{
  "society": "Bath Building Society",
  "slug": "bath-building-society",
  "smpUrl": "https://smartmoneypeople.com/bath-building-society-reviews/products",
  "totalReviewsOnSMP": 2510,
  "avgRating": 4.75,
  "scrapedAt": "2026-02-06T15:31:50.543779+00:00",
  "reviews": [
    {
      "title": "Very helpful informative team.",
      "text": "Very helpful informative team. Supportive throughout process. Nice manner",
      "rating": 5,
      "date": "5th February 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Friendly, knowledgable and efficient service from al...",
      "text": "Friendly, knowledgable and efficient service from all at the company. From initial contact to offer was less than 3 weeks, a great rate and good product perfect for a university student.-",
      "rating": 5,
      "date": "29th January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "great service and comms",
      "text": "As a Mortgage Intermediary it’s important to have good contacts and timely communications and we recently received exemplary service from the team at Bath BS and Nick T was exceptional in the way that he continued to keep us informed of progress",
      "rating": 5,
      "date": "28th January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Fantastic customer service , always happy to help ,...",
      "text": "Fantastic customer service , always happy to help , especially Tom & Adam",
      "rating": 5,
      "date": "22nd January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Mortgage Port",
      "text": "We sold and were looking at porting our mortgage. Start was good, then it went a little wrong but then resolved very well and professionally",
      "rating": 5,
      "date": "20th January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "A very complicated case, fantastic support & outcome.",
      "text": "A very complicated case, and slightly off criteria basis, was sensitively assessed by the underwriting team with a positive outcome. This was supported by the fantastic BDM Kerrin White, who listened and liaised between myself and the underwriting team, despite numerous hurdles - I cannot recommend Kerrin any more, as he is a polite, attentive, understanding, fair, and consummate professional. He stood out above even some of the best I have worked with from different lenders over the last 5 years. I would recommend him for an industry award if it were possible. Many thanks.",
      "rating": 5,
      "date": "15th January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Specialist new build loan",
      "text": "I had a specialist loan to finance a new build property. The application process and management of the loan drawdowns was very efficient. There was always someone available to speak to with any queries.",
      "rating": 5,
      "date": "6th January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent all round Service",
      "text": "From first registering an interest online in order to re-mortgage my property, the service has been fast and very professional. My Mortgage adviser, Tim Randall was excellent. Always handled my correspondence and queries very promptly and efficiently.",
      "rating": 5,
      "date": "22nd December 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "A Smooth, Stress-Free Mortgage Experience",
      "text": "I’m extremely impressed with the service I received from Bath Building Society, and especially from my mortgage advisor, Tim. From the very start, Tim has been incredibly supportive, professional, and reassuring. He guided me through every stage of the process, answered all my questions clearly, and helped me complete the forms with confidence. What could have been a stressful experience felt smooth and straightforward thanks to Tim’s calm, positive attitude and attention to detail. He was always quick to respond and very good at explaining what was important—and what I didn’t need to worry about! That made a huge difference. I’m absolutely delighted that my mortgage offer was produced so quickly, in just five working days. The efficiency and personal service I received exceeded all expectations. I genuinely felt looked after throughout the entire process. Thank you to Tim and everyone at Bath Building Society for making this such a positive experience.",
      "rating": 5,
      "date": "12th December 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Retirement mortgage with exceptional service",
      "text": "Bath Building Society (Tim and the team) provided exceptional service from start to finish. The team was professional, knowledgeable, and genuinely supportive, with a personal touch far superior to anywhere else (we went to other building societies and brokers). The key differences were we weren’t passed from pillar to post, endlessly repeating ourselves to different people filling in forms without context and more importantly treated with respect and listened to. The Retirement Mortgage itself perfectly met our needs too, which is flexible, reliable with longevity, and unlike anything we found elsewhere. It truly feels like a well-kept secret. On top of that, they worked to our timelines, which was a fantastic bonus. Definitely a 5 star service - thank you!",
      "rating": 5,
      "date": "4th December 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent service",
      "text": "Ian Burch and the team were outstanding with their advice, help and assistance. They were always on hand for any queries or concerns we had and made the whole progress stress free",
      "rating": 5,
      "date": "25th November 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Arranging our remortgage with Bath Building Society...",
      "text": "Arranging our remortgage with Bath Building Society was an overall very positive experience. In particular the support offered by Tim Randall was excellent. From the initial contact through the application process and beyond Tim guided us, offering appropriate advice and information and we are very grateful for his sage counsel. The underwriting process felt somewhat protracted at times, however, we do appreciate that this may be due to the individuality applied to each individual application.",
      "rating": 5,
      "date": "21st November 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "5-Star Review for Tim Randall",
      "text": "I had an excellent experience working with Tim as my Mortgage Advisor. As a first-time buyer, the whole process felt overwhelming at first, but Tim made everything clear, manageable, and stress-free. He was incredibly patient, explained every step in simple terms, and always responded quickly whenever I had questions.",
      "rating": 5,
      "date": "18th November 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "The chat service on the intermediaries website is ex...",
      "text": "The chat service on the intermediaries website is excellent",
      "rating": 5,
      "date": "12th November 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Quick and efficient service",
      "text": "Tom was quick and efficient with his responses and all my questions were answered.",
      "rating": 5,
      "date": "11th November 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great BDM",
      "text": "I spoke to Kerrin White regarding a Holiday Let mortgage for my client and he has been nothing but helpful during the start of the process. Answered all of my emails and calls quickly and made sure i was fully aware of the process.",
      "rating": 5,
      "date": "11th November 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "The Best Banking Team Around!",
      "text": "The team at Bath Building Society are always so helpful. I love having an account with them because you always receive a very personalised service where you are speaking to a very helpful representative from their side, you aren't ever kept waiting long for an answer and it is so refreshing and appreciated these days to be speaking directly with a human not endlessly trying to communicate via a 'live chat' or AI bot which many other banks now use. Whenever I have had a query this is responded to usually on the same day, they also keep you informed on any pending decisions. I have to give a special mention to Nick and Natasha who I was working with recently in regards to one of my accounts with them.",
      "rating": 5,
      "date": "5th November 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Kerrin (BDM) was very helpful and Tom (on live chat)...",
      "text": "Kerrin (BDM) was very helpful and Tom (on live chat) answered my query really quickly. Thanks both.",
      "rating": 5,
      "date": "5th November 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Had a simple question, which was answered quickly an...",
      "text": "Had a simple question, which was answered quickly and clearly",
      "rating": 5,
      "date": "5th November 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Applied for a mortgage with the Bath Building Societ...",
      "text": "Applied for a mortgage with the Bath Building Society and from initial enquiry to getting the offer the service has been excellent . My adviser Ian Birch has been amazing . He took time to explain everything in great detail and quickly responded to any questions I had regarding my application. I cannot recommend him highly enough. Process was easy to complete and all done in a very good timescale. Was kept informed at all times and made the whole process painless. I would have no hesitation in recommending Ian and the Bath Building society.",
      "rating": 5,
      "date": "3rd November 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Your organisation and team member Tim Randall",
      "text": "We deal with your team member Tim Randall, he was always clear with information and return any emails or telephone messages almost immediately. The communications between Tim Randall and ourselves was paramount to assist a constant flow of information needed in regarded to organising our mortgage. At all times we felt that the contact between Tim and ourselves was very personal which help us along the route. It was a pleasure to deal with such a organised team member and Tim is surely a great asset to your organisation.",
      "rating": 5,
      "date": "22nd October 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Bathvl is good",
      "text": "Bath were one of very few building society's prepared to offer a BTL mortgage at a reasonable rate. Good Communication with them over the personal issues",
      "rating": 3,
      "date": "19th October 2025",
      "product": "Mortgages",
      "sentiment": "mixed"
    },
    {
      "title": "Customer service exceptional",
      "text": "Ian Birch was exceptionally helpful as were his colleagues. Their customer service was brilliant and we would definitely recommend to family and friends.",
      "rating": 5,
      "date": "11th October 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent service.",
      "text": "Excellent service. Great communication. Tim Randall was excellent.",
      "rating": 5,
      "date": "2nd October 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "My mortgage advisor was fantastic.",
      "text": "My mortgage advisor was fantastic. He explained all the factors relating to the type of mortgage we were entering into and was very quick in responding to queries we had both written and verbally.",
      "rating": 5,
      "date": "30th September 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Nick Thornton - a pleasure to deal with",
      "text": "Nick Thornton is a pure pleasure to deal with. He offers a very personal service and nothing is too much trouble. He is efficient, thorough and responds quickly. I would have no hesitation whatsoever in recommending him. He's a breath of fresh air in this world of call centres, and a credit to the Bath Building Society. Thank you for all of your help Nick",
      "rating": 5,
      "date": "29th August 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Nick Thornton is my mortgage manager.",
      "text": "Nick Thornton is my mortgage manager. He has been brilliant in keeping myself informed on all changes to rates etc. He has been proactive in informing myself on any new products and changes. I have full confidence with himself and Bath Building Society",
      "rating": 5,
      "date": "27th August 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "questions quickly answered.",
      "text": "questions quickly answered friendly service",
      "rating": 5,
      "date": "22nd August 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "5 star remortgage experience, fast, good value, frie...",
      "text": "5 star remortgage experience, fast, good value, friendly Nick",
      "rating": 5,
      "date": "21st August 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very helpful",
      "text": "Very helpful, easy to access a real person who was helpful and did what they said they would without delay",
      "rating": 5,
      "date": "21st August 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very helpful staff, answered my query straight away",
      "text": "Very helpful staff, answered my query straight away",
      "rating": 5,
      "date": "14th August 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Good friendly chatbox for brokers",
      "text": "Good friendly chatbox for brokers",
      "rating": 5,
      "date": "8th August 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Bath Building Society: Buy for Uni Mortgage",
      "text": "My son took out a Buy for Uni mortgage with Bath and we worked with Ian Birch as our advisor, and he was excellent: very helpful and thorough at every step of the process and very responsive to our queries. The wider mortgage process team also very good and timely in responses. Overall, the whole process was seamless and would highly recommend the Bath Building Society based on this experience",
      "rating": 5,
      "date": "7th August 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "East to contact and Great service",
      "text": "Really good experience every time I needed to make direct contact with Bath Building Society. This was important as we accessed a self build mortgage. Very east with great service when settled my account. Alexandra was fab",
      "rating": 5,
      "date": "31st July 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Buy for uni mortgage",
      "text": "We completed an online enquiry form regarding the student mortgage. Tim Randall contacted us really quickly and arranged an interview . In that session he explained in detail all about the mortgage and how it worked and what was required. This was extremely useful and it encouraged us to go ahead. Tim kept in contact with us throughout the whole process, even when we had additional questions . He worked with the Bath team to address any open questions and updated us promptly. Tim was super quick at relying to our emails and was a great advocate for Bath Building Society, professional and thorough. He was happy to answer even small questions we had. We were so pleased with his support and service.",
      "rating": 5,
      "date": "30th July 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "live chat is super quick and helpful Tom is always a...",
      "text": "live chat is super quick and helpful Tom is always a delight!",
      "rating": 5,
      "date": "30th July 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Student mortgage",
      "text": "Tim was thorough & knowledgeable of the details of the student mortgage product, which suited our requirements. Tim & the admin team were helpful & kept up regular communication. Very pleased with the process.",
      "rating": 5,
      "date": "25th July 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent service and excellent staff",
      "text": "All the staff we have spoken with have been extremely helpful and friendly, cannot fault any of them or the service provided",
      "rating": 5,
      "date": "18th July 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "so quick to respond",
      "text": "so quick to respond on live chat and lend much more than other lenders for single applicants",
      "rating": 5,
      "date": "8th July 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Rebecca was really helpful, and very knowledgable",
      "text": "Rebecca was really helpful, and very knowledgable",
      "rating": 5,
      "date": "8th July 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Helpful and friendly team",
      "text": "The mortgage team and adviser who dealt with our new mortgage was friendly and helpful- we felt like Tim was getting us the best deal/option.",
      "rating": 5,
      "date": "5th July 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "always really quick on live chat",
      "text": "always really quick on live chat",
      "rating": 5,
      "date": "3rd July 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "8/10 would recommend",
      "text": "Great entry intot he bank with a \"mortgage welcome care package\" sent to our home. Where we would have loved to have seen some more proactiveness was at the end of our initial term. People are busy and we just go into the remortgage process, and we ended up leaving for a gbp 100 saving per month.... which is grea,t but if BBS were to have gotten in touch plenty in advance with a price match or competitive quote, we may have stayed as we enjoyed our experience with BBS.",
      "rating": 4,
      "date": "30th June 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "All in all a positive experience with bath building...",
      "text": "All in all a positive experience with bath building society if I have had an issue it has been resolved quickly and efficiently.if I was in the market for another mortgage I would they would be top of my list",
      "rating": 5,
      "date": "26th June 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Thank you Tim and the team!",
      "text": "From the very first phone call Tim has been absolutely exceptional. He went out of his way to help me in my niche circumstances and ensured I was updated every step of the way. The service from the entire team has been speedy and professional but my experience with Tim has been outstanding. Not only did he support me in securing a better fit for my circumstances but above all he was patient and kind and is a real credit to your Company. Thank you",
      "rating": 5,
      "date": "25th June 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "New Mortgage rate swap!",
      "text": "My Buy to let mortgage was coming to the end of its fixed period and Bath were very quick in contacting me, helping me select a new product and implemented this very quickly so that I could benefit from the better rate as soon as possible! Great service.",
      "rating": 5,
      "date": "25th June 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Quick fast response found out what i needed to in se...",
      "text": "Quick fast response found out what i needed to in seconds",
      "rating": 5,
      "date": "19th June 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "complicated case - web chat offered telephone call w...",
      "text": "complicated case - web chat offered telephone call which was v helpful",
      "rating": 5,
      "date": "19th June 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Really friendly bank with very friendly genuine staf...",
      "text": "Really friendly bank with very friendly genuine staff who care.",
      "rating": 5,
      "date": "16th June 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "The process was very smooth, the staff are efficient...",
      "text": "The process was very smooth, the staff are efficient and the rates are best in the market!",
      "rating": 5,
      "date": "13th June 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Thank you to Tim and the team",
      "text": "Tim and the team were fantastic, as well as being incredibly responsive and making the process incredibly clear along the way, they went to extra efforts to make this mortgage happen. I'm incredibly grateful.",
      "rating": 5,
      "date": "5th June 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Nick is very experienced and he is so kind and capab...",
      "text": "Nick is very experienced and he is so kind and capable to hold our hands through the whole application process.",
      "rating": 5,
      "date": "4th June 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great Service",
      "text": "Very happy with mortgage application process and service from Tim (mortgage advisor). Competitive rate and advised of an alternative cheaper product that met my needs. Only negative was the old fashioned paper application form.",
      "rating": 4,
      "date": "2nd June 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very quick service, smooth and efficient service",
      "text": "Very quick service. From application to mortgage offer just under 4 weeks, this at a time when all institutions were inundated with applications to beat the labour stamp duty increases. I had been advised that there would be a delay because of the SD increases so was pleasantly surprised to receive my offer in such a timely manner. Tim was especially helpful at the application stage. I have now had notice of completion. All in all a very smooth and pleasant experience Well done BIBS, impressed with you.",
      "rating": 5,
      "date": "22nd May 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "A listening approach",
      "text": "My mortgage application could have been declined because the nature of the property doesn't fully fit with the Society's lending criteria. However, there are many positives about the property - and at every stage, Society colleagues were prepared to look at potential snags in the light of the bigger picture, to arrive at a balanced and considered view on whether a mortgage could be offered in my overall circumstances.",
      "rating": 5,
      "date": "16th May 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Brilliant to deal with, excellent mortgage product",
      "text": "One of the best experiences I have had, over 40+ years, of dealing with a financial institution. Excellent mortgage product available, very flexible, suits our needs exactly.",
      "rating": 5,
      "date": "10th May 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Mortgage came up for review; process was very good a...",
      "text": "Mortgage came up for review; process was very good a customer services was excellent",
      "rating": 5,
      "date": "9th May 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "BBS were great for our guest house mortgage",
      "text": "Bath Building Society was very flexible and set up a mortgage for our guest house. All the other lenders we approached (Lloyds, Natwest, Halifax etc.) were unable to help because we didn't fall into a standard tickbox category. The rate was always competitive, we had a series of discounted rate deals. Been with them for about 20 years. I highly recommend BBS.",
      "rating": 5,
      "date": "24th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "My mortgage process was delayed because essential qu...",
      "text": "My mortgage process was delayed because essential questions were not asked promptly by Bath at the outset. This delay ended up costing me over £1000 due to being on the SVR with my previous provider. The app itself is difficult to use and lacks necessary information accessibility. While I was satisfied with the rate during my mortgage term, any potential savings were negated by the delays in the initial months, largely caused by Bath. Based on this experience, I cannot recommend Bath and will not return.",
      "rating": 1,
      "date": "24th April 2025",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "Very personal service.",
      "text": "Very personal service. Tim was extremely helpful and his emails always very quick to respond with questions we had. The process was quite slick from start to finish, and we were kept informed of progress along the way.",
      "rating": 5,
      "date": "15th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very friendly helpful staff.",
      "text": "Very friendly helpful staff. Efficient service",
      "rating": 4,
      "date": "10th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Brilliant mortgage provider",
      "text": "This mortgage was great for my first home purchase. They made the process simple and easy to understand. Whenever I was unsure of anything, I could call and speak to someone. The service feels personal and would highly recommend them.",
      "rating": 5,
      "date": "9th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent Service.",
      "text": "Tim Randall was very knowledgeable, clear and concise about Bath's products. When he said he would do something, he did it. We were kept informed throughout the process and he answered any questions and concerns. He was excellent.",
      "rating": 5,
      "date": "4th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "friendly and helpful from the start.",
      "text": "friendly and helpful from the start. Kept informed throughout.",
      "rating": 5,
      "date": "4th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "First, it's very slow. Many last minute surprises",
      "text": "First, it's slow, very slow. Next dont get your hopes up. Everything seemed great (but slow). Finally we received the offer long after we hoped to exchange. The offer contained a number of demands that contradicted the information supplied in the application, literally impossible & impractical demands. So we are now having to start the entire process again. Find a new property, make a fresh application, etc. It would have been better if they had suggested that it's riverside location could raise problems rather than wait months to be congratulated with impossible demands. If you wanted to say No to the property just say so Don't say Yes and then ask the impossible like no site fees for a house on a private road and insist on preferential treatment on non-allacoted parking. Numpties! Even the surveyor got the house age wrong by 20 years. They also requested 50% more charge against my parents property than discussed during the application. As a first time buyer, this couldn't have been disheartening.",
      "rating": 1,
      "date": "31st March 2025",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "Helpful and courteous",
      "text": "My contact with BBS staff has always been a positive experience.",
      "rating": 5,
      "date": "31st March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "difficult getting through telephone lines, wish it w...",
      "text": "difficult getting through telephone lines, wish it was easier",
      "rating": 4,
      "date": "28th March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Bath Building Society provide a traditional approach...",
      "text": "Bath Building Society provide a traditional approach genuine customer service. They are contactable, with real people to speak to, always respond to calls and enquiries and are approachable to advise and support. I cannot praise them too highly and have happily recommended them already to friends and peers.",
      "rating": 5,
      "date": "26th March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "A longstanding professional relationship",
      "text": "I have been a borrower for some 25 years. My mortgage rate had expired and my mortgage was getting near to end of term. The mortgage department delivered reliable, good service in order to assist me.",
      "rating": 5,
      "date": "26th March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Tim helped me to understand everything in simple ter...",
      "text": "Tim helped me to understand everything in simple terms and was very helpful and communicative throughout the process",
      "rating": 5,
      "date": "25th March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Good service but sometimes slow",
      "text": "Customer service was good but some of the internal processes seemed very slow. We received excellent prompt responses when we chased for progress but would have preferred not to have to chase either by quicker processes or regular updates.",
      "rating": 4,
      "date": "24th March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Tom is very experienced and thoughtful.",
      "text": "Tom is very experienced and thoughtful.",
      "rating": 5,
      "date": "24th March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Tom was super helpful, helped me get started with my...",
      "text": "Tom was super helpful, helped me get started with my first case",
      "rating": 5,
      "date": "21st March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent from start to finish!",
      "text": "Excellent from start to finish! One of only a few companies that offer a buy-for-uni mortgage so that was a good start. Every step of the way we were treated with professionalism and told what was happening. I could not recommend you more!!!",
      "rating": 5,
      "date": "19th March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Overall good. Just slow.",
      "text": "They are just slow as the process seems manual for the mortgage. Everything turned out good though. So just be prepared for a slow application.",
      "rating": 3,
      "date": "18th March 2025",
      "product": "Mortgages",
      "sentiment": "mixed"
    },
    {
      "title": "Rebekka is a diamond,so helpful with full understand...",
      "text": "Rebekka is a diamond,so helpful with full understanding of my reasonable request.Acted fast and be really empathetic for my case which this showed me an excellent customer service and a higher level of reliability Well done!",
      "rating": 5,
      "date": "13th March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very thorough and professional service.",
      "text": "Very thorough and professional service.",
      "rating": 5,
      "date": "13th March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Myself and my husband both had a tricky credit histo...",
      "text": "Myself and my husband both had a tricky credit history whch on paper would have looked bad but we were recommended to contact Bath Building Society for their mortgages and were very pleased to find out they take a personal and human approach and came to talk with us rather than use an impersonal online form. After explaining our history and providing evidence of our current incomes we were given a mortgage. It was one of the happiest moments for us after years of uphill struggle.",
      "rating": 5,
      "date": "12th March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent customer service",
      "text": "Excellent customer service - a sensible caring evaluation of my needs and proposal of the most suitable product to mee them.",
      "rating": 5,
      "date": "7th March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "THE exemplar of the best",
      "text": "Bath Building Society is an, no probably THE exemplar of how to balance digital excellence with warm and receptive personal customer/member service. At a time when on-line and customer services among financial services providers and public utilities are far from an acceptable level of service BBS are a joy to deal with. Whatever the Society does to imbue all its staff with what makes a society if they could bottle it it would be what everyone went for. Every contact is a demonstration that being nice, professional and helpful people to deal with doesn't have to be neglected to be a commercial success.",
      "rating": 5,
      "date": "6th March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "1st class branch customer servive",
      "text": "1st class branch customer servive",
      "rating": 5,
      "date": "6th March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Tim Randall, mortgage advisor, has been a great help...",
      "text": "Tim Randall, mortgage advisor, has been a great help during our buy-to-let mortgage application. He ensured a smooth and speedy process, chased things up when needed, and kept me updated throughout. If the interest rates had been a bit more favorable, I would have given 5 stars all the way.",
      "rating": 5,
      "date": "6th March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "I have a buy for uni mortgage which has been really...",
      "text": "I have a buy for uni mortgage which has been really helpful and unique experience to own my own property at such a young age.",
      "rating": 5,
      "date": "10th February 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Innovative products - hands on manual approach - is...",
      "text": "Innovative products - hands on manual approach - is ideal in some client scenarios.",
      "rating": 5,
      "date": "10th February 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great customer service!",
      "text": "Tom and Rebecca have been super helpful with all my queries regarding one particularly tricky case. Nothing is ever too much to ask.",
      "rating": 5,
      "date": "7th February 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Fantastic service & product transfer rate",
      "text": "I have a holiday let mortgage with Bath BS & when it came to find a new product, not only were they very friendly & helpful, they also had the best rate on the market & didn't charge a fee. I love that they give their current customers the best rates possible & don't try and squeeze every penny from them.",
      "rating": 5,
      "date": "6th February 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "I couldn't be happier with Bath Building Society! :-)",
      "text": "I couldn't be more happy with Bath Building Society. I've been with them since 2009 and I just moved house and although I could have got cheaper rates elsewhere, as their customer service is superb I was happy to stay with them. They always reply quickly, with real people you can talk to and they couldn't do more for you. Well done Bath Building Society and thank you! :-)",
      "rating": 5,
      "date": "30th January 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "My wife and I remortgaged to BBS",
      "text": "My wife and I remortgaged to BBS with a relatively small mortgage (under £80k) but the underwritering process was unduly lengthy in my opinion given the loan to value (house valued in excess of £500k), but have clean credit file and good income. The process to make overpayments, in my opinion is flawed and should be reviewed. Lastly, the app really did not provide me with much informaiton inc. what over payment allowances were remaining - so really is pretty pointless as I see it",
      "rating": 3,
      "date": "13th January 2025",
      "product": "Mortgages",
      "sentiment": "mixed"
    },
    {
      "title": "Really helpful",
      "text": "Tim, as Mortgage Advisor for Bath Building Society, was so helpful.",
      "rating": 5,
      "date": "8th January 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Fast response and helpful, kind staff",
      "text": "Fast response and helpful, kind staff",
      "rating": 5,
      "date": "7th January 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "EXCELLENT CUSTOMER CARE FROM START TO FINISH",
      "text": "EXCELLENT CUSTOMER CARE FROM START TO FINISH, RARE TO FIND SUCH DEDICATED STAFF IN TODAYS WORLD",
      "rating": 5,
      "date": "10th December 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great service",
      "text": "Good service throughout the mortgage application process and I was able to complete my purchase on time without delays.",
      "rating": 4,
      "date": "24th November 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very Knowledgeable and went the extra mile!",
      "text": "Very Knowledgeable and went the extra mile!",
      "rating": 5,
      "date": "12th November 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Tom was great and got back to me in good...",
      "text": "Tom was great and got back to me in good time",
      "rating": 4,
      "date": "11th November 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "We queried about potential quotes and got response i...",
      "text": "We queried about potential quotes and got response instantly",
      "rating": 5,
      "date": "11th November 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Good chat service - thank you Ian.",
      "text": "Good chat service - thank you Ian.",
      "rating": 5,
      "date": "5th November 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Tom @ Bath Building society on live chat was very kn...",
      "text": "Tom @ Bath Building society on live chat was very knowledgeable and helpful. thank you Tom!",
      "rating": 5,
      "date": "4th November 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Really knowledgable and friendly",
      "text": "Really knowledgable and friendly. Helped with my query quickly. Clear and informative in answering my question",
      "rating": 5,
      "date": "31st October 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Nick at Bath was super helpful!",
      "text": "Nick at Bath was super helpful! Genuinely looking after existing customers",
      "rating": 5,
      "date": "28th October 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Clear and concise",
      "text": "quick to respond and provided clear concise information",
      "rating": 5,
      "date": "16th October 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Decent product, painfully slow process",
      "text": "No problem with the product offered by painfully slow process that ended up failing to complete because the vendor's circumstances changed in the meantime",
      "rating": 2,
      "date": "6th October 2024",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "BIBS SERVICE",
      "text": "VERY PROFESSIONAL TEAM, ALWAYS ACCESSIBLE, GREAT PRODUCTS AND SERVICE, GREAT EXPERIENCE",
      "rating": 5,
      "date": "1st October 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Application processing unacceptably slow",
      "text": "We made an application for a mortgage on a new purchase in early June 2024. After many delays and several long turnarounds for information provided, we finally received a mortgage offer on 6th September 2024. Unfortunately, we have not bee able to proceed wit the purchase because the vendor died just the week befire the offer was received. It is unusual that delays have such an impact but it is always a risk when every piece of information takes so long to review. In this case, the delay has destroyed the sale and cost all of us considerable time and money.",
      "rating": 3,
      "date": "30th September 2024",
      "product": "Mortgages",
      "sentiment": "mixed"
    },
    {
      "title": "Quick and Rebekkah was able to answer my query super...",
      "text": "Quick and Rebekkah was able to answer my query super fast",
      "rating": 5,
      "date": "27th September 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Natasha was great.",
      "text": "Natasha was great. Actioned everything I asked there and then via live chat",
      "rating": 5,
      "date": "26th September 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "I asked to change my bank details.",
      "text": "I asked to change my bank details. Email sent with direct debit form. Very quick but the chat box layout on an iPhone is terrible. But other than that helpful chat",
      "rating": 4,
      "date": "19th September 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Everything was smooth albeit super slow!",
      "text": "Everything was smooth albeit super slow!!! It seems everything is manual which can be a good thing if you have special circumstances. All good in the end!",
      "rating": 4,
      "date": "18th September 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "FirstReview",
      "text": "I was impressed about the money I could potentially borrow for a mortgage.",
      "rating": 4,
      "date": "16th September 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent service from Bath Building Society",
      "text": "Excellent service from Bath Building Society - intelligent pro-active staff who understood their products and processes and were oriented to assisting me with a slightly complex transaction so all went very smoothly - totally customer-centric !",
      "rating": 5,
      "date": "15th September 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "24 years on, with perfect customer service",
      "text": "I took my first mortgage out with the Bath in 2000. Since then I have had several mortgage and savings product. My last mortgage was granted during the days of Mr and Mrs Hodgman running the Society. I recently had to make some changes to my mortgage and the Society, including the Mortgage Team were outstanding in terms of customer service, speed of reaction, engagement and a 'can do' approach. The experience was exactly the same from my perspective when you used to have to go and see Mr and Mrs Hodgman for tea and a chat to see if you had been successful for a mortgage. I must name check Craig in the mortgage team who is an absolute credit to the Society and he was so helpful to me. It's a pleasure to do business with the Society and I highly recommend them, as their values and their integrity do not change.",
      "rating": 5,
      "date": "13th September 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "4 words to summarise",
      "text": "Helpful, personable, realistic and empathetic",
      "rating": 5,
      "date": "2nd September 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Chat contact was very helpful!",
      "text": "initial contact on chat with Oliver has been a great one. he provided the required info quickly",
      "rating": 5,
      "date": "30th August 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "good chat - responder was pleasant and helpful",
      "text": "good chat - responder was pleasant and helpful",
      "rating": 5,
      "date": "11th July 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Buy for Uni mortgage",
      "text": "We applied for a niche product, a Buy for Uni mortgage, which is only offered by 3 lenders. In fact, of the 3, the Bath BS was the only one that could meet all our criteria. Excellent service from start to finish with supportive and informative advice from Tim Randell. The application form was a little old fashioned, completed in pen and posted back! But in reality it was no problem. It was processed quickly and the offer made without any real delays.",
      "rating": 5,
      "date": "28th June 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "very good meetings with Ian Birch, who calmly and he...",
      "text": "very good meetings with Ian Birch, who calmly and helpfully took us through two separate applications. Very grateful to him",
      "rating": 5,
      "date": "25th June 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "asked for rate updates got details",
      "text": "asked for rate updates got details",
      "rating": 5,
      "date": "21st June 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Tim Randall is an absolute credit to the organisation",
      "text": "Tim helped us with securing a mortgage, in quite complex and trying circumstances,. His communication, diligence, professionalism, and kindness made a very difficult time much easier. I genuinely think that other agents might have given up on us, but Tim drove the process to completion. Really can't thank him enough.",
      "rating": 5,
      "date": "24th May 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Helpful staff provided easy and clear information ab...",
      "text": "Helpful staff provided easy and clear information about my case that is with the lender. Definitely feels like a human being approach rather than a PC",
      "rating": 5,
      "date": "15th May 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent help and service throughout",
      "text": "Excellent service and very explanatory throughout",
      "rating": 5,
      "date": "8th May 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Mortgage Application Process",
      "text": "I had an excellent experience Working with Bath Building Society. Tim managed my application and he did a fantastic job at making sure everything ran smoothly and sufficiently.",
      "rating": 5,
      "date": "24th April 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Thank you Oliver for going all out to assist me subm...",
      "text": "Thank you Oliver for going all out to assist me submitting an application",
      "rating": 5,
      "date": "18th April 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Bath Building Society gave us a break",
      "text": "We have had 3 mortgages with Bath Building Society over the last 35 years and are now mortgage free. They were the only company who would listen to us when buying our first home and won’t forget that they trusted us and provided us with that first rudder to the housing market. Thank you",
      "rating": 5,
      "date": "15th April 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Effortless process",
      "text": "Effortless process, We had it packaged by Buildloan and from offer to completion it took around 2 weeks",
      "rating": 5,
      "date": "12th April 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Clear and efficient communication",
      "text": "Our mortgage advisor was very clear and helpful in talking and seeing us through the process when we had queries. We felt he welcomed our contact and was always efficient when replying to our communications.",
      "rating": 5,
      "date": "2nd April 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "BATH BUILDING SOCIETY",
      "text": "An excellent lender who are in touch with the needs of their clients and who always try to help in a positive manner",
      "rating": 5,
      "date": "25th March 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Superb customer service! Thank you!",
      "text": "I've had a mortgage with Bath building society for 15 years . I was made redundant just before Christmas 2011 and was out of work for 3 whole months and couldn't pay the mortgage. When I contacted Bath they were very decent about it and when I did find another job they were flexible about the repayments. Above all they didn't make me feel humiliated like I was begging which I couldn't say for my own bank or other providers. Well done Bath and thank you, your kindness was not forgotten!",
      "rating": 5,
      "date": "23rd February 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Had my mortgage with bath building society for years...",
      "text": "Had my mortgage with bath building society for years and always great communication and fair pricing",
      "rating": 5,
      "date": "23rd February 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Professional, friendly and knowledgeable team.",
      "text": "Professional, friendly and knowledgeable team. Always proactive in providing competitive rates at the end of fixed or discounted terms.",
      "rating": 5,
      "date": "23rd February 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent",
      "text": "Good service, Google interest rate",
      "rating": 5,
      "date": "22nd February 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "I left a product Variation until the final day of 7...",
      "text": "I left a product Variation until the final day of 7 from the date of the letter from Bath BS, it was late afternoon and yet Adam still accommodated this late application and got it through in time, brilliant work I must say.",
      "rating": 5,
      "date": "20th February 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Small enough to care!",
      "text": "Quick and helpful to deal with over 25 years. Flexible with my changing requirements",
      "rating": 5,
      "date": "12th February 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "New mortgage - specialist product",
      "text": "Great service from start to finish on a more specialised mortgage product. The best part was the fact that I had named people who I could contact, who were all very helpful and responsive - not like the large faceless organisations we are all used to dealing with these days. I would highly recommend Bath",
      "rating": 5,
      "date": "11th February 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Buy for Uni Mortgage a Success",
      "text": "Thank you for your support with our Buy for Uni Mortgage. After 3.5 years my daughter has graduated, secured a job and the mortgage has now completed. I’d just like to say thank you for offering such a flexible product. It was a pleasure doing business with BBS. It transformed my daughter’s university life. She was able to live in a comfortable house and was in control of sorting out any day to day repairs. The Buy for Uni product gave us the flexibility we needed to have tenants or rent the property. Knowing she had full flexibility over the use of the property was a great peace of mind. My daughter secured a job after graduation and decided to take over the mortgage of the property on a repayment basis. I hope this boost to get on the property ladder will stand her in good stead. The BBS team were easy to contact and quickly responded to our questions. In today's world it was a pleasure to deal with someone directly and not through several layers of call center operatives. Thank you again.",
      "rating": 5,
      "date": "5th February 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Easy and quick online chat would use again.",
      "text": "Easy and quick online chat would use again.",
      "rating": 5,
      "date": "26th January 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "this is my first time using bath bs",
      "text": "this is my first time using bath bs and Oliver has been so helpful as i had technical problems submitting the application and he added the information to the application for me",
      "rating": 5,
      "date": "23rd January 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "My experience has been okay.",
      "text": "My experience has been okay. Nothing to write home about, but okay.",
      "rating": 3,
      "date": "17th January 2024",
      "product": "Mortgages",
      "sentiment": "mixed"
    },
    {
      "title": "New mortgage application - very professional",
      "text": "Professional and helpful staff from start to finish. Process was quick and easy. Getting through to staff and receiving quick resolutions/decisions was very good. customer responsiveness was excellent.",
      "rating": 5,
      "date": "10th January 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "remote chat",
      "text": "spoke remotely to Nick ,was extremely helpful.Answered all my queries",
      "rating": 5,
      "date": "3rd January 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Helpful and informative",
      "text": "Nick was very quick and provided clear responses.",
      "rating": 5,
      "date": "15th November 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Straight forward and simple",
      "text": "Each stage happened in the timescale set out at the start of the process and these were fully explained at the outset.",
      "rating": 5,
      "date": "1st November 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent Client Service",
      "text": "Bath Building Society are responsive, polite and professional- highly recommended.",
      "rating": 5,
      "date": "31st October 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Helpful and friendly service",
      "text": "Our mortgage application for a Buy for Uni mortgage was made all the easier with help from our mortgage adviser at Bath Building Society - Ian Birch, who was unfailingly helpful throughout.",
      "rating": 5,
      "date": "24th October 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Mortgage lender review",
      "text": "Bath are a well organised Building Society and very easy to be engaged with.",
      "rating": 5,
      "date": "19th October 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Professional and friendly",
      "text": "The Bath are always professional and friendly. Staff are so helpful and explain things really well. We would highly and happily recommend them.",
      "rating": 5,
      "date": "9th October 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "very helpful",
      "text": "alex was very helpful and friendly",
      "rating": 5,
      "date": "2nd October 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent service from start to finish from all members of staff that we dealt with.",
      "text": "We have recently taken out a 'buy for university' mortgage with Bath BS. From start to finish, all of your staff have been absolutely excellent but a particular shout out to Ian Birch, Rebekka and Jalani (the latter, both in the mortgage admin team). Our application was not that straightforward and under short timescales but the support of your staff could not have been better. I'm also aware that there were many staff that I did not engage directly with that supported our application.",
      "rating": 5,
      "date": "29th September 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Prompt response",
      "text": "Very quick and efficient service, and agent with a very wide knowledge.",
      "rating": 5,
      "date": "27th September 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "All questions answered",
      "text": "All my questions were answered and a link provided where needed",
      "rating": 5,
      "date": "25th September 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Fantastic service through unique circumstances",
      "text": "We took out a stage release mortgage with Bath to finance our housebuild. Communication was quick and clear throughout, particularly at the end of the build stage as the mortgage switched to a different product and everyone we dealt with at Bath was supportive and professional in helping us to source the best deal.",
      "rating": 5,
      "date": "13th September 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great Service using the chat facility",
      "text": "Typed in a question on the chat facility and this was answered promptly and professionally providing the answer needed.",
      "rating": 5,
      "date": "12th September 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Good, succinct response.",
      "text": "Question re a RIO mortgae rapayment strategy options.",
      "rating": 5,
      "date": "11th September 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Buy for uni",
      "text": "Really helpful and a possible way forward",
      "rating": 5,
      "date": "7th September 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very Helpful",
      "text": "It was very useful abcdefghijklm",
      "rating": 5,
      "date": "5th September 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Phone chat",
      "text": "No complaints about how Nick treated the call. very friendly and personal but disappointed with the outcome as there seems to be no good reason why a person handicapped through dementia (itself a mental illness) is treated differently when it comes to mortgages to someone with an equally permanent mental disability where both sets of family have lasting power of attorney or in our case deputyship in terms of lifetime mortgages. It does seem discriminatory and contrary to the DDA",
      "rating": 4,
      "date": "4th September 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excllent service, very responsive and helpful staff.",
      "text": "Excllent service, very responsive and helpful staff.",
      "rating": 5,
      "date": "4th September 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "FANTASTIC LENDER",
      "text": "BATH BUILDING SOCIETY ARE THE BEST LENDER I HAVE EVER USED, ALWAYS ON HAND TO ASSIST, ALWAYS HAPPY TO LISTEN AND NEVER FAILED TO DELIVER, THEY HAVE HELPED ME OVER A NUMBER OF YEARS AND THROUGHOUT THE PERIOD HAVE BEEN CONSISTENTLY EXCELLENT, CAN NOT RECOMMEND THEM HIGHLY ENOUGH",
      "rating": 5,
      "date": "30th August 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "good customer service",
      "text": "Really quick and told me what i needed to know. Great",
      "rating": 5,
      "date": "29th August 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "The Superstars at Bath Building Society",
      "text": "I have been a loyal customer of Bath Building Society for several years. In my opinion, the Bath Building Society is the epitome of excellence. I believe the staff must all be Superstars as the work they do is truly amazing. If you want the best then use Bath Building Society.",
      "rating": 5,
      "date": "25th August 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "webchat service is great help",
      "text": "great speedy service from webchat.",
      "rating": 5,
      "date": "17th August 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent Communication",
      "text": "Tim R. has been fantastic - always so willing to answer any questions I have, no matter how big or small, and is always quick to reply. This is definitely making the process a lot less daunting than it otherwise would be for a first-time buyer like myself!",
      "rating": 5,
      "date": "11th August 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very easy mortgage process",
      "text": "The mortgage advisor Tim was very helpful and made the process easy for us, I would recommend them without hesitation.",
      "rating": 5,
      "date": "24th July 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very slow process, lots of obstacles.",
      "text": "While we are delighted to work with a local business and to be issued with a mortgage, the process took nearly 7 months. We hoped to complete end of May, and we've completed end of July. This means our family will be without a home for 2 months while building work is carried out, impinging on our 10 year old and 13 year old's school term. I understand the need to scrutinise our finances and to ensure the property will be worth it's value, but we are both in well paid jobs, with an extra property as additional security and we sought a 50% mortgage, with the remainder in cash. I would hope that we represent attractive customers with this kind of LTV. The property is clearly a good deal, given that most refurbished properties on the street go for £1.2 million In spite of this, our finances were scrutinised to a level we've not seen from prior lenders, asking about individual lines on our bank statements and the cost of my train tickets to London. The survey was deeper than normal, taking up extra time.. BIBS is retaining 5% while we complete the work: we are buying the house to do the work, in order for a young family to live in. We have no choice but to do the work. Finally, at the last minute, we were asked to submit approved building regs, prior to work starting. Given that building regs can only be formally approved AFTER the work is complete. This added a further 4 week delay. Our solicitor, building control and agent, have never seen in a process like this, and they all have over 20 years experience. I completely understand the vital nature of financial control and the avoidance of taking on a risk that would expose the financial system, but I cannot see the value of this level of scrutiny given our financial situation and the property. We have respected your conditions throughout, but it's caused a huge amount of anxiety in our house which appeared entirely unnecessary. In future, I would suggest that some of these conditions are laid out earlier in the process, we could have ensured we were ready for the extra scrutiny, and secure building control approval much earlier. Some of the lead times in communications could be speeded up. I would suggest we could have completed in May, had there been improved communication and expectations set clearly in advance. Again, I am delighted to be able to support a local business and I'm delighted that we have a mortgage in place: thank you.",
      "rating": 2,
      "date": "21st July 2023",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "Bot 0 - Nick 1",
      "text": "Bea still needs some training but, thanks to Nick, I got the information I needed. Not what I wanted but clear and understandable criteria guidance. Saved time waiting for a call to be answered.",
      "rating": 5,
      "date": "21st July 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Always wonderful service",
      "text": "Always wonderful service, super friendly and I like that they are local.",
      "rating": 5,
      "date": "19th July 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Fantastic service",
      "text": "Can't complain, always been treated well and it's easy to contact if needed.",
      "rating": 5,
      "date": "19th July 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "So quick on Instant Chat",
      "text": "Immediate response from the agent - Called Nick. Answered all my Questions relating to BTL Mortgage.",
      "rating": 5,
      "date": "19th July 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Fast easy means of contact",
      "text": "Thank you for your speedy and professional response",
      "rating": 5,
      "date": "17th July 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very efficient chat function",
      "text": "I wanted to start a remortgage application and used the instant chat function to get the process started. It was very quick and easy, I downloaded the application form and fact sheet within in minutes of starting the chat.",
      "rating": 5,
      "date": "11th July 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent product, Professional service",
      "text": "We applied for a \"Uni-Mortgage\" and from the outset meeting we had with Tim Randall the introduction, details of the product and the application process was clearly, articulately and professional explained to us. Throughout the whole process from initial meeting to offer letter Tim supported us through the entire process and had an accurate understanding of our situation, his commitment to navigate us through the application process was stead-fast & professional, which was greatly appreciated, he has an impressive work ethic & tenacity and is a credit to Bath Building Society Thank-you Tim",
      "rating": 5,
      "date": "6th July 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Uni Mortgage",
      "text": "Good Support and provided all required information",
      "rating": 5,
      "date": "4th July 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Preliminary chat for mortgage",
      "text": "Very helpful and on point. Thanks!",
      "rating": 5,
      "date": "3rd July 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Pleasure to deal with",
      "text": "Have just dealt with the Bath Building Society for the first time in many years and have been really impressed with their professionalism and courtesy. Special mention to Ingrida who dealt with our delay in submitting the Certificate of Title in a calm and friendly manner and who ensured that funds were released in time for completion. Shame all borrowers don't use you!!",
      "rating": 5,
      "date": "26th June 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Slow to act and respond",
      "text": "Quite possibly the worst mortgage experience in our lives. My wife and I are purchasing a property and the slow response times of Bath and inability to keep to service levels was quite shocking, at one point risking the transaction as our vendor started to lose patience. The BD manager admitted that staffing issues were leading to delays, but there was no proactive communication of such delays until deadline after deadline was missed. The whole mortgage process took over 3 months to conclude.",
      "rating": 1,
      "date": "23rd June 2023",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "Efficient",
      "text": "Fairly efficient Building society when comes to new mortgage process.",
      "rating": 5,
      "date": "23rd June 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Chocolate teapot comes to mind",
      "text": "As a joint mortgage holder I have no access to any of the mortgage information. I am not able to access the mobile app as it doesn't recognise me and they dont do online banking. They have however confirmed that if the primary mortgage holder defaults they will then contact me (after my credit rating has been affected). Overall my experience with them and their customer service has been very poor.",
      "rating": 1,
      "date": "20th June 2023",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "Personal and helpful!",
      "text": "My query was a little complicated so rather than continue via typed messages, Oliver gave me his number so we could chat it through and move forward to help my client - excellent service!",
      "rating": 5,
      "date": "8th June 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Helpful as always",
      "text": "From initially receiving excellent advice regarding Retirement Mortgages to responding to queries since, we have always found staff at Bath to be helpful and friendly.",
      "rating": 5,
      "date": "25th May 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "First class service from a very helpful organisation",
      "text": "We were looking to purchase a property for our son to live in for up to 3 years whilst he was living in another part of the U.K. The Bath Building Society’s Buy for Uni student mortgage product was exactly what we were looking for. However, as well as having a market leading product, they also had a team of people behind it that took the time and trouble to understand our circumstances and come up with a finance offer. Have nothing but praise for the way we were looked after,",
      "rating": 5,
      "date": "22nd May 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Real people to talk with about one's product",
      "text": "I would like to express my appreciation for the way my remortgage has been handled by Bath Building Society. I was offered a product that exactly suited my circumstances and which was a great relief to me at the time. It has since been serviced efficiently and promptly, and I have at all times felt that I had the help that I needed.",
      "rating": 5,
      "date": "17th May 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Really good experience",
      "text": "Very pleased with how easy The Bath Building society were to deal with, very fast at responding and easy to get hold of.",
      "rating": 5,
      "date": "5th May 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very friendly service",
      "text": "Very prompt and friendly live chat service.",
      "rating": 5,
      "date": "2nd May 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "very helpfull",
      "text": "nice member of staff and i received answer for every of my question",
      "rating": 5,
      "date": "20th April 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Super duper staff",
      "text": "Nick has been incredibly helpful and patient with all my questions as a first-time buyer. He answered all my questions quickly and clearly, and was always very friendly.",
      "rating": 5,
      "date": "18th April 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Not great legal work",
      "text": "Relatively slow process and high (unnecessary?) fees. Not impressed by the solicitor handling the case for BBS. Although I recognise they are acting for BBS and not on my behalf they were fairly uncommunicative, incorrectly quoted fees for work, slow to update information (e.g. completion statements were out of data and therefore inaccurate) , incorrect statements, left requests for vital (and large) fees until less than 1 hour before completion deadline. Charging £35 for completing the process online instead of by post? in the 21st century???? Some kind of joke?",
      "rating": 3,
      "date": "3rd April 2023",
      "product": "Mortgages",
      "sentiment": "mixed"
    },
    {
      "title": "Bath building society were professional, responsive and approachable",
      "text": "Bath Building Society proved flexible and even helpful which was essential as we didn’t use an intermediary and it was out first Ltd Co BTL.",
      "rating": 5,
      "date": "3rd April 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Highly recommend for mortgages",
      "text": "A building society that I would highly recommend for a mortgage. Easy to work with.",
      "rating": 5,
      "date": "31st March 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great Company for Mortgage Support",
      "text": "We have been with Bath Building Society for over 12 years and received during this time unfailing support and advise wiht regard to our small Mortgage which we recently redeemed in a very easy process. We strongly recommend Bath as an institution of professionalism and integrity.",
      "rating": 5,
      "date": "29th March 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "BIBS MORTGAGES",
      "text": "I HAVE BEEN A CUSTOMER OF BIBS FOR MANY YEARS AND HAVE ALWAYS FOUND THEM TO BE AT TH EFRONT OF BUSINESS AND CUSTOMER SERVICE, A SUPERB EXPERIENCE EVERY TIME",
      "rating": 5,
      "date": "25th March 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "very difficult to get 50% mortgage",
      "text": "their solicitor panel ackroydlegal.com are horrible and incompetent which makes the overall experience with BBS terrible. i would avoid if possible",
      "rating": 2,
      "date": "24th March 2023",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "Speedy, efficient and concise advice!",
      "text": "Speedy, efficient and concise advice!",
      "rating": 5,
      "date": "15th March 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Amazing, friendly and helpful service",
      "text": "Bath Building Society provided excellent, friendly service",
      "rating": 5,
      "date": "11th March 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Quick response online.",
      "text": "Good start to the process of gaining a mortgage in principle.",
      "rating": 5,
      "date": "8th March 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Personal service",
      "text": "Always quick to answer and good to talk to a human being.",
      "rating": 5,
      "date": "7th March 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Best in the West of England",
      "text": "Great Customer Service, very pleased",
      "rating": 5,
      "date": "2nd March 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "My late husband and I applied ito many banks and societies for a small mortgage on a high value property. We were turned down as too old. Bath Building Society supplied the mortgage needed and has pro",
      "text": "A company cannot be better than excellent and I recommend the Bath Building Society to anyone wo mentions looking for a mortgage or safe saving place.",
      "rating": 5,
      "date": "20th February 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Efficient Personalised Customer Service",
      "text": "The customer service offered by Bath Building Society (BBS) is unique in this online age. If we have ever needed to contact them we have always been dealt with by knowledgable and engaging individuals who have always solved whatever issue we may have had. Keep up the good work BBS!",
      "rating": 5,
      "date": "18th February 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Amazing service",
      "text": "I got a mortgage when it was looking tough. I have been with Bath now for 12 years. Staff are friendly and accommodating",
      "rating": 5,
      "date": "17th February 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Brilliant service",
      "text": "Bath building society always helpful polite and nothing to much trouble",
      "rating": 5,
      "date": "17th February 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Outstanding service",
      "text": "We have been borrowers now for some 23 years and the service levels are consistently high - A great Building Society",
      "rating": 5,
      "date": "17th February 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very friendly bank",
      "text": "We have a mortgage with Bath Building Society since 2015 and enjoy friendly accessible service. You feel like a valued customer and not just a number.",
      "rating": 5,
      "date": "17th February 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent in communicating",
      "text": "My questions and my requests for information are always very promptly responded to by the friendly staff of Bath Building Society",
      "rating": 5,
      "date": "17th February 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Amazing specialist lender!",
      "text": "Bath are a great specialist lender, who have their customers at the heart of everything they do. 10/10 would recommend.",
      "rating": 5,
      "date": "10th February 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "wonderful young man Oliver delight to chat to and his contact broker Nick equally wonderful clear and open - really fast service - delighted",
      "text": "oliver and nick - great people to chat too both need a 50% pay increase",
      "rating": 5,
      "date": "9th February 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "One in a million.",
      "text": "When we true to get our first mortgage no one would look at us then we went off to Bath Investment Building Society and had a chat. The lady who I can’t remember her name reassured us and asked us to prepare a spreadsheet of our outgoings and incomings etc. this was a non-traditional approach and very welcoming. We went off and carefully prepared our report and a good case of why Bath Investment Building Society should give us a mortgage. She went through all the figs carefully and within one week we had an offer. We understand there was a risk here but they took it. Since our first mortgage in 1989 we’ve had 5 mortgages with Bath and ar happy to say we are now mortgage free. Thank you for believing in us and giving us a chance to get on the property market. We are forever grateful. Debbie and Patrick Batheaston",
      "rating": 5,
      "date": "8th February 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Unique product range",
      "text": "A good range of products to fit the most unique set of requirements. Fantastic",
      "rating": 5,
      "date": "8th February 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Remortgage",
      "text": "Very easy process to remortgage by btl over to Bath. My advisor was great throughout the process, he was very knowledgeable and professional.",
      "rating": 5,
      "date": "1st February 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very helpful service",
      "text": "My chat request was answered very quickly, and clear answers were given. Nick was extremely helpful and pleasant.",
      "rating": 5,
      "date": "27th January 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Good product but time-consuming",
      "text": "The mortgage advisor at Bath (Ian Birch) was excellent and always responded immediately to any questions. I cannot rate him highly enough! Once the application was submitted however, the process became more arduous. For example my husband and I were asked for a signed gift letter, this had already been submitted. We were also asked for statements for an account that we didn’t have - turned out that this was our daughter’s account and the request should have been sent to her. It also wasn’t made clear at the initial application that screen shots would not be acceptable - if this had been stated it would have saved a lot of time. And the whole process took so long that we were requested to provide yet more bank statements as the ones that had been submitted were out of date! It also would have been helpful to be informed via email that our mortgage offer had been made, as with the postal strike it took several days to reach us and the sellers were getting anxious.",
      "rating": 4,
      "date": "12th January 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Bit of a problem but sorted very quickly by talking to the right man!!",
      "text": "I had some problems getting documents I needed to do with my Buy to Let mortgages. This was due to either misunderstandings, or lack or knowledge or training. After several failed attempts I phoned Ben Hutchings who had helped me in the past, he put wheels in motion and sorted immediately even though it wasn't really his responsibility. Thank you Ben!!!",
      "rating": 5,
      "date": "11th January 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Efficient, Helpful and Contactable",
      "text": "We have just completed our re-mortgage to the Bath Building Society. Our first very positive experience was that the mortgage deal we were offered in September '22 was the deal we now have in January '23 - a period when the mortgage market dramatically changed and where mortgage products and offers in principle were being withdrawn. We found the underwriting process efficient and thorough which is, frankly, reassuring. However, the stand out feature for us was the ability to communicate with members of the mortgage admin team, quickly, by telephone or email, who were able to deal with our enquiries there and then and when they couldn't actually got back in contact with us within a few hours with the answer. This has not been our experience with other financial institutions. It's also worth noting how friendly and courteous everyone we have come into contact with has been.",
      "rating": 5,
      "date": "5th January 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Generally so so ...",
      "text": "The online chat function was brilliant and I got the answer I was looking for. However the experience I had setting up this mortgage was not great and my advisor complained formally. The issue generally surrounded the slow pace at which the application was reviewed and we almost lost out on our property. That said, the online chat was great and I hope my opinion continues to change. I appreciate it's a tricking time.",
      "rating": 3,
      "date": "5th January 2023",
      "product": "Mortgages",
      "sentiment": "mixed"
    },
    {
      "title": "They got me a mortgage!",
      "text": "Tim Randall has been absolutely amazing and very professional! He kept me informed throughout the entire process, he was very efficient at getting back to me regarding any queries I had and went above and beyond to get my house re-mortgaged! I was able to re-mortgage at the most difficult time when deals were being pulled from the market, left, right and centre and interest rates were rising due to the bank of England rising their rates. I would 100% recommend Tim and Bath Building Society.",
      "rating": 5,
      "date": "28th December 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great pre-application service",
      "text": "All the information on the website was clear and the chat function on the website is really quick, easy and informative.",
      "rating": 5,
      "date": "16th December 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Innovative Product for our times",
      "text": "The severe shortages of rental accommodation in Edinburgh for my student son last April led me to search for a guarantor type mortgage. I found the 'buy for university' product and it ticked all the boxes. We were lucky to have Tim as our advisor and he was fantastic, any questions he responded promptly and kept us informed as the underwriter review dragged on a little bit. There were some restrictions to the mortgage which limited what we could buy. Eventually we found a place and our offer was accepted. The approval process took 8 weeks to complete from submission of the application. One suggestion for improvement would be in regard to the extra security, it was not clear to us what documents were needed and this caused some panic and delay post the mortgage offer. But a great product overall.",
      "rating": 5,
      "date": "16th December 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Professional",
      "text": "Very helpful and very professional with good interest rates. I am glad i found them through our mortgage broker highly recommend who are looking for stress free lender",
      "rating": 5,
      "date": "14th December 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Poor service",
      "text": "Very poor contact.Lost count on the amount of calls made. No pace no urgency or keeping customers informed. Nearly 5 months to process once signed the documents. Raised a formal complaint. Was fobbed off when challenged. Could have been so much better. Very poor",
      "rating": 1,
      "date": "12th December 2022",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "Easy remortgage prices",
      "text": "Great communication, designated contact made the process relatively rubble free",
      "rating": 5,
      "date": "12th December 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Financial Services as they should be",
      "text": "Dealing with most financial services organisations is, for a large part, a demonstration of how customers come a distant second to under invested technology systems and computer dictated processes. BBS is a demonstration of how an organisation can demonstrate that it and every one in the organisation values and cares for customers at the same time as it deals with the regulatory framework and commercial considerations of the sector in which it operates..",
      "rating": 4,
      "date": "12th December 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "First class service",
      "text": "Prior to my application with Bath, I had applied with one of the major lenders but was Essentially through that process messed about. I decided to go with Bath and felt thoroughly supported and kept in the loop through the process. My solicitors comments were that this was by far the best mortgage firm they had dealt with. Bath was responsive , experienced and super efficient. Highly recommended.",
      "rating": 5,
      "date": "8th December 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Brilliant help over the online chat",
      "text": "Very helpful and I get what I needed promptly",
      "rating": 5,
      "date": "7th December 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Useful and quick to ask questions",
      "text": "Helpful and easy to get useful answers",
      "rating": 5,
      "date": "25th November 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "BTL RATE SWITCH",
      "text": "Adviser was unable to help with my query. and so it was referred on",
      "rating": 4,
      "date": "25th November 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Online chat service",
      "text": "Quick and efficient service. Gave information required.",
      "rating": 5,
      "date": "22nd November 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Good communication and knowledge",
      "text": "I used the live chat option and was connected very quickly and the agent was very helpful",
      "rating": 5,
      "date": "17th November 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very responsive and quick",
      "text": "All questions answered quickly and the chat works great.",
      "rating": 5,
      "date": "9th November 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Building height restriction is too strict for 2022",
      "text": "The online chat was great and helped me get a quick answer to my question but the reason I wouldn’t be able to recommend Bath Building Society to friends and Family is due to the strict building height rules for lending criteria. They do not lend on buildings over 6 storeys high which in today’s economy especially for borrowers in London; is extremely unhelpful as most London new builds are well over 10 floors. Other than that, I thought they would have been a great lender option so it’s such a shame!",
      "rating": 5,
      "date": "31st October 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "A pleasure to deal with",
      "text": "Ian and the team provided a smooth, quick and professional service and made the whole process painless",
      "rating": 5,
      "date": "27th October 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Remortgage to Bath Building Society",
      "text": "Tim was fantastic at keeping me up to date on the progress of my application. I would highly recommend using Bath Building Society.",
      "rating": 5,
      "date": "24th October 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Thank you!",
      "text": "Just wanted to say thank you for giving us the opportunity to purchase our first ever home. With a not so perfect credit rating I am so thankful you gave us the chance to become homeowners when others said no. Your customer service is excellent and you always provided updates to my broker on our case which made the whole process less stressful. Thank you Bath BS!!",
      "rating": 5,
      "date": "24th October 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Brilliant service! Highly recommend!",
      "text": "Ian and the team at BBS were amazing. Ian was super helpful, knowledgeable, kind and considerate. He made the application process so easy and was available if I had any issues. The admin team were quick and thorough. These guys honestly have such amazing mortgage service, it way exceeds most of the larger high street mortgage lenders. I wouldn’t hesitate to recommend them.",
      "rating": 5,
      "date": "22nd October 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "great service, helpful and knowledgeable",
      "text": "Great service, from the first person I spoke to the re-mortgage has been problem free and easy. High recommend.",
      "rating": 5,
      "date": "19th October 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Professional and personal, first class in all aspects.",
      "text": "A refreshing change to be a customer of an organisation that clearly see its members as individuals. How nice to be able to talk to somebody on the phone without having to go through countless menu options. Queries always dealt with promptly and with clarity. I would highly recommend.",
      "rating": 5,
      "date": "13th October 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "What you are offering is amazing",
      "text": "Thankyou so much for offering the Buy for Uni mortgage",
      "rating": 5,
      "date": "12th October 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Nick was prompt and knowledgeable",
      "text": "really good quick service, very refreshing",
      "rating": 5,
      "date": "11th October 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Outstanding customer service",
      "text": "Mortgage processed quickly and efficiently despite a couple of non-standard details in the application. Excellent personal attention from staff throughout.",
      "rating": 5,
      "date": "10th October 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Professional service",
      "text": "Smooth application process, responsive and friendly staff, would recommend your services.",
      "rating": 5,
      "date": "1st October 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Fixed rate query",
      "text": "Understandably the fixed rates have been pulled but the chat function and assistance was very handy.",
      "rating": 5,
      "date": "28th September 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Tom was very helpful",
      "text": "I was looking to find out more about a rather niche product, but Tom was very quick, professional, and helpful. I would thoroughly recommend him.",
      "rating": 5,
      "date": "16th September 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent on live chat, not good at returning calls",
      "text": "Having used Bath for the first time, they could do with making their system more user friendly.",
      "rating": 5,
      "date": "16th September 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Nick helped quickly",
      "text": "Nick called me which was a nice touch and we resolved the query quickly, so really efficient for us both",
      "rating": 5,
      "date": "15th September 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Communication",
      "text": "Communication is not very great, however when through to chat with someone they were helpful. They didn't have my email address on the system to request additional documents from me, despite communicated via email while initiating the process of mortgage application. so clear gap in departments.",
      "rating": 3,
      "date": "14th September 2022",
      "product": "Mortgages",
      "sentiment": "mixed"
    },
    {
      "title": "Lovely experience",
      "text": "Lovely professionals. Questions answered fast and precise.",
      "rating": 5,
      "date": "30th August 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Got there in the end",
      "text": "Very slow, took 6 months to agree a simple mortgage, seemingly very picky and to some extent box ticking. On the plus side, terms were favourable and the service was more personal than other mortgage lenders. We used a broker but in hindsight I think dealing direct would have been much better, also note BBS will only deal with solicitors not a conveyancing company, broker should have (but didn't) advised this.",
      "rating": 3,
      "date": "17th August 2022",
      "product": "Mortgages",
      "sentiment": "mixed"
    },
    {
      "title": "Quick Service",
      "text": "Great work from Oliver on the chat desk. Really efficient and got me to the right answer quickly.",
      "rating": 5,
      "date": "2nd August 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very efficient and friendly",
      "text": "Nick was great, he came across as knowledgeable and helped with my query very quickly",
      "rating": 5,
      "date": "27th July 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Good service",
      "text": "The chat facility is good. Oliver and Tom have been helpful",
      "rating": 5,
      "date": "27th July 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great service!",
      "text": "Although I wasn't able to get all of the answers I required immediately, Oliver had no hesitation in providing me with details to contact him via email where he would be able to help me further with my query. It gave me confidence that I would always have help when needed from Bath Building Society",
      "rating": 5,
      "date": "20th July 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "mixed bag",
      "text": "Tim, the advisor was brilliant; available, supportive and prepared to listen and respond flexibly. The staff are all very pleasant and available. However, we encountered difficulties with the underwriters, who made things hard going and all innovation for solutions to the problems we encountered had to come from us. They seemed to be overly cautious and, in our view, a bit tick boxy in approach. We were required to undertake legal advice for three adult kids and ourselves which didn't tell us anything we didn't already know (I'm trained as a lawyer!) at a cost of nearly £1000 when the advice for the kids could be summarised; you have no rights now but this charge means you are signing away your non-existent rights! If we hadn't been under so much time pressure in the purchase I think we probably would have sought a different provider (despite Tim).",
      "rating": 4,
      "date": "16th July 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Broker Support",
      "text": "Nick was great along with Adam, very supportive and knowledgeable",
      "rating": 5,
      "date": "6th July 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "great service",
      "text": "Efficient, helpful, great service being received on my urgent case.",
      "rating": 5,
      "date": "1st July 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    }
  ]
}