{
  "society": "Buckinghamshire Building Society",
  "slug": "buckinghamshire-building-society",
  "smpUrl": "https://smartmoneypeople.com/buckinghamshire-building-society-reviews/products",
  "totalReviewsOnSMP": 724,
  "avgRating": 4.58,
  "scrapedAt": "2026-02-06T15:33:53.521982+00:00",
  "reviews": [
    {
      "title": "Professional, knowledgeable, and reliable.",
      "text": "Professional, knowledgeable, and reliable. Kay Stockdale explained every step clearly, responded quickly to questions and very helpful.",
      "rating": 5,
      "date": "12th September 2025",
      "product": "Direct Advice",
      "sentiment": "positive"
    },
    {
      "title": "Fantastic, personable, professional and speedy service.",
      "text": "Fantastic, personable, professional and speedy service.",
      "rating": 5,
      "date": "10th July 2025",
      "product": "Direct Advice",
      "sentiment": "positive"
    },
    {
      "title": "Kay Stockdale is wonderful",
      "text": "Kay Stockdale is wonderful. I would recommend her to anyone who needs a mortgage. Very helpful and informative.",
      "rating": 5,
      "date": "18th June 2025",
      "product": "Direct Advice",
      "sentiment": "positive"
    },
    {
      "title": "Great communication from start to finish with the team.",
      "text": "Great communication from start to finish with the team. Great support in pointing me in the right direction and providing me with the best options.",
      "rating": 5,
      "date": "11th June 2025",
      "product": "Direct Advice",
      "sentiment": "positive"
    },
    {
      "title": "Great experience in our re-mortgage application",
      "text": "Our experience with Kay Stockdale was impeccable from start to finish. She kept in touch with us on a regular basis and nothing was too much trouble. She was also very understanding. I would highly recommend her to anyone looking to take out a mortgage with Bucks Building Society.",
      "rating": 5,
      "date": "29th May 2025",
      "product": "Direct Advice",
      "sentiment": "positive"
    },
    {
      "title": "Applying for a RIO mortgage",
      "text": "I found the whole experience of applying for a RIO mortgage online easy. This was facilitated by Kay who always responded quickly to any emails and was a pleasure to talk to on the phone. As this building society is one of the few offering this type of mortgage I had never dealt with them before but I can certainly recommend them if you are considering applying.",
      "rating": 5,
      "date": "11th February 2025",
      "product": "Direct Advice",
      "sentiment": "positive"
    },
    {
      "title": "Brilliant service from initial enquiry phone call to...",
      "text": "Brilliant service from initial enquiry phone call to receiving a mortgage offer. Kay Stockdale instantly made me feel at ease and made the whole process stress free, Sam also was great in the whole underwriting process. I would definitely recommend if you are looking for a personal approach to getting a mortgage ! 10/10 service",
      "rating": 5,
      "date": "25th May 2024",
      "product": "Direct Advice",
      "sentiment": "positive"
    },
    {
      "title": "Great Customer Relationship management",
      "text": "Excellent customer services via mortgage advisor Kay Stockdale, she is a credit to your organisation. Very knowledgeable and empathetic towards my specific requirements.",
      "rating": 5,
      "date": "9th April 2024",
      "product": "Direct Advice",
      "sentiment": "positive"
    },
    {
      "title": "Just Amazing",
      "text": "Kay was absolutely amazing from the initial conversation right through to the offer being issued. I can't recommend Kay and BBS enough. Superb!!",
      "rating": 5,
      "date": "14th November 2023",
      "product": "Direct Advice",
      "sentiment": "positive"
    },
    {
      "title": "Kay has been brilliant, from start to finish",
      "text": "From the moment I first spoke to Kay and in every conversation/email since, Kay has been professional, knowledgeable and extremely helpful. All my questions have been responded to very prompty and thoroughly and I am very impressed with the level of service provided by Buckinghamshire Building Society.",
      "rating": 5,
      "date": "22nd September 2023",
      "product": "Direct Advice",
      "sentiment": "positive"
    },
    {
      "title": "Re-mortgage experience",
      "text": "Kay my mortgage adviser was brilliant, communication was really good, and she kept us updated on a regular basis, she made me feel at ease. I would 100% recommend Buckingham building society,",
      "rating": 5,
      "date": "11th September 2023",
      "product": "Direct Advice",
      "sentiment": "positive"
    },
    {
      "title": "As a broker I had not used Buckinghamshire previousl...",
      "text": "As a broker I had not used Buckinghamshire previously but have to say the openens and ease of communication has been fantastic on what was not the most straight forward of cases which has now received an offer of mortgage so all good",
      "rating": 5,
      "date": "29th January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Shockingly slow, beyond comprehension",
      "text": "Effectively left on street when moving as they need more than 6 hours to complete a simple completion statement, thus preventing the chain from doing anything all day to complete.",
      "rating": 1,
      "date": "19th September 2024",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "Mortgage Application",
      "text": "I find their criteria to be flexible and even on a standalone Further Advance offered the cheaper existing client rate rather than the higher current rate available.",
      "rating": 5,
      "date": "6th June 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Complex Case Offered!",
      "text": "I have just had a very complex case offered by Buckinghamshire. I hadn't used them up to this point as a broker but due to a few bits of criteria I found that Buckinghamshire would lend subject to application. I initially spoke to Natalie about the case who was very helpful and then this moved onto Paige who was equally as helpful, both getting back to me very quickly when I had initial questions. The case was then underwritten by Stacey who carried on the excellent service as given by Natalie and Paige. May have been 5 stars but did take slightly longer than I anticipated to be approved with lots of information and documents needed which I understand and appreciate with complex cases however I think this was out of the hands of the individuals I have mentioned who I stress again were all great!",
      "rating": 4,
      "date": "4th April 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Submitted a complex case.",
      "text": "Submitted a complex case. The case was technically outside of policy, however Simon, Claire and Sam worked tirelessly on a solution and a positive outcome for the clients. It too longer than ideal to get to offer, however the flexibility and knowledge that they have shown has been imperative for my clients to get the right outcome.",
      "rating": 5,
      "date": "27th March 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Review of mortgage offer",
      "text": "When dealing with a mortgage offer and certain things happen, that are out of your hands. As an individual this can be very deflating. To be given time and their time to resolve the situation, to get a mortgage offer needed confirmed. I honestly couldn't be more thankful to Claire, Louise and Mark and the team at BBS for this. As they didn't have to, but they did.",
      "rating": 5,
      "date": "21st March 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Going The Extra Mile",
      "text": "On the day of the remortgage completion it suddenly became apparent that there would be a shortfall in funds. I contacted Claire and Susan at the Bucks and they immediately escalted my request for an amended offer, came through the following day, completion set for the day after. Amazing work by Claire and Susan and the teams behind them to get the completion done. Thank you and it was very much appreciated by me and my clients.",
      "rating": 5,
      "date": "16th November 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Bucks review",
      "text": "the BDM and staff are very knowledgeable and helpful",
      "rating": 5,
      "date": "26th October 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Bucking the trend.........",
      "text": "As a Mortgage Broker, I have been dealing with Bucks for some 15 years - They are my first call for the more difficult to place cases. They can't always help, but can be relied on to try their best to accommodate in a friendly & professional manner. As someone who spends their life dealing with similar institutions, I can tell you their attitude is quite refreshing!",
      "rating": 5,
      "date": "6th May 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "AGM Member Review",
      "text": "Promotes confidence, very efficient. No known areas of improvement.",
      "rating": 5,
      "date": "19th April 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Helped my client remortgage when other lenders wouldn't...",
      "text": "My client had a few recent credit blips and two other lenders wouldn't consider her. After our D.I.P application, the lovely Paige at Buckinghamshire BS helped us find a way forward to help the client and get the application submitted. Buckinghamshire BS very much have a human approach to mortgages, rather than the usual tick box and computer says no attitude of the majority of lenders out there. Definitely try Bucks BS if you haven't already, or if you struggled with other lenders recently with a client and are about to give up. Thanks again Paige and speak again soon! Brian",
      "rating": 5,
      "date": "15th March 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Thank you Julie Hanlf",
      "text": "Julie was our regions business development manager and even though she covers another area now she is still on the end of the phone whenever I've needed help. She has helped me with complex cases and always with a smile. She is a great BDM and a great representative for Bucks.",
      "rating": 5,
      "date": "24th February 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Brokers choice for common sense lending",
      "text": "I have had the pleasure of working with BBS on a couple of occasions when , as broker, the case didn't fit standard criteria but made common sense lending. My BDM Paul Johnson took the time to meet with me and discuss the case over breakfast ( which he sprung for, thanks PJ!) and said he thought this was a case for them and to leave it with him. He came back in short order and said yep they will do it. It was a little tricky during underwriting but Louise Bellis who was underwriting the case liaised with us and together we worked the issues and next week we expect the offer out. Listen - this wasn't a standard case so don't moan if it takes a little longer than usual and explain to your clients why and (providing everyone keeps talking) things come out favorably for all but this isn't the first time I have used BBS and it wont be the last. Well played to PJ, Louise and all involved in making stuff happen at the BBS. Carry on . Malcolm Clarke, Simpson FS, Royal Leamington Spa, Feb 2023",
      "rating": 5,
      "date": "22nd February 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Claire BDM is Fantasic",
      "text": "Huge thanks Claire. Not enough BDMs do the hard yards up front. Tricky case for clients with a small holding on the property and other quirks. Took the time to assess the application up front and you have delivered on what you promised. Huge thanks to yourself and the underwriters involved",
      "rating": 5,
      "date": "9th February 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Fantastic Service",
      "text": "Claire Askham deloivered a fantastic service, she was so helpful, and really went above and beyond to try and accommodate my client and it was much appreciated.",
      "rating": 5,
      "date": "26th January 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "AGM Review",
      "text": "Friendly customer service. Better online facility please. Good at listening to customer feedback",
      "rating": 4,
      "date": "1st May 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Amaterus",
      "text": "These people have no idea what they're doing, extremely messy and costly working them, avoid like plague.",
      "rating": 1,
      "date": "30th December 2021",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "Mortgage review",
      "text": "Real person answers phone immediately",
      "rating": 5,
      "date": "30th April 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Like all financial institutions, could do better!",
      "text": "Must pass on interest rate changes quicker.",
      "rating": 3,
      "date": "17th April 2020",
      "product": "Mortgages",
      "sentiment": "mixed"
    },
    {
      "title": "AGM Feedback",
      "text": "Seems like a family business. Very personable and professional",
      "rating": 5,
      "date": "15th April 2020",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Efficient and esay to deal with",
      "text": "Efficient and easy to deal with",
      "rating": 5,
      "date": "7th April 2020",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great customer service",
      "text": "Many thanks for helping me sort out my mortgage and making it so straightforward to move product.",
      "rating": 5,
      "date": "29th March 2020",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Buckinghamshire building society review",
      "text": "I have had no problems with Buckinghamshire and always in contact with their customers",
      "rating": 5,
      "date": "24th March 2020",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Lovely experience.",
      "text": "Lovely experience. Staff remember you. Friendly. Manager comes out to support till staff with queries.",
      "rating": 5,
      "date": "27th November 2024",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Streets ahead compared to large banks.",
      "text": "Recently opened two accounts with the Buckinghamshire Building Society and I have been extremely impressed by the high level of service provided both at their branch and on the phone. They are streets ahead compared to large banks.",
      "rating": 5,
      "date": "2nd May 2024",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "STILL NO APOLOGY FROM BUCKS BUILDING SOCIETY!",
      "text": "Still no apology for trying to pay me c.£40 interest less than I was due.. Very poor customer service.",
      "rating": 1,
      "date": "20th April 2024",
      "product": "Savings",
      "sentiment": "negative"
    },
    {
      "title": "Excellent service",
      "text": "Always very impressed with the speed of service by post. Friendly and competent when I have rung them up too. Transparent about interest rates: I get an email when they change and the website is up to date. too.",
      "rating": 5,
      "date": "15th July 2023",
      "product": "Savings",
      "sentiment": "positive"
    }
  ]
}