{
  "society": "Cambridge Building Society",
  "slug": "cambridge-building-society",
  "smpUrl": "https://smartmoneypeople.com/cambridge-building-society-reviews/products",
  "totalReviewsOnSMP": 0,
  "avgRating": 5.0,
  "scrapedAt": "2026-02-06T15:34:06.892819+00:00",
  "reviews": [
    {
      "title": "A really good building society",
      "text": "The Cambridge Building Society really tries to help both its savers and borrowers, they are always trying to do their best, and make sure that you fully understand everything you need to know, its mortgage products are spot on and its range of savings products is exceptional,the rates paid are one of the best in the market, I thoroughly recommend them",
      "rating": 5,
      "date": "16th April 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent",
      "text": "Quick sign up. Excellent website and app. Had to secure message them for a query and my message was dealt within a few hours. Fast payments are in within a couple if hours.",
      "rating": 5,
      "date": "15th December 2024",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "lovely local branch",
      "text": "lovely local branch with friendly helpful staff. Their rates are competitive with many of the more well known companys",
      "rating": 5,
      "date": "30th August 2015",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Took us on for a re-mortgage when others declined.",
      "text": "From our first call to the Cambridge Building Society to the final one when our re-mortgage was completed, the service they provided was top class.\nOur mortgage adviser Emerson was extremely helpful throughout the whole process, and was always kind, considerate and very knowledgeable.\nWe cannot recommend this great company enough!\nThank you.",
      "rating": 5,
      "date": "5th February 2026",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "I would totally recommend this bank as…",
      "text": "I would totally recommend this bank as was very understanding on my situation and helping towards  house sales.\nThank you for all help given to support me and my family to make things easy.\nBig thank you for all the staff specially Richard been there from beginning and was very valued adviser on all the process.",
      "rating": 5,
      "date": "18th December 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Regret opening an Saving Account",
      "text": "I tried to open a savings account. Using their verifier app I was told to follow the process to download documents so I could open my account. Their app failed time after time. Since then customer services have been on hand to resolve the issues. They are contactable and friendly.",
      "rating": 3,
      "date": "11th December 2025",
      "product": "General",
      "sentiment": "neutral",
      "source": "trustpilot"
    },
    {
      "title": "If you enjoy a poorly designed and…",
      "text": "If you enjoy a poorly designed and operated website, low interest rates and appalling customer service, this is the place for you!",
      "rating": 1,
      "date": "8th November 2025",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    },
    {
      "title": "The Cambridge Building Soc. - a competitive return and excellent service",
      "text": "Ref: Cambridge BS Extra Reward Loyalty Regular Saver. At the end of the 1 year term, I was able to renew the  product without the faff of a new account number: it was all set up and ready-to-go with minimal effort. The Cambridge BS also seem to have maintained a customer-centred approach, whilst still investing heavily in the online platform form and function. Local mutuals, I feel, are also worth supporting for the sake of the local residents if nothing else ...",
      "rating": 5,
      "date": "24th October 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "A fantastic service from a really…",
      "text": "A fantastic service from a really lovely lady today. Very helpful and solved my issue straight away, then later on I spoke to another very helpful lovey lady!",
      "rating": 5,
      "date": "26th August 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Poor customer service in the CBS Histon branch today",
      "text": "Went into the Histon branch today to open an account. Been with them for years.  45 minutes later still had not opened the account despite being long serving customers with ID already supplied. A couple of weeks ago had a maturing ISA the foreign lady in there said I could only transfer £20k.  I said it was old money and I could transfer it all.   Did not have a clue what she was talking about so had to get another customer service lady to do a proper job.  Customer service in the Histon branch is now rock bottom,",
      "rating": 1,
      "date": "12th July 2025",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    },
    {
      "title": "Let down by their conveyancing company",
      "text": "I’m currently moving my mortgage to Cambridge BS, but unfortunately have to deal with their chosen legal company, Conveyancing Direct. \nThe company is very slow, then get you to do the running around for them and to add insult to injury, add additional charges after you do their work. \nThey also come across as very rude and unprofessional.\nIts such a shame as it’s definitely made my broker think about using them in the future for this reason.",
      "rating": 2,
      "date": "25th June 2025",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    },
    {
      "title": "Been with the Cambridge for many years",
      "text": "Been with the Cambridge for many years. The staff are always very patient and helpful. Especially in the Ely branch",
      "rating": 5,
      "date": "20th June 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Decline in Standards of Customer Care",
      "text": "I have held a mortgage with The Cambridge for over 10 years. They wrote twice advising me that my product was coming to an end and they would contact me. The end date was fast approaching and having had no further contact I phoned the head office to be advised that they wouldn't speak to me because I had failed a security check. I had given accurate answers to the security questions which means the society holds data that is not factual. I asked how the matter could be resolved and they left me on hold.\nStandards seem to be in decline at The Cambridge.",
      "rating": 1,
      "date": "30th May 2025",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    },
    {
      "title": "The worst experience I ever had",
      "text": "The worst experience I ever had , taking ages with application process . My fixed term has finished and now I have to pay high interest rate because No remortgage done by Cambridge.\nAfter few months they lower my rental income to unable to remortgage at good price . Not recommend",
      "rating": 1,
      "date": "17th May 2025",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    },
    {
      "title": "A building society for the people",
      "text": "Unlike some of the bigger mortgage lenders, I have always found The Cambridge Building Society to be one of the more friendly societies….a lender for the people. I've recently had a change in circumstances meant I needed some flexibility. The Cambridge were excellent in working with me to find a solution. They treated me like a human being, not a number. Many thanks to all involved.",
      "rating": 5,
      "date": "7th April 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Out of pocket",
      "text": "Very disappointed that this company let us pay £275 for a valuation on a flat that has fully remediated cladding but no EWS1 form yet (wait times for this are long). They knew this before the valuation took place - so they should've known they wouldn't lend on a flat that doesn't have it's EWS1 form yet. Yet another company taking advantage of people stuck in this cladding crisis. By the way, RICS guidance is to value flats that are in buildings currently being or finished remediation at market value.",
      "rating": 1,
      "date": "23rd December 2023",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    },
    {
      "title": "An excellent financial services…",
      "text": "An excellent financial platform with product offering that nurtures great savings & investment habits.✨✅",
      "rating": 5,
      "date": "15th December 2023",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Company ignores RICS guidance on…",
      "text": "Company ignores RICS guidance on mortgage lending for flats with COMPLETED remediation.  They were informed ahead of time, and of course got us to pay for a valuation - which i assume they got a kick back for.  Why even bother it's not like we were hiding it from you!",
      "rating": 1,
      "date": "11th December 2023",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    },
    {
      "title": "Great call centre staff",
      "text": "Such helpful and knowledgeable staff, Dean was great, he did not rush me and guided me so I could get back on the app after forgetting my password as I had changed phones. \nHe got me through the login process and then helped me to download the app and get on, then sorted my other dilemma of a money transfer. \nBig thanks to cbs for such helpful staff. \nBest wishes\nStephen Hill",
      "rating": 5,
      "date": "23rd February 2023",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Don't remortage unless doing 6months in advance",
      "text": "The initial mortgage advisor was good.  After agreeing to remortage with them, it has been one long battle dealing incompetent admin, spelling mistakes, errors in emails.  Despite sending all required documents immediately, I have had to chase every step of the way.  It has now taken so long that it did not complete before our existing rates went up so we now have to pay an extra £235 this month. Wish we'd never started the moving process, certainly would not recommend",
      "rating": 1,
      "date": "30th January 2023",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    },
    {
      "title": "RED FLAGS!",
      "text": "Made the mistake of trying to pay money into their easy access account via my bank. EVERY SINGLE TIME my bank flagged up that the details I was inputting were not recognised, so I double, triple and quadruple checked. Interestingly, I had to transfer some money to another new payee via my bank and that went through no problem. I assume the Cambridge Building Society are not to be trusted, so I'll be looking for a new savings account.",
      "rating": 1,
      "date": "9th October 2022",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    },
    {
      "title": "Avoid ! Awful service",
      "text": "Avoid !! Awful service. Have regular savings which they not willing to increase rate like so many other building societies do. Went to open another savings account and screen just keeps coming up with error codes. They can't be bothered to call or email me. Lazy unprofessional. Would not recommend.",
      "rating": 1,
      "date": "2nd October 2022",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    },
    {
      "title": "I must recommended your entire team at…",
      "text": "I must recommended your entire team at the Bar Hill branch.\nParticularly Ali who went above and beyond recently with help and advice regarding my mother's bereavement affairs.\nAli showed genuine concern and provided us with the best advice.  Very much appreciated by us.  Thank you. \nChris.  France.",
      "rating": 5,
      "date": "26th July 2022",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Amateurish and Unhelpful",
      "text": "A 3 year bond in conjunction with my grandson is soon to mature. At rather short notice I have received a letter concerning options on maturity. One option being to ring to discuss what options are available. The letter emphasises that it is helpful to discuss matter with a \"Savings Expert\". The letter goes on to say \"contact us today\"  Rather surprised on ringing Cambridge to be  told that the letter is a general letter not relevant to the bond and that it is not possible to discuss this via a phone call.\nAlso tried live chat which is not working and neither is feedback at the end of a phone call.",
      "rating": 1,
      "date": "13th June 2022",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    },
    {
      "title": "A great bank",
      "text": "A great bank, and the staff are very polite and helpful.",
      "rating": 5,
      "date": "4th March 2022",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Rescued by Customer Services",
      "text": "I made the mistake of handing two large Cambridge Building Society cheques into the Post Office to credit my bank account. Two working days later they had not arrived even as a pending transaction. All I had from the Post Office was a slip saying I had used their service! Customer Services at Head Office responded to my request for help within the hour and arranged not only to stop the cheques but then to transfer the funds to my account direct. I had not known they could pay direct and a new counter clerk at a local branch was to blame for that. Absolutely outstanding service and now I can sleep tonight.",
      "rating": 5,
      "date": "11th January 2022",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Arrogant staff a big problem!",
      "text": "Had to call this company today due to a company issue; i have never in my life been spoken to in such an obnoxious arrogant manner by the female who answered the call.  I was so angry i hung up the phone.  There are ways of speaking to people and this is not it; training needed Cambridge; urgently!",
      "rating": 1,
      "date": "13th May 2021",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    },
    {
      "title": "Cambridge Building Society Shelford",
      "text": "Cambridge Building Society Shelford. This is a wonderful building society. helpful staff and great products. I recently opened up two accounts here with the help of a staff member named, Helen. A patient kind lady, who was well knowledge on all accounts. She explained things thoroughly to me, as I can be a little slow on the uptake. She is a credit to the company and will recommend this branch to all my friends and family.",
      "rating": 5,
      "date": "15th April 2021",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    }
  ],
  "trustpilotUrl": "https://uk.trustpilot.com/review/www.cambridgebs.co.uk"
}