{
  "society": "Chelsea Building Society",
  "slug": "chelsea-building-society",
  "smpUrl": "https://smartmoneypeople.com/chelsea-building-society-reviews/products",
  "totalReviewsOnSMP": 0,
  "avgRating": 2.33,
  "scrapedAt": "2026-02-06T15:34:17.146685+00:00",
  "reviews": [
    {
      "title": "Outdated, awful customer service, careless staff and zero loyalty to long term customers",
      "text": "Chelsea Building Society is really outdated, rigid and short sighted. There is absolutely zero loyalty towards long term customers and inflated interest rates, not competitive at all with other lenders. Staff are inflexible, off hand and careless (sent my personal financial information to someone else’s email address). Highly recommend Canada Life as a much more liberal, professional and modern approach and much better interest rates.",
      "rating": 1,
      "date": "28th February 2022",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "Definitely not the greatest !",
      "text": "I àwant my exes name taking off what was 'our mortgage as it is only myself living here & paying it and has been for years, I enquired in branch about how to do this & then did as I was advised. I didn't receive an acknowledgement of my request so called customer services & explained the issue only to be spoken to in a way that was belittling & was refused my request due to my work circumstances. Apparently even though I'm the person that has always paid my mortgage I'm not deemed suitable to pay by myself ' but I always have ' !? So they won't take his name off my mortgage even though he has asked to be removed !! It's not so much that they won't but the way it was said and the fact they didn't have the good level of customer service to write or call to let me know & I had to call them. Not my idea of great service",
      "rating": 1,
      "date": "23rd August 2021",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "Brilliant service",
      "text": "I've been with the Chelsea for several years now and in all of that time I can honestly say I have not had any bad experiences in my dealings with the society. Staff are very knowledgeable, attentive and friendly in their conduct of their duties. The range of products on offer are very competitive and put the business where it is today amongst the ranks of financial institutions to deal with.",
      "rating": 5,
      "date": "16th March 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Mariyam was very helpful",
      "text": "Mariyam was very helpful, patient and understanding. She sorted out my issues efficiently and was very kind.",
      "rating": 5,
      "date": "17th March 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Very poor",
      "text": "Very poor. Been with them for 16 years and still have to waste 1.5 hours refixing the mortgage and have to make an appointment, SO ANNOYING",
      "rating": 1,
      "date": "27th February 2024",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    },
    {
      "title": "Stuck in the past!",
      "text": "Tried to activate a Lasting Power of Attorney. \nChelsea BS want me to fill in a piece of paper, which they will send to me by post and I have to post back to them, or have me go into a branch, if there's one nearby, to fill it in.\nOther financial institutions have happily accepted, by email, a verification code I have obtained from the Office of the Public Guardian with whom the LPA is registered.\nLPAs and the OPG are set up to do things electronically so why does the Chelsea BS need bits of environmentally unfriendly paper, envelopes, stamps and slow polluting transport to ferry it back and forth to do the same job?",
      "rating": 1,
      "date": "24th October 2023",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    },
    {
      "title": "Customer service when trying to move…",
      "text": "Customer service when trying to move ISA cash was dire. It's lucky my call was important to them, or I might have given up waiting for them to answer.",
      "rating": 1,
      "date": "6th October 2023",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    },
    {
      "title": "Mortgage problem",
      "text": "Our fixed mortgage is coming to its end and they sent an letter for us to chose a replacement, the letter explained that the products offered were the only ones eligible. We chose a product and sent back the form, 3 weeks later they write back that the product we had chosen was not eligible and we should contact them to discuss. Their office hours are 9-5 Monday to Friday and 9-1 on Saturdays, typical working hours for normal people. We took time off work to telephone them, the AI asks for your account number which it then tells you it does not recognise & please try again, it still does not recognise the account number but sends you through to an operator. You wait for 5-6 minutes and then find your talking to someone who can only help you be making an appointment with a mortgage advisor who would call you back sometime next week, no date, not time, sometime! Tried to get contact details to make complaint but the operator had to find a form? I assume they had to physically go and fetch it from somewhere because we waited 10 minutes while they fetched it, they could not offer a name for a manager/director only offer to get a manager to call me back sometime. So 4 weeks later and still no answer to our mortgage problem. I cannot recommend this experience and would now strongly advise against mortgages with this company, customer service is a must and there is so little of it here, on / occasions while waiting to be connected the operator spoke asking if they could help, then promptly closed the call despite me speaking to them.",
      "rating": 1,
      "date": "28th July 2023",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    },
    {
      "title": "Poor service",
      "text": "I'm trying to contact their bereavement service in relation to an account my mother held.  The line just continuously gives an engaged tone -that seems like an anachronism for a big company.  So tried to go via their savings team, they at least answered the phone fairly quickly, and they said they would transfer me.  Held on for just over a minute and they bounced me back out of the system.  Very poor service.",
      "rating": 2,
      "date": "11th July 2023",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    },
    {
      "title": "I do not trust the YBS as given my…",
      "text": "I do not trust the YBS as given my personal experience is that they are Cruel, Heartless and Barbaric. They are not all inclusive and are not there for its members. \nThey are only in it for themselves hence SWITCH is the best way forward. I should be given a Gesture of Goodwill Payment for disgraceful Customer Service.\nThey cancelled my Membership and my Savings accounts which left me out of pocket. Hence I feel like a Victim of Hate Crime and am devastated and depressed as a result of their actions against me. Family and friends agree it's not right.",
      "rating": 1,
      "date": "22nd May 2023",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    },
    {
      "title": "Difficult to receive deposits",
      "text": "An auction escrow account attempted to transfer funds to my account but despite having the correct sort code and account number YBS rejected the payment and did not inform me of the rejection. On investigation, I’m now informed they also need a reference number to accept deposits but have never informed me of this. I have asked them to now accept the payment but am told the relevant department that can fix this are not answering the phone! Epic fail!",
      "rating": 1,
      "date": "18th May 2023",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    },
    {
      "title": "DEAFNESS TOTALLY IGNORED",
      "text": "Well that's it , yorkshire building society have acted true to form. No compensation for houurs wasted trying to get to MY money .Total disregard for my deafness. So I am giving up bothering. The retiring CEO -Miss Susan appears illiterate as I have not  received any response to my letter, merely one from one of their clerks-Mr. Dominic Whitehead. No breakdown of my final account. \nNo access to money which is legally mine. I have wasted hours trying to get money which is legally mine and all I get is a threatening letter from Mr. Whitehead. I cannot access my account and Mr. Witehead seems to have no consideration for the fact that I am deaf  ( I wear hearing aids in both ears and my brother and sister were both born deaf.I asked for compensation fpr the time I have wasted trying to get my money but nothing.",
      "rating": 1,
      "date": "16th May 2023",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    },
    {
      "title": "Definitely The Worst Building Society I Have Used",
      "text": "Im an online Customer back to open large ISA  and Rainy day a/c— YBS already have all of my details /information —so what could possibly go wrong in opening new accounts online??—surprise they now demand a facial video of myself-then want to sight passport @or driving licence -( through their agents clearing system)-you have 3 days to react otherwise??",
      "rating": 1,
      "date": "13th May 2023",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    },
    {
      "title": "Customer service is hopeless.",
      "text": "Customer service is hopeless.",
      "rating": 1,
      "date": "17th April 2023",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    },
    {
      "title": "Sent an email over a week ago received…",
      "text": "Sent an email over a week ago received a reply telling me to log in and send a secure message through the app, no such feature in the app.",
      "rating": 1,
      "date": "31st March 2023",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    },
    {
      "title": "Customer service",
      "text": "I was locked out of my online saving accounts using their app, I don't know why, I was using the passwords given.\nI've just spent the best part of 2 hours trying to get new credentials and am told I have failed and I have to ring back later by 3 seperate Cust service people. It feels like they are fobbing me off. I answer their question correctly.\nI needed to transfer funds quickly but it's too late now.\nTheir systems and customer service are abysmal.",
      "rating": 1,
      "date": "27th March 2023",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    },
    {
      "title": "REPORTING A DEATH",
      "text": "I am notifying financial institutions about the death of my brother and for the first three or four the experience was frankly appalling. Long winded, endless \"on holds\" long waiting times to actually get through to the \"bereavement team\" and operators that finished with \"Have a nice day\" automatically. Sensitivity zero.\nBy contrast - and hugely relieved - the experience with the Yorkshire Building Society was quick - I spoke to a human being (sorry I didn't get his name) almost immediately, he offered condolences, took basic account details, asked my name and the number etc, explained how Yorkshire BS dealt with my data and told me the team would be in touch within days. No more than 4 or 5 minutes total. I asked him to pass my appreciation of the process up the line and explained why. 5* rating indeed. Why can't all the others be the same.",
      "rating": 5,
      "date": "11th March 2023",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "‘Faster Payments’ righto",
      "text": "‘Faster Payments’ righto. It’s 2023 and it still takes them a whole day to transfer money into my account.\n\nAll my other accounts instantaneous. Get with the programme YBS….I’d rather have IBS",
      "rating": 3,
      "date": "1st March 2023",
      "product": "General",
      "sentiment": "neutral",
      "source": "trustpilot"
    },
    {
      "title": "WHY I CLOSED MY YORKSHIRE BUILDING SOCIETY ACCOUNT.",
      "text": "I opened an account with YBS but have reluctantly felt obliged to close the account.\nThis is because: 1.When trying to open their app I started continually getting an unwelcome message. This was:\n'Something went wrong, please try again'\nI had successfully gone into the app many times previously.\n\n2. I had tried at length to set up the app again under the guidance of one of their head office staff.\nThis was unsuccessful and after considerable time, stress & frustration, I requested to speak to a manager so that I could voice my dissatisfaction.\nThis was denied to me and is my second reason for closing my account.\nI told the agent that I would go onto social media regarding this.\nMy contention is that if managers are not willing to speak to the customers who are the basis of their business, then such companies are not worth dealing with.\n\n3.My third reason is that I have found a better deal with Zopa. \nThey give a higher interest rate and most importantly   interest is paid monthly. \nOnline operation is also easy and straightforward.\nMy dealings with YBS were previously satisfactory.",
      "rating": 1,
      "date": "14th February 2023",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    },
    {
      "title": "Appalling customer service -went to…",
      "text": "Appalling customer service -went to branch presented ID and power of attorney documents ie letters from OPG , after month YBS decided wanted sight of the original POA -obtained access code for them to check online which lady in complaints never heard of, now YBS insist utility bill, which was fine on the day now out of time and need another -stupid vendetta because i complained , whole business rammed with thick jobsworths sole aim block access to money not theirs will go elsewhere ASAP where staff do not treat customers with comntempt and realise it is not their money",
      "rating": 1,
      "date": "2nd February 2023",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    },
    {
      "title": "Good service but some issues",
      "text": "Despite many negative reviews of YBS, which made me a bit jittery about opening the Account, the Account Opening process was quite quick and smooth and took very little time (including credit checks) and was all done online.\nI used their chat service to ask about their withdrawal facilities. It was promptly answered.\nThen I test deposited £1 to see if that reached the Account and had to use their phone line to check and after going through all the security questions, they confirmed it's arrival within a few hours (Faster Payments). And I received the login details today (within 3 days). So, pretty good so afr. Yet to try a withdrawal, but I've no reasons to believe it'd be problematic.\n\nEdit : One can't withdraw for the first 14 days of Deposit, but it actually is the 16th day when you can actually withdraw.\nAlso, it is not a Faster Payment for Withdrawals - the amount arrives by the end of next day. Hence making it 3 *.",
      "rating": 3,
      "date": "2nd February 2023",
      "product": "General",
      "sentiment": "neutral",
      "source": "trustpilot"
    },
    {
      "title": "I have had my offset Chelsea mortgage…",
      "text": "I have had my offset Chelsea mortgage for 5 years. Last year when I moved house The Chelsea persuaded me to transport my mortgage to the new property. Firstly they took 2 mortgage payments 2 weeks after the first mortgage was closed. Then wrote to me telling me I was in arrears. They have completely failed to link my savings account to my offset mortgage. Failed to return my calls 6 times. Now have written telling me that my mortgage offer is to expire on a mortgage I took out 3months ago. Still not resolved.",
      "rating": 1,
      "date": "26th January 2023",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    },
    {
      "title": "Absolute nightmare dealing with this…",
      "text": "Absolute nightmare dealing with this Building Society from abroad.\nExpensive phone costs .\nIntractable rules and unbending staff.\nAll in all very inflexible.\nI will never ever use them again.\nVery poor service",
      "rating": 1,
      "date": "23rd January 2023",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    },
    {
      "title": "Branch staff very helpful in Cheltenham",
      "text": "Branch staff very helpful in Cheltenham\nTook a while to transfer an ISA from another bank.\ngot there in the end but took a few weeks",
      "rating": 4,
      "date": "8th January 2023",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "I am writing this while still trying to derestrict my ISA account",
      "text": "I am writing this while still trying to sort out a ISA transfer in to YBS. I started the process of opening the new online account back at the start of the month, then took in ID (passport, driving licence and utility bill) to my local branch a few days later to complete the process. It is now over 3 weeks since this happened and the ISA transfer has not occurred, for reasons I am told are due to the postal strike (really, in this day and age are you guys still sending details across to each other by post!!). The most frustrating thing though is that the account remains restricted, preventing me seeing it online, putting money into it, or establishing that the transfer of previous tax years' savings has occurred. This despite 6 separate calls in the last 4 days to YBS (both central office and local branch) to try and resolve the problem. Individual staff have tried to help (hence they don't get 1 star) but YBS as an organisation is clearly dysfunctional. The problem so I am lead to believe is that there is a flag on my ID that they can't unblock. For the first 3 days I was being told the branch needed to input my ID into the system and all would be OK the next day and each day it wasn't. When I spoke to the branch rather than central office on day 3 they made it clear that they had done this 20 days ago when I went into them in person. They agreed to try again that same day to re-enter my ID but now we are coming to the end of day 4 of this epic phoneathon and I continue to have a restricted account.",
      "rating": 2,
      "date": "22nd December 2022",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    },
    {
      "title": "in the branches i have found the staff…",
      "text": "in the branches i have found the staff helpful . At customer services  it is another story. uninterested and very unhelpful. I would not recommend. complete lack of accountability.",
      "rating": 1,
      "date": "22nd December 2022",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    },
    {
      "title": "Slowwwwww",
      "text": "Welcome to the analogue world (sadly with none of the good bits). Slow to act, serve and update each time. Today's wasted journey was updating an address in person, which they said they hadn't received the letter three weeks ago. Turns out they had but only updated the system two days ago. Can't really blame Royal Mail's strikes - they've had more than enough time. Just another sloth-like maneuver from the UK's most backward financial facility.",
      "rating": 1,
      "date": "21st December 2022",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    },
    {
      "title": "Excellent Service",
      "text": "I had to set up an account with the Yorkshire Building Society in Inverness .It was a good experience .The staff were knowledgeable , helpful ,efficient and pleasant.I would highly recommend them.",
      "rating": 5,
      "date": "8th December 2022",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "No Cooling Off Period At All",
      "text": "My mortgage came up for renewal and I looked at the options available to me. I went on line and the options in the letter had been replaced by higher options. I was going to get a five year fixed but opted for two because of this. I had been away so didn’t receive my letter until a couple of weeks before my current mortgage had run out. I later thought that I would have an option of a 14 day cooling off period, only to be told I couldn’t and I was never informed of this. I’ve been with them for 14 years always paid and never missed. I will be looking to change after this two years whatever happens as I feel let down and not valued at all. Congratulations Chelsea another lost customer in 2 years time and I’m not the only one to leave by the looks of their service. My new product doesn’t start for three weeks but I can’t get out otherwise I would.",
      "rating": 1,
      "date": "14th November 2022",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    },
    {
      "title": "YBS dangerously chaotic, don't wast your time.",
      "text": "My wife tried to open a savings account. They didn't recognise her online, despite having lived at the same place for 23 years and all others did recognise her so they wanted a copy of her passport by post. This she sent, after 10 days nothing. She then sent them an email to chase and they responded that they did have her proof of identity. After another week nothing. Then an email saying that they had never received any proof of identity and would she send a copy of her passport! This she did, together with a copy of their email stating that they had already received it. After a few days finally a letter with a 'customer number' to log on. She tried to log on with the details they'd sent but the website rejected the log-on 'Not the details they hold'. Absolutely chaotic. Not only would I not recommend them but it's dangerous to deal with any financial institution which is so clearly totally out of control.",
      "rating": 1,
      "date": "13th November 2022",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    },
    {
      "title": "Opening an online account.",
      "text": "Opened an online within minutes, which was confirmed via post in 3 days. All very simple and efficient. Let's see if it is still 5* when I come to use the account.",
      "rating": 5,
      "date": "3rd November 2022",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Really poor treatment of loyal customers",
      "text": "So much for being a mutual!  While other institutions have raised rates by a meaningful amount Chelsea have done so by a mere 0.1% and not at all for customers with £20k invested.  Really poor show.",
      "rating": 1,
      "date": "12th September 2022",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    },
    {
      "title": "Absolute rubbish.",
      "text": "I opened an account on behalf of an elderly friend. At the end I was asked for ID which was sent two days later. After another week we got a no-reply email reminding us to send it. I went on-line to find an email address to send to and after another week got log in details for the account. They did not work, so I emailed again and got no help. By now the account was locked so we had to phone. No one answered of course and their system does not recognise the details they sent.\nWe have now given up and have gone elsewhere.\nShould be no stars.",
      "rating": 1,
      "date": "2nd August 2022",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    },
    {
      "title": "Question about withdrawal",
      "text": "Question about withdrawal \nHow do I withdraw from my account?\nThere was an error whilst fetching the answer. It was error 157 (NO RESULTS)",
      "rating": 1,
      "date": "27th July 2022",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    },
    {
      "title": "Note before you invest",
      "text": "This BS advertises a higher rate for existing customers - what they don't tell you is that the customer must be with them for at least a year!",
      "rating": 1,
      "date": "15th July 2022",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    },
    {
      "title": "Shame I can’t give a negative star…",
      "text": "Shame I can’t give a negative star count, they have the attitude that if they stick their heads in the sand problems go away. I’m still waiting for a response to a full subject access request, so far I have had about 15%. I still have 3 accounts with them after they bought  my building society. It’s a shame they won’t let me have my funds, they are hoping that if I leave it they can pocket the money. The complaints proses treats disabled customer as if we are stupid, news flash were not!\nContact me before this goes to court",
      "rating": 1,
      "date": "12th July 2022",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    },
    {
      "title": "Awful Treatment and Still Owed Money",
      "text": "My mother set up a new ISA with this company and organised for her lifesavings to be moved across. Her old bank closed the old isa and confirmed the funds had been sent. She received notification from YSB that they had received her funds (even stating the exact amount correctly) and her account would be credited. Well 1 month later and 9 phone calls to their customer service department and her account has still not been credited. I cannot express the anxiety and upset this is causing! Customer service keep saying they will investigate and a manager will call back, which so far no one has followed up on. It is absolutely outrageous and appears their staff do not care to resolve this issue. We are at our wits end and there is still no end in sight and no one willing to help her.",
      "rating": 1,
      "date": "28th April 2022",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    },
    {
      "title": "Absolutely useless",
      "text": "Online system often doesn’t work and has the audacity to say “you have lost your way through the online system” despite it being their ever failing technology \n\nLast time I visited my branch could not get my money out as their systems were down. Ordered me to go to a branch 6 miles away when on my lunch break and don’t drive \n\nCan’t use my card to withdraw money now - Staff in branch advised it’s because “we are trying to get rid of accounts like yours”\n\nRude, ineffective and frankly not fit for purpose \n\nGo elsewhere",
      "rating": 1,
      "date": "26th April 2022",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    },
    {
      "title": "Failed to transfer my cash isa out",
      "text": "Again, they have refused to transfer my cash isa money to another provider - pathetic - whose money is it?",
      "rating": 1,
      "date": "12th April 2022",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    },
    {
      "title": "1 star as is not available",
      "text": "1 star as 0 is not available.  Given conflicting information.  I wanted to move my ISA to a better rate with them.  So I called them and asked how to do it.  Go online and the money move is part of the application process.  So I did and it is NOT.  So called them and told the first information was not correct I have to download a form, fill it in and send it thro the post!  Wow is this 1922 or 2022?  So filled the form in and sent it off.  A week later still waiting for the funds to be moved to the new ISA.  Then saw a new account giving a better rate.  Called them again to ask what was happening to be told - Yes we have your form but not actioned it yet.  Then I asked if I could open the new account to be told they would sent me a form ha ha ha.  Are they in the dark ages.  I will move my 84k somewhere else.",
      "rating": 1,
      "date": "28th March 2022",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    },
    {
      "title": "A minor gripe but if you're going to…",
      "text": "A minor gripe but if you're going to invite customers to email you via your website, don't then email them back telling them that email isn't secure (when you've not asked to be sent anything worthy of stealing) and instruct them to call on that number you never answer.",
      "rating": 3,
      "date": "15th February 2022",
      "product": "General",
      "sentiment": "neutral",
      "source": "trustpilot"
    },
    {
      "title": "The Yorkshire Building Society (the main one) are easy to use online",
      "text": "The Yorkshire Building Society has run my ISA for many years. When I needed to cash it in the money they were very helpful on the phone and in the end  I did it all online just before Christmas, expecting a long delay  - but instead the funds were credited to me the next day! I can therefore recommend them even if their branches are not near you.",
      "rating": 5,
      "date": "22nd December 2021",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Yorkshire Building Society -- Simplifying ?",
      "text": "Yorkshire Building Society ---\"We are simplifying our savings\" --- \"We're withdrawing your ability to use cash machines and any LINK cards. ----------------------------- on 15th DEC2021.-------   Merry Xmas.!",
      "rating": 1,
      "date": "26th November 2021",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    },
    {
      "title": "Pretty awful",
      "text": "I took out a commercial mortgage with YBS over 3 years ago. It was a very mediocre service throughout. Minimal contact and always difficult to get in touch. Approaching the end of the mortgage period, I told them I was leaving. I asked for mortgage statement and confirmation on the process for notifying customers after mortgage redemption. Eventually received a generic response, demanding to know who I was moving to. At no point did they answer any of my requests. When the move finally completed, I still heard nothing from YBS...I had to chase YBS to get confirmation that the mortgage had ended and no further payments would be taken. That triggered several other problems including potentially open ended enduring liability clauses. To date I've not really had much support. Throughout YBS have been unresponsive and unhelpful. I've received better services from other financial service providers. This is one to avoid at least for commercial mortgages. Perhaps because I'm not a customer I don't get the focus but to be honest it wasn't that much worse than when I was a customer.",
      "rating": 1,
      "date": "25th November 2021",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    },
    {
      "title": "Not on-line capable",
      "text": "Impossible to open an account without going to a branch, due to badly written guidance for new customers and dated internet technology.",
      "rating": 1,
      "date": "15th November 2021",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    },
    {
      "title": "Abysmal",
      "text": "Abysmal. Cannot get through on the 0345 number and no other contact possible. Seems to cost me 73p per minute for some reason and no 0800 number available. Already racked up over £10 today on my mobile over four attempts for no result. I can't afford for YBS to continually profit at my expense. If they had any decency they would provide an 0800 or a online chat page as other business seem able to do....\nIt goes on.. the phone service hours are now 9am-5pm and they have shut my local branch how the hell do I get to them !",
      "rating": 1,
      "date": "26th October 2021",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    },
    {
      "title": "Yorkshire Building Society is a racket",
      "text": "Yorkshire Building Society is a racket. IT system doe snot work. Customer service is non-existent. IT functionality is terrible. Never go anywhere near it and get your money out before it is locked up for 8 weeks which is their expected response time.",
      "rating": 1,
      "date": "20th September 2021",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    },
    {
      "title": "No fuss y b s.good rates atm",
      "text": "No fuss. Online app works fine, and have never waited too long if i have rang them...no complaints..transfered my isa from santander, gained over £ 1000 interest over 2yr...BUT extremly slow service in the selby branch,one woman was unsure how to even write me a transfer cheque out",
      "rating": 4,
      "date": "7th August 2021",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "bond matured and charged to get funds",
      "text": "My fixed term bond matured. They put the funds into a new low interest account without asking and now want to claw back 45 days interest when I close the account. Disgraceful.",
      "rating": 1,
      "date": "27th June 2021",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    },
    {
      "title": "All dine online within minutes and…",
      "text": "All dine online within minutes and confirmed via post within 3 working  days. Good app. Very simple and efficient.",
      "rating": 5,
      "date": "9th April 2021",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Utter nonsense",
      "text": "Utter nonsense. Just try getting hold of someone to talk to. Or even, if you happen to use the internet, try getting past their security measures to log into your own account. \n\nWant to change your password: Call us (can't get through) Want to reset your account: Call us (can't get through). \n\nI'm not quite sure how much money they make out of keeping people on hold on their phone lines but I imagine it must be one of their bigger sources of income.",
      "rating": 1,
      "date": "12th January 2021",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    },
    {
      "title": "If only online worked!",
      "text": "I wanted to make an enquiry about a maturing ISA account so used the online Chat facility but was advised it was not possible to deal with my enquiry using this facility and to send an email to a specified address. This I did but in the absence of any response after a few days I logged on to my account and used the secure message facility, Again I was advised it was not possible to deal with my enquiry using this method and to phone a specified number. This I did and after listening to recommendations to use the online facility, and other warnings, I was eventually able to press the option number recommended but was informed roughly every 20 seconds that \"our lines are still busy and your call will be answered shortly\".  After 20 minutes the call dropped so I had to go through the process again. After another 20 minutes waiting I gave up.\n\nI cannot see the point of encouraging customers to use the online or app facility if it is not possible to achieve the object of your enquiry.",
      "rating": 1,
      "date": "6th January 2021",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    },
    {
      "title": "Terribly communications and outdated…",
      "text": "Terribly communications and outdated systems of setting up an online savings account.\nFrustrating",
      "rating": 1,
      "date": "21st November 2020",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    },
    {
      "title": "Poor Staff and Service",
      "text": "Really poor service from Karl in your Taunton branch, spoke like a robot and I felt like he was the character from Little Britain....computer says no. He clearly needs customer service training and shouldn’t be in the job if he isn’t willing to adapt his approach. Branch has gone down hill in the last 12-18 months. Lots of good, friendly and knowledgeable staff have left. I won’t ever return  to this Building Society and will use Skipton which is just down the road. Would score it zero stars if I could!\nRead all the other reviews as they are accurate.",
      "rating": 1,
      "date": "4th November 2020",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    },
    {
      "title": "I Gave In",
      "text": "So as not to bore you with the details I will cut it short. I tried to open a savings account recently but in the end I had to admit defeat and I surrendered to common sense and gave up.",
      "rating": 1,
      "date": "3rd November 2020",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    },
    {
      "title": "Idiot employed for customer Telephone assistance",
      "text": "Ok I tried online to open a new eISA it would not let me transfer money from my existing Yorkshire Building Society Annual Access Account.\n\nSo I phone customer services as directed, after half an hour wait I finally get through to a \"Pushy Loves the sound of her own voice type\" who just talked at me giving instructions and did not listen. I followed these instructions and guess what. I still cannot open a new eISA using my Annual Access Account. If only she had listened as customer service staff should.\n\nAvoid this awful, useless Building Society until they can employ properly trained and knowledgeable staff.",
      "rating": 1,
      "date": "20th October 2020",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    },
    {
      "title": "Great service from Amanda today",
      "text": "Great service from Amanda today. Such a welcome change from Lloyd’s who I have been dealing with on another matter. Amanda was friendly, efficient and professional and answered all my queries. Thank you!",
      "rating": 5,
      "date": "17th October 2020",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Avoid like the plague.. not worth wasting time where your custom is not valued",
      "text": "I would give them 0 stars if I could.\n\nJust read several similar reviews. Seems it will be best to stay away from Yorkshire Building Society\n\nMy wife is trying to open an online Internet Saver account as they promise good interest rate as you increase your savings, but she has fallen at the first hurdle.\n\nThey want paper ID posted to them !  What madness in these days of online banking !\n\nYou cannot get access to the online account until they send you a Customer Number which you can't get until they activate the account which needs ID posted to them - chicken & egg !\n\nAnyway played their game and posted ID documents to them on 5/10/2020; get an email today 17/10/2020 that they need ID documents...  mostly likely because they haven't got the staff receiving post during covid... wouldn't it have been better implementing an online account that allows you to access it straight away and send document copies by secure message. Other banks can do this.\n\nNow we are stuck in an infinite loop as nobody is picking up their phone.. sat on the phone 3 times for nearly 60 minutes each and gave up eventually... This morning the phone just cuts off immediately you enter all your details... so we can't speak to a customer service rep and posting documents to a black hole is not going to help\n\nTime to move on... better saving at another organisation that values your custom",
      "rating": 1,
      "date": "17th October 2020",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    },
    {
      "title": "Karen's experiences highlights same…",
      "text": "Karen's experiences highlights same points I hold...  Google and tweet this\n\nBETH OF SUTTON IS THE FLAGSHIP POLTERGEIST.. DAMIEN OMEN AND CARRIE ALL ROLLED TO ONE\n\n\n\nNICK TURK... SO TRUE BELOW WOW.. THEY REALLY ARE THE DEVILS BANK HIWAY TO HELL LOOK AT MR TURKS EXPERIENCE AS FOR. MR. 2.MONTHS DURING LOCKDOWN THEY FROXE MY FUNDS..... FOR 90 DAYS FOR. NO JUST REASON... THEN FSO SIDED WITH THEM. BANINGBHERE GOING TO DOGS \n\nWHO. AM I.. JUST A CITI GLOBAL BANKER",
      "rating": 1,
      "date": "23rd August 2020",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    },
    {
      "title": "Very poor unprofessional customer…",
      "text": "Very poor unprofessional customer Service at the ALFORD OFFICE of Yorkshire Building Society.\nBy prior arrangement I visited this office on at 9.40am on Thursday 17/06/20 to enable my elderly and infirm father in law to update his many accounts as he has difficulty standing for long and uses a walking frame.\nOn arrival we were instructed to wait outside on the pavement next to the busy road as there was a lady in the office sat near the window opposite the counter area. We were still waiting 20 minutes later when the office door opened slightly and I could hear the staff member having a good old chinwag with the lady which was nothing at all to do with the business she should have been engaged in doing. I peered through the window on several occasions hoping the staff member Chloe might be prompted knowing we were still waiting but I was ignored except for the lady sat at the window!\nBy now my father in law could not wait any longer and I decided it was best to walk away and go to the Boston branch for professional service. Just as we were leaving another lady stood behind us in the queue and saw the lady STILL sat in the window and made us aware that we were wasting our time as the lady was always there chatting. We went to Boston 23 miles away and had great professional service immediately. I have complained via their resolution centre but hold little hope of it being dealt with correctly. They will I assume blame Covid 19 restrictions????",
      "rating": 1,
      "date": "18th June 2020",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    },
    {
      "title": "Really awful",
      "text": "Really awful.  Tried to open an ISA with them to transfer my old one.  Given the pandemic I checked with them that this can be done and managed w=entirely online.  I was told absolutely it can.  As soon as the account opened am being told I need to go into a branch with ID (they will not accept an email) in order to transfer in, administer online, in fact do anything at all.  Customer services were terrible, hold time massive and generally crap service all round.  Do not believe their lies, it is not an online account - you need to do many things by post or in branch.  No allowances for the pandemic - mind boggling that they have actively chosen a process that requires face-to-face meetings, for a new product brought out during COVID-19 pandemic.  Clearly very little regard for customers.",
      "rating": 1,
      "date": "18th May 2020",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    },
    {
      "title": "Should be nil stars.",
      "text": "Should be nil stars.\nThe most complicated web site to work with.\nAVOID if you can you will be twisted about.\nI think they do it as a laugh.",
      "rating": 1,
      "date": "11th May 2020",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    },
    {
      "title": "Scarborough branch of Yorkshire Building Society",
      "text": "I visited the Scarborough branch of Yorkshire Building Society today and I would like to comment on the staff member Jenny who very helpful to me. I am disabled and did not realise that I had to make an appointment to carry out the business I needed to do. Dispite this she still went above and beyond helping me.She was very efficient and completed my business in privacy. I was very impressed with her efficiency and helpfulness and would recommend the YBS to anyone.",
      "rating": 5,
      "date": "1st November 2019",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Terrible experience throughout",
      "text": "Terrible experience throughout - even when closing the account.  Passed from one to the other indefinitely and waiting times on the phone are really to be believed!",
      "rating": 1,
      "date": "7th October 2019",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    },
    {
      "title": "Awful experience at the Sutton branch…",
      "text": "Awful experience at the Sutton branch with a lady called Charlotte.I came in to open an account but she made me feel like I was a nuisance and that the branch was closing soon, I wouldn't of minded that but it was the manner in which it was handled - she was rude and belittling, and barely let me get a word in edge ways. I left feeling frustrated and deflated. The worst thing was she seemed completely oblivious. Not a way to treat Customers - I will venture to another building society or another branch next time that's for sure!!",
      "rating": 1,
      "date": "27th June 2019",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    },
    {
      "title": "Simply the best",
      "text": "I cannot begin to say how magnificent this company's been to us when we recently needed to transfer our mortgage from one property to another. Our circumstances had changed but they were just wonderful helping us sort everything out. Thank you to everyone involved you were marvellous.",
      "rating": 5,
      "date": "23rd January 2019",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "A small building society with a narrow minded approach.",
      "text": "Applied for a remortgage because they had the better rates as published in papers. Extremely difficult and tedious lengthy process. For some reason staff make every effort to shun customers. Very arrogant and bullish attitude.\nIn summary a small building society with a narrow minded approach.\nRef: 11859712",
      "rating": 1,
      "date": "3rd December 2017",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    }
  ],
  "trustpilotUrl": "https://uk.trustpilot.com/review/thechelsea.co.uk"
}