{
  "society": "Chorley Building Society",
  "slug": "Chorley-building-society",
  "smpUrl": "https://smartmoneypeople.com/Chorley-building-society-reviews/products",
  "totalReviewsOnSMP": 1818,
  "avgRating": 4.9,
  "scrapedAt": "2026-02-06T16:23:42.110807+00:00",
  "reviews": [
    {
      "title": "Five Star Service.",
      "text": "I am delighted with Chorley’s service. Mark Rothwell is an outstanding mortgage advisor, he took the time to make sure I understood the options available to me and really made me feel that Chorley really go above and beyond to look after their customer. Mark and Chorley genuinely care about the customer. I can’t recommend Chorley enough, from start to finish they make the whole process pleasant and straightforward. Five star service.",
      "rating": 5,
      "date": "16th January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Personalise service with excellent communication",
      "text": "My application was a bit ore complicated than the standard but my Mortgage Advisor (Devon Park) demonstrated tenacity, perseverance and a real can do attitude. The service I received was personal and very customer focused with a direct line and direct email address to Devon. Communication has been excellent and all with the same advisor so no having to repeat the circumstances. I would highly recommend the Chorley Building Society and specifically Devon Park.",
      "rating": 5,
      "date": "14th January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "no trouble",
      "text": "We spoke to Devon, and unfortunately, I got the time wrong, but it was no trouble to her, and she rang back when we got home",
      "rating": 5,
      "date": "12th January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great support when needed...",
      "text": "Currently going through some financial struggles and had no disposable income available to pay mortgage. Chatted to Mark who was great at understanding, offered multiple solutions and made a scary process much more bearable, so I personally appreciate that and the help offered.",
      "rating": 5,
      "date": "8th January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Mortgage Term: Rod/Suffolk.",
      "text": "My experience with Mortgage Advisor Candice Fields who was very polite, professional and knowledgeable in explaining the various options and details for the Term Extension of the Mortgage through every step of the way. Candice would always keep me udated throughout the application process, either by email or phone. I would most certainly highly recommend Candice and the Chorley Admin team for their excellent service. Kind regards, Rod.",
      "rating": 5,
      "date": "8th December 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent self build lender",
      "text": "They were excellent through our self build. Lending to us when others would not. Their team is always so friendly and accessible to speak with. Very happy with their products and service.",
      "rating": 5,
      "date": "12th November 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Its great to be able to have a direct conversation w...",
      "text": "Its great to be able to have a direct conversation with a highly knowledgably, professional, mortgage expert. Highly recommend Mark Rothwell.",
      "rating": 5,
      "date": "23rd October 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Helpful, informative and very professional.",
      "text": "Helpful, informative and very professional.",
      "rating": 5,
      "date": "21st October 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Devon Park mortgage broker at Chorley building society.",
      "text": "Devon Park was our mortgage broker contact at Chorley building society. She made it a seamless and pleasurable service from start to finish. Friendly knowledgeable and timely. Would recommend highly.",
      "rating": 5,
      "date": "8th October 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Mr Mark Rothwell",
      "text": "Our mortgage advisor Mr Mark Rothwell was extremely helpful and very professional regarding every aspect of our mortgage. He was extremely polite and informative, and made the whole process less stressful. All future business, we would welcome Mr. Mark Rothwell to deal with it for us. Excellant service.",
      "rating": 4,
      "date": "6th October 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "As always, excellent personal service.",
      "text": "As always, excellent personal service. Dealing with Mutual Building Society’s is the way way forward, where you are very much treated as a person and not a number. A big thanks to Candice for all her assistance throughout",
      "rating": 5,
      "date": "3rd October 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Five Years of Faultless Service",
      "text": "I've been with Chorley Building Society for 5 years now with my mortgage and I honestly can’t fault them. Every time my deal has come up for renewal, they’ve been right there to support me and make the process smooth and stress-free. What really stands out is how easy they are to contact and talk to, something that’s becoming increasingly rare these days. Every interaction I’ve had has been friendly, helpful and professional. I’ve never felt silly asking questions and they’ve always taken the time to explain things clearly and without any pressure. At each renewal, they’ve gone the extra mile to scout out new deals or products that offer better benefits tailored to my situation. It’s that kind of proactive, personal service that makes such a difference. Truly faultless. I would absolutely use them again and wouldn’t hesitate to recommend Chorley Building Society to anyone looking for honest, friendly and reliable mortgage support.",
      "rating": 5,
      "date": "26th September 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Amazing Service",
      "text": "As always amazing customer service, thank you to Candice and Devon who have provided exceptional support and service. We have used CBS for a number of years and the service has always been excellent.",
      "rating": 5,
      "date": "23rd September 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "mortgage review",
      "text": "Mark Rothwell wasexcellent from start to finish , dealt with the whole thing exactly how i wanted",
      "rating": 5,
      "date": "18th September 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Good value and quick replies.",
      "text": "Good value and always replied quickly to queries.",
      "rating": 5,
      "date": "6th September 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Outstanding service and flexible products.",
      "text": "Outstanding service and flexible products.",
      "rating": 5,
      "date": "15th August 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Mortgage enquiry efficiently handled",
      "text": "Phone enquiry handled extremely efficiently throughout. Great to speak to knowledgeable people who are keen to assist. Mark dealt with everything quickly and efficiently and provided everything we needed to come to an informed decision. Thanks Mark",
      "rating": 5,
      "date": "8th August 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "My partner and I were under an extremely tight deadl...",
      "text": "My partner and I were under an extremely tight deadline to complete within 8 weeks. Chorley building society and specifically the admin team were nothing short of incredible. I would like to express my gratitude to the wider team but specifically Hettie who kept me informed each step of the way and did not hesitate to answer all of my queries. Overall, the service, responses and attention to detail was amazing. Thank you all!",
      "rating": 5,
      "date": "25th July 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Intermediary Channel Assistance",
      "text": "Mark Rothwell provided an excellent service :)",
      "rating": 5,
      "date": "24th July 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Always super helpful and very friendly.",
      "text": "Always super helpful and very friendly. Mark Rothwell especially has been a huge help and always very friendly & prompt to reply to any emails. Great team at Chorley.",
      "rating": 5,
      "date": "23rd July 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "my experience of Chorley Building Society",
      "text": "each time I have needed to speak to someone they have always been helpful and understanding.It is good to speak to people who know your situation and can give advice on financial products products available.",
      "rating": 5,
      "date": "22nd July 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "New mortgage products advice",
      "text": "I spoke to Mark Rothwell about new mortgage products, now my existing deal is due to end in October. Mark was easy to talk to, very helpful in helping me understand the options and in reaching a conclusion that was best for me. Thanks Mark",
      "rating": 5,
      "date": "1st July 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "You are more than just a number !",
      "text": "Whenever we call we are helped very promptly. Great customer service. Mark in the mortgage team is exceptionally helpful with a friendly caring manner. Everyone is very pleasant to deal with. They make you feel a very valued customer. Highly recommended.",
      "rating": 5,
      "date": "20th June 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great product and customer experience",
      "text": "whenever I phone I always get a quick response. have spoken to Mark on many occasions who is very informative and helpful",
      "rating": 5,
      "date": "30th May 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Superb customer service from Chorley Building Society",
      "text": "We are transferring our mortgage to a different lender, who has missed all their deadlines. This has resulted in me having to call the Mortgage team at Chorley several times over the last few days. On every occasion the phone has been answered quickly and the customer service has been superb. The agents have always been polite, sympathetic and extremely helpful. The last call I had was with Lucy Lowe who provided outstanding customer service and was able to address all my queries without the need to be transferred to other teams. Great experience.",
      "rating": 5,
      "date": "29th May 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent customer service",
      "text": "I had to phone up for information about my son’s mortgage. I spoke to a lady called Louise. She was marvellous so helpful and gave me all the information I needed. Nothing was too much trouble wonderful customer service",
      "rating": 5,
      "date": "14th May 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "We have been with chorley for years and would never...",
      "text": "We have been with chorley for years and would never contemplate changing. Always the best service.",
      "rating": 5,
      "date": "6th May 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "I recently mortgage advice from Louise",
      "text": "I recently received mortgage advice from Louise at Chorley Building Society and couldn't be happier with the experience. Louise was exceptionally professional, taking the time to explain everything clearly and thoroughly. She was approachable, knowledgeable, and genuinely helpful, making what could have been a stressful process feel smooth and straightforward. Her friendly and supportive manner gave me great confidence in making my decisions. I would highly recommend her services to anyone seeking expert mortgage advice.",
      "rating": 5,
      "date": "26th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "5 star Candice",
      "text": "Candice is brilliant, credit to your business. very personable and friendly. also very knowledgeable.",
      "rating": 5,
      "date": "22nd April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Good customer service",
      "text": "Good customer service, well structure informative and details, well organised session call. good and honest people.",
      "rating": 4,
      "date": "17th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Friendly, professional staff who care!",
      "text": "Chorley Building Society staff are friendly, professional and helpful in their approach. I called them today about fixing a new rate and they were extremely efficient in sorting everything out for me. I felt they went the extra mile in helping me to make an informed choice which has ultimately saved me money. Special shout out to Mark but have to say all the staff here seem 'human' and we are so glad we chose them for our mortgage.",
      "rating": 5,
      "date": "9th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Good value, easy to deal with, great communication.",
      "text": "Easy to communicate with even when there was a little error with the payment calculations. Very open. Good value. Would definitely use Chorley again.",
      "rating": 5,
      "date": "23rd March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Real people - Real service",
      "text": "Always helpful, great personal customer service - No-one better at this!",
      "rating": 5,
      "date": "9th March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "I have had the best renewals with Chorley.",
      "text": "I have had the best renewals with Chorley. Makes mortgages seems simple. However - wish they did longer term but fab customer service.",
      "rating": 5,
      "date": "9th March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Louise was excellent",
      "text": "Louise was extremely friendly, professional and informative and a pleasure to speak with.",
      "rating": 5,
      "date": "8th March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "We have been with Chorley Building society for the l...",
      "text": "We have been with Chorley Building society for the last 7 years excellent with our mortgage",
      "rating": 5,
      "date": "7th March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "We applied for a mortgage with Chorley BS and they c...",
      "text": "We applied for a mortgage with Chorley BS and they couldn't have been more helpful or accommodating particularly Candice Fields who couldn't have been more helpful",
      "rating": 5,
      "date": "6th March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Chorley Building Society - Exceptional",
      "text": "Our mortgage advisor at Chorley (Candice) was exceptionally supportive and we couldn’t recommend her or CBS highly enough. Candice went above and beyond and helped us along our house purchasing journey.",
      "rating": 5,
      "date": "6th March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Product switch - excellent customer service",
      "text": "I have just had a detailed conversation about product switch as we come to the end of our discount rate term. The gentleman I spoke to listened, provided information in a clear manner, and helped me to be able to make a decision about next steps. It was a pleasure when it could have been a chore.",
      "rating": 5,
      "date": "6th March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Come across as a traditional building society",
      "text": "Come across as a traditional building society with family values, service at its core. Cannot fault them",
      "rating": 5,
      "date": "6th March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Amazing experience",
      "text": "Have always had an amazing experience with Chorley Building Society. Customer Service has always been brilliant and everything is always explained in detail.",
      "rating": 5,
      "date": "5th March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Mortgage Renewal",
      "text": "Chorley's advisors are very helpful and made it easy to renew my mortgage with the best available rate.",
      "rating": 5,
      "date": "5th March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Friendly and effective staff.",
      "text": "Friendly and effective staff. Always helpful and keen to assist",
      "rating": 5,
      "date": "5th March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "We recently came to the end of our fixed term mortga...",
      "text": "We recently came to the end of our fixed term mortgage and needed to renew. We did this over the phone and it was a great service. We got a very competitive interest rate for 2 years fixed.",
      "rating": 5,
      "date": "5th March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very approachable and had excellent advice.",
      "text": "Very approachable and had excellent advice.",
      "rating": 5,
      "date": "5th March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent customer service by knowledgeable staff",
      "text": "Excellent customer service by knowledgeable staff",
      "rating": 5,
      "date": "5th March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Valued us as a customer.",
      "text": "Gave us a mortgage and were interested in our business where others weren't.",
      "rating": 5,
      "date": "5th March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "User friendly",
      "text": "Ease of application when joining, and process well assisted",
      "rating": 5,
      "date": "5th March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Local Branch",
      "text": "So handy with a very local branch in the town (Leyland).",
      "rating": 5,
      "date": "5th March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very happy",
      "text": "We have been with Chorley Buildings Society for over 7 years since we bought our first home and they have supported us through a number of moves and mortgages since then. They have always been on hand for any help and advice and have been very warm and friendly when dealing with people",
      "rating": 5,
      "date": "5th March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Customer service at it's best",
      "text": "Not only were Chorley brilliant through a difficult time and did everything to help and provide the best options, my solicitors also rang to say what lovely people and so helpful there were",
      "rating": 5,
      "date": "5th March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent Retirement Mortgage Provider",
      "text": "Chorley BS provided a mortgage for us when there were very few specialist mortgages of this type available. They provide a valuable service for people over 65 years old.",
      "rating": 5,
      "date": "5th March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Chorley building society - a personal touch",
      "text": "Chorley building society are extremely helpful and provide wonderful customer service. This is a building society that truly cares about their customers. They have always treated us as people and not just a number. The personal touch puts them above all other providers.",
      "rating": 5,
      "date": "5th March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent mortgage provider",
      "text": "Chorley provided an excellent mortgage for us in a timely manner",
      "rating": 5,
      "date": "5th March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Extremely knowledgeable and professional staff who a...",
      "text": "Extremely knowledgeable and professional staff who are friendly and patient. Our experience with the Chorley has been excellent for the last 9 years.",
      "rating": 5,
      "date": "5th March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "CBS are extremely helpful and deliver excellent serv...",
      "text": "CBS are extremely helpful and deliver excellent service. No problems at all",
      "rating": 5,
      "date": "5th March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "New to take out a mortgage with Chorley moving from...",
      "text": "New to take out a mortgage with Chorley moving from a high street provider. Not disappointed",
      "rating": 5,
      "date": "5th March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Amazing customer service",
      "text": "Chorley have been great from start to finish arranging the mortgage. We needed to complete just before Christmas and Chorley did everything they could to help make it happen. Customer service was amazing and very helpful. Definitely recommend them.",
      "rating": 5,
      "date": "5th March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Efficient and excellent service from this company",
      "text": "Efficient and excellent service from this company who will always go the extra mile for the customer. Louise was most helpful in determining the most suitable product for my circumstances.",
      "rating": 5,
      "date": "5th March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "I’ve had a wonderful experience with this bank.",
      "text": "I’ve had a wonderful experience with this bank. The customer service is consistently excellent, with friendly staff always ready to assist. They offer a wide range of services that make banking convenient, and the online app is user-friendly and efficient. It’s clear they prioritize customer satisfaction, and I truly appreciate their commitment to providing seamless and reliable banking solutions",
      "rating": 5,
      "date": "5th March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Been with Chorley for many years for our mortgage al...",
      "text": "Been with Chorley for many years for our mortgage always get good rates and all staff you speak to are so helpful and friendly always kept up to date with any changes",
      "rating": 5,
      "date": "5th March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Chorley are reliable with helpful and caring staff",
      "text": "Having taken out my mortgage with Chorley, they were informative at every stage and listened to my requirements all the way, and when we found it getting a bit difficult, because of losing my job and deciding to retire, they helped me, providing me with the correct solution so that I would not get into debt. I definitely would recommend Chorley for mortgages, they are a caring and reliable company, who listen to the needs of their customers",
      "rating": 5,
      "date": "5th March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Flexible and fair.",
      "text": "Flexible and fair. Great experience for a self build mortgage. The process was not over complex and everyone was helpful.",
      "rating": 5,
      "date": "5th March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Self build mortgage success with Chorley!",
      "text": "We have had an excellent service from Chorley- they are attentive & detailed in all interactions.",
      "rating": 5,
      "date": "5th March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "CBS offered us a product that aligned with what we n...",
      "text": "CBS offered us a product that aligned with what we needed and listened and understood our circumstances. They have been great when we have made enquiries relating to our mortgage and also very quick to make changes to details and customer service has always been great via phone and email. They keep us up to date with any changes to our product and explain things so you can understand them in their correspondence too which is great!",
      "rating": 5,
      "date": "5th March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Through, friendly, swift and helpful.",
      "text": "Through, friendly, swift and helpful. Excellent experience throughput and like helping a local business who helps other local people",
      "rating": 5,
      "date": "5th March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Self build mortgage provider, high rates",
      "text": "Self build mortgage provider, high rates",
      "rating": 5,
      "date": "5th March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Happy with the service",
      "text": "We are very happy with the service and their continuous support and regular updates",
      "rating": 5,
      "date": "5th March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Fab lender!",
      "text": "Fab lender! Looked after us for more than 20 years",
      "rating": 5,
      "date": "5th March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Whoever I speak with at Chorley is always profession...",
      "text": "Whoever I speak with at Chorley is always professional,polite and a pleasure to talk to. Plus,they are real people! So often banks are faceless.",
      "rating": 5,
      "date": "5th March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "WE had a mortgage refused due to our workshops been...",
      "text": "WE had a mortgage refused due to our workshops been to close to our house.",
      "rating": 1,
      "date": "5th March 2025",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "Early Assessment Appears Satisfactory",
      "text": "Only just opened a Chorley mortgage this month, so a little too early to fully assess. Appear professional and friendly so far though. Time will be the true indicator.",
      "rating": 4,
      "date": "5th March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very high interest rate mortgage",
      "text": "Very high interest rate mortgage",
      "rating": 3,
      "date": "5th March 2025",
      "product": "Mortgages",
      "sentiment": "mixed"
    },
    {
      "title": "Excellent customer service.",
      "text": "It has been a really easy process porting my mortgage. Candice was excellent and very efficient the whole way through. Excellent customer service.",
      "rating": 5,
      "date": "4th March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Well done The Chorley..........",
      "text": "I received expert help and advice from start to finsh which turned what for many, can be a complicated and nerve-racking experience into a comfortably manageable process. Not quite a walk in the park but almost. Well done The Chorley.",
      "rating": 5,
      "date": "27th February 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Chorley Building Society Mortgage",
      "text": "I found Louise very helpful, patient and knowledgeable, she brought my attention to something that I had not considered, which was actually quite important. I have now got sufficient background information to discuss with my wife and base our decision making on.. Louise is brilliant! Thank you.",
      "rating": 5,
      "date": "26th February 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent!",
      "text": "Responsive with any queries and assisted in completing paperwork making the process much less stressful. Emails were replied to quickly. Worth every penny!",
      "rating": 5,
      "date": "25th February 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Without doubt Chorley's decision to approve an exten...",
      "text": "Without doubt Chorley's decision to approve an extension of 3 years to our major mortgage, enabled us to prepare for the opportunity to resolve the major flooding problems of October 2023, thus enabling the desired sale of our house in 2027/28. Our Stress levels dropped significantly. Thank You. Roger & Margaret Roseboom",
      "rating": 5,
      "date": "13th February 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Fantastic local service with a personal touch and so...",
      "text": "Fantastic local service with a personal touch and someone at the end of a phone",
      "rating": 5,
      "date": "7th February 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "A more personal experience!",
      "text": "I was recommended to Chorley Building Society by Louise who put me in contact with Candice. She went above and beyond to find a suitable mortgage . Always at the end of a phone call or email to assist with any questions and kept me informed of the process throughout .",
      "rating": 5,
      "date": "4th December 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Fantastic!",
      "text": "We have had the best experience we could have possibly asked for in obtaining our new mortgage through Chorley Building Society - a special thanks goes to Lee Ellison for being a wonderful underwriter.",
      "rating": 5,
      "date": "22nd November 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Mark Rothwell was so helpful",
      "text": "Mark Rothwell has been so helpful on changing my mortgage after 2 years. The process he recommended was simple and easy to complete and he was always there to help when I needed to check items with him.",
      "rating": 5,
      "date": "15th October 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Helpful Team",
      "text": "As a mortgage advisor I was happy to recommend Chorley for a client of mine. As a smaller lender in the market I was surprised to see them top sourcing. The team were very helpful and quick to act when needed.",
      "rating": 5,
      "date": "12th October 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "I've been with The Chorley now for five years.",
      "text": "I've been with The Chorley now for five years. They've been consistently good value for money and their customer service is fantastic. I feel valued and important to the company whenever I've needed help or advice.",
      "rating": 5,
      "date": "8th October 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great service",
      "text": "I was looking to change my mortgage and they made the process exceptionally easy for me, whilst still ensuring i had all the information i needed to make an informed choice.",
      "rating": 5,
      "date": "7th October 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Candice was absolutely amazing!",
      "text": "Candice was absolutely amazing! She was always on hand to help us in any way she could. The process of being a first time buyer is daunting, but Candice made us feel so at ease and helped us through the whole process. No matter what our question was she guided us in the best way she could. I would highly recommend Candice.",
      "rating": 5,
      "date": "17th September 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "quick to chase money slow to refund",
      "text": "quick to chase money slow to refund",
      "rating": 3,
      "date": "21st August 2024",
      "product": "Mortgages",
      "sentiment": "mixed"
    },
    {
      "title": "Mortgage renewal",
      "text": "I had the bi annual phone appointment with Chorley BS for my mortgage, as always very friendly and knowledgable chat with the advisor (mark) and was steered in the right direction for what suited our needs the best 5 star",
      "rating": 5,
      "date": "13th August 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Superb Mortgage Advisor",
      "text": "Our Mortgage Advisor couldn’t have been any more helpful. She was thorough and went above and beyond to make the process as seamless and simple for us from beginning to end. If we could give 10 stars we would. I wouldn’t hesitate to recommend Chorley Building Society to anyone looking for a mortgage product.",
      "rating": 5,
      "date": "8th August 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "The Best People & Service you could ask for",
      "text": "After having a bad experience with an independent mortgage broker and coming close to losing the house purchase, I reached out to Chorley and with mostly the help of Lee in under writing rescued my house purchase I cannot say a=enough how amazing Lee has been managing this through to offer letter given the timescales we where up against but not only that the service received by Lee and Candice was beyond excellent and so personal I cannot say enough how amazing they are at Chorley you work with real people and so quick to respond to you and discuss any concerns .. hope to now be customer for life due to this ........ Lee is an outstanding member of the team can I just say a final thank you",
      "rating": 5,
      "date": "1st August 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very easy to communicate with.",
      "text": "Very easy to communicate with. Get to talk with real people without a long wait",
      "rating": 5,
      "date": "9th July 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great personal service",
      "text": "Alway talked to a real person with a very short wait when i need too",
      "rating": 5,
      "date": "27th June 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great Service",
      "text": "Great application process, phone answered quickly by a human, all staff are friendly , helpful, and efficient.",
      "rating": 5,
      "date": "3rd June 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Superb service",
      "text": "The experience we had with Chorley Building Society has been superb. Everyone was super helpful and explained the process to us in great detail so there was no confusion. Candice was amazing in assisting us and ensured us that the process would be stress free for us which it was. I would highly recommend to all my friends and family.",
      "rating": 5,
      "date": "22nd May 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "They have gone above and beyond guiding us through t...",
      "text": "They have gone above and beyond guiding us through the process of buying our first house. What we thought was going to be a very complicated process, they was made a complete walk in the park. Could not recommend chorley building society enough.",
      "rating": 5,
      "date": "21st May 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Sensible approach to lending!",
      "text": "I found that Corley had a very sensible approach to lending, very professional staff, Candice was fantastic. Kept me updated all the way even with a difficult case like mine.",
      "rating": 5,
      "date": "9th May 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Having lost my job i was worried -amazing help",
      "text": "Having lost my job I was worried about the monthly payments it is both unexpected and unavoidable but something I hope to remedy very quickly. I would like to take the time to write about the end to end service I received from Louise Whitman and to thank her and Chorley from the bottom of my heart as this takes away such a burden that would have only continued to build and build. Thankyou for taking the time to explain this and more importantly listening and being so kind throughout it means the world to me",
      "rating": 5,
      "date": "3rd May 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Chorley have fantastic people.",
      "text": "Chorley have fantastic people working for them I've always had helpful, kind and considerate service in all circumstances.",
      "rating": 5,
      "date": "22nd April 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent customer support",
      "text": "Candice Regan and Richard Mayman were so helpful with our complex remortgage (following self build mortgage). It was a stressful time and they made it a lot easier particularly making use of previous information .",
      "rating": 5,
      "date": "19th April 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "I really do feel like a valued member of The Chorley",
      "text": "After having a call today with Mark.R ok a bit of a fact finding mission he answered every question in terms I understood and was so helpful in explaining all my options. We are currently on a self build mortgage, and have been for a long time now - today’s phone call was the most helpful and beneficial conversation I’ve had during the whole process. I really do feel like a valued member of The Chorley and after the call today wouldn’t hesitate in recommending their services and am more than likely to stay with them when we switch to a residential mortgage - especially if we get to speak to mark again!",
      "rating": 5,
      "date": "17th April 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent service from Louise Whittam.",
      "text": "Excellent service from Louise Whittam. Concise and to the point. She made everything really easy and presented very well",
      "rating": 5,
      "date": "10th April 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Exceptional Service",
      "text": "Our fixed mortgage term was about to end and it was time to pick a new mortgage product. From start to finish the process is really simple and the standard of service is exceptional. I have been a happy customer with Chorley for a number of years and I cannot fault the service. They offer amazing guidance that helps you make your own decision about what is best for you. I think the biggest and most important thing to say is Chorley really care and genuinely want the best for you. The whole process is very friendly and also super professional ensuring you have the greatest of trust that you are in very good hands. So very glad we are with Chorley.",
      "rating": 5,
      "date": "14th March 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "I used Chorley Building Society for my mortgage and...",
      "text": "I used Chorley Building Society for my mortgage and the whole process was made as easy as possible thanks to them. Each member of their team I dealt with was informative and always helpful whenever I needed assistance. Whilst the process of my mortgage was quite complicated and long winded due to the nature of my situation, the team at Chorley Building society made it as simple as possible which was excellent and I would definitely recommend them!",
      "rating": 5,
      "date": "8th March 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Good service every single time in branch or on telep...",
      "text": "Good service every single time in branch or on telephone.",
      "rating": 5,
      "date": "7th March 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Fantastic service from start to finish",
      "text": "We have been members with Chorley for over 10 years and loved every minute of the service provided. The staff have been exceptional.",
      "rating": 5,
      "date": "6th March 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "excellent local company",
      "text": "excellent local company dedicated to providing a professional service",
      "rating": 5,
      "date": "6th March 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Arranged self build mortgage with Chorley BS who mad...",
      "text": "Arranged self build mortgage with Chorley BS who made it possible",
      "rating": 5,
      "date": "5th March 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Self build dream",
      "text": "Provided me the mortgage to self build my dream home",
      "rating": 5,
      "date": "5th March 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great mortgage offers and help with renewal",
      "text": "Great mortgage offers and help with renewal",
      "rating": 5,
      "date": "5th March 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "New home",
      "text": "I’m happy for my 1st mortgage was bit hard to go through",
      "rating": 5,
      "date": "4th March 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Help when I needed it most!",
      "text": "This Building society helped me out when I needed it most. After a major operation they were able to arrange a new payment plan for me whilst i was recovering and unable to go into work. . Thanks to them I have a beautiful home that I'm really proud of and im continuing towards my goal of paying my mortgage off. Thankyou.",
      "rating": 5,
      "date": "4th March 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "5* on customer service",
      "text": "Always helpful and informative when needed understand your needs and advice is good",
      "rating": 5,
      "date": "4th March 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Tthrough thick and thin",
      "text": "Long term mortgage holder through thick and thin the Chorley has always been ther for us.",
      "rating": 5,
      "date": "4th March 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great experience and easy to navigate.",
      "text": "Great experience and easy to navigate.",
      "rating": 5,
      "date": "4th March 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Professional Service",
      "text": "I had a professional service when I took out my mortgage with Chorley Building Society",
      "rating": 5,
      "date": "4th March 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very clear explanations of the products they have.",
      "text": "Very clear explanations of the products they have. Made it easy to make the correct decisions for myself and my family.",
      "rating": 5,
      "date": "4th March 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "We never thought we would own our own home",
      "text": "We never thought we would own our own home, it was a dream. A dream that became a reality because Chorley supported us, guided us on the right path, and believed in us. Helping us to make our dream come true, and giving us the security we needed to live a happy life.",
      "rating": 5,
      "date": "4th March 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "SIMPLY THE BEST",
      "text": "Chorley BS are easy to deal with and very helpful staff.",
      "rating": 5,
      "date": "4th March 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Overall pretty good",
      "text": "Overall pretty good, not the cheapest but have the right approach.",
      "rating": 4,
      "date": "4th March 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "smooth and effortless",
      "text": "The whole process from applying to moving into our house was smooth and effortless",
      "rating": 5,
      "date": "4th March 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Recently taken out a mortgage, no issues so far.",
      "text": "Recently taken out a mortgage, no issues so far.",
      "rating": 4,
      "date": "4th March 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Chorley were excellent",
      "text": "Chorley were excellent from start to finish during our mortgage application.",
      "rating": 5,
      "date": "4th March 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Choosing a mortgage",
      "text": "Chorley Building Society make choosing a mortgage product much easier with their easy to follow website. The mortgage advisors are very knowledgeable and more than happy to help putting you, the customer, at ease in a sometimes stressful time.",
      "rating": 5,
      "date": "4th March 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Chorley Building Society have been easy to communica...",
      "text": "Chorley Building Society have been easy to communicate with (they send us reminders and we are able to set up meetings with them) and transparent with their processes.",
      "rating": 5,
      "date": "4th March 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Pleasant Staff and an efficient service all round.",
      "text": "The staff were pleasant and quick to respond to my questions. This saved time and it was pleasing to know I could always get an answer back to my team quickly. We worked by email most of the time and this helped resolve problems early on in the negotiations. Also any telephone calls I made were always answered in the same day.",
      "rating": 5,
      "date": "4th March 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Good mortgage rate",
      "text": "Good mortgage deal when we first took it out 18months ago",
      "rating": 4,
      "date": "4th March 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Chorley assisted us with our first joint mortgage an...",
      "text": "Chorley assisted us with our first joint mortgage and have since kept us regularly updated with any changes, and have always been very easy to contact and respond to our queries.",
      "rating": 5,
      "date": "4th March 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "best service provider",
      "text": "first mortgage and stayed with them for 15 years - never any issues always very helpful",
      "rating": 5,
      "date": "4th March 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Superb lender in every respect.",
      "text": "Superb lender in every respect. We know for certain they have our best interests at heart ❤️",
      "rating": 5,
      "date": "4th March 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Remortgage made Easy",
      "text": "A remortgage made simple, no time wasting. Speaking to real people made everything so easy.",
      "rating": 5,
      "date": "4th March 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Mortgage",
      "text": "Excellent customer service as well as the mortgage advisor for a new mortgage I just had to renew",
      "rating": 5,
      "date": "4th March 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "We have been with Chorley for our mortgage for 7 years.",
      "text": "We have been with Chorley for our mortgage for 7 years. We have taken two more mortgage products since and we don't have any problems. They have always communicated well and they resolve issues with us quickly",
      "rating": 5,
      "date": "4th March 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Really helpful and efficient.",
      "text": "Really helpful and efficient. Would recommend for mortgages. Friendly team.",
      "rating": 5,
      "date": "4th March 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "This is my first ever mortgage and Chorley have supp...",
      "text": "This is my first ever mortgage and Chorley have supported me consistently - always willing and prompt with contacts, information and answers to questions that I’ve had - couldn’t ask for more!",
      "rating": 5,
      "date": "4th March 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "The best mortgage company ever!",
      "text": "Been with Chorley building society since 2019. They are easy going, so kind to speak to over the phone/email & helpful. Always fast at replying. I have recommended them to many people before. I didn’t have a credit score as such back then as I was only young, but they still accepted me and let me take on a mortgage, their prices of the mortgage I’ve had have been spot on. Nothing expensive at all! I will continue to have a mortgage with amazing company!",
      "rating": 5,
      "date": "4th March 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Have been with Chorley for my mortgage for years alw...",
      "text": "Have been with Chorley for my mortgage for years always there to help with a friendly attitude talk you through step by step and never waiting on the phone to speak to someone always get through straight away none of this waiting in a line your number 3 in the Que half hour later you speak to someone the most annoying thing five star all round",
      "rating": 5,
      "date": "4th March 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Really good personalised experience",
      "text": "We have not left Chorley because they are really personalised to us. The underwriters have contacted us personally to check any issues and have always been really helpful. We have not wanted to leave because of this despite other places having a slightly lower rate",
      "rating": 5,
      "date": "4th March 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Top class Customer service",
      "text": "Chorley have been very supportive with us over the past 12 months. They are personable, flexible and very helpful",
      "rating": 5,
      "date": "4th March 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "great service for 5 years!",
      "text": "Ive been with chorley for 5 years now.. i recently remortgaged as they offered me the best rate by far on the market. Advisors are always kind, happy to help, quick with response time and polite!!",
      "rating": 5,
      "date": "4th March 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very promptly responded.",
      "text": "Very promptly responded. Brilliant service!",
      "rating": 5,
      "date": "26th February 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "It is so good to talk to an actual person!",
      "text": "It is so good to talk to an actual person! I received a call a few moments ago from Louise. This was to discuss payment for this month. Louise explained that they were there to help,which was a stark contrast to my last provider.",
      "rating": 5,
      "date": "22nd February 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent service and advice",
      "text": "The mortgage advisors are very helpful and explain everything in a very understandable way. Nothing is too much trouble and communication is excellent.",
      "rating": 5,
      "date": "19th February 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Chorley are the best financial services out there by...",
      "text": "Chorley are the best financial services out there by a country mile. It’s the personal service and efficiency that put them streets ahead.",
      "rating": 5,
      "date": "7th February 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excelent, Common Sense Service",
      "text": "Katie has been efficient, professional and vey helpful throughout the process. It is refreshing to have access to Underwriters and a common sense approach can be applied rather than computer says.....",
      "rating": 5,
      "date": "2nd February 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Mortgage Application.",
      "text": "My experience with mortgage adviser Candice Regan was excellent and thorough from start to finish. Candice was very detailed, professional, and respectful for the information she requested for my application and would recommend her very highly.",
      "rating": 5,
      "date": "1st February 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Friendly helpful staff can’t recommend highly enough.",
      "text": "The Chorley building society were helpful and efficient from the very start of our mortgage application. Keith talked through all the range of products available and the process ran very smoothly. The next stage was dealt with by Lee who moved our application forward. Everyone at the Chorley building society were helpful and I can’t recommend them more highly. enough.",
      "rating": 5,
      "date": "31st January 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Chorley Building Society, highly recommended.",
      "text": "from the beginning of my mortgage application to now more than half way through the mortgage with them Chorley have been accessible, professional, and helpful. I highly recommend them, it has been a pleasure to have the with me every step of the way",
      "rating": 5,
      "date": "17th January 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "I dealt with Mark Rothwell and was both friendly and...",
      "text": "I dealt with Mark Rothwell and was both friendly and highly professional, which is a hard blend to achieve sometimes.",
      "rating": 5,
      "date": "17th January 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Mark Rothwell",
      "text": "Both my Wife and I have been speaking with Mark Rothwell and he has been extremely courteous, very helpful and knowledgeable throughout our discussions. Thank you Mark.",
      "rating": 5,
      "date": "3rd January 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Happy to help in difficult times",
      "text": "It's so refreshing having people dedicated to helping you out at a difficult time, so pleasant and easy to talk to.",
      "rating": 5,
      "date": "22nd December 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Hassle Free process",
      "text": "Brilliant service, fantastic to speak to the team at Chorley who run through the options clearly and concisely and then get it done straight away. Top mortgage company to deal with in my experience.",
      "rating": 5,
      "date": "20th December 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Efficient, helpful and friendly",
      "text": "I’ve alway valued my experiences with the Chorley. They are personable to deal with and so helpful, at all times.",
      "rating": 5,
      "date": "14th December 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Best mortgage lender",
      "text": "I cannot recommend Chorley highly enough. Their customer service is to die for. Many thanks guys",
      "rating": 5,
      "date": "13th December 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "It took Mark literally seconds to solve a problem that was, for me, becoming a real headache",
      "text": "I was having trouble with my earnings being paid to coincide with DD due dates. Mark simply moved the DD date giving me leeway between the 2 events and explaining that being in the correct month, I wasn’t falling behind",
      "rating": 5,
      "date": "11th December 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Mortgage Review",
      "text": "Fantastic advice from a very helpful advisor Mark",
      "rating": 5,
      "date": "27th November 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Amazing Support form the Chorley staff.....",
      "text": "Chorely staff have been reaching out to suppport our transition from a lowerinterest rate mortgage deal, to much higher inteest rate adjustment for over three months. They have been so supportive and helpful. At the last minute we wanted to pivot to a different product, and Mark was amazing tuning round the fastest ever mortgage offer and confirmation in the hirstoy of the organisation! Many thanks to the Chorely and Distraict Team.",
      "rating": 5,
      "date": "22nd November 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Chorley Building Society Branch Review",
      "text": "Application was very fast and the documents etc. were sent out very quickly.",
      "rating": 5,
      "date": "3rd November 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent service",
      "text": "I appreciated the courteous, helpful support and guidance I received from Mark. I was impressed and grateful.",
      "rating": 5,
      "date": "2nd November 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Best Mortgage Provider",
      "text": "The Chorley Building Society gave us a mortgage when no one else would - because they actually looked at our circumstances, rather than relying solely on machines to say yes or no. We have been with them for 8 years, have never missed a payment and they have been unbelievably helpful throughout the time we've been with them. Recently had to opportunity to reduce our mortgage and they went out of their way to pursue the most cost-effective option for us. Can't recommend them highly enough. Proper old-fashioned customer service.",
      "rating": 5,
      "date": "1st November 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Bespoke and exceptional service.",
      "text": "During the last five years, that we have dealt with the Chorley & District building society. The whole experience has been both professional and efficient. We would strongly recommend them to anyone requiring an individual approach to their financial requirements. The Society does definitely provide an excellent service in all aspects of their business activity.",
      "rating": 5,
      "date": "27th September 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Good",
      "text": "Always great service providing great communication",
      "rating": 5,
      "date": "22nd September 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "New Mortgage Deal",
      "text": "I spoke today with Mark, he is polite, friendly, very knowledgeable and a pleasure to deal with. Nothing is too much trouble for him, I think he is an asset to CBS and I am very grateful for his assistance.",
      "rating": 5,
      "date": "22nd September 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "having chorley in my corner made all the difference",
      "text": "From start to finish Candice Regan was absolutely brilliant and carried me through this whole process with great care & expertise. Thank you so much.",
      "rating": 5,
      "date": "22nd September 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent customer service!",
      "text": "When I phoned I was immediately put through to a member of the mortgage team (Mark) who was highly knowledgeable and clearly explained my options without any pressure, he also answered my questions straight away in an open and honest way. As always Chorley are fantastic to speak to and have straightforward products without any hidden costs. You always get to speak to the right individual who fully explains the product or item and I would highly recommend them.",
      "rating": 5,
      "date": "13th September 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Individual Service",
      "text": "I’m not very confident with the on line things that you have to complete .. but my contact Mark Rothwell was so helpful. Replied to each email I sent with a question and answered with no waffle .. just to the point. Would 100% recommend dealing with Chorley and Mark in particular. Thankyou.",
      "rating": 5,
      "date": "12th September 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Successful application",
      "text": "We already have a mortgage with Chorley, and have ported it with a slight top-up to a new property. Chorley were very helpful, responded to our queries and change of property and mortgage amount without much delay. They are very traditional and the mortage interviews were a bit long (hence only 4 star), but I don't know how much of this is due to the financial regulations and how much is down to Chorley's working practices. It's good to be thorough, anyway! Candice Regan was a pleasure to work with, always happy to help.",
      "rating": 4,
      "date": "10th August 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Solid support from Chorley",
      "text": "My experience with Chorley Building Society has been overwhelmingly positive. My main contact is Louise Whittam, who has been friendly and helpful all along. It makes a big difference if you can deal with a specific individual on a consistent basis.",
      "rating": 5,
      "date": "12th July 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Remortgage",
      "text": "Louise has been just brilliant in her explanations, reassurance and advice!",
      "rating": 5,
      "date": "26th June 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Rollercoaster of emotions",
      "text": "I’m glad I get this opportunity to express some feedback on my experience, after potentially losing all hope in getting a mortgage and waiting for anyone to pick up my case, a lovely lady name ‘Nina’, emailed to explain that she’d like to take my case and in doing so, dropping other cases, one of the loveliest woman I’ve spoken to in these types of circumstances, nothing was to much trouble and I believe she even worked behind her work day in order get the answer I needed, honestly cannot thank her enough she needs a big bonus! I’d love to know her address so I could send her a big bunch of flowers and nice bottle of wine to say thanks! Over the moon with how I was dealt with and it’s all down to Nina!",
      "rating": 5,
      "date": "23rd June 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "great service",
      "text": "i had a great service with Louise Whittam, with very nice patience to explain me everything. highly recommend. :)",
      "rating": 5,
      "date": "22nd June 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Existing Customer Re-mortgage May/June 2023",
      "text": "I’ve been a customer with the Chorley Building Society since 2017 and cannot recommend them highly enough. The service in every area has been absolutely exemplary and my most recent experience of re-mortgaging my property in May/June 2023 only strengthened this view. Whilst they may not always be the cheapest on the market, you cannot place a value on the benefits of dealing with real, friendly, humans who take their time understand your circumstances and work through a personalised recommendation / solution. Special thanks to Candice for again making the experience re-mortgaging straight forward!",
      "rating": 5,
      "date": "8th June 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "excellent service",
      "text": "mark rothwell could not have been more professional and efficient in dealing with our mortgage",
      "rating": 5,
      "date": "25th May 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Friendly, approachable and dedicated",
      "text": "I found myself going through a protracted divorce quite late in life which resulted in me having to take on the mortgage and move house. The mortgage advisor painstakingly took me through the process and was extremely supportive. Due to some technical issues with the divorce the Branch also came up with workable solutions. Eventually everything was sorted out and I have been in my new house for almost 12 months. Since moving my ported product was due to expire. Arranging for another product could not have been easier.",
      "rating": 5,
      "date": "15th March 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent Advice",
      "text": "Customer service is impeccable and the mortgage rate provided was the best we could get at the time of purchase.",
      "rating": 5,
      "date": "10th March 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Fundamental",
      "text": "I have had my mortgage with Chorley for 5 years and they have been steadfast in their support and value throughout - always there when you need them, no hidden surprises and always willing to listen and support when needed. In this current climate of uncertainty it is reassuring to know I can rely on them.",
      "rating": 5,
      "date": "10th March 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Wonderful customer service and very good communication",
      "text": "The staff are wonderful, we get regular contact about our self build mortgage, they guide you through all of the process as the build takes place",
      "rating": 5,
      "date": "10th March 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Friendly, reliable service",
      "text": "Chorley have been fantastic to deal with from start to finish. They made applying for a mortgage clear and simple, a much better experience than the high street lenders!",
      "rating": 5,
      "date": "9th March 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great Mortgage Products",
      "text": "One of only a few lenders who would offer me an interest only re-mortgage as a retired & working person. Simple application process and communication.",
      "rating": 5,
      "date": "5th March 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great service- very helpful",
      "text": "Really impressed with the service and would definitely recommend xx",
      "rating": 5,
      "date": "5th March 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Chorley is the best bank to me better than any bank I have ever had",
      "text": "In my view chorly is the bank for the poor.They are very accommodative to poor like me. I wouldn't have had a house to live in if it was not because of Chorley I am now planing to save my money with Chorley.",
      "rating": 5,
      "date": "2nd March 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Life changing company, with people who care",
      "text": "Fantastic experience with Chorley Building Society. Always a friendly and helpful voice on the phone, nothing automated or fake. Just genuine people who want what’s best for their customers and will go above and beyond to achieve new homeowners , life changing dreams. They care about the person, not the status like many other banks. Don’t delay, choose Chorley today",
      "rating": 5,
      "date": "1st March 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Personal, local, caring",
      "text": "A wonderful, personal service, great attention given to detail and provided exactly what they said they would",
      "rating": 5,
      "date": "28th February 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Bespoke, individual needs",
      "text": "Chorley took time to create a bespoke mortgage to a complicated situation that helped me secure my house for the future",
      "rating": 5,
      "date": "28th February 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Best Financial Service I have ever had",
      "text": "I worked with Chorley for my mortgage - I have to say I did not know companies like this still existed - I had 1 person to deal with how responded and spoke to be by return on every occassion. She explained everything good and bad in great detail I would definitely recommend Chorley to anyone.",
      "rating": 5,
      "date": "28th February 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Customer Satisfaction - An Example of how it should be done!",
      "text": "Been with the Chorley since 2018. Nothing too much trouble, real people to answer your questions and address your concerns. Outstanding in all respects. Brilliant!",
      "rating": 5,
      "date": "28th February 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "remortgaging without the headaches!!!!",
      "text": "needed to remortgage and looked everywhere only to discover the best advice and deal was available from my existing mortgage provider. should have saved myself loads of headaches and gone straight to the chorley!!!!!!",
      "rating": 5,
      "date": "28th February 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Good human contact and understanding.",
      "text": "Simple mortgage product. Remarkably little fuss. No robots or computer interface. No waiting on calls. So simple and wonderfully old fashioned.",
      "rating": 4,
      "date": "28th February 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Good company",
      "text": "I have never had a problem with them I use them for my mortgage customer service always helpful",
      "rating": 5,
      "date": "28th February 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "They are humans, not computers",
      "text": "I would say professionals they know what they’re doing.",
      "rating": 5,
      "date": "27th February 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Efficient Mortgage Company",
      "text": "Very clearly communicated mortgage with reasonable rates.",
      "rating": 5,
      "date": "27th February 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very competitive product",
      "text": "My search for a good remortgage ended here as that was the best deal that I could find at that very difficult time. But the product fee was falsely changed last and reason was mistake from their side which is very unprofessional. Also they can improve the online version as it’s not very informative.",
      "rating": 4,
      "date": "27th February 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "The Chorley Building Society changed my life!",
      "text": "I was offered a credit repair mortgage by The Chorley Building Society almost 3 years ago. Their open minded and fair approach to people, who in the past, have for often no fault of their own had a less than perfect credit history. The mortgage they gave me literally changed my life, giving me financial security and home for life. I will forever be greatful to them for taking the time to really look into my application. I now have a beautiful home that I can call my own.",
      "rating": 5,
      "date": "27th February 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Brilliant company & supportive",
      "text": "I had so much support and guidance from Chorley employees. The mortgage was actually an easy process. Remortgaging was also simple. We have stuck with them 5* as rates are good too. Can’t rate them high enough! Thanks for your support from first time buyers.",
      "rating": 5,
      "date": "27th February 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Chorley Mortgage Review",
      "text": "Nice helpful people and efficient administration",
      "rating": 5,
      "date": "27th February 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "First time buyers",
      "text": "As first time buyers the world of mortgages was completely new to us. Chorley BS have been brilliant, informative and helpful since day one. I have already recommended Chorley BS to friends and will continue to do so. More than happy! :-)",
      "rating": 5,
      "date": "27th February 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Helped us greatly",
      "text": "Helped us with a mortgage and a great friendly service deal with problem effectively and answer questions fast",
      "rating": 5,
      "date": "27th February 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Re mortgage",
      "text": "We are re mortgaging completion fingers crossed tomorrow. I telephoned with a few quires. I got straight though! No horrid music, lovely lady on the phone, talked as if we we old friends. Very friendly and sorted everything out. These days you are on hold wherever you are, it was just a shock not to be. Makes a refreshing change. Thank you",
      "rating": 5,
      "date": "27th February 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Personal touch",
      "text": "In todays world of impersonal call centres and online chat whereby common sense and any degree of reasonable understanding is all but lost, Chorley strikes a balance to retain all that used to be good in banking whilst looking ahead. I honestly don’t know any other organisation that has held on to the personal touch and long may it continue.",
      "rating": 5,
      "date": "27th February 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Review",
      "text": "Great company. Pleased with the communication when getting our mortgage in place",
      "rating": 5,
      "date": "27th February 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent personal service",
      "text": "Excellent personal service and product choice",
      "rating": 5,
      "date": "27th February 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Brilliant mortgage provider",
      "text": "The most customer oriented mortgage business there is!",
      "rating": 5,
      "date": "27th February 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Pleasant experience",
      "text": "I have had quite a straightforward experience with this building society and am happy",
      "rating": 4,
      "date": "27th February 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Professional Mortgage Provider After Retirement",
      "text": "I was looking for a Mortgage after having to take early retirement at 55+years and had convinced myself that it would not be possible. I contacted Chorley Building Society and they reassured me that it was possible and at an affordable monthly amount! They were so professional and helpful and I would recommend them to friends and family.",
      "rating": 5,
      "date": "27th February 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "excellent customer service",
      "text": "Simple to understand correspondence, excellent customer service!",
      "rating": 5,
      "date": "27th February 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "A building society that works like a community",
      "text": "The house we wanted had been rejected by high street lenders due to its size and scope and Chorley looked at us and the house individually rather than just the numbers on a spreadsheet. They looked after us and checked in on us all through the process.",
      "rating": 5,
      "date": "27th February 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Fantastic customer communication and support.",
      "text": "Quick, easy to understand communications and straightforward processes thoughout our remortgage, The Chorley have been fantastic throughout, what has been an otherwise protracted transaction.",
      "rating": 5,
      "date": "27th February 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Trusted Mortgage Provider with no surprises and honest approach",
      "text": "I have had a mortgage with. Chorley BS since moving to the area over 12 years ago. When I first applied for the mortgage, they were extremely helpful and provided a friendly service with excellent local knowledge. The service has remained impeccable since then and I have renewed my mortgage with them ever since. Although their rates are not the cheapest out there, the service they provide gives me a hassle free way of guaranteeing I can renew my mortgage, without the aggregation involved with other lenders.",
      "rating": 5,
      "date": "27th February 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Brilliant offer and great customer service.",
      "text": "We were happy with the mortgage options and the process was smooth and quick . Great customer service.",
      "rating": 5,
      "date": "27th February 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great customer focused solutions",
      "text": "The advisers at Chorley genuinely care about getting it right for the customer. They have excellent follow up to ensure you are looked after.",
      "rating": 5,
      "date": "27th February 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Just the best",
      "text": "We have had our mortgage with Chorley for many years this is our second mortgage house with them we sold our first house and decided to stay with them they are always at the end of the phone to speak to they go out of there way to help you with excellent customer care can’t fault Chorley excellent in all aspects",
      "rating": 5,
      "date": "27th February 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent caring service",
      "text": "The service at Chorley is of the highest standard. Staff really care about helping you and answer any questions swiftly and in a way that ensures you understand everything and ultimately guide and help you to make the best possible decisions when choosing your mortgage. The best out there and I am so glad I am a customer. Best service from a building society I have ever received.",
      "rating": 5,
      "date": "27th February 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "First time buyer",
      "text": "Clear information, helpful and prompt responses",
      "rating": 5,
      "date": "27th February 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "No hale down to earth commom sense service",
      "text": "Always straight to the point all my queries were proffesionally handled",
      "rating": 5,
      "date": "27th February 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "First timer Morgage.",
      "text": "This is my first mortgage, and this mortgage provider have been absolutely brilliant. Always informing me of any changes. And keeping me up to date with up and coming charges.",
      "rating": 5,
      "date": "27th February 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Mortgages at Chorley",
      "text": "Always helpful and there to give advice on new products etc. They always ring back with answers to any queries you may have.",
      "rating": 5,
      "date": "27th February 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "New Build Mortgage",
      "text": "Really really helpful team who immediately understood the issues and worked proactively to ensure a suitable mortgage product was identified and achieved",
      "rating": 5,
      "date": "27th February 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Outstanding customer service",
      "text": "It is so refreshing to be able to deal with a financial institution where you can ask for somebody by name and have consistent and efficient service. Chorley have been nothing short of excellent in setting up our new mortgage and responding to subsequent enquiries. When it was time to renew at the end of the fixed rate deal I refused to move provider due to the quality of service and the trust I have in them to do a good job. I do not hesitate in recommending them to everybody.",
      "rating": 5,
      "date": "27th February 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very Clear in requirements",
      "text": "Good customer service. Specifically, quick to respond to queries",
      "rating": 5,
      "date": "27th February 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very helpful and friendly staff",
      "text": "Took my mortgage out with chorley building society during the pandemic on 2020. Very helpful friendly staff. Have had no issues since and staff have sorted any queries I have had very swiftly. 5 star service",
      "rating": 5,
      "date": "27th February 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Chat re change of mortgage product",
      "text": "Candice was extremely helpful. She immediately understood our situation and offered us alternative approaches to achieve our objective. She talked it through carefully and helped us to make the best choice for us.",
      "rating": 5,
      "date": "22nd February 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great costumer service",
      "text": "Mortgage advisor and Underwriter Kate Shawcross has provided exceptional support for our product review and the extension of our mortgage term. She has been friendly, efficient and answered all of our questions fully and in a timely manor. We also appreciated Kate's flexibility with scheduling phone calls. When we requested longer to make a decision on products she was supportive and happy to reschedule a meeting. Overall great costumer service and a wonderful experience, thanks Kate!",
      "rating": 5,
      "date": "20th January 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Detailed application dealt with quickly",
      "text": "From application to completion dealt with quickly - very impressed with service!",
      "rating": 5,
      "date": "30th August 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Outstanding service",
      "text": "Chorley Building Society have been an absolute pleasure to deal with. Every step of the way has been made smooth and easy by the wonderful, friendly and exceptionally helpful staff. The service is second to none, and I feel that I can really trust the advice and options given to me when recently renewing my mortgage term. I have the confidence that they really know what they are talking about and I genuinely feel safe and secure and very happy that I have my mortgage with such a reputable building Society. A massive gold star for such truly excellent service. Thank you.",
      "rating": 5,
      "date": "27th July 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Flexible and efficient",
      "text": "Took 1 year to buy this house and 3 mortgage offers, great understanding from Chorley!",
      "rating": 5,
      "date": "8th July 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Attentive, efficient and friendly",
      "text": "Excellent experience working with Candice Regan who was thoroughly professional, attentive, clear in communications and committed to providing superior customer support. Fantastic attitude and very friendly. Thank you.",
      "rating": 5,
      "date": "15th June 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "I like honesty..",
      "text": "I found all communications were honest, even if the answer wasn't what I hoped, I knew where I stood. I hope the Society will bring their conveyancing services 'in house' to complete the experience.",
      "rating": 5,
      "date": "27th March 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "For the customer",
      "text": "Does the right thing for customers",
      "rating": 5,
      "date": "1st March 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Saved us at a difficult time",
      "text": "Chorley we’re utterly amazing. They listened to us and gave us such a personal service. They understand personal circumstances and that everything is not cut and dry. They accepted us and gave us a mortgage in what we’re difficult times. I will always be grateful to them and would recommend them to anyone. Thank you.",
      "rating": 5,
      "date": "18th February 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Brilliant - patient and personalised",
      "text": "Candice was so patient with us and really professional. She was clear and thorough in our application and always clearly explained all of our options. We had a few hiccups along the way unrelated to Chorley (COVID and OFSTED) which delayed us sending information back, and Candice was really patient with us throughout these.",
      "rating": 5,
      "date": "14th February 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Mortgages done right!",
      "text": "Chorley are one of the few mortgage providers that in our experience do what they say. Mortgages with common sense and a personal touch included- a refreshing change!",
      "rating": 5,
      "date": "12th February 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Painful",
      "text": "The application process has taken months. The level of detail and box ticking is unreal. I wish I had not embarked on a self build mortgage process.",
      "rating": 2,
      "date": "29th January 2022",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "Existing mortgage client",
      "text": "Excellent client interaction, clear and concise.",
      "rating": 5,
      "date": "10th November 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Top Quality Mortgage Process",
      "text": "This is my 3rd new Mortgage now with Chorley and each and everytime the process has been clear, simple and well communicated. The staff are friendly understanding and can’t do enough to help you through the orocess",
      "rating": 5,
      "date": "5th October 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Exceptional service, above and beyond.",
      "text": "Engaging The Chorley was the light at the end of our tunnel. Beforehand we had terrible experiences with a multitude of companies. The Chorely was like a breath of fresh air to deal with. They bent over backwards, and sometimes sideways, to help us. Even though they took on much more of the work than required they did so in order to help us achieve our goal and end up with a house to move in to. We could not recommend The Chorley high enough or give them sufficient praise for their work ethic and attention to their customer, us. A difficult and arduous process was made much simpler and even enjoyable. The mortgage team were exceptional.",
      "rating": 5,
      "date": "8th September 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Fast, efficient and professional mortgage underwriting team!",
      "text": "I had some hiccups with my mortgage broker but Lee Ellison stepped in and worked as efficient as he could to get the problems solved, got our case moving and accepted in a very timely manner. Very pleased.",
      "rating": 5,
      "date": "8th September 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Reducing Customer Service for Existing Customers",
      "text": "As an existing customer the information provided when switching products at the end of a fixed term as reduced significantly. No longer is the information provided on product options specific to my account, based on the remaining debt and projected monthly repayments, but generalised so as to be totally useless. All routes forward now involve speaking to an advisor and working out the information that was previously provided. Why provide customer service when there is a sales opportunity?",
      "rating": 2,
      "date": "21st April 2021",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "CBS is the best!",
      "text": "Been a customer for 44 years, wouldn’t go anywhere else. The sectors best!",
      "rating": 5,
      "date": "5th February 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Strongly recommend The Chorley",
      "text": "We have just completed our mortgage with the Chorley. We had excellent service from The Chorley from the moment we approached them until now. Setting up the mortgage was straightforward and given the type of mortgage we had (interest only) we were given great help at the two year intervals when we had to renew the product. What we particularly liked was the friendly and helpful approach on the phone and this was especially true during the pandemic when it must have been very difficult for staff. Many thanks and we would wholeheartedly recommend The Chorley. Mike and Yvette, Cumbria",
      "rating": 5,
      "date": "2nd December 2020",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "A word of thanks to Chorley B/S",
      "text": "One factor that really stood out was the attention and continuous advice and support that we received, despite the effects of the Corona Virus pandemic , which Chorley B/S had to cope with. We really appreciate your decision to approve our application which has enabled us to look forward and enjoy the coming years.",
      "rating": 5,
      "date": "30th July 2020",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "First time buyers.",
      "text": "Chorley was very understanding of our complicated circumstances and were able to provide us with a completive rate mortgage. Excellent cues timer service, very friendly.",
      "rating": 5,
      "date": "2nd July 2020",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "COVID 19",
      "text": "The Chorley have been absolutely fantastic and very understanding. We couldn’t of wished to of dealt with better people. They have put our minds at ease thank you.",
      "rating": 5,
      "date": "29th June 2020",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Mortgage Offer",
      "text": "My partner and I are both in our 50's and 60's. Chorley were clear about the process and the information required. They provided a prompt, no fuss and efficient service.",
      "rating": 5,
      "date": "24th May 2020",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very helpful",
      "text": "In times of need they was there for me when I needed help and was fast to respond !! I",
      "rating": 5,
      "date": "6th May 2020",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent Customer Service",
      "text": "The speed at which CBS reacted and were able to help at the onset of the Covid-19 pandemic made a stressful time a lot easier. Would highly recommend.",
      "rating": 5,
      "date": "1st May 2020",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Exceptional service",
      "text": "I contacted Chorley due to the impact of Covid-19. I had been furloughed and my husband has been put on a 20% pay cut, this of course, was causing us huge anxiety. I contacted Chorley and they could not have been more helpful! Thank you Chorley!",
      "rating": 5,
      "date": "29th April 2020",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Fantastic service",
      "text": "I have been with CDBS for 6 years now and every time I have contacted them they were friendly and professional. Always helpful. I would definately recommend CDBS.",
      "rating": 5,
      "date": "28th April 2020",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Mortgage Account Holder",
      "text": "Very Helpful and informative and always quickly responsive to querys and questions.",
      "rating": 5,
      "date": "26th April 2020",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Speedy response",
      "text": "I applied for a 3 month mortgage holiday due to being furloughed and had it approved within 18 hours of requesting it, such a relief at what is a very stressful time",
      "rating": 5,
      "date": "25th April 2020",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Friendly and very understanding of the situation.",
      "text": "We went very quickly from 2 incomes, to one. This mortgage break has relieved the pressure.",
      "rating": 5,
      "date": "23rd April 2020",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Mortage holiday",
      "text": "Very helpful when I initially enquired about this, they where very quick to respond and they understood where i was coming from.",
      "rating": 5,
      "date": "23rd April 2020",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "POOR SERVICE AND UNINTERESTED IN HELPING CUSTOMERSThe way I was spoken to on the…",
      "text": "The way I was spoken to on the telephone today and previously and the lack of interest in helping me as a long standing customer was most surprising and disappointing. The staff clearly feel they will carry out requests when they feel like it and  offer no empathy with customer. They do not offer online line accounts with the better interest rates to customers who have dementia as people with dementia whom are power of attorney cases cannot have online accounts with the Chorley Building Society. It is very poor and sad the way staff at this Society have acted and spoken to me on the telephone. I am avoiding doing further business with this Building Society which seems uninterested in helping custmers.",
      "rating": 2,
      "date": "28th January 2026",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    },
    {
      "title": "This is a bunch of crooks, avoid like the plague",
      "text": "This buiilding society do their best to avoid returning funds you have deposited with them.\n\nI had an account maturing with them and provided the maturity instructions well in advance.  It turns out that their procedures mean it takes 4 days for them to process those instructions.  \n\nYou what?  Whatever happened to faster payments?  After all, they had the maturity instructions so........that was a waste of time then?\n\nI got sick of this and manually requested that the account be closed.  They then tried every trick in the book to delay closure, including inputting details of my current account (which they already had) 7 minutes after their own cut off time - how convenient.\n\nThis load of chancers should be shut down, they're a disgrace.",
      "rating": 1,
      "date": "4th December 2025",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    },
    {
      "title": "If only  I could give less than 1 star",
      "text": "If only  I could give less than 1 star. I have never had a worse experience with a company than this  I have invested the best part of my life time savings in what I thought was a good company. As I am now 86 yrs old and need the money for a heart operation, I tried to close the account , but that is against Chorley's principles. They send you forms which are impossible to complete (i.e. \" What is the amount you are withdrawing, in Figures and Words\" ) when you don't know the amount of interest. Also, they want to charge you £25 for carrying out the transfer to your bank. I only wish I had read the reviews before I opened this account.",
      "rating": 1,
      "date": "18th August 2025",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    },
    {
      "title": "In December last year we moved house…",
      "text": "In December last year we moved house and still retained our old house to use as second home. \nI tried online to change my address but you cannot do that despite doing it with 10 other accounts including my banking accounts online. I am 80 years old and emailed and phoned Chorley to change my address, I was rudely spoken to and told in a rude manner in my opinion to write in enclosing my and my wife’s driving licence actual not copies along with our Council tax statement. I asked to speak to the Cheif executive but was rebuffed. \nWe sent our licences and Council tax statement and being 80 said we had had enough of them. \nWe rang again to receive our interest statements for 23/24 tax year and they posted to our new address thank god.\nIn this tax year 24/25 we received one of our statements to our old address. I rang once again and spoke to Maisie and complained that this was a breach of the Data protection act as we had registered our new address and asked to speak to a manager. \nA person Jill Cilar came on the line and quoted my letter to them that said I had enclosed my driving licences and Council tax account and as I was so desperate to get my Certificates of interest if they did not accept my new address to send them to my old address. We then received them at our new address. \nThis tax year I received my interest statement at my old address, on contacting Chorley Building Society that this was not my address I was told it was as I said they could use my old address if they could not alter it.\nI quoted the interest statements sent to my new address then Jill Cilar in my opinion realising I was still\nAwake at 80 years old capitulated and said it should not have been sent there..\nI asked if they could put my certificates online as other banks do andJill Cilar promptly put them there for me to download. \nWhat a mess there was no heading at all to say where the interest was from. I promptly contacted Jill Cilar again, no proper apology I had been tied up all morning couldn’t get out with the racehorses. I suggested a payment of £200 to compensate me. No chance she suggests. \nToday I spoke to Kerry Rodger’s and asked a formal complaint was made to the Chief Executive. This lady suggested did I want to close my account. I specified I had never suggested that and it came from her not me trying to bewilder me but I am an old dog and can hang in there. \nI am now waiting for a response from the Chief Executive\nVery satisfied with having 170K earning good interest just want to be properly treated by their staff\nXx",
      "rating": 1,
      "date": "30th April 2025",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    },
    {
      "title": "C & D - CRAP & DIABOLICAL!",
      "text": "Attempted to apply online. After setting up and re-entering password, progressing to next page no instructions or method of continuation apparent. Gave up as this was the only option! Having then read the   \nreviews of this institute here maybe Karma intervened and it's a blessing in disguise!",
      "rating": 1,
      "date": "8th November 2024",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    },
    {
      "title": "They are always late when you want your money back. Avoid",
      "text": "They are always late when you want your money back\n\nI have just \"lost\" (£4.60/d) 3 days of interest (~ 1% of the annual value) through an unfair rule.\nMy account with chorley has been updated with a withdraw on Friday that will \"reach\" my account with Barclays on Monday.\nThe reality?\nBarclays doesn't stop transaction to show in my account, even during the weekends. Hence, Chorley keep using my money without paying interest on it by recording the transaction on Friday but wiring the funds only on Monday.\nJust on this transaction Chorley have unfairly taken from me more than £13.80.\nAVOID\nThere are other banks that do not \"take\" unfairly your money:Cynergy, Chip, Kroo...",
      "rating": 1,
      "date": "11th August 2023",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    },
    {
      "title": "LAUGHABLE",
      "text": "LAUGHABLE\nThis poxy, tiny antiquated Building society insist that your chosen law firm to act has to have a minimum of 4 partners or directors? My firm only had 2 so I moved to another lender and got better rate.\nIdeas above their station. They are the only lender I can find that insist of 4 partners. All big lenders need 2! Bye Bye Chorley.",
      "rating": 1,
      "date": "10th August 2023",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    },
    {
      "title": "Beware - Customer Service Does Not Exist!",
      "text": "My wife and I have attempted to open accounts with this Building Society but the online system appears to have broken. We have been registered for online banking and are able to log on. We have also received emails advising us that the accounts have been opened and will be available to access on line, where we will see our account numbers so that we can transfer funds in. This is not the case, no new account details are available. I have attempted to contact the society by phone many times today but can never get through to anyone. I have always been placed in a queue for ten minutes after which time I am told to leave a message and the line is cut. This is absolutely disgraceful. Needless to say, we will not be bothering to send them any money even if, by some miracle, we finally get our accounts. I feel very sorry for the staff if they are treated with as much contempt as customers.",
      "rating": 1,
      "date": "24th July 2023",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    },
    {
      "title": "OMG. Dreadful. Useless, Antiquated",
      "text": "OMG. How old fashioned and un user friendly is this Building Society? Antiquated online system, no faster payments (only cheque (?????) or BACS for withdrawals. Useless, unfriendly, hopeless. Have money stuck in here as I cannot withdraw it. Avoid this lot at all costs. You will regret using them very quickly.",
      "rating": 1,
      "date": "18th May 2023",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    },
    {
      "title": "Xenophobic",
      "text": "Turned down today from opening a savings account because I am an EU citizen and not a UK citizen.  This is probably discriminatory but I am looking at it positively as I would not wish to be associated with an institution that is xenophobic.",
      "rating": 1,
      "date": "26th April 2023",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    },
    {
      "title": "Chorley (not) Online!",
      "text": "My rating of this arrogant, misleading, Victorian Age building society, is solely based upon their so called \"online\" savings account.\nOne can deposit their savings online by using faster payments for example, but when a withdrawal of one’s money is required, it can only be at one of their branches in Lancashire, by CHAPS (£25), or by cheque following a postal withdrawal application procedure. So not at all online!\nChorley asserts that this is in their Ts & Cs, but this should not be in their “small print”, and there are no truely online accounts that I know of, that have these constraints on the account holder, just to get their own money repaid!\nI lost over £32 in interest alone, when I closed my Chorley account, as I found it impossible to estimate either (random) postal, or Chorleys timeframes on receiving and acting upon my written closure instructions. This  resulted in their cheque arriving on a Friday, and hence not being cleared until late on the following Monday. Not to mention taking the cheque to a bank in town!\nThis is unacceptable, and I have requested that the Ombudsman investigate the issue!",
      "rating": 1,
      "date": "31st January 2023",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    }
  ],
  "trustpilotUrl": "https://uk.trustpilot.com/review/chorleybs.co.uk"
}