{
  "society": "Coventry Building Society",
  "slug": "coventry-building-society",
  "smpUrl": "https://smartmoneypeople.com/coventry-building-society-reviews/products",
  "totalReviewsOnSMP": 152,
  "avgRating": 4.12,
  "scrapedAt": "2026-02-06T15:35:13.058227+00:00",
  "reviews": [
    {
      "title": "Good mortgage , simpler than other banks to pass the...",
      "text": "Good mortgage , simpler than other banks to pass the checks. Also like that it's easy to check the current balance with their app.",
      "rating": 5,
      "date": "18th March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent communication and products",
      "text": "Excellent mortgage products to suit every lender and their comunication makes you feel like you are a valued customer.",
      "rating": 5,
      "date": "12th March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Refuse porting to sting you with ERC",
      "text": "Portable mortgage but when trying to port they offer 15% less than current mortgage, quoting changes in their lending policies. I guess a good way to sting (ex)customers with an early exit fee. Never again CBS.",
      "rating": 1,
      "date": "26th June 2024",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "Excellent products and service from mortgages to sav...",
      "text": "Excellent products and service from mortgages to savings accounts.",
      "rating": 5,
      "date": "12th April 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Early exit fees were ridiculously high with my product.",
      "text": "Early exit fees were ridiculously high with my product. I didn’t find the self service features like the app very easy to use.",
      "rating": 2,
      "date": "2nd April 2024",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "Pleasant surprise for existing customer",
      "text": "Customer service were good at dealing with my re-mortgage queries, and it was a pleasant surprise to find that re-mortgage rates for existing customers were better than those for new clients.",
      "rating": 5,
      "date": "11th March 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Good Rates for existing Customers",
      "text": "Unlike a lot of companies who get you in with low rates for a fixed term, we were pleasantly surprised to get comparably good rates for a new fixed term mortgage, meaning we didn't have to remortage completely and we saved on the cost of moving to another company.",
      "rating": 4,
      "date": "28th April 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "No issues",
      "text": "No issues with using Coventry for our mortgage",
      "rating": 3,
      "date": "3rd April 2023",
      "product": "Mortgages",
      "sentiment": "mixed"
    },
    {
      "title": "Good customer service",
      "text": "Always good to deal with, also quick to increase rates both on savings :) and mortgage :(",
      "rating": 4,
      "date": "30th March 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great service and staff",
      "text": "I applied for a mortgage with Coventry Building Society and I was very impressed by their service. They were quick, efficient and helpful throughout the process. They offered me a competitive rate and flexible terms. They communicated clearly and regularly with me and answered all my questions. I would recommend them to anyone looking for a mortgage. This review is based on information from various sources1234. It is not intended to be a substitute for your own research or personal experience. Please note that your experience may vary depending on your circumstances and preferences. Received message. Here is a possible review on Coventry Building Society mortgage services: I applied for a mortgage with Coventry Building Society and I was very impressed by their service. They were quick, efficient and helpful throughout the process. They offered me a competitive rate and flexible terms. They communicated clearly and regularly with me and answered all my questions. I would recommend them to anyone looking for a mortgage. This review is based on information from various sources . It is not intended to be a substitute for your own research or personal experience. Please note that your experience may vary depending on your circumstances and preferences.",
      "rating": 4,
      "date": "9th March 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "TERRIBLE COMPANY AVOID AND DO NOT USE !!!!",
      "text": "shocking company offered us a mortgage held till october then when we came back to finalise told us we could still have it then two weeks later someone higher up said we couldnt !! shocking has put us back two weeks and we may lose the house now AVOID USING THESE PEOPLE",
      "rating": 1,
      "date": "24th August 2022",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "Mortgage fraud",
      "text": "Coventry building society used a forged mortgage to steal an OAPs home. He died a scared broken old man. Coventry building society does it really take 10 years to show him the unsigned mortgage he never signed. How long before this is taken down?",
      "rating": 1,
      "date": "12th August 2022",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "Amazing team",
      "text": "The customer service team at Coventry are extremely helpful and all issues are resolved quickly.",
      "rating": 5,
      "date": "21st June 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Feeble Staff Training",
      "text": "Don't even think of applying for a mortgage with these people if you are a company director. They have absolutely no idea how Ltd companies operate. If you're a sole director and your company has shareholder funds just under a million this does not compute with the Coventry. Feeble training of underwriters and ludicrous questions. They feel they are doing you a favour not providing a service.",
      "rating": 1,
      "date": "28th November 2019",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "Mutual values",
      "text": "Coventry is how a building society should be. It listens to its customers and puts their interests first.",
      "rating": 5,
      "date": "5th November 2019",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Bad experience",
      "text": "I have applied for a mortgage 3 weeks ago and still waiting for a decision. Keep asking stupid and irrelevant questions. Do not recommend, don't waste your time and money with them.",
      "rating": 1,
      "date": "22nd May 2019",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "Great value, great service",
      "text": "Cheap rates speak for themselves, but Coventry also provides superb customer experience and the best complaints handling I've ever experienced",
      "rating": 5,
      "date": "27th January 2019",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Helpful and reasonable",
      "text": "Very helpful when switching, reasonable rates, easy to use website.",
      "rating": 5,
      "date": "30th December 2018",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "10-year fix with offset",
      "text": "A mutual, it puts the customer first with maximum flexibility",
      "rating": 4,
      "date": "17th December 2018",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great service",
      "text": "Fast, efficient, friendly and best rates",
      "rating": 5,
      "date": "9th November 2018",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Slow, but they get there in the end",
      "text": "Getting a mortgage through Coventry Building Society was a bit laborious. After a quick start, the home buyers survey was conducted and reported on within a week - great! Week after week, we were promised to hear from CBS with an offer, but the offer didn't come for nearly a month. Everything else was ready to go, but the underwriter apparently forgot that he had a few queries that we never got asked. In the end, we got there and although it's early days with the mortgage, everything else has been smooth...",
      "rating": 4,
      "date": "17th July 2018",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Good product, a little slow",
      "text": "Customer services were always polite and helpful and the mortgage product itself was very competitive, but our application was processed rather slowly.",
      "rating": 4,
      "date": "2nd June 2018",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Best Mortgage Company!",
      "text": "I'm absolutely over the moon with Coventry Building Society. Not only for their competitive mortgage rates for existing and new customers but for their outstanding customer service! 10/10 Coventry!",
      "rating": 5,
      "date": "28th November 2017",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "waste of money",
      "text": "pay 495 in advance and didnt get mortgage! waste of money dont go with them at all.",
      "rating": 1,
      "date": "3rd November 2016",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "Shambolic customer service and hopeless internet banking.",
      "text": "Been a member for three years. Not had any problems with them until we went on holiday last year and instead of lifting the block on accessing the account outside the UK (this is a default for them) the manager kindly blocked access to the account completely for the week and the weekends either side of the holiday. Which was not what he had been instructed to do, and which was quite inconvenient. A complaint on return from holiday brought an apologetic phone call from someone in a call centre but nothing in writing. After that, I tried to set up online banking with them. This is a convoluted system requiring you to send off a form to get a password and then get a card with codes to access your account. Two step security. First form went off. No response. Popped into branch to enquire. 'Not received. We'll generate another form'. Second one goes off. Card received. Account unaccessible. Ring to activate account. Get into system. Clunky but manageable. Second time I logged in, system fails to recognise new password, locks me out. Try online password reset. Doesn't work. Ring up help desk. 'You can't reset your password online - your email address isn't registered with us'. Explain patiently that I receive e-mails frequently from the Coventry but to no avail. Third form generated, filled in and returned. No answer. Call into branch. 'Form not received'. Fourth form requested. Has been filled in and sent off. Two weeks now and nothing received back from them. Am just about to ring them and find out if they have fallen out with the postal service as well as me. Then I am going to request details of my direct debits prior to closing the account and opening up one with another provider. Reasonable rates of interest in these penurious times, average customer service, online banking system run by a bunch of sloths. Avoid unless ringing call centres is a hobby of yours.",
      "rating": 1,
      "date": "24th September 2016",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "Brilliant customer service",
      "text": "Recently went in for a mortgage review and the last couldn't of been more helpful, explained all the options Available to us as I find some of the jargon difficult to understand, went ahead with a really good deal, very happy",
      "rating": 5,
      "date": "28th March 2016",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very helpful and profesonal whilst buying my new house.",
      "text": "I found all the staff to be very helpful and informative, whilst not overly pushy as I have found with other companies. Would happily go back to them again following this purchase for other products.",
      "rating": 5,
      "date": "9th April 2015",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Competitive Interest Rates",
      "text": "I have a limited access cash ISA with Coventry Building Society and after the last Bank of England base rate cut I was expecting my rate to fall by 0.25% in line with all my other accounts with other banks/building societies. However the rate only fell by 0.15% which was a pleasant surprise. I think Coventry Building Society do try to offer the best possible rates.",
      "rating": 5,
      "date": "26th January 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Perfect Savings Accounts",
      "text": "Great service with flexible high interest savings accounts",
      "rating": 5,
      "date": "24th January 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Changing ,saving accounts!.",
      "text": "Changing accounts,was done seamlessly and efficiently,assistants very professional,friendly and financially competent!",
      "rating": 5,
      "date": "23rd January 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Savings them meet my needs",
      "text": "They offer a get rate on my savings and the flexibility I require.",
      "rating": 5,
      "date": "15th July 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Excellent savings rates and good online savings service",
      "text": "Excellent savings rates and good online savings service",
      "rating": 5,
      "date": "13th June 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Great product and service , excellent interest rate",
      "text": "Great product and service , easy to use and very used friendly platform.",
      "rating": 4,
      "date": "12th June 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "I have recently opened a Junior ISA for my child, an...",
      "text": "I have recently opened a Junior ISA for my child, and it was really funny because they said there would be no app or website to control or just check the the account. You have to, literally either walk to your nearest branch or phone them up! I laughted and asked them if they thought it was 1986. It's very old fashioned! It's a way of putting it. I have now read some reviews of how people have been treated unfairly and it's really made me think.",
      "rating": 2,
      "date": "27th May 2025",
      "product": "Savings",
      "sentiment": "negative"
    },
    {
      "title": "Friendly efficient staff .",
      "text": "Friendly efficient staff .Good range of products",
      "rating": 4,
      "date": "17th April 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Simple to use, excellent interest rates, and much more",
      "text": "Simple to use, excellent interest rates, great communications, helpful advice - profits go back to investors and into the local community rather than to a bunch of hifalutin directors and/or alien trust and hedge funds",
      "rating": 5,
      "date": "2nd April 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Offer competitive interest rates on cash ISAs.",
      "text": "Offer competitive interest rates on cash ISAs. Easily allow you to switch to another cash ISA they have recently launched. Good communication.",
      "rating": 5,
      "date": "24th March 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Dropped off a little on interest rates but still good",
      "text": "I like saving with a building society rather than a bank. Coventry haven't been quite as competitive for interest rates this year but they are good at communication.",
      "rating": 5,
      "date": "2nd March 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Good overall",
      "text": "Quick customer service reply, good range of regular savings accounts and saving accounts. Easy to access. Transfers out happen next day but website easy to use.",
      "rating": 5,
      "date": "2nd March 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Great rates and very secure.",
      "text": "Great rates and very secure. Easy website and app to use. Account benefits explained very well.",
      "rating": 5,
      "date": "1st March 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Friendly, quick service.",
      "text": "Friendly, quick service. Great products with good solid rates . A well known , trust name with branches on the High Street. Clear to understand product information and good communication about rate changes and maturity.",
      "rating": 5,
      "date": "26th February 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Fantastic customer service",
      "text": "Fantastic customer service and wonderful help in-branch. Staff proactively offer relevant additional information and are very friendly.",
      "rating": 5,
      "date": "26th February 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Branch experience great, online poor",
      "text": "Branch is great and accessible. Sadly online access leaves a lot to be disputed. Clunky, difficult to use and lots of repetition and waiting around. Even telephone banking is not as easy as it could be.",
      "rating": 3,
      "date": "12th February 2025",
      "product": "Savings",
      "sentiment": "mixed"
    },
    {
      "title": "Competitive Cash ISA",
      "text": "The four access cash ISA pays a competitive interest rate. Coventry Building Society are good at communicating any changes to the interest rate. They now have an app as well.",
      "rating": 5,
      "date": "23rd November 2024",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "A good account for small savers",
      "text": "Opening an account online was a quick and easy experience. The interest rate is excellent and the added bonus of a monthly prize draw mad it even more attractive. The limit on monthly deposits is not very high but otherwise the account is very flexible.",
      "rating": 5,
      "date": "4th September 2024",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Competitive rates",
      "text": "They keep you informed about rate changes and are as quick to raise them as they are drop them when the base rate changes. They have competitive interest rates and I like being a member of a building society rather than a customer of a bank.",
      "rating": 5,
      "date": "29th August 2024",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Friendly staff and wide range of products",
      "text": "Friendly staff and wide range of products",
      "rating": 5,
      "date": "23rd August 2024",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Coventry building society used a forged mortgage.",
      "text": "Coventry building society used a forged mortgage to seize an oaps home. The court case caused him to stop eating and taking his medications. He died due to the shock. Coventry building society does it really take 10 years to show him the unsigned mortgage he never signed. Shame on you.",
      "rating": 1,
      "date": "19th July 2024",
      "product": "Savings",
      "sentiment": "negative"
    },
    {
      "title": "Great retail savings",
      "text": "very competitive rate and an very esay and functional websist/online portal, with multi level security.",
      "rating": 5,
      "date": "26th May 2024",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Competitive interest rate and you are saving with a...",
      "text": "Competitive interest rate and you are saving with a building society not a bank.",
      "rating": 4,
      "date": "25th May 2024",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Savings and Service very good",
      "text": "ISA four access good rate and allows transfers in and out. Savings products regular saver to access good rates and do not give tiered rates which are unfair to limit amount of interest on balances.",
      "rating": 4,
      "date": "23rd May 2024",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Human service and great value on maturities not just...",
      "text": "Human service and great value on maturities not just deals for new customers",
      "rating": 5,
      "date": "12th April 2024",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "customer service okay",
      "text": "Customer service is good but I found it difficult to log in .",
      "rating": 4,
      "date": "15th March 2024",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Great rates",
      "text": "Consistently provided strong interest rates across a range of products, noth new and older accounts.",
      "rating": 5,
      "date": "12th March 2024",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "You can rely on The Coventry.",
      "text": "Good online experience and if needed no waiting phone option available.",
      "rating": 5,
      "date": "2nd March 2024",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Isa Renewal",
      "text": "Isa renewal smooth, good interest rate , easy and effective to deal with",
      "rating": 5,
      "date": "2nd March 2024",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Great rates for savings.",
      "text": "I use their regular savings accounts. Great rates.",
      "rating": 5,
      "date": "27th February 2024",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Brilliant",
      "text": "Excellent interest rates and brilliant customer service. They once got something wrong with one of my accounts and quickly corrected it and offered compensation without me asking for it. Brilliant Building Society",
      "rating": 5,
      "date": "26th February 2024",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Always in the picture",
      "text": "Kept fully informed at all times. Their security features outsatanding.",
      "rating": 5,
      "date": "22nd February 2024",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Consistently provide good, competitive savings rates",
      "text": "Consistently provide good, competitive savings rates",
      "rating": 5,
      "date": "21st February 2024",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Easy to deal with and good rates",
      "text": "Easy to deal with and good rates",
      "rating": 5,
      "date": "18th February 2024",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Great cash ISA provider",
      "text": "I have been able to transfer my cash ISA to a new cash ISA issue from Coventry Building Society offering a better interest rate with ease.",
      "rating": 5,
      "date": "16th February 2024",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Consistently Good Rates",
      "text": "Great Range of Products. Competitive Rates. Good Web site and the new App is excellent and this has been launched based on Customer feedback so they really listen to Customers.",
      "rating": 5,
      "date": "16th February 2024",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Ethical and environmentally friendly",
      "text": "This building society offers really excellent interest rates and rewards loyalty. Also they’re a really ethical bank who consult their members on charity partners. Importantly it’s great to know that my money isn’t funding the climate crisis",
      "rating": 5,
      "date": "15th February 2024",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Good communication",
      "text": "Very clear in showing interest rates etc. Online and paper communication about all my accounts",
      "rating": 4,
      "date": "15th February 2024",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "The Coventry Building Society reward their loyalty",
      "text": "The Coventry Building Society reward their loyal customers by providing special loyalty products with great interest rates. They are also a certified B Corp so I feel good about investing with them and am likely to stay.",
      "rating": 5,
      "date": "15th February 2024",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "A great bank paying decent interest",
      "text": "A great bank paying decent interest",
      "rating": 5,
      "date": "15th February 2024",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Excellent experience opening a child saving account...",
      "text": "Excellent experience opening a child saving account and Coventry still have actual branches where you can do this.",
      "rating": 5,
      "date": "15th February 2024",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Excellent savings rates offered.",
      "text": "Excellent savings rates offered. Easy to register and deposit money online",
      "rating": 5,
      "date": "14th February 2024",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "simple to set up and good rates.",
      "text": "simple to set up and good rates. Logging into app could be simpler though. However quite happy.",
      "rating": 5,
      "date": "1st February 2024",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "I have had a few isolated problems but overall very...",
      "text": "I have had a few isolated problems but overall very good.",
      "rating": 4,
      "date": "31st January 2024",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Coventry BS is good.",
      "text": "Coventry BS is good. Savings rates are high. Customer service is good but done over the phone. The online management of products is easy.",
      "rating": 5,
      "date": "25th January 2024",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "On the ball",
      "text": "Always up to speed with market changes",
      "rating": 4,
      "date": "14th October 2023",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Still competitive and good service",
      "text": "I'm still using CBS for savings because they are proactive about increasing interest rates, they keep me informed, their internet banking site works well and they are still competitive.",
      "rating": 5,
      "date": "14th October 2023",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Pleasant Surroundings",
      "text": "Any changes in interest rates company sends mail and emails promptly.",
      "rating": 5,
      "date": "24th August 2023",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Absolutely terrible",
      "text": "Tried to withdraw funds using electronic trf but their system defaults to my full christian name so my bank did not recognise it. Told to complete withdrawal form for a cheque. 2 weeks later this was rejected because I opened the a/c online and they need specimen signature. Cut a [very] long story short - am still waiting for funds 4 weeks later. Staff all say different contradictory things. Phone line cuts you off. Poorest I have experienced in a very long time.",
      "rating": 1,
      "date": "18th August 2023",
      "product": "Savings",
      "sentiment": "negative"
    },
    {
      "title": "Great rates, increases quickly passed on.",
      "text": "Coventry BS have competitive rates and I like that they are a Building Society rather than a bank. They keep me updated about Bank of England rate rises and are quick to increase their own rates.",
      "rating": 5,
      "date": "11th August 2023",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Easy & Competetive",
      "text": "Always ahead of the pack for increasing interest credits. Coventry keeps in touch and easy for communicating.",
      "rating": 5,
      "date": "8th August 2023",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "MASSIVE FAIL!",
      "text": "Coventry Building Society account number 23683694 Coventry Building Society! I was always talking good way to my friends and brokers.... until I try to port my loan to another property. Coventry you hurt my so much! You broken me, you broken all my dreams all I was working extremely hard for 15 years! You are desgusting how you handle this case with porting my mortgage. I am absolutely broken now and efect my health condition currently! You can't imagine what you did to us. We came so far with selling my house, found the buyer, start proceeding with solicitor, buyer paid for the searches. I Also found property for myself, start proceeding, paid for the searches, so many people was involve with this transaction, brokers estate agents. We all waste money and 5 months from the selling my property to find out that you decline my mortgage. You wasted 2 months waiting and providing information from the time the aplication was sent to port the mortgage. You broke everything... bsolutely everything. We was very soon looking to complete this transaction. So many peope involved witht this one and you decision broke everyone dreams. Buyer received mortgage offer from his lender as well. My broker was working extremely hard in my case. I can't believe you decline. I just still can't believe what you did. I completed with property and after the time I try to sell the property because of the Street I live is unsafe. The people are very danger there and me and my partner we very worry of our safety. We have to always make sure our door and Windows are close all the time. I was attack few times already. We have group of people every evening in front of our house shouting, they are very agresive and doing strange things. We dont see our future at this house and make happy family at that house. Coventry you broke us! In first place you agreed to port our loan to another property and said the offer will bee issued in 48hours then you change the mind and decline. You waste my money i paid for searcher the property I was trying to purchase. What you did to us!",
      "rating": 1,
      "date": "24th June 2023",
      "product": "Savings",
      "sentiment": "negative"
    },
    {
      "title": "Rewards Long Term Savers",
      "text": "Always has near the top of the league savings rates and even better, rewards loyal customers with better rates than new customers",
      "rating": 4,
      "date": "11th April 2023",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Good reliable concern",
      "text": "The staff at the Coventry are always helpful. Gave a very good rate of interest when setting up accounts",
      "rating": 5,
      "date": "11th April 2023",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Junior ISA",
      "text": "Best interest rates in the UK - moved my children's accounts here",
      "rating": 5,
      "date": "6th April 2023",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Good interest rates",
      "text": "The best interest rates around for a savings account",
      "rating": 5,
      "date": "5th April 2023",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Good webdite and phone service",
      "text": "Easy to navigate website and efficient phone service support. Calls quickly responded to without extended wait time and annoying holding sound.",
      "rating": 5,
      "date": "3rd April 2023",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "EASY ON LINE ACCOUNT FACILITY",
      "text": "EASY TO UNDERSTAND LIMITED ACCESS SAVINGS ACCOUNT GOOD INTEREST RATE",
      "rating": 5,
      "date": "31st March 2023",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "High Interest fixed ISA",
      "text": "When interest rates started to rise, I moved from a low interest ISA into a high interest account for very small cost.",
      "rating": 5,
      "date": "30th March 2023",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Great savings accounts and ways to keep your money safe",
      "text": "really like this company, they have lots of different types of accounts, of which I have several as I really like how they are set out to keep your money safe. They also have good interest rates to lock your money away for a few years",
      "rating": 5,
      "date": "20th March 2023",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Easy to access",
      "text": "Easy to access account information. Unique offers for existing customers",
      "rating": 4,
      "date": "17th March 2023",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Ok but some advice confusing",
      "text": "I have been with CBS for some years. Recently when I took out an ISA the accompanying small print was confusing to say the least resulting in losing half my allowed investment. Very disappointing.",
      "rating": 3,
      "date": "17th March 2023",
      "product": "Savings",
      "sentiment": "mixed"
    },
    {
      "title": "Safe",
      "text": "I get excellent savings rates and feel my money is safe",
      "rating": 5,
      "date": "16th March 2023",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Security matters",
      "text": "The Coventry Building Society take security very seriously. I feel very confident that my money is safe with them",
      "rating": 5,
      "date": "16th March 2023",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Not The Leading, But The Best For Us",
      "text": "I opened a regular savings account with Cov BS a year ago. This was quick and easy to request online. Forms arrived soon after in the post, which required signatures. I returned these in a pre-paid envelope, and my account was opened in just over a week. Internet banking/log in is scure, and I receive regular emails inviting me to view our statement online. I have telephoned once, and visited in-branch once for unrelated reasons - the customer service I received in both instances was quick, professional and friendly. Email communication is regular, clear, and concise. I also regularly participate in a Coventry BS panel along with other account holders and also Cov BS staff members to discuss all aspects of banking with Cov BS, to participate in polls, and to answer questions (sometimes with the chance of winning a reward). Since opening my regular savings account the interest rate has risen several times in line with the base rate, and this is always acted upon promptly. I have since opened an easy access account. I like the set up of the society and its internet banking, which is easy to navigate, and easy to set up payments to. I feel my money is safe - there are no shareholders to satisfy! On that basis, I have no reason to consider changing to another bank or building society.",
      "rating": 5,
      "date": "10th March 2023",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Reliable",
      "text": "It helps having a local branch to sort out the wrinkles. On line big recent improvements and responsive to interest rates going up and informing customers.",
      "rating": 4,
      "date": "10th March 2023",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Overall good",
      "text": "Good rates, timely uprating, very efficient",
      "rating": 5,
      "date": "10th March 2023",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Great rates and options",
      "text": "Great rates and options of savings. Easy to set up online and staff also very friendly and helpful.",
      "rating": 5,
      "date": "28th February 2023",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Simple products with good interest rates",
      "text": "For both the isa and saving accounts, CBS have promptly raised interest rates to reflect changes to base rate. Some of the best rates out there, especially on the limited access accounts that still allow for 6 withdrawals a year within penalty.",
      "rating": 5,
      "date": "28th February 2023",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Coventry building society",
      "text": "Always helpful and efficient .Help given to maximise savings.Good company",
      "rating": 5,
      "date": "23rd February 2023",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Treat Existing Customers Fairly",
      "text": "Good savings interest rates especially for existing customers. They do send too many letters.",
      "rating": 4,
      "date": "23rd February 2023",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Great for savings",
      "text": "Have been using the regular savings account for the last few years - the best one I could find always!",
      "rating": 5,
      "date": "18th February 2023",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Excellent",
      "text": "Been with CBS for 40 years. As smart money goes, I have always felt safe and secure with them. Online or in ranch, helpful to a person.",
      "rating": 5,
      "date": "9th February 2023",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Competitive savings rates and members not shareholders profit.",
      "text": "I've moved nearly all my savings to Coventry and they continue to offer competitive interest rates and I would prefer to bse a building society member than make money for a bank.",
      "rating": 5,
      "date": "3rd February 2023",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Always first to look to increase savings rates",
      "text": "Market leading rates and quick to respond to BoE rate increases for savers",
      "rating": 5,
      "date": "2nd February 2023",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Great ISA rates and good service",
      "text": "This ISA had great interest rates, was easy to open and customer service is very good.",
      "rating": 5,
      "date": "1st February 2023",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Awesome service and savings rate",
      "text": "Easy to switch accounts, generous rates",
      "rating": 5,
      "date": "18th January 2023",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Terrible banking service",
      "text": "Ten years of banking with this society counts for nothing. I was locked out of my online savings account and when I tried to reset my password I was told by their system that they had no record of my account. This account held my life savings. I spent 1hr 10mins in their telephone system before someone spoke to me. I went though telephone security only to be told I could not transfer my money into the current account I had used with them for those ten years. I had to make a two hour round trip to try and transfer my money, spent another 30mins waiting to talk to a manager. I did not succeed. I left the branch still not knowing if my money would be transferred. Still locked out of my account I tried to ring again and was told by the recording I was 102nd in the queue! This has caused me so much stress over a two day period, they should be shut down and not allowed to operate until their systems are fit for purpose.",
      "rating": 1,
      "date": "28th October 2022",
      "product": "Savings",
      "sentiment": "negative"
    },
    {
      "title": "Coventry building society kill OAP",
      "text": "The Coventry building society used a forged mortgage to steal an OAPs home. The court case caused him to stop eating and taking his medication. He died a scared broken old man. Coventry building society does it really take 10 years to show him the unsigned mortgage he never signed. AVOID AVOID AVOID",
      "rating": 1,
      "date": "11th August 2022",
      "product": "Savings",
      "sentiment": "negative"
    },
    {
      "title": "Regular Saver",
      "text": "We opened our joint account online in April. The whole process took one week, and we were set up with easy to view and manage internet banking. I transfer money regularly to this account from another bank, via internet banking. Coventry BS takes account security seriously, though it is straightforward to access your account. So far I have only needed to contact the Cov by telephone, and that was a query while the account was initially being set up; the lady I spoke with was professional, friendly and helpful. Since opening our account Cov BS have honoured the inflation rises by raising the interest rate some 3 times now (not all banks/building societies do this, and they're not obliged to). I also joined their separate site which sends out invites now and again (via email) to answer the odd survey or question. For one short survey I won £200 in M&S vouchers! I get the impression the Cov genuinely listens to feedback. Cov BS moderators regularly converse with customers on the blog section, and anyone can start a thread - most of the stuff on there is interesting with very few gripes! Sure, it's not the best rate out there, yet I like their set up and their features. They have a lot of accounts on offer - something for everyone, no matter what age. Wish we'd got involved with them sooner.",
      "rating": 5,
      "date": "5th August 2022",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Very Helpful staff and a great rate .",
      "text": "Been with CBS for quite a number of years always found them extremely helpful , Often one of the best interest rates around.",
      "rating": 5,
      "date": "24th June 2022",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Received excellent service",
      "text": "Staff Avni Gandhi was very helpful.Provided excellent service.",
      "rating": 5,
      "date": "23rd June 2022",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Devious and incompetent",
      "text": "You want to close an account ?? LOL best of luck. Complain !!! ?? don't bother. Accountable ?? err no .",
      "rating": 1,
      "date": "7th May 2022",
      "product": "Savings",
      "sentiment": "negative"
    },
    {
      "title": "Best ever experience with opening accounts",
      "text": "Was so experienced with information given",
      "rating": 5,
      "date": "30th March 2022",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "The best savings rates available from a major building society",
      "text": "The Coventry frequently launches new savings accounts with very competitive interest rates, especially its fixed rate bonds and ISAs. The management listen to what the members say and work in the members' best interests which is more than can be said for the high street banks and Nationwide.",
      "rating": 5,
      "date": "1st February 2022",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Great Range of Savings Products",
      "text": "Coventry is probably my favourite Bank/BS. Their Rates are becoming less competitive but I love their Dashboard, the fact that one can view Balances and Transaction without the Phone Call Challenge (only needed to do transactions). I like the new design of the DashBoard and the Range of Products. But I also like that they reach out for feedback from their Customer on how to improve.",
      "rating": 5,
      "date": "23rd January 2022",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Disgusted by their actions",
      "text": "After reading online an article about how the Coventry building society cheated 2 OAPS out of their home of 40 years . The ordeal caused 1 OAP to die a broken man. My wife was appalled by the Coventrysite action and will transfer her account to another Bank. Avoid Avoid Avoid",
      "rating": 1,
      "date": "5th January 2022",
      "product": "Savings",
      "sentiment": "negative"
    },
    {
      "title": "refusing to close my account",
      "text": "2 weeks and CBS still refusing to close my account. This establishment think its THEIR money and not the customers money. Ignore them at all costs",
      "rating": 1,
      "date": "5th November 2021",
      "product": "Savings",
      "sentiment": "negative"
    },
    {
      "title": "You're a criminal",
      "text": "Bad experience at the Highworth branch. Got treated like a money laundering criminal. Was asked to provide proof of a private sale of a motorcycle. I was explicit concerning the sale and when asked how I could provide further evidence the manager said I could've (and I quote) taken a screenshot of the eBay advert. I was astonished. The end result was that they just wouldn't believe the money was from an honest transaction and refused to deposit less than £3000. So I closed my account and went to the Post Office and paid it in there. What makes me laugh is that the manager had no idea about motorcycles and I could've shown him a photo of a pram and he wouldn't have known the difference.",
      "rating": 1,
      "date": "11th August 2021",
      "product": "Savings",
      "sentiment": "negative"
    },
    {
      "title": "Sharp practice over interest rates and no communication",
      "text": "I opened a Double Access Saver (online) account with the Coventry paying 1.2% interest on 22 September 2020. While preparing my tax return for the 20/21 year, I noticed from the end of year statement issued by the Coventry in April that the account was listed as a Limited Access Saver (online) account paying 0.55% interest. I queried this by phone & was told that the Society had supposedly sent me an email on 10 February telling me of this change. No such e-mail was received. I complained about this, and was told that as far as the Coventry was concerned, it had met its obligations. And so, on the back of a single email, of which I have seen no evidence whatsoever, the Society believes it can unilaterally close a customer’s account and open another one on considerably reduced terms – in this instance a c. 70% interest rate reduction - without first seeking consent. Unlike other financial organisations, the CBS feels no need to ensure that a customer has received an email on such matters by inviting a response. It doesn't believe it's necessary to issue a follow-up confirmation either electronically or via the post. I see that it subsequently ‘reissued’ the Double Access several times in Autumn at a continuously lower interest rate. This in itself doesn't inspire confidence. My extended family & I have been customers of the Coventry for 20 years. It's a shame that, having once traded on its ethical reputation, the Coventry now freely resorts to sharp practices & treats its loyal customers with such contempt. My family will be taking its custom elsewhere. Not that its managers will care, of course.",
      "rating": 1,
      "date": "6th July 2021",
      "product": "Savings",
      "sentiment": "negative"
    },
    {
      "title": "Good rate",
      "text": "Easy to open a saving account on line and manage it on line. best rate in town at the time of opening.",
      "rating": 5,
      "date": "4th April 2021",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Good interest rate in comparison",
      "text": "Opened as best savings interest of the day. Been reduced regularly since but still slightly better than the rest. Only gripe would be to add a SMS authentication option as well as automated call - not.everone can take a call!",
      "rating": 3,
      "date": "11th March 2021",
      "product": "Savings",
      "sentiment": "mixed"
    },
    {
      "title": "Successful Investment",
      "text": "I invested lump sum in an ISA after seeing the rate at the time- content investor .",
      "rating": 5,
      "date": "18th January 2021",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Coventry b soc Online not recommended",
      "text": "A year ago Internet Banking was easy until I was locked out! Trying to access a new Internet Account proved very long winded and in the end I gave up and withdrew funds except for bonds. Not recommended! M King",
      "rating": 2,
      "date": "11th August 2020",
      "product": "Savings",
      "sentiment": "negative"
    },
    {
      "title": "Still living in the 20th century",
      "text": "tried to open an account online - the normal way to do it nowadays. All that happens is that they send you an envelope of paper which took so long to arrive I had forgotten that I had made the application. not sure I can be bothered frankly",
      "rating": 1,
      "date": "29th May 2020",
      "product": "Savings",
      "sentiment": "negative"
    },
    {
      "title": "Excellent service",
      "text": "Always kept informed - good rates - no harrassing!!",
      "rating": 5,
      "date": "24th May 2020",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Good savings product",
      "text": "Receive a decent interest rate for saving a set amount each month to be held for a fixed period of time. Easy to set up online. Staff available to talk with on the phone for help and guidance if required.",
      "rating": 5,
      "date": "9th February 2020",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Savings Accounts",
      "text": "Friendly & very easy to get through to on phone - good if not great rates but talking to real people who are happy to help makes the difference",
      "rating": 4,
      "date": "5th February 2020",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Fantastic Service",
      "text": "Always looking after our money and giving the best savings rates on the market.",
      "rating": 5,
      "date": "19th January 2020",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "The best",
      "text": "I like Coventry Building Society. They are up to date and offer some good rates of interest across their products. I have recently opened an easy access saver which gives one of the best interest rates out there.",
      "rating": 5,
      "date": "16th January 2020",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Best Incompetant Building Society 2019 - Coventry",
      "text": "Still waiting for my WEB ID three months after opening an account. Coventry are unable to explain why I havn't received my web id. They can't supply it in branch, on line or by post. In the 21st century this has to be the most incompetant building society ever.",
      "rating": 1,
      "date": "10th January 2020",
      "product": "Savings",
      "sentiment": "negative"
    },
    {
      "title": "Frustrating to set up and register online",
      "text": "I have just opened a savings account with them and I have never before found setting up and registering for online banking so annoying, long-winded and frustrating! I almost gave up with the amount of paperwork and failed attempts I made! However, the 2.5 % interest is the best I could find on the market at the moment with a maximum of £500 a month paid in for a year.",
      "rating": 2,
      "date": "22nd November 2019",
      "product": "Savings",
      "sentiment": "negative"
    },
    {
      "title": "Friendly and helpful staff",
      "text": "Great staff at our local Coventry Building Society - patient and helpful",
      "rating": 5,
      "date": "13th January 2019",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "No brainer",
      "text": "Opened Junior Isa for both my children, they have the best rates and they are a company I trust. Can't go wrong. Highly recommended.",
      "rating": 5,
      "date": "19th November 2018",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Excellence",
      "text": "Both me & my spouse have used this company for a few years & have been consistently impressed by their professionalism, loyalty & savings rates nearly always above those offered by other more lauded & popular organisations who invariably fall down badly in the customer care department. Coventry provide a service for all & do not push their clients down the current road of insisting on internet banking, again unlike the more 'usual suspects'. They cater for all in that they deal in branch, by post, by phone & online. I cant recommend them highly enough & its been a pleasure speaking with their customer advisors.",
      "rating": 4,
      "date": "26th May 2018",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Genuine customer first approach",
      "text": "The Coventry do exactly as it says on the tin, which is refreshing in this day and age - they put the customer first.",
      "rating": 4,
      "date": "4th April 2018",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Reliable but difficult",
      "text": "I feel as though my money is very secure with this company, I've had great customer service in every experience but I've had trouble with getting access to my ISA almost every time even though I have the right documentation, it takes a while.",
      "rating": 4,
      "date": "10th February 2018",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "A trustworthy provider of savings accounts",
      "text": "The Coventry Building Society is the only savings account provider I have found that consistently pays good rates of interest, has never tried to move my money into low interest accounts and has never offered me poorer rates than new investors. If only all financial institutions showed such loyalty to long term customers.",
      "rating": 5,
      "date": "23rd November 2017",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Honest and respectable",
      "text": "An honest and respectable company that treats it's customers fairly.",
      "rating": 5,
      "date": "15th November 2017",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Good service and interest rate",
      "text": "Very easy to set up and transfer in old cash ISA. Great customer service when contacting the bank and good interest rate.",
      "rating": 5,
      "date": "13th November 2017",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "No-brainer!",
      "text": "I've had accounts with the Coventry for many years and have never seen a reason to leave. Their interest rates are generally a little above that of their competitors (vital in these times of such pitiful returns) and they reward loyalty by keeping rates on existing accounts a little ahead of their newer equivalents. Also the Coventry's website is a doddle, even for a technophobe like me!",
      "rating": 5,
      "date": "8th November 2017",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Good service",
      "text": "I found it easy to set up my account, but it was difficult to initially access the online banking service. Interest rates are reasonably competitive, and the customer service has been good when I've needed to contact them.",
      "rating": 4,
      "date": "4th July 2017",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Redisign /simplify online/telephone/security",
      "text": "The most obstructive and cumbersome security questions and codes that i have ever experienced. They involve swapping postal communications just to set up and now a new additional code grid has been sent to me. I have given up trying to communicate with them.",
      "rating": 1,
      "date": "2nd June 2017",
      "product": "Savings",
      "sentiment": "negative"
    },
    {
      "title": "Easy Access ISA",
      "text": "Phoned up to open easy access Isa and they told me over the phone that the interest rate was going up the following day which was a lovely surprise and quite unusual",
      "rating": 5,
      "date": "30th March 2017",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Great face to face service plus online services that actually work.",
      "text": "I have had several complicated transactions to negotiate with The Coventry over the past year and they could not have been more helpful. They followed the death of my father and whilst other companies seemed to make the process even more traumatic , The Coventry went out of their way to make it as pain free and simple as possible . I really cannot fault their customer service",
      "rating": 5,
      "date": "11th February 2017",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Good interest rates offered, strong security set up for internet account",
      "text": "Good interest rates, good online security - lots of steps for logging in",
      "rating": 4,
      "date": "24th December 2016",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Really is Easy Access ISA (4)",
      "text": "Easy to set up this ISA on line, but I missed the comment that I couldn't transfer in ISA balances from previous years. When the form came to say I was transferring in this year's ISA balance it was confusing but when I phoned for help they were very helpful. Only drawback? The amount of post I received, each by separate envelope, welcome letter, passcode, letter about transfer, grid for reference on phone queries, etc. I got 4 in just one day! Certainly communicative.... overall happy with service and the interest rate is the best I could find for easy access ISA at the moment.",
      "rating": 4,
      "date": "20th December 2016",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Friendly staff and good deals",
      "text": "Coverage is not national but that provides it with a more personal feel and a good customer focus.",
      "rating": 5,
      "date": "18th February 2016",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Good rates and helpful staff",
      "text": "Good range of accounts and a friendly local branch",
      "rating": 5,
      "date": "27th January 2016",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Fantastic savings account",
      "text": "Great ISA account with a competitive interest rate. Customer service is good when contacting them.",
      "rating": 5,
      "date": "24th December 2015",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "unprofessional",
      "text": "always a problem, unable to talk to manager when asked. Staff becoming 'annoyed' easily",
      "rating": 2,
      "date": "8th November 2015",
      "product": "Savings",
      "sentiment": "negative"
    },
    {
      "title": "Easy to use",
      "text": "I have an online ISA savings account which I've had no problems with. It was easy to open, I feel reassured by the high levels of security needed to access the account, and they promptly pay a competitive interest rate on my savings.",
      "rating": 4,
      "date": "9th August 2015",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Exactly what i want from a building society.",
      "text": "The staff are always helpful and friendly, the branch i use is well laid out and clean and also whenever i carry out a deposit, withdrawal or change to my account, it was done fairly quickly.",
      "rating": 5,
      "date": "10th April 2015",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Changing Address Problem",
      "text": "I've been trying to change my account address but it is proving very difficult. No response from web forms. Impossible to implement advice from their telephone helpline. I just want to close my account now!",
      "rating": 1,
      "date": "7th April 2015",
      "product": "Savings",
      "sentiment": "negative"
    }
  ]
}