{
  "society": "Darlington Building Society",
  "slug": "darlington-building-society",
  "smpUrl": "https://smartmoneypeople.com/darlington-building-society-reviews/products",
  "totalReviewsOnSMP": 13253,
  "avgRating": 4.86,
  "scrapedAt": "2026-02-06T15:37:22.591845+00:00",
  "reviews": [
    {
      "title": "Not thorough, waste of my time",
      "text": "I waited 3+ weeks for my application to process, with them gathering info piece by tiny piece, only to be told that they couldn't ever have processed it because the value of the property it too low. This should've been checked before I instructed solicitors, and before I paid the valuation fee. The whole process was a huge waste of my time and wouldn't have occurred if they'd just read my application in the first place (which I repeatedly asked my mortgage advisor to do). I am being refunded the valuation but I'm most upset about the waste of my time, and the potential of losing the house I am trying to purchase.",
      "rating": 1,
      "date": "4th February 2026",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "Nothing much but no concern, just only concerned abo...",
      "text": "Nothing much but no concern, just only concerned about the rate which seems high, this needed to be reviewed",
      "rating": 5,
      "date": "1st February 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "All was ok and thats all i have to say.",
      "text": "All was ok and thats all i have to say. Thank you.",
      "rating": 4,
      "date": "31st January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Four years ago we were looking for an affordable mor...",
      "text": "Four years ago we were looking for an affordable mortgage, although working many companies wouldn’t lend to us. Our home was a RTB and we could buy with 50% off which was amazing . It wasn’t just a house with lots of land it was a forever home. I was born in our property and wanted to secure the future for my son to ensure he had a roof over his head if anything was to happen to me. Darlington building society have great customer service, the staff are knowledgeable and very helpful. In 2025 we renewed another fixed rate mortgage. The process was very quick and efficient. We live in north east Derbyshire which is miles away from Darlington building society . Darlington gave us good rates. Thank you to Darlington for helping us secure a future for my family. Nobody else had lived in this house from first being built, so for me it was important to keep this property in our family. I will always be grateful to Darlington. I will always highly recommend The Darlington Building society.",
      "rating": 5,
      "date": "30th January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Beyond the usual box ticking the best of British!",
      "text": "Darlington provided a mortgage when I and my income didn't 'tick the box' saving a much loved home, with understanding, competent customer service. They are also a genuine building society rooted in their local community.",
      "rating": 5,
      "date": "29th January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Brilliant Mortgage Service",
      "text": "I have just gained a new mortgage with Darlington, the process could not have been easier. Clarity of process from start to finish and we have been kept informed all the way as to what was happening and when our payments would be. No hassles just great service and product, I would strongly recommend Darlington.",
      "rating": 5,
      "date": "29th January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Everything has already been smooth and straightforwa...",
      "text": "Everything has already been smooth and straightforward with Darlington Bank. I've never needed to contact them for help as everything just happens as it should.",
      "rating": 5,
      "date": "29th January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Always at the top of their game!",
      "text": "I do not tend to make that many physical visits to the Darlington branch, but whenever I do, I never consider it to be a chore, as I know that from walking through the door I will be treated courteously and professionally at all times. That instils in me, the confidence to know that I am dealing with, and that I am part of, one of the best financial businesses in the North-East of England.",
      "rating": 5,
      "date": "29th January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Happy customer",
      "text": "We built our own house. Darlington was helping with every stage of process",
      "rating": 5,
      "date": "29th January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Thank you for hearing me.",
      "text": "I reached out to Darlington BS when having difficulty getting a mortgage after being told I would have to accept an adverse credit mortgage at higher rates. I did not have adverse credit other than a dispute with an energy company that was with the ombudsman, but was being turned down by lenders even my own bank that could see my credit history and finance management. It was demoralising. My friend told me how Darlington BS had listened to her and gave her a standard mortgage so I contacted them. They asked me to provide a full credit report and their underwriters would make a decision, and fortunately found in my favour providing me with a good mortgage and faultless communication and help. I have recommended them to many people since. Thank you DBS.",
      "rating": 5,
      "date": "29th January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent customer service.",
      "text": "Excellent customer service. Contacted me weill ahead of the end of Fixed Term Mortgage and offered me a new Fixed Rate. Very pleased with the new rate.",
      "rating": 5,
      "date": "29th January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "They were able to get me my morgage even though I wa...",
      "text": "They were able to get me my morgage even though I was an older customer",
      "rating": 5,
      "date": "29th January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Helpful, friendly and great communication",
      "text": "Very helpful and friendly staff, great communications to members and easy to contact them / speak to someone. Range of suitable products for us which fit our needs. Very responsive and helpful.",
      "rating": 5,
      "date": "29th January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Customer",
      "text": "Excellent customer service, replied every query",
      "rating": 5,
      "date": "29th January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "I was very pleased with the help we got with process...",
      "text": "I was very pleased with the help we got with processing the forms and documents.",
      "rating": 5,
      "date": "14th January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Paula Marshall provided an excellent service, she re...",
      "text": "Paula Marshall provided an excellent service, she responds to calls and messages promptly and couldn't be any more helpful",
      "rating": 5,
      "date": "1st December 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Frustrating at times.",
      "text": "Frustrating at times. Difficult to contact specific people who don’t ring back",
      "rating": 3,
      "date": "17th November 2025",
      "product": "Mortgages",
      "sentiment": "mixed"
    },
    {
      "title": "Mortgage Adviser (Paula) answered all of my questions.",
      "text": "Mortgage Adviser (Paula) answered all of my questions and provided extra and relevant information. After speaking with her, I feel confident regarding moving to a new property should I decide to do so. A follow-up email was received confirming the information gained during our earlier phone conversation.",
      "rating": 5,
      "date": "28th October 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great customer service",
      "text": "Customer service was outstanding when obtaining original mortgage and then moving to a new property. Very quick responses and friendly people. Cheryl in particular was amazing!",
      "rating": 5,
      "date": "23rd October 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Thank you, Paula, for your excellent support",
      "text": "My wife and I have recently had the pleasure of dealing with Paula Marshall regarding our BTL mortgage application, and I could not be more pleased or impressed with the outstanding service we received. Paula has demonstrated high levels of professionalism, coupled with a very much appreciated personal attentiveness. She has been incredibly responsive, efficient, and helpful throughout the process. Paula's communication has been clear and prompt; she has taken the time to clarify any questions I have posed in what has been a new experience for us and has kept us informed at every stage, ensuring everything progressed smoothly. It has been reassuring to know our application was in capable hands. Paula’s approachable manner and attention to detail made what could have been a stressful process much easier. This level of one-to-one personal attention is unusual in this 'virtual age' but it is very much welcomed. Thank you, Paula, for your excellent support and customer care — a true credit to Darlington Building Society!",
      "rating": 5,
      "date": "22nd October 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "The staff were extremely helpful with helping sort a...",
      "text": "The staff were extremely helpful with helping sort a last minute mortgage, particularly Linda, Louise and Sehreena. They went above and beyond to help sort last minute complications from my solicitors.",
      "rating": 5,
      "date": "8th October 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "We was a bit unsure whether to apply for additional...",
      "text": "We was a bit unsure whether to apply for additional funds for home improvements or just sell up and move after initially applying for additional funds we changed our minds .Paula Marshall was absolutely brilliant with us she was very understanding and very patient and not at all bothered by our indecision even though we had clearly wasted her time.",
      "rating": 5,
      "date": "2nd October 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Locked out of system",
      "text": "Very helpful after getting locked out of my account. Simon McCabe was very helpful in getting me back in.",
      "rating": 5,
      "date": "2nd October 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent Service all around",
      "text": "I have always found them to be helpful and informative",
      "rating": 5,
      "date": "16th September 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "All of your staff are very professional and polite why",
      "text": "All of your staff are very professional and polite why",
      "rating": 5,
      "date": "20th August 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Cannot thank the team enough!",
      "text": "Spoke with Paula who has helped me step by step through my transfer of equity and she was patient and understanding along with the rest of the team who did everything they could to assist me, I am over the moon with my outcome and cannot thank the team enough!",
      "rating": 5,
      "date": "6th August 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Paula was really helpful, polite and supportive",
      "text": "Paula was really polite, very helpful and supported me through the whole process. She helped me every step of the way going above and beyond to get my mortgage approved.",
      "rating": 5,
      "date": "5th August 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Mortgage Advice & Application",
      "text": "We applied for a single owner joint borrower mortgage to support our son buying his home . The Mortgage Adviser Ann Walpole was excellent throughout the process. It was not just the quality of advice provided and the service , it was the fact that Ann demonstrated real empathy & went the extra mile to ensure that the mortgage was in place to allow our son to purchase his home.",
      "rating": 5,
      "date": "29th July 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "In branch service review",
      "text": "Your mortgage staff are very helpful and went the extra mile to reassure us that changes would be made in a timely manner.",
      "rating": 5,
      "date": "29th July 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "An easy experienc",
      "text": "An easy experience with the mortgage advisor spending time to gather all the relevant information before offering advice.",
      "rating": 5,
      "date": "25th July 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "A breath of fresh air...",
      "text": "Dealing with the Darlington is like a breath of fresh air, having had other mortgages with a range of lenders, Darlington is the one I have gone back to - and would do so again. They are people wo are dealing with people - and their company ethics are actually shared by the people who work for them - it's not just an advertising strap line. Our designated contact person Ann W has been absolutely amazing, going above and beyond to help us with the bureaucracy that has come from all the other people who you have to deal with when taking out a mortgage. She has been patient and kind and you cant ask for better.",
      "rating": 5,
      "date": "24th July 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "On talking to the team, I found them to be very help...",
      "text": "On talking to the team, I found them to be very helpful. When talking to Paula, her help and advice was superb. All telephone appointments were met on time and nothing was too much trouble.",
      "rating": 5,
      "date": "19th July 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Paula was cordial but thorough and searching in asce...",
      "text": "Paula was cordial but thorough and searching in ascertaining relevant facts. This was done in a relaxed atmosphere. in a pleasant office. Our meeting could not have been more professional. Thank you.",
      "rating": 5,
      "date": "15th July 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Ann the mortgage advisor could not be more helpful o...",
      "text": "Ann the mortgage advisor could not be more helpful of what we wanted to know excellent customer service",
      "rating": 5,
      "date": "1st July 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "A Very Positive Experience",
      "text": "Cheryl was efficient, helpful and approachable throughout the process. Made me feel very much at ease. Thankyou.",
      "rating": 5,
      "date": "28th June 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "I can't recommend DBS enough , first class service a...",
      "text": "I can't recommend DBS enough , first class service as always... I've just recently renewed my mortgage with DBS saving a unbelievable ££230 per month thanks to both Brian and Paula",
      "rating": 5,
      "date": "24th June 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Customer Service at its best!",
      "text": "Suzanne Eccleston explained all that I needed to know regarding switching mortgages in a clear and concise manner. She was friendly and helpful and put me at ease. I have to say that since getting our Mortgage from you in 2016 I have found my few interactions with your staff to be easy and they are all so friendly and helpful. Keep it up",
      "rating": 5,
      "date": "21st June 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "My mortgage advisor was very personable and helpful...",
      "text": "My mortgage advisor was very personable and helpful but would have liked to have met face to face in the first instance.",
      "rating": 5,
      "date": "29th May 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Easy to talk too and excellent service",
      "text": "Easy to talk too and excellent service",
      "rating": 5,
      "date": "23rd May 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "My experience has been brilliant, Paula has helped m...",
      "text": "My experience has been brilliant, Paula has helped me out every time I had a question or needed assistance.",
      "rating": 5,
      "date": "19th May 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "easy, simple and quick!",
      "text": "easy, simple and quick! took the stress out of the mortgage shopping.",
      "rating": 5,
      "date": "12th May 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Mortgage question answered quickly and very clearly",
      "text": "I asked a question about my mortgage and received a comprehensive and very informative reply swiftly by return. It is very much appreciated.",
      "rating": 5,
      "date": "8th May 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "had a meeting today with a lovely lady paula, she wa...",
      "text": "had a meeting today with a lovely lady paula, she was so helpful explained really clearly and talked us through the the whole process., thank you very much paula for a very pleasant experience",
      "rating": 5,
      "date": "7th May 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Easy Process!",
      "text": "Made buying our first property easy. Great communication from the team.",
      "rating": 5,
      "date": "30th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Mortgage Application",
      "text": "We recently used a mortgage advisor (Paula) from Darlington Building Society and couldn’t be happier with the service we received. From start to finish, the process was smooth, professional, and reassuring. Paula was incredibly knowledgeable, taking the time to explain all of our options in clear, straightforward terms and making sure we felt comfortable at every step.",
      "rating": 5,
      "date": "25th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Being a member of a Society not just a client",
      "text": "Darlington Building Society staff have always treated me very much as a person rather than primarily as a source of income. During the mortgage application procedure, their advisor made sure I had the product that was exactly right for my family and our circumstances. Now, we are nearly 5 years into our financial relationship and I have always appreciated the human person-centred approach that the society's staff have shown whenever I have had need to contact them. The staff have always made me feel truly like a member of the Society rather than just a client.",
      "rating": 5,
      "date": "23rd April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very helpful and keep you informed when fixed rate c...",
      "text": "Very helpful and keep you informed when fixed rate coming to an end. Offer competitive deals to existing customers",
      "rating": 5,
      "date": "22nd April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Seamless!",
      "text": "Seamless, with helpful newsletters sent out regularly.",
      "rating": 5,
      "date": "22nd April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "The personal touch is second to none.",
      "text": "The personal touch is second to none. My mortgage experience was made all the smoother and with minimal stress from the mortgage team. They assisted me way over and beyond what was expected of them. 100% recommend Darlington BS.",
      "rating": 5,
      "date": "22nd April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent support from outside the UK",
      "text": "We had to deal with Darlington from abroad to rearrange a buy to let mortgage, and they made the task stress-free. Their customer service was easy to navigate and excellent support.",
      "rating": 5,
      "date": "21st April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very helpful and understanding",
      "text": "We found Darlington Building Society very helpful with our situation and we're great in supplying us with a great mortgage. Also so easy to renew after our two year fixed rate was up. They gave plenty of options, fully recommend.",
      "rating": 5,
      "date": "20th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great buy to let mortgage",
      "text": "I've had this buy to let mortgage for many years, very pleased with product which is reviewed every 2 years, and customer service is excellent",
      "rating": 5,
      "date": "19th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Mortgage",
      "text": "Looking at mortgage product needed to purchase my flat, the best option for me was Darlington Building society. A really good website and portal. Very happy with the service provided to date. I would recommend Dalington to family and friends.",
      "rating": 5,
      "date": "19th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Darlington customer service is amazing",
      "text": "Communicating with darlington has always been very easy! Since the very beginning I've worked with the same person and that makes everything super easy because they understand my situation without me having to explain again",
      "rating": 5,
      "date": "18th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent and friendly customer service.",
      "text": "Excellent and friendly customer service.",
      "rating": 5,
      "date": "17th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "It's ok .But staff need to learn politeness& C Service.",
      "text": "It's ok . Regularly get updates which is good . Spoke over the phone 2 times didn't find them polite. My mortgage ws/is 6.89 % which ridiculous but at the time interest was rising by Bank of England every other week",
      "rating": 5,
      "date": "17th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great Service, great people",
      "text": "Darlington Building Society were one of the very few companies offering mortgages to the over 65 age group when we got our mortgage from them 9 year’s ago. They have looked after us well since then and will stay with them until mortgage free in a few years time. Customer service personnel are so helpful.",
      "rating": 5,
      "date": "17th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very efficient without any hassle.",
      "text": "Very efficient without any hassle.",
      "rating": 5,
      "date": "17th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Easy, smooth & reliable",
      "text": "An easy, smooth & reliable service, I am so impressed. I had unusual circumstances and am thankful Darlington worked with me for my mortgage.",
      "rating": 5,
      "date": "17th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very helpful in all aspects.",
      "text": "Very helpful in all aspects. Quick and easy to deal with.",
      "rating": 5,
      "date": "17th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great experience with Darlington Building Society!",
      "text": "Great experience with Darlington Building Society! The process was smooth, staff were helpful, and everything was handled professionally. Highly recommend for a stress-free mortgage!",
      "rating": 1,
      "date": "17th April 2025",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "Mortgage Review",
      "text": "It was all done on line or telephone - easy process",
      "rating": 5,
      "date": "17th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Darlington BS excellent service by far",
      "text": "Darlington Building Society have come as a boon to us at the right time. We got our 1st house mortgage approved by them when none of banks were ready to pitch in! Always been a great service working with representatives of DBS. Cheers to team.",
      "rating": 5,
      "date": "17th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "1st time buyer and Darlington have made it all very...",
      "text": "1st time buyer and Darlington have made it all very simple, Easy to get hold of when I needed them from start to finish and offered me the best deal.",
      "rating": 5,
      "date": "17th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Seamless to deal with.",
      "text": "Seamless to deal with. Always a person to speak to, and always great service. So much better than the endless automated robots at other banks.",
      "rating": 5,
      "date": "17th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "No issues",
      "text": "I never had issues and when I contacted the customer service team they were polite and helpful. I would just say to improve the email communication as before I called a sent several emails and never had a response but once I called every thing was sorted",
      "rating": 5,
      "date": "17th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "a very pleasant journey",
      "text": "It has been a very pleasant journey so far. Very good rates and extremely professional team.",
      "rating": 5,
      "date": "16th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Have had a lovely experience from start to finish wh...",
      "text": "Have had a lovely experience from start to finish when applying for my Mortage",
      "rating": 5,
      "date": "16th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Clear explanations and supportive staff.",
      "text": "Clear explanations and supportive staff.",
      "rating": 4,
      "date": "16th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent customer service , amazing rate charges.",
      "text": "Excellent customer service , amazing rate charges. would definitely recommend!.",
      "rating": 5,
      "date": "16th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "All staff friendly, knowledgeable about products.",
      "text": "All staff friendly, knowledgeable about products. Nothing is to much trouble. Excellent customer service.",
      "rating": 5,
      "date": "16th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Fab service for mortgages and easy to contact",
      "text": "Fab service for mortgages and easy to contact",
      "rating": 5,
      "date": "16th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Good service and informative thank you for giving re...",
      "text": "Good service and informative thank you for giving reliable information and service",
      "rating": 5,
      "date": "16th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Porting with Darlington.",
      "text": "Easy to get through when calling. Staff are knowledgeable and always willing to help. Currently utilising the porting system to move to another property, which is very affordable.",
      "rating": 5,
      "date": "16th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "I have been with Darlington building society since A...",
      "text": "I have been with Darlington building society since August 2020 and I have always received excellent service. Darlington gave me a mortgage when other lenders wouldn’t. I recently had to speak to Darlington and the 2 officers I dealt with were very helpful. Although they couldn’t solve the problem they gave me information to investigate different avenues. They were very professional. This is a smaller building society but they know how to deliver good customer service.",
      "rating": 5,
      "date": "16th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "One of few lenders to welcome older applicants and a...",
      "text": "One of few lenders to welcome older applicants and at reasonable interest rate. Always helpful with queries and clear informative updates.",
      "rating": 5,
      "date": "16th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "New customers to Darlington Building Society.",
      "text": "New customers to Darlington Building Society. All good so far.",
      "rating": 5,
      "date": "16th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "We are about to come to the end of our 25 year mortg...",
      "text": "We are about to come to the end of our 25 year mortgage. Some years ago we came into financial difficulty and all the worry that brings. The meetings and discussions we had made life so much easier, the staff were brilliant. They did not judge and just helped us decide what was best for us. Here we are a couple of payments to go and we still have our house.",
      "rating": 5,
      "date": "16th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Efficient friendly & professional Staff.",
      "text": "Efficient friendly & professional Staff. Always ask if there is anything else they can help with.",
      "rating": 5,
      "date": "16th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "My experience with Darlington was exceptional, espec...",
      "text": "My experience with Darlington was exceptional, especially during an incredibly challenging period in my life. The COVID-19 pandemic caused significant cash flow issues for me, which were further compounded by ill health. Despite these difficulties, Darlington provided unwavering support and understanding until I was able to reenter employment. Their customer service team was outstanding—compassionate, professional, and always willing to assist. I am truly grateful for their patience and dedication during such a tough time. Darlington went above and beyond to help, and I cannot recommend them highly enough. Thank you, Darlington (especially Brian), for your exceptional service and support when I needed it most.",
      "rating": 5,
      "date": "16th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very informative and responds to our calls",
      "text": "Very informative and responds to our calls",
      "rating": 5,
      "date": "16th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Been with you for 10 yrs.",
      "text": "Been with you for 10 yrs. Excellent service",
      "rating": 5,
      "date": "16th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great staff and good products",
      "text": "I have been with Darlington since buying my house four and a half years ago. The people I have dealt with have been friendly, efficient and have handled my initial mortgage, plus refinances very well.",
      "rating": 5,
      "date": "16th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very difficult to get an update.",
      "text": "Very difficult to get an update. No App to track progress",
      "rating": 3,
      "date": "16th April 2025",
      "product": "Mortgages",
      "sentiment": "mixed"
    },
    {
      "title": "Good experience Nice people.",
      "text": "Good experience Nice people. Very fast",
      "rating": 5,
      "date": "16th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "We were recommended Darlington building society,",
      "text": "We were recommended Darlington building society, I can’t remember who. We were surprised that the whole procedure was manual but being older we was perfectly happy with the process, it was in-depth and thorough. We found the interest rate to be competitive. We would recommend to other people.",
      "rating": 5,
      "date": "16th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Rates are not that competitive.",
      "text": "Rates are not that competitive. I asked about reducing mortgage term but they wanted £70 to do this which I didn't think was fair value.",
      "rating": 3,
      "date": "16th April 2025",
      "product": "Mortgages",
      "sentiment": "mixed"
    },
    {
      "title": "Simply fabulous!!!",
      "text": "I have had my mortgage with them for almost 5 years now. No issues at all. Excellent at helping - easy to contact, I am also able to regularly receive updates thru email and post. I never had any issue with and in fact I have recommended them to my family and friends. A fantastic company!",
      "rating": 5,
      "date": "16th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent service",
      "text": "Good service got me my morgage they got me a morgage for an older person now I was able to move nearer my chikdren",
      "rating": 5,
      "date": "16th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Brilliant",
      "text": "Never hade a problem even with a late payment.",
      "rating": 5,
      "date": "16th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Simple and straightforward application process.",
      "text": "Simple and straightforward application process. The team at the office are very helpful",
      "rating": 5,
      "date": "16th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "We have a new mortgage with Darlington.",
      "text": "We have a new mortgage with Darlington. Everything has been super easy and straight forward so very happy.",
      "rating": 5,
      "date": "16th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "I’ve been a member for 3 years now, excellent team ,...",
      "text": "I’ve been a member for 3 years now, excellent team , good online platform, user friendly system.",
      "rating": 4,
      "date": "16th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Mortgage application- no problems",
      "text": "My mortgage application went through without any problems.",
      "rating": 5,
      "date": "16th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "I’ve had a 5 year fixed rate with your selves, then...",
      "text": "I’ve had a 5 year fixed rate with your selves, then with the inflation fluctuating up and down prices, I’ve managed to get another 5 year fixed rate at a good percentage. Haven’t looked elsewhere really good customer service",
      "rating": 5,
      "date": "16th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Simply the best Mortgage Lender",
      "text": "Simply the best mortgage lender I have experienced to date.",
      "rating": 5,
      "date": "16th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "We always send an email to Paula regarding our mortg...",
      "text": "We always send an email to Paula regarding our mortgage and she always responds that day which is great for us.",
      "rating": 5,
      "date": "16th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Remortgaged with Darlington, totally hassle free a t...",
      "text": "Remortgaged with Darlington, totally hassle free a total breeze. Took away all the anxiety of remortgaging.",
      "rating": 5,
      "date": "16th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "It was smooth and clear prompt reply",
      "text": "It was smooth and clear prompt reply",
      "rating": 5,
      "date": "16th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent customer service",
      "text": "Darlington provided us with an interest only mortgage despite being relatively advanced in years! The process was straightforward and they have kept us informed throughout the whole process and since the granting of the mortgage.",
      "rating": 5,
      "date": "15th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Supporting the older lender - thanks Darlington",
      "text": "Darlington were one of the few mortgage lenders who would offer us a mortgage due to our ages. They recognised we had excellent credit ratings and supported our aspiration to own a home again.",
      "rating": 5,
      "date": "15th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Darlington have provided me with a self build mortga...",
      "text": "Darlington have provided me with a self build mortgage in partnership with BuildLoan. They have been very supportive and good communicators throughout the process, alongside being quick to coordinate stage payments which has been critical in enabling the build process to run smoothly.",
      "rating": 5,
      "date": "14th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "An older lady",
      "text": "As an older lady I was pleased that Darlington offered me a mortgage at my age.",
      "rating": 5,
      "date": "13th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "DBS were very helpful and assisted me along the way.",
      "text": "DBS were very helpful and assisted me along the way. To add to this, no question went unanswered.",
      "rating": 5,
      "date": "12th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Gave a mortgage to pensioner!",
      "text": "Gave a mortgage to me as a retired person which I was unable to get from other banks. Fantastic as enabled to buy my own house for the first time in 20 years! Also got a great deal at a reasonable rate.",
      "rating": 5,
      "date": "12th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Reliable good service",
      "text": "The mortgage provided by the Darlington Building Society has been ideal for my needs and when it came up for review I was able to repay some of the capital and get a reasonable rate at a very challenging time. The only downside was several sources of information giving slightly different advice bt that was resolved by speaking to someone.",
      "rating": 5,
      "date": "12th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Interest rate reductions not sufficient",
      "text": "Despite the interest rate cuts by the bank of England the rate the reduction of our mortgage, which is on a variable rate, has been negilgible. Customer service has been good with prompt replies to inqueries.",
      "rating": 2,
      "date": "11th April 2025",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "Made our dream home ownership possible!",
      "text": "We’re incredibly grateful to the bank for providing us with a loan to help cover the down payment on our first home. Their support made it possible for us to take this important step, and we truly appreciate their assistance throughout the process.",
      "rating": 5,
      "date": "10th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Professional, Precise and Personal",
      "text": "Easy to contact, always helpful, uk based staff.",
      "rating": 5,
      "date": "10th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Darlington saved our home",
      "text": "Just when we thought there was no hope in our very complicated mortgage to save our home, Darlington processed our application via our amazing mortgage broker. Darlington is not complicated and it was quite stress free. Many thanks again",
      "rating": 5,
      "date": "9th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "A real understanding of community values",
      "text": "I have had a mortgage with the society for many years. During this time I have switched mortgage deals a number of times to other products provided by the society. I have found the process pretty straight forward to do on my own using the website and through discussion with a member of the customer service team. In the past I have fallen into arrears with my mortgage due to a change in circumstances and whilst I buried my head in the sand for sometime as I was afraid of the repercussions of doing so when I eventually came up for air and spoke to the team about it I found them to be empathic in dealing with and helping me to get back on track which ultimately avoided me losing my family home. I am eternally grateful for the compassion shown to me by the society during this difficult period. I’m not sure I would have been helped to stay in my home by the bigger lenders! Keep up the great work Darlington Building Society. A local company with a real understanding of community.",
      "rating": 5,
      "date": "9th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very quick process and always willing to help.",
      "text": "Very quick process and always willing to help.",
      "rating": 5,
      "date": "9th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Helpful staff",
      "text": "Easy to get through on telephone and staff so helpful and kind. Every time I have phoned staff always seem to have the answers and do not pass me to another person.",
      "rating": 5,
      "date": "9th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Darlington Building Society is our mortgage provider.",
      "text": "Darlington Building Society is our mortgage provider. And honestly, I don't know what we would have without them. They provided us with the mortgage we needed to buy our bungalow, which gave us a roof over heads! They have looked after since, with renewal quotes at excellent interest rates! We would highly recommend Darlington Building Society for customer service, product availability, knowledgeable staff and being there for us! Thank you Darlington",
      "rating": 5,
      "date": "9th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "great customer service..",
      "text": "have been given great service every time i had an enquiry,service staff always very polite and knowledgable",
      "rating": 5,
      "date": "9th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "As a first time buyer nearly 4 years ago I have had...",
      "text": "As a first time buyer nearly 4 years ago I have had a great experience with Darlington! Great customer service, quick responses and consistent communication!",
      "rating": 5,
      "date": "9th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Darlington asking for the Inns and Outs of a fart",
      "text": "When my wife and I applied for a mortgage via a mortgage broker, Darlington took a long time to make a descision to lend. They were quibbling over a £50 catalogue account that they wanted to be cleared before they would lend. ( Andwe have a joint income of over £100k) We had to remortgage with Darlington a second time , only because our solcitor forgot to register our New Build House in our names by the time the 2 year fixed rate expired. We could not use the whole market at the time becasue of that. Otherwise we would have got a much cheaper rate elsewhere.",
      "rating": 3,
      "date": "9th April 2025",
      "product": "Mortgages",
      "sentiment": "mixed"
    },
    {
      "title": "Very happy with the product I have and efficient ser...",
      "text": "Very happy with the product I have and efficient service received.",
      "rating": 5,
      "date": "9th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Okay service",
      "text": "The online site and correspondence has been fine but I do think the rate I pay is a bit high but I agreed it so it is what it is. Hopefully I will get a more competitive rate on renewal.",
      "rating": 3,
      "date": "9th April 2025",
      "product": "Mortgages",
      "sentiment": "mixed"
    },
    {
      "title": "Exceptionally friendly and proactive",
      "text": "I find the staff at Darlington exceptionally friendly and proactive. The are willing to help and show enthusiasm for their jobs. A rare commodity in today's world. I only use phone and online banking services.",
      "rating": 5,
      "date": "9th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great service",
      "text": "I have found Darlington to be a caring bank giving me the best advice and information.",
      "rating": 5,
      "date": "9th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Darlington Building Society are so easy to work with",
      "text": "Darlington Building Society are so easy to work with, they have kept us in the loop throughout our first mortgage process and been amazing with our mortgage. Every question we’ve had has been answered quickly whilst putting our mind at easy. I would 100% recommend Darlington Building Society for a mortgage.",
      "rating": 5,
      "date": "9th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Always get informed by Darlington about what is goin...",
      "text": "Always get informed by Darlington about what is going on and f any changes being made. The interest rate on our mortgage is great as well as having it portable.",
      "rating": 5,
      "date": "8th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "I am very happy with my mortgage",
      "text": "I am very happy with my mortgage",
      "rating": 5,
      "date": "8th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Remortgage",
      "text": "All options clearly described and best option for my circumstances selected",
      "rating": 5,
      "date": "8th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Customer service",
      "text": "Not really had many experiences but helped immensely throughout covid. Fantastic customer service.",
      "rating": 5,
      "date": "8th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "In general, the experience was good.",
      "text": "In general, the experience was good. But the rate changed after DIP. More transparent is needed.",
      "rating": 4,
      "date": "8th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Self-Build Excellence",
      "text": "Darlington provided me with a mortgage suitable for my self-build. Funds are drawn down as needed. The team are highly responsive and the service is unobtrusively personal.",
      "rating": 5,
      "date": "8th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Two great years , no hassle .",
      "text": "Two great years , no hassle . Excellent service",
      "rating": 5,
      "date": "8th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Never a problem Always answer queries promptly and h...",
      "text": "Never a problem Always answer queries promptly and honestly",
      "rating": 5,
      "date": "8th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Friendly, helpful Building Society",
      "text": "They are a friendly branch at Northallerton and happy to answer any question regardless how big or small it is. I wanted to come into a branch to arrange renew my mortage as I was not looking forward to speaking over the phone, but the lady I spoke to, explained everything brilliently and in languiage that was simple and easy to understand. I didn't have to take time off work to come into the branch, which was even better. I also have a savings account with the Darlington Building Society where I have managed to save up to make improvements around my house.",
      "rating": 5,
      "date": "8th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Best Mortgage Option if you work Overseas",
      "text": "As someone who works overseas Dartington was one of the few lenders who would offer me a mortgage despite an excellent credit rating. We live in a globalized world Dartington appreciates that reality.",
      "rating": 5,
      "date": "8th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "We were introduced to Darlington via a mortgage broker.",
      "text": "We were introduced to Darlington via a mortgage broker. I have called them a couple of times querying things such as early settlement or the option to remortgage both times have received really good friendly service. If we do move or wish to borrow more would certainly go to Darlington first",
      "rating": 5,
      "date": "8th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Smooth and hassle free process",
      "text": "A very smooth and hassle free process to set up a new mortgage. Information was easy to find online and discussions with customer advisor was straightforward.",
      "rating": 5,
      "date": "8th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very excellent service and trustworthy.",
      "text": "Excellent friendly service always pleasant and polite and willing to go to the extra mile to help you",
      "rating": 5,
      "date": "8th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Always been low interests rates, for my mortgages, a...",
      "text": "Always been low interests rates, for my mortgages, and the telephone service, is exceptional, they answer quickly and you get to chat to the specific person very quickly.",
      "rating": 5,
      "date": "8th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Couldn't have asked for a better experience.",
      "text": "Couldn't have asked for a better experience. Prompt responses to questions and prompt with payment to allow me keys to my house in the morning on my day of completion",
      "rating": 5,
      "date": "8th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Always very friendly and helpful",
      "text": "Always very friendly and helpful",
      "rating": 5,
      "date": "8th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very friendly and upfront about any charges so easy...",
      "text": "Very friendly and upfront about any charges so easy to work with",
      "rating": 5,
      "date": "8th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Helpful and knowledgeable staff.",
      "text": "Helpful and knowledgeable staff. I had a niche query. The person who answered didn't know the answer but passed it on and I received a full and helpful response the same day.",
      "rating": 4,
      "date": "8th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Brilliant start to finish no complaints at all , cus...",
      "text": "Brilliant start to finish no complaints at all , customer service was second to none brilliant rates very competitive, easy to use account . Would definitely recommend to friends and family .",
      "rating": 5,
      "date": "8th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great customer care",
      "text": "Very helpful when enquiring about paying extra payments to reduce the term. Rang me back when they said they wood.",
      "rating": 5,
      "date": "8th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very Friendly",
      "text": "Have used DBS for many years and have always found them to be friendly and helpful. Nothing ever seems to be a problem and the staff go out of their way to ensure that I always receive a very high standard of customer service.",
      "rating": 5,
      "date": "8th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Darlington has the Human touch and gives peace of mind",
      "text": "Darlington staff have been extremely helpful in my case. I was having financial difficulties and advice and guidance was forthcoming with nothing ever being too much trouble.",
      "rating": 5,
      "date": "8th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Exceptional Service and Support!",
      "text": "I recently had the pleasure of working with Darlington Building Society, and I can't recommend them enough! From the beginning, their team was helpful and knowledgeable, guiding through every step of the mortgage process. They made what could have been a stressful experience smooth and enjoyable. If you're looking for a reliable mortgage company that cares about its clients, look no further!",
      "rating": 5,
      "date": "8th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "It was a smooth and easy process, and I am so gratef...",
      "text": "It was a smooth and easy process, and I am so grateful you considered my circumstances.",
      "rating": 5,
      "date": "8th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Seamless Experience",
      "text": "My experience was seamless. I couldn’t have asked for a better experience, especially for a first time buyer.",
      "rating": 5,
      "date": "8th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "We like the way they use human beings to make a deci...",
      "text": "We like the way they use human beings to make a decision and not some electronic algorithm. We had no idea that retirees like us would even be considered for a mortgage. We like old fashioned values and the human touch",
      "rating": 5,
      "date": "8th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "You offer timely and excellent service",
      "text": "You offer timely and excellent service",
      "rating": 5,
      "date": "8th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "New mortage application.",
      "text": "I applied for a mortgage at the age of 79 yrs and was accepted with a very good 5 yrs fixed rate. Excellent. The local Branch staff are very knowledgeable and polite and patient !!",
      "rating": 5,
      "date": "8th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "phone service",
      "text": "always very helpful when phoning for either advice or updates regarding the mortgage. As we only deal over the phone the service provided is excellent",
      "rating": 5,
      "date": "8th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Always very helpfull when contacted",
      "text": "Always very helpfull when contacted",
      "rating": 5,
      "date": "8th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Always helpful and professional.",
      "text": "Always helpful and professional.",
      "rating": 5,
      "date": "8th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "DBS helped me when no one else would",
      "text": "Darlington Building Society helped me get a mortgage when no one else would. I was going through a divorce and they were so understanding and sympathetic towards my situation",
      "rating": 5,
      "date": "8th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Darlington has given us much valued support and conf...",
      "text": "Darlington has given us much valued support and confidence in our financial future",
      "rating": 5,
      "date": "8th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Helpful staff, sound advice .",
      "text": "Helpful staff, sound advice . Would be happy to recommend Darlington",
      "rating": 4,
      "date": "8th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great service, friendly and helpful humans",
      "text": "Great service, friendly and helpful humans on the end of a phone is a refreshing change.",
      "rating": 5,
      "date": "8th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Mortgage lender",
      "text": "We have had our mortgage with Darlington for a number of years. They were very helpful when we moved and took out a larger mortgage. Whenever we have a question or want to make an overpayment they are always very helpful and give excellent service.",
      "rating": 5,
      "date": "8th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Straight forward dealing with them, easy to get thro...",
      "text": "Straight forward dealing with them, easy to get through when you need to call. Had the best deal for my situation.",
      "rating": 5,
      "date": "8th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Exceptional Building Society",
      "text": "Exceptional Building Society who supplied us with a mortgage where other companies would not. Always fantastic service, kind and attentive team. They have changed our life.",
      "rating": 5,
      "date": "8th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "1st mortgage",
      "text": "This is our 1st mortgage and we found the process to be smooth and effortless with Darlington Building Society. We're very grateful.",
      "rating": 5,
      "date": "8th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "PROFESSIONAL, KNOWLEDGABLE AND FRIENDLY",
      "text": "PROFESSIONAL, KNOWLEDGABLE AND FRIENDLY",
      "rating": 5,
      "date": "7th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent service all round",
      "text": "They've been accommodating in their lending criteria. Their rates were very competitive and when we've had questions the response time on the phone has been quick and professionally managed",
      "rating": 5,
      "date": "7th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Good, all very good, would recommend",
      "text": "Good, all very good, would recommend",
      "rating": 5,
      "date": "7th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Have been with Darlington for several years.",
      "text": "Have been with Darlington for several years. I’m a customer who resides overseas, I have had no problems communicating with the team , easy , understanding and patient each time. Have been able to maintain repayments to a affordable amount through the continued refinancing offers",
      "rating": 5,
      "date": "7th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "It as very helpful the advisor us knowledge",
      "text": "It as very helpful the advisor us knowledge",
      "rating": 5,
      "date": "7th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Mortgage renewal process made simple.",
      "text": "Mortgage advisor staff we’re excellent, informative and helpful in assisting my fixed mortgage rate renewal.",
      "rating": 5,
      "date": "7th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Effortless from day one.",
      "text": "Effortless from day one. Response and resolution within a few simple questions",
      "rating": 5,
      "date": "7th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "I'm quite happy",
      "text": "At the moment I'm quite happy and comfortable with it. They offered us a very reasonable price.",
      "rating": 5,
      "date": "7th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent staffing and great support.",
      "text": "Excellent staffing and great support.",
      "rating": 5,
      "date": "7th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great building society for first time buyers!!",
      "text": "We were first time buyers and got our mortgage the DBS and they sent everything across and all communication was clear and really helpful to us as first time buyers. Plus the product fee wasn’t as ridiculous as some of those bigger banks!",
      "rating": 5,
      "date": "7th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Out of the ordinary mortgages & customer service",
      "text": "We went with Darlington because they were recommended by our broker for providing 'out of the ordinary' mortgages - which suited us! They have since provided not only a good product but excellent customer service with very helpful people to answer and queries we have had.",
      "rating": 5,
      "date": "7th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Always great rates over the full term of my mortgage...",
      "text": "Always great rates over the full term of my mortgage and staff are always very helpful and polite at the other end of the telephone.",
      "rating": 5,
      "date": "7th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "We had our very first mortgage with Darlington.",
      "text": "We had our very first mortgage with Darlington. And the best rate available at the time. Everything was so easy to fill out with plenty of support when I needed it. Darlington was amazing they talked me all the way through from beginning to end. My mortgage is up for renewal February next next year and I’m hoping to stay with Darlington. Amazing staff very helpfull nothing is to much trouble, if I didn’t understand anything all I had to do was pick up the phone, or send and email. Out of all the potential lenders Darlington came out on top for us. Great rates!!",
      "rating": 5,
      "date": "7th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Clear and simple",
      "text": "No problems clear and simple right from the beginning! I’m a first time buyer and they made the process so easy to follow!",
      "rating": 5,
      "date": "7th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Individuality",
      "text": "They helped through a difficult time to make a transition in my life easy to buy the property I needed . Good at keeping you informed love the monthly updates.",
      "rating": 5,
      "date": "7th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Every time I have dealt with you it’s been a...",
      "text": "Every time I have dealt with you it’s been a pleasure",
      "rating": 5,
      "date": "7th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Good customer service from Darlington",
      "text": "Good customer service from Darlington",
      "rating": 5,
      "date": "7th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Darlington feel like Building Societies used to, wit...",
      "text": "Darlington feel like Building Societies used to, with caring, helpful people to advise customers. They were absolutely wonderful in arranging our Mortgage. The members of staff were extremely knowledgeable and helpful. We had tried all the big names but felt from start to finish that Darlington staff were trying to do their very best for us and the experience was so easy and smooth. We are 3 years in with the mortgage and couldn't be happier with Darlington, who keep us up to date from time to time, without it feeling too often.",
      "rating": 5,
      "date": "7th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Couldn’t ask for anything more",
      "text": "Have had a great experience with Darlington Building Society over the past two years",
      "rating": 5,
      "date": "7th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Newbie house",
      "text": "Not been with them long but everything going well so far, good rates.",
      "rating": 5,
      "date": "7th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Anonymous",
      "text": "Been customer for years, always had mortgage with them. Wouldn't have stayed if service was poor.",
      "rating": 4,
      "date": "7th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Easy application and excellent service.",
      "text": "Easy application and excellent service.",
      "rating": 5,
      "date": "7th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Good value mortgage, and good customer service",
      "text": "Good value mortgage, and good customer service",
      "rating": 4,
      "date": "7th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Such a helpful Building Society.",
      "text": "We were refused a mortgage at many other banks Darlington Building Society were the only ones who would take us on because of our age, they have been so helpful and we renewed our fixed rate again with them this year so easy to do online.",
      "rating": 5,
      "date": "7th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent mortgage advisor",
      "text": "Excellent mortgage advisor, very knowledgeable and helpful. Phoned back on time and took care of everything.",
      "rating": 5,
      "date": "7th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Staff always helpful and knowledgable.",
      "text": "Staff always helpful and knowledgable. Enquiries are always promptly sorted out.",
      "rating": 5,
      "date": "7th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very nice and good The Tim was very good",
      "text": "Very nice and good The Tim was very good",
      "rating": 5,
      "date": "7th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Dissatisfied",
      "text": "I always rated darlington high but I've never missed one payment and when I ask for a small amount to generate my kitchen because of my age I was denied as you don't take my wages into account, this is find strange because if I passed you would still get your money, very dissapointed",
      "rating": 2,
      "date": "7th April 2025",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "Great Mortgage",
      "text": "We have not had any issues at all to date, very happy",
      "rating": 5,
      "date": "7th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent service and products",
      "text": "Darlington building society has always provided excellent customer service. You always speak with someone if you have a query and they make an effort to resolve and issues. I particularly appreciated how easy the renewal process was and the quality of the deals offered",
      "rating": 5,
      "date": "7th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Straightforward and easy to work with - friendly tea...",
      "text": "Straightforward and easy to work with - friendly team and efficient process from start to finish",
      "rating": 4,
      "date": "7th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Professional, very approachable and excellent service",
      "text": "Professional, very approachable and excellent service",
      "rating": 5,
      "date": "7th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Mortgage made easy with Darlington",
      "text": "Amazing experience, everything was easy and very clear steps to follow. Have remortgage again with Darlington",
      "rating": 5,
      "date": "7th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "We have had very good feedback from them when we cha...",
      "text": "We have had very good feedback from them when we changed our mortgage deal",
      "rating": 5,
      "date": "7th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Darlington offer competitive mortgages for expats re...",
      "text": "Darlington offer competitive mortgages for expats returning to the UK.",
      "rating": 4,
      "date": "7th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Joint, later life, Mortgage.",
      "text": "One of only a very few mortgage lenders that offered my sister and I a joint, later life, mortgage.",
      "rating": 5,
      "date": "7th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "The mortgage lender for the people",
      "text": "The only society to grant us a mortgage to people who are senior citizens",
      "rating": 5,
      "date": "7th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very clear and competitive mortgage deal",
      "text": "Very clear and competitive mortgage deal that met my complicated requirments from a build mortgage to normal mortgage.",
      "rating": 5,
      "date": "7th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very helpful to suit circumstances",
      "text": "When the company I worked for went into liquidation the society was very helpful in altering my mortgage repayments to make if affordable within my means.",
      "rating": 5,
      "date": "7th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "All of my experiences in dealing with Darlington Bui...",
      "text": "All of my experiences in dealing with Darlington Building Society have been positive.",
      "rating": 5,
      "date": "7th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Look After existing and potential new Customers",
      "text": "Really looked after us as an existing mortgage holder",
      "rating": 5,
      "date": "7th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "The where able to work with our income and come up w...",
      "text": "The where able to work with our income and come up with a flexible payment plan",
      "rating": 5,
      "date": "7th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Everything was very good People from agency,engineer...",
      "text": "Everything was very good People from agency,engineers very well",
      "rating": 5,
      "date": "7th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Had a mortgage with them since 2020, rates are compe...",
      "text": "Had a mortgage with them since 2020, rates are competitive and really great customer service.",
      "rating": 5,
      "date": "7th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent service and good communications.",
      "text": "Excellent service and good communications. Thank you",
      "rating": 5,
      "date": "7th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Older first time buyers",
      "text": "Darlington took the time to listen to our story and after all the usual steps were successfully completed we were able to buy our home thanks to Darlington.",
      "rating": 5,
      "date": "7th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "customer focused",
      "text": "very straightforward application process",
      "rating": 5,
      "date": "7th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Darlington is professional, and speedy . clear i...",
      "text": "Darlington was very professional, speedy and clear in the way they handled our mortgage application. There were no delays or unclear communications. This proved the winning formular for us. Darlington also provided the most competitive rates for our situation and mortgage.",
      "rating": 5,
      "date": "7th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Easy to deal with, very understanding and would reco...",
      "text": "Easy to deal with, very understanding and would recommend to others",
      "rating": 5,
      "date": "7th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "They have good rates efficient service and professi...",
      "text": "They have good rates efficient service and professional. They answer queries on time and polite. I recommend them to family members and friends.",
      "rating": 5,
      "date": "7th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "A common sense approach .",
      "text": "Very straight forward common sense approach . They do exactly what they say they will do",
      "rating": 5,
      "date": "7th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "A wonderful opportunity after retirement",
      "text": "The Darlington has given us the chance to get back on the property ladder which we had thought was impossible. As pensioners we really appreciate this as it’s reduced our outgoings considerably & has provided us with a much loved affordable home by the sea in wonderful Northumberland. Thanks so much",
      "rating": 5,
      "date": "7th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "My Society",
      "text": "i like mutual societies and Darlington fits the bill",
      "rating": 5,
      "date": "7th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great Experience",
      "text": "Great experience, we had to have a debt management mortgage due to my husbands credit but after two years seamlessly transferred to a normal mortgage, overpayments are easy, always someone at the end of the phone or email. It's been a fantastic experience.",
      "rating": 5,
      "date": "7th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Darlington's service is excellent and I would strong...",
      "text": "Darlington's service is excellent and I would strongly recommend it. Thank you so much for all the support!!!",
      "rating": 5,
      "date": "7th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Customer services is excellent.",
      "text": "Customer services is excellent. No wait times and you speak to someone who actually knows what they are talking about. No mixed messages from different agents. First class service",
      "rating": 5,
      "date": "7th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Really happy with the service received, has improved...",
      "text": "Really happy with the service received, has improved further since starting with them and continues to provide informative communications and rapid responses to my queries",
      "rating": 5,
      "date": "7th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Easy system, good rates, simple to use.",
      "text": "Easy system, good rates, simple to use. Have already remortgaged with Darlington.",
      "rating": 5,
      "date": "7th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Self build mortgage has provided flexibility.",
      "text": "Self build mortgage has provided flexibility and clarity. Communication has been good and we are considering a new product, but staying with Darlington.",
      "rating": 4,
      "date": "7th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Staff are always happy to help",
      "text": "Staff are always happy to help and provide easy to understand explanations of areas I did not quite understand",
      "rating": 4,
      "date": "7th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Friendly but very professional and speedy service in...",
      "text": "Friendly but very professional and speedy service in relation to my mortgage",
      "rating": 5,
      "date": "7th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great self build mortgage option",
      "text": "Good and efficient service, friendly and helpful team. We found them because we needed a self build mortgage and they have done a good job with this.",
      "rating": 5,
      "date": "7th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Gave my daughter a chance where no one else would",
      "text": "Gave my daughter a chance where no one else would",
      "rating": 5,
      "date": "7th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "This is a Bank with a Building Society heart.",
      "text": "This is a Bank with a Building Society heart. My own bank of over 40 years considered me too old for a remortgage. Darlington could see my potential as a good customer and provided me with a fixed remortgage deal, at the end of which offered me another suitable fixed deal. The remortgage supported my plan for moving to my forever home.",
      "rating": 5,
      "date": "7th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent Service",
      "text": "I am 80 years old and had many experiences over my time in dealing with various banks and building societies. Some I rate as poor, some I rate as middle of the road and some I rate as good, but I must say in all honesty Darlington Building Society is best by miles. Every staff member in all departments know exactly what they are doing and about the products that they are providing. They have the knack of explaining things in a simple and easy way to understand on exactly what their products are about. What I like most of all is every member of staff are so knowledgeable and you don't get passed from pillar to post like many other banks and building societies I have dealt with. We have recently moved homes and they made porting our mortgage over very easy and with perfection.",
      "rating": 5,
      "date": "7th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Darlington helped me with my 1st mortgage, They mad...",
      "text": "Darlington helped me with my 1st mortgage, They made it a breeze from start to finish, I would highly recommend then to anyone looking to get on the property ladder",
      "rating": 5,
      "date": "7th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Fantastic got me a mortgage so I can be near my fami...",
      "text": "Fantastic got me a mortgage so I can be near my family for a retired lady Darlingtons made it easy for me",
      "rating": 5,
      "date": "7th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "No problem at all getting the remortgage",
      "text": "No problem at all getting the remortgage",
      "rating": 5,
      "date": "7th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "They were brilliant from start to finish with my ini...",
      "text": "They were brilliant from start to finish with my initial mortgage and the same with all thoptions as each term deal came to an end.",
      "rating": 5,
      "date": "7th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Took out a mortgage with them.",
      "text": "Took out a mortgage with them. The process was easy and they kept me informed every step of the wsy",
      "rating": 5,
      "date": "7th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Smooth process",
      "text": "I am grateful to having been connected to Darlington Building Society, we were new in UK when we decided to purchase our own flat, and while we had worries about getting approved on mortgage application, our process was smooth and hassle free.",
      "rating": 5,
      "date": "7th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very helpful and attentive throughout a difficult an...",
      "text": "Very helpful and attentive throughout a difficult and anxious process",
      "rating": 5,
      "date": "7th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great Service",
      "text": "Darlington offered various options and listened to what my requirement were to ensure i got the best offer and deal. It was an informative, smooth and efficient process.",
      "rating": 5,
      "date": "7th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Straight forward process, getting the mortgage appro...",
      "text": "Straight forward process, getting the mortgage approved and informed of each stage, the app is very useful knowing how much is left to pay.",
      "rating": 5,
      "date": "7th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "I was offered a mortgage that suited my needsa",
      "text": "I was offered a mortgage that suited my needsa as a pensioner. When I added a second mortgage a few years ago the help and advice I received was second to none.",
      "rating": 5,
      "date": "7th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Thank you Darlington Building Society",
      "text": "I have been treated very respectfully and very well all along, and the mortgage rate I was offered and followed through with is excellent. Thank you Darlington Building Society",
      "rating": 5,
      "date": "7th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Darlington provided us with an excellent self build...",
      "text": "Darlington provided us with an excellent self build loan and helped us to provide a great mortgage after the build.",
      "rating": 5,
      "date": "7th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Really helpful Would thoroughly recommend",
      "text": "Really helpful Would thoroughly recommend",
      "rating": 5,
      "date": "7th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "We are loyal customers for our mortgages from Darlin...",
      "text": "We are loyal customers for our mortgages from Darlington Building Society due to our salary being paid in USD. Darlington Building Society really do look at the individual when assessing for their mortgages. It’s a very personal touch and much appreciated. I have been dealing with the same mortgage adviser for quite a few years at Darlington and she has been excellent. Darlington have made it possible to remain homeowners when other lenders were not interested in the ‘ hassle ‘ of non UK currency salaries.",
      "rating": 5,
      "date": "7th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "We had rented our home for 40 years and because our...",
      "text": "We had rented our home for 40 years and because our mortgage lady Nadine was able to speak to a person and explain our situation you granted us a mortgage and we own our home which we love",
      "rating": 5,
      "date": "7th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent all round",
      "text": "Great company, excellent service, very helpful, excellent all round",
      "rating": 5,
      "date": "7th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very Good and quick turnaround.",
      "text": "Very Good and quick turnaround. Kept us informed at every stage of the process",
      "rating": 5,
      "date": "7th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Darlington have always been a delight",
      "text": "Darlington have always been a delight. They're knowledgable about mortgages and helped to find me a deal that worked with my very specific/niche requirements. While they weren't the best value, they did provide me with reassurances that they would support my needs and my requirements and help to make life easier.",
      "rating": 5,
      "date": "7th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "We have been with the Darlington for 22 years and ea...",
      "text": "We have been with the Darlington for 22 years and each time our deal was coming to the end, their advisor was brilliant, talking us through all options and finding the best one for us, and even saved us money and reduced the length of our mortgage. Would and have highly recommended the company.",
      "rating": 5,
      "date": "7th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very helpful",
      "text": "They have always been helpful each time I have needed to renew my mortgage, I have been surprised that no mention has ever been made of my age, currently 75 and potentially still 8 years to run, why would I want to go with anyone else?",
      "rating": 5,
      "date": "7th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "I have a mortgage with Darlington and their communic...",
      "text": "I have a mortgage with Darlington and their communication and offering has been superb. They are so straight forward to deal with and have made it easy to understand and navigate.",
      "rating": 5,
      "date": "7th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Managed to sort out an issue",
      "text": "Managed to sort out an issue where the first payment was taken twice. After calling this resolved in a timely manner. The customer service was understanding about the situation and assured me the issue will be sorted.",
      "rating": 5,
      "date": "7th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Customer service is always very efficient, and easy...",
      "text": "Customer service is always very efficient, and easy to get in touch with when needed.",
      "rating": 5,
      "date": "7th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "We had a complex scenario when taking out our mortga...",
      "text": "We had a complex scenario when taking out our mortgage however DBS offered a good option which was flexible and suited our needs.",
      "rating": 5,
      "date": "7th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    }
  ]
}