{
  "society": "Dudley Building Society",
  "slug": "dudley-building-society",
  "smpUrl": "https://smartmoneypeople.com/dudley-building-society-reviews/products",
  "totalReviewsOnSMP": 3917,
  "avgRating": 4.42,
  "scrapedAt": "2026-02-06T15:38:53.508869+00:00",
  "reviews": [
    {
      "title": "Great service, but better interest on savings elsewhere",
      "text": "Great service, but better interest on savings elsewhere",
      "rating": 5,
      "date": "19th June 2025",
      "product": "Financial Advice",
      "sentiment": "positive"
    },
    {
      "title": "Savings account.",
      "text": "As a member with a savings account, I would expect to be notified when a new account is launched which is similar to my account and which pays a higher interest rate.",
      "rating": 4,
      "date": "18th June 2025",
      "product": "Financial Advice",
      "sentiment": "positive"
    },
    {
      "title": "Customer service",
      "text": "I use the Dudley branch and staff always helpful and friendly.I visited today and was dealt with swiftly and friendly manor by Brenda.always a pleasure to go there",
      "rating": 5,
      "date": "3rd February 2025",
      "product": "Financial Advice",
      "sentiment": "positive"
    },
    {
      "title": "good interest rates",
      "text": "good interest ratesI did experience problems and delays with changing nominated bank account, and problems with the automatic logging out off the account on line without warning",
      "rating": 3,
      "date": "16th September 2024",
      "product": "Financial Advice",
      "sentiment": "mixed"
    },
    {
      "title": "Called in to deposit a cheque into a savings account.",
      "text": "Called in to deposit a cheque into a savings account.",
      "rating": 5,
      "date": "26th March 2024",
      "product": "Financial Advice",
      "sentiment": "positive"
    },
    {
      "title": "AN Excellent Service all round",
      "text": "From the moment I opened my savings account I have had nothing but excellent service. I needed to query what evidence of identity was acceptable and phoned and was met by courtesy and professionalism. I have no hesitation in recommending this building society to others and have in fact already done so to a close friend.",
      "rating": 5,
      "date": "18th August 2023",
      "product": "Financial Advice",
      "sentiment": "positive"
    },
    {
      "title": "50/50",
      "text": "Missing information not passed on to me as a customer. I was also sent outdated interest rate information - it was not even valid. The information given needs to be 100% accurate but is not.",
      "rating": 1,
      "date": "6th December 2022",
      "product": "Financial Advice",
      "sentiment": "negative"
    },
    {
      "title": "Dudley Building Society Branch Review",
      "text": "Carol - advised, and served very efficiently by Jane and Carol.",
      "rating": 5,
      "date": "30th November 2022",
      "product": "Financial Advice",
      "sentiment": "positive"
    },
    {
      "title": "Opening 2yr Saving Bond",
      "text": "I've had a few problems but your staff have been very helpful. Unusually, as a new personal customer I wished to open a 2 year savings bond but this was complicated by the fact that I was also the nominated person for Charity Trustee account. My online application for a personal saving bond repeatedly failed and I only could discover the reason for this when I contacted your staff. I found your online on-line log off after 120 seconds inconveniently short – have you considered extending this to say 5-minutes as typically used by banks? Lastly it seems I have to use same email address for both personal account and charity account - far from satisfactory. Inspite of above all sorted now (apart from email problem) Regards Keith",
      "rating": 4,
      "date": "11th November 2022",
      "product": "Financial Advice",
      "sentiment": "positive"
    },
    {
      "title": "Great to be dealt with by competent people",
      "text": "Well I know the Dudley people pretty well but dealing with them as a customer puts everything you already know into perspective. They are clear, knowledgeable and competent.",
      "rating": 5,
      "date": "5th September 2022",
      "product": "Financial Advice",
      "sentiment": "positive"
    },
    {
      "title": "Happy",
      "text": "Excellent service. Friendly, professional staff. No queues - Absolute Bonus!!!",
      "rating": 5,
      "date": "14th July 2022",
      "product": "Financial Advice",
      "sentiment": "positive"
    },
    {
      "title": "First class service",
      "text": "I was listened to. I got all the help I needed and more. I felt so reassuring to speak to someone who really understood my problem. So fantastic to be able to pick up a phone and speak to someone who cares about their customers. I felt as if my call mattered. Excellent service .",
      "rating": 5,
      "date": "11th June 2022",
      "product": "Financial Advice",
      "sentiment": "positive"
    },
    {
      "title": "Registering online",
      "text": "Very pleased to now be able to access my accounts online and be able to make changes as I need. It’s not always easy to come into branch.",
      "rating": 5,
      "date": "5th May 2022",
      "product": "Financial Advice",
      "sentiment": "positive"
    },
    {
      "title": "ISA ADVICE",
      "text": "Excellent service as usual. Appreciate being able to see people face to face to discuss financial matters in a local location.",
      "rating": 5,
      "date": "22nd December 2021",
      "product": "Financial Advice",
      "sentiment": "positive"
    },
    {
      "title": "Great friendly staff",
      "text": "It's always a pleasure to visit the branch and speak to a real person. The ladies in the Gornal branch are wonderful.",
      "rating": 5,
      "date": "25th November 2021",
      "product": "Financial Advice",
      "sentiment": "positive"
    },
    {
      "title": "Great customer service",
      "text": "Always thorough with security and very helpful customer service",
      "rating": 5,
      "date": "22nd November 2021",
      "product": "Financial Advice",
      "sentiment": "positive"
    },
    {
      "title": "Fantastic",
      "text": "Staff always very helpful and very welcoming",
      "rating": 5,
      "date": "28th October 2021",
      "product": "Financial Advice",
      "sentiment": "positive"
    },
    {
      "title": "Very helpful",
      "text": "Couldn’t of been more helpful. Very satisfied.",
      "rating": 5,
      "date": "7th October 2021",
      "product": "Financial Advice",
      "sentiment": "positive"
    },
    {
      "title": "Dudley branch review",
      "text": "Very helpful - Paid cheque in envelope for me",
      "rating": 5,
      "date": "1st October 2021",
      "product": "Financial Advice",
      "sentiment": "positive"
    },
    {
      "title": "Excellent",
      "text": "The staff are very friendly and helpful,",
      "rating": 5,
      "date": "16th September 2021",
      "product": "Financial Advice",
      "sentiment": "positive"
    },
    {
      "title": "Friendly h greatelpful",
      "text": "Pleasant great service have been with dbs for about 25 years or more",
      "rating": 5,
      "date": "15th September 2021",
      "product": "Financial Advice",
      "sentiment": "positive"
    },
    {
      "title": "Dudley intermediaries",
      "text": "terrible service levels. 3 days of constant ringing and leaving messages with no call back!",
      "rating": 3,
      "date": "12th August 2021",
      "product": "Financial Advice",
      "sentiment": "mixed"
    },
    {
      "title": "Excellent service!",
      "text": "I’ve been with with Building Society for years, they’ve never let me down!",
      "rating": 5,
      "date": "13th July 2021",
      "product": "Financial Advice",
      "sentiment": "positive"
    },
    {
      "title": "Service",
      "text": "Excellent service and very helpful staff",
      "rating": 5,
      "date": "10th July 2021",
      "product": "Financial Advice",
      "sentiment": "positive"
    },
    {
      "title": "Depositing cheque and withdrawing money.",
      "text": "On my visit the transactions were handled courteously and effectively by a very pleasant assistant",
      "rating": 5,
      "date": "6th July 2021",
      "product": "Financial Advice",
      "sentiment": "positive"
    },
    {
      "title": "Review",
      "text": "Other members of the public without face mask on in branch. Clearly says on door face covering should be worn.",
      "rating": 3,
      "date": "5th July 2021",
      "product": "Financial Advice",
      "sentiment": "mixed"
    },
    {
      "title": "Very friendly staff",
      "text": "I was dealt with very quickly and effiecently",
      "rating": 5,
      "date": "2nd July 2021",
      "product": "Financial Advice",
      "sentiment": "positive"
    },
    {
      "title": "Excellent customer service!",
      "text": "I have been with Dudley Building Society for around 25 years because they offer a very competitive savings rates and excellent customer service!",
      "rating": 5,
      "date": "21st June 2021",
      "product": "Financial Advice",
      "sentiment": "positive"
    },
    {
      "title": "Regular Savings",
      "text": "This scheme is easy to join The staff are helpful with the initial admin Once the standing order is set up I can forget about. The savings rate is better than many of the competitors",
      "rating": 4,
      "date": "8th June 2021",
      "product": "Financial Advice",
      "sentiment": "positive"
    },
    {
      "title": "Quick and effective",
      "text": "Claire was helpful and quick to sort my query out",
      "rating": 4,
      "date": "24th February 2021",
      "product": "Financial Advice",
      "sentiment": "positive"
    },
    {
      "title": "Online Access",
      "text": "Attempted online access to a passbook account and finally successful after many messages to the Society about failing to access to see my account. Staff suggested using a different browser, which did the trick. Thanks to patient staff dealing with my frustrations.",
      "rating": 5,
      "date": "23rd February 2021",
      "product": "Financial Advice",
      "sentiment": "positive"
    },
    {
      "title": "Good people despite the limited resources and good response from them",
      "text": "Had some difficulty getting into the account but all ok now and my thanks to the staff who helped me . Thanks Emma & Laura",
      "rating": 5,
      "date": "4th February 2021",
      "product": "Financial Advice",
      "sentiment": "positive"
    },
    {
      "title": "Online access",
      "text": "I was unhappy not to able to access my investment online but now, thank goodness, it has been made possible.",
      "rating": 4,
      "date": "2nd February 2021",
      "product": "Financial Advice",
      "sentiment": "positive"
    },
    {
      "title": "Perton branch review",
      "text": "Very pleased and friendly service.",
      "rating": 5,
      "date": "3rd January 2020",
      "product": "Financial Advice",
      "sentiment": "positive"
    },
    {
      "title": "Gornal Wood branch review",
      "text": "Service - friendliness. Less paperwork, professionalism",
      "rating": 5,
      "date": "2nd July 2019",
      "product": "Financial Advice",
      "sentiment": "positive"
    },
    {
      "title": "We wanted someone with the knowledge to look at our current pension situation.",
      "text": "David was very helpful and happy to look at our overall situation.",
      "rating": 5,
      "date": "16th June 2019",
      "product": "Financial Advice",
      "sentiment": "positive"
    },
    {
      "title": "Very helpful and friendly",
      "text": "Recently had a consultation with Mr Roger Dutton, Financial Adviser, arranged via Dudley Building Society at their Gornal branch. Very useful meeting with lots of good advice and with no 'hard selling' at all.",
      "rating": 5,
      "date": "23rd May 2019",
      "product": "Financial Advice",
      "sentiment": "positive"
    },
    {
      "title": "Financial Advisor",
      "text": "I was recommended to speak to Financial Advisor, Roger Dutton, regarding planning for retirement. He contacted me quickly and arranged to meet at a time that was convenient to me. He arrived punctually, and was friendly and knowledgeable, he gave me good advice with clear explanations. A good service.",
      "rating": 4,
      "date": "27th March 2019",
      "product": "Financial Advice",
      "sentiment": "positive"
    },
    {
      "title": "PENSION ADVICE",
      "text": "Roger Dutton arrived on time. He was very pleasant and easy to get along with. We can't thank him enough for the advice he gave to us , it was very informative and very helpful. Thank you",
      "rating": 5,
      "date": "1st February 2019",
      "product": "Financial Advice",
      "sentiment": "positive"
    },
    {
      "title": "Good advice received",
      "text": "Respected my decisions. Listened carefully to my situation and what I was trying to achieve. Gave an option I would not have thought about and which suited me moving forward.",
      "rating": 5,
      "date": "23rd January 2019",
      "product": "Financial Advice",
      "sentiment": "positive"
    },
    {
      "title": "Highly Recommend",
      "text": "Financial Advisor was patient and understanding with cautious first time investors. Gave clear and knowledgeable advice. We did not feel rushed to make decisions. We would highly recommend.",
      "rating": 5,
      "date": "24th December 2018",
      "product": "Financial Advice",
      "sentiment": "positive"
    },
    {
      "title": "Very likely",
      "text": "Always friendly and very helpful in advice very clear too",
      "rating": 5,
      "date": "7th December 2018",
      "product": "Financial Advice",
      "sentiment": "positive"
    },
    {
      "title": "Dudley Branch review",
      "text": "The feedback I got from the C.S.A lady was fantastic and I would recommend my friends to join Dudley Building Society",
      "rating": 5,
      "date": "27th November 2018",
      "product": "Financial Advice",
      "sentiment": "positive"
    },
    {
      "title": "David Kemp Financial Adviser",
      "text": "I was very pleased with the adviser Dudley Building Society arranged for me , David Kemp was very knowledgeable and he answer all the issues I was concern with and I would be happy to use him for future financial advise should I need it.",
      "rating": 5,
      "date": "21st November 2018",
      "product": "Financial Advice",
      "sentiment": "positive"
    },
    {
      "title": "Financial advice",
      "text": "Delighted in the service given and would recomend this to anyone looking for finacial advice.",
      "rating": 5,
      "date": "13th November 2018",
      "product": "Financial Advice",
      "sentiment": "positive"
    },
    {
      "title": "caring",
      "text": "i had to open new account today it was very easy and the staff member was nice",
      "rating": 5,
      "date": "10th April 2018",
      "product": "Financial Advice",
      "sentiment": "positive"
    },
    {
      "title": "EXCELLENT PERSONAL SERVICE",
      "text": "The staff are always wishing to improve the services offered and superb with our mortgage, life assurance and were competitive with our home insurance. Thank you for remaining our local financial service.",
      "rating": 5,
      "date": "9th April 2021",
      "product": "Insurance",
      "sentiment": "positive"
    },
    {
      "title": "Perton Branch Review",
      "text": "Since your alteration nothing else required",
      "rating": 5,
      "date": "17th August 2018",
      "product": "Insurance",
      "sentiment": "positive"
    },
    {
      "title": "Member Review",
      "text": "Very good and friendly staff. But better music please!",
      "rating": 5,
      "date": "22nd March 2018",
      "product": "Insurance",
      "sentiment": "positive"
    },
    {
      "title": "Fantastically helpful service",
      "text": "I was in a position to pay off my mortgage and phoned for help. I got straight through, the staff member I spoke to was very helpful and sent me all the information I need within a couple of hours. When I was trying to make my payments I encountered a couple of hiccups on my side - nothing to do with Dudley BS - and the email support that I asked for was given quickly, precisely, and was exactly what I needed, and all done with a positive tone. If I’d asked something impossible I think they’d still have tried to make it happen! Fantastic service.",
      "rating": 5,
      "date": "30th December 2025",
      "product": "Mortgages Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Dudley is the A-Team!",
      "text": "For the onset the team at Dudley are always personable, efficient and responsive and in these days of automated systems it is this attention to detail and understanding that marks Dudley Building Society as an outstanding people driven mortgage provider. Even when our mortgage has been up for renewal the team have been fully engaged in keeping us updated. Can’t fault them. Thank you for Simply being the best! Grace, Hannah and Lily: you are the A-Team!",
      "rating": 5,
      "date": "28th October 2025",
      "product": "Mortgages Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Flexible and Good Communication",
      "text": "I am a mortgage adviser and work with a lot of Building Societies and Banks and know to expect with each. When a lender is flexible like Dudley BS, they obviously need more information to ensure that they are protecting the customer and the society. Although the process was a bit slow and laborious, the overall service, flexibility and communication was good. I will definitely consider using them again when the need appears.",
      "rating": 4,
      "date": "9th October 2025",
      "product": "Mortgages Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Very professional service.",
      "text": "Very professional service. Once we provided requested info it was acted on and good results! The team were excellent.",
      "rating": 4,
      "date": "6th October 2025",
      "product": "Mortgages Reviews",
      "sentiment": "positive"
    },
    {
      "title": "I would like to thank the support of Nav who was exc...",
      "text": "I would like to thank the support of Nav who was excellent and helped me resolve an urgent query in a timely matter and",
      "rating": 4,
      "date": "19th August 2025",
      "product": "Mortgages Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Allowing more time for repayment on maturity",
      "text": "When the mortgage matured and we needed more time to resolve the best way forward the Dudley team were very helpful and patient. This enabled a satisfactory resolution for both sides.",
      "rating": 4,
      "date": "18th August 2025",
      "product": "Mortgages Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Excellent customer service",
      "text": "Excellent service from Lilly today, she was extremely helpful and friendly. Went out of her way to help with my queries and answered every question efficiently. She was very understanding, patient and genuine. Lovely experience.",
      "rating": 5,
      "date": "12th August 2025",
      "product": "Mortgages Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Outstanding from start to finish",
      "text": "From start to finish of our relationship with Dudley BS, their service has been outstanding. All the people we dealt with - whether over the phone (it was nice at times to still be able to pick up the phone and speak to a person to quickly clarify/sort an issue) or via email were polite, efficient and knowledgeable. Communication was first rate. Products were competitive and clearly explained.",
      "rating": 5,
      "date": "6th August 2025",
      "product": "Mortgages Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Mortgage review explanation.",
      "text": "I spoke to a member of the customer service team. Lilly, was exceptionally knowledgeable and helpful with my enquiry. So helpful and made what can be a confusing conversation to have if your experience in the mortgage sector is below the normal, her approach in dealing with any question i asked was one of a clear and precise explanation without any confusion. Most definitely a credit to your team. An excellent experience of calling my mortgage provider.",
      "rating": 5,
      "date": "15th July 2025",
      "product": "Mortgages Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Re Mortgage enquiry",
      "text": "I spoke with Nav today. I had a lot of questions for her regarding our Mortgage, she answered all of my questions and was really helpful. She went over and above to make sure she gave me all the correct information. Thank you Nav",
      "rating": 5,
      "date": "30th June 2025",
      "product": "Mortgages Reviews",
      "sentiment": "positive"
    },
    {
      "title": "A highly professional but helpful experience",
      "text": "The advisor I spoke to had complete and (ready) knowledge of the request. They were very welcoming in answering all the question and when needed, I had to request for more info, which I was instantly provided. The advisor kept their words as I needed an email with certain information to respond to the Building Society. At no point, did I feel the advisor was in a rush and wanted me to leave the line. What struck me most was that the advisor actually, helped me by giving bits of info, which I might have gotten otherwise after a few more calls, but the advisor was kind and pointed out what my options were. So really very happy with the call. Were I to give her marks, I would go for 10/10.",
      "rating": 5,
      "date": "23rd June 2025",
      "product": "Mortgages Reviews",
      "sentiment": "positive"
    },
    {
      "title": "All dealings with our mortgage have been dealt with...",
      "text": "All dealings with our mortgage have been dealt with in a efficent, considerate and friendly manner. We have nothing but highest praise for the service provided by Dudley Building Society",
      "rating": 5,
      "date": "9th May 2025",
      "product": "Mortgages Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Big shout out to girls in the mortgage dept ...",
      "text": "Big shout out to girls in the mortgage office particularly Caroline and Clare . But to be fair, the Building Society generally in the way they handled a very difficult and sensitive situation . The capital sum was due to be paid off in November of last year but the property was in the midst of bitter court proceedings between myself and my ex and there was much unexpected delay . I was fearful throughout that Dudley could repossess - as was their contractual right but instead they handled the whole situation with kindness , sensitivity and flexibility . It took six further months to resolve and now at least we will walk away with something . Thank you Dudley . Really . You avoided turning a drama into a crisis",
      "rating": 5,
      "date": "29th April 2025",
      "product": "Mortgages Reviews",
      "sentiment": "positive"
    },
    {
      "title": "The operator was very polite and well mannered and s...",
      "text": "The operator was very polite and well mannered and she put me at ease and answered my questions",
      "rating": 5,
      "date": "6th April 2025",
      "product": "Mortgages Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Excellent service",
      "text": "Dudley Building Society have been excellent with their service for me, especially Claire who has helped and supported me so much",
      "rating": 5,
      "date": "2nd April 2025",
      "product": "Mortgages Reviews",
      "sentiment": "positive"
    },
    {
      "title": "We had financial difficulties and I dealt with Clair...",
      "text": "We had financial difficulties and I dealt with Claire, she was fantastic and so understanding, she allowed us to pay a percentage of our monthly payment while we sold our property.. eventually it was sold and we managed to pay the balance of the mortgage off. Claire was invaluable to us so thank you Claire and the Dudley Building Society for helping us through a very difficult time.",
      "rating": 5,
      "date": "19th March 2025",
      "product": "Mortgages Reviews",
      "sentiment": "positive"
    },
    {
      "title": "In branch service review",
      "text": "Friendly services, accepted us for our mortgage when others didn't.",
      "rating": 5,
      "date": "27th February 2025",
      "product": "Mortgages Reviews",
      "sentiment": "positive"
    },
    {
      "title": "I asked for a lot of lot information going back seve...",
      "text": "I asked for a lot of lot information going back several years. All provided very quickly.",
      "rating": 5,
      "date": "25th February 2025",
      "product": "Mortgages Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Extremely helpful",
      "text": "Called up for some advice as I wanted to change my payment date. Rebecca was extremely helpful, informative and the company offer a good amount of flexibility which is refreshing.",
      "rating": 5,
      "date": "24th February 2025",
      "product": "Mortgages Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Highly recommend",
      "text": "We have had mortgages with dbs for over 30 years, they have been amazing.",
      "rating": 5,
      "date": "21st February 2025",
      "product": "Mortgages Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Great interaction ,very pleasent,knowledge was clear...",
      "text": "Great interaction ,very pleasent,knowledge was clear and all round good customer service",
      "rating": 5,
      "date": "4th February 2025",
      "product": "Mortgages Reviews",
      "sentiment": "positive"
    },
    {
      "title": "I have held my mortgage with Dudley Building Society...",
      "text": "I have held my mortgage with Dudley Building Society for a significant period of time and have had excellent service throughout and today when I was enquiring about final repayment of the mortgage",
      "rating": 5,
      "date": "1st February 2025",
      "product": "Mortgages Reviews",
      "sentiment": "positive"
    },
    {
      "title": "mortgage",
      "text": "Dudley have been great help. Claire is fab.",
      "rating": 5,
      "date": "23rd January 2025",
      "product": "Mortgages Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Support ex-pat customers",
      "text": "As a company that specialises in mortgages for ex-pat then it is essential that they have access to internet banking for many reasons: hours are not convenient, it is expensive to phone, phone calls can be missed, texts are not delivered.",
      "rating": 1,
      "date": "20th December 2024",
      "product": "Mortgages Reviews",
      "sentiment": "negative"
    },
    {
      "title": "Excellent fast response to our enquiry",
      "text": "Excellent fast response to our enquiry",
      "rating": 5,
      "date": "21st October 2024",
      "product": "Mortgages Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Due to circumstances the society have been able to s...",
      "text": "Due to circumstances the society have been able to support us through a difficult time and we are grateful to Claire for all the assistance she has given to us.",
      "rating": 5,
      "date": "15th October 2024",
      "product": "Mortgages Reviews",
      "sentiment": "positive"
    },
    {
      "title": "The repaymnt rates have been manageable",
      "text": "The repaymnt rates have been manageable",
      "rating": 4,
      "date": "30th August 2024",
      "product": "Mortgages Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Overall helpful and fit for purpose.",
      "text": "Overall helpful and fit for purpose. So glad I found them !",
      "rating": 5,
      "date": "15th July 2024",
      "product": "Mortgages Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Mortgage redemption",
      "text": "Just been in the fortunate position to pay off my mortgage. What a seamless and easy process. Shout out to Caroline for all her help.",
      "rating": 5,
      "date": "2nd July 2024",
      "product": "Mortgages Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Large new self build mortgage",
      "text": "Dudley have worked with us on a large new build and Laura McGinn specifically has been a beacon of professionalism, organisation, communication and customer care. She could not have been better, which is the highest praise I could offer.",
      "rating": 5,
      "date": "28th June 2024",
      "product": "Mortgages Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Great customer service, always so happy to help and...",
      "text": "Great customer service, always so happy to help and so informative and patient.",
      "rating": 5,
      "date": "13th June 2024",
      "product": "Mortgages Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Staff great, business poor. Avoid",
      "text": "The staff and desire to help is second to none, clearly well trained customer facing staff. However the internal processes and infrastructure is abysmally poor. Took us many months to confirm our mortgage deal, and 32 pieces of CDD to verify it. From then, overpayments follow an overly complicated process. I complained to the Ombudsman about our take-on, they ruled in our favour 6 months ago and recommended Dudley make payment. Since then, Dudley simply refuse to make payment, and are using every trick in the book to dodge their duties. Great staff, really poor running of their business. Would avoid at all costs given the competitive market and many other mtg providers. Not worth the hassle.",
      "rating": 2,
      "date": "10th June 2024",
      "product": "Mortgages Reviews",
      "sentiment": "negative"
    },
    {
      "title": "Kind and helpful service.",
      "text": "Kind and helpful service. Easily assisted me with my query and informed me of what I needed to do.",
      "rating": 5,
      "date": "7th June 2024",
      "product": "Mortgages Reviews",
      "sentiment": "positive"
    },
    {
      "title": "I have been dealing mainly with Claire, who is incre...",
      "text": "I have been dealing mainly with Claire, who is incredibly professional and easy to speak to. Can't thank her enough for her support actually.",
      "rating": 5,
      "date": "23rd May 2024",
      "product": "Mortgages Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Fantastic customer service always",
      "text": "They were so helpful with my first ever mortgage and now the renewal too. Always there to explain things to you in simple, easy to understand terms without judgment and without automatic robots on the phone lines!",
      "rating": 5,
      "date": "8th April 2024",
      "product": "Mortgages Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Friendly, knowledgeable and expedient.",
      "text": "Friendly, knowledgeable and expedient. Exceeded my expectation dealing with my transaction.",
      "rating": 5,
      "date": "22nd March 2024",
      "product": "Mortgages Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Equity Redemption",
      "text": "I found Claire to be very helpful with the matter of my late mothers equity redemption she was very professional and explained clearly the things that I had to do. I would gladly recommend anyone who wanted to use their resources",
      "rating": 5,
      "date": "22nd December 2023",
      "product": "Mortgages Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Mortgage broker",
      "text": "It took a long time to get documents reviewed however i like the system",
      "rating": 3,
      "date": "17th November 2023",
      "product": "Mortgages Reviews",
      "sentiment": "mixed"
    },
    {
      "title": "Solution Found",
      "text": "Not the cheapest on the market but have great niche products.",
      "rating": 4,
      "date": "8th November 2023",
      "product": "Mortgages Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Excellent Service",
      "text": "We had a few problems started speaking with Claire Sanders for help and advice.. The commitment from Claire was fantastic as she sorted everything out with kindness understanding and correct advice.. if not for Claire we would have lost the property.. THANK YOU CLAIRE",
      "rating": 5,
      "date": "22nd August 2023",
      "product": "Mortgages Reviews",
      "sentiment": "positive"
    },
    {
      "title": "'A Griffin Savings like' mortgage lender",
      "text": "I am a mortgage admin and I have had a case in since 14th June- the service is slow, the portal has requirements from 2 other banks that are unrelated to the case and apart from James Green, the helplines have been terrible and seem to not want to help The case is agreed subject to val - val report is fine however it has taken over 15 days to get picked up. For document requirements to be reviewed it takes 12+ working days even if it is only a reply to an enquiry. Overall if you need an offer in 2 months- this is not the place. A shame",
      "rating": 2,
      "date": "22nd August 2023",
      "product": "Mortgages Reviews",
      "sentiment": "negative"
    },
    {
      "title": "Genuinely - the worst",
      "text": "Where to start, deal with this half baked, wholly incompetent, bone-idle company at your peril. A simple re-mortgage, of a BTL property with LTV of 60%, proven equity, a two-year AST lease with stable income and two owners with stable jobs an demonstrable incomes has taken 5 months to complete. Why? Because Dudley have shown incompetence to another level, leaving us stuck paying a sky-high SVR on our existing product for 3 months. At each step, they have failed to understand, asked for extra information, misplaced and lost documents, asked the same question multiple times, failed to update us on case progress and shown all round incompetence of which I have never encountered before. I can go into so much more detail, and have to the Ombudsman and my local MP, but am limited to a word count on this box. Long story short - avoid, avoid, avoid. Worth paying a higher rate and fixing with another provider.",
      "rating": 1,
      "date": "20th July 2023",
      "product": "Mortgages Reviews",
      "sentiment": "negative"
    },
    {
      "title": "Extremely happy with 10 years of great service",
      "text": "I have just cleared my mortgage and not stress how happy I have been with the service provided from my first dealings right to the last where I was helped by Grace and as usual it was friendly, polite and efficient",
      "rating": 5,
      "date": "12th July 2023",
      "product": "Mortgages Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Treating Customers fairly??!!",
      "text": "Appalling treatment of existing customer who has been trying to switch her mortgage onto a new repayment method nearly 2 months ago, Poor communication from the lender and still no indication of how long this will take? in the meantime the customer is being putting in a negative financial situation.",
      "rating": 1,
      "date": "26th May 2023",
      "product": "Mortgages Reviews",
      "sentiment": "negative"
    },
    {
      "title": "Re-mortgage made easy",
      "text": "Such helpful and friendly company, never had a problem and all questions I didn’t understand made simple . Thank you",
      "rating": 5,
      "date": "22nd March 2023",
      "product": "Mortgages Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Professional",
      "text": "Very professional service, friendly and knowledgeable staff",
      "rating": 4,
      "date": "16th February 2023",
      "product": "Mortgages Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Very efficient and friendly service",
      "text": "I always receive a fast and helpful reply to my questions.",
      "rating": 5,
      "date": "5th December 2022",
      "product": "Mortgages Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Fantastic customer service, very very helpful and help in so many ways, and so easy to talk to, i cant i would nog be in my property without their help and support, and thsnk them so much",
      "text": "Fantastic builfing society, so very friendly and so understanfing, cant reccomend enough so happy we're with dudley building society thank you so much",
      "rating": 5,
      "date": "1st December 2022",
      "product": "Mortgages Reviews",
      "sentiment": "positive"
    },
    {
      "title": "I was working abroad and the Dudley could not have been more helpful",
      "text": "I was able to keep in contact at all times even though I was in the Middle East and I was able to secure a mortgage over 3 years which was perfect as it finished just before I retired",
      "rating": 5,
      "date": "16th November 2022",
      "product": "Mortgages Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Do not use! 16 weeks and still no offer",
      "text": "DO NOT USE! If I could give 0 star I would. If you value your mental health please do not use Dudley Building Society. After paying an almost £500 fee for a mortgage application (which so many other mortgage lenders do not require) and being reassured by them (and stated on their website) that their lead time for application was 6 weeks, after weeks of chasing, bad communication, mistakes on their part, 16 weeks after my application was submitted, still no mortgage offer despite my broker providing everything required. It was a week before I was due to exchange and still no offer so went with another lender who were excellent and turned an offer round in less than a week. It took Dudley 8 weeks to instruct a valuation and 8 weeks later there was still no valid report due to errors on their and the surveyors part. They do not respond to complaints simply 'reject' them. I actually believe them taking a fee and not proving the service in the timescales stated in the original communication and on their website is not only in breach of the consumer act, but is also fraud. Please do not use them, please do not hand over your money to them. The constant chasing, the constant 'you will have it next week' is mentally draining and has caused me so much anxiety and stress (which they do not care about) I wouldn't want anyone else to do through that.",
      "rating": 1,
      "date": "4th November 2022",
      "product": "Mortgages Reviews",
      "sentiment": "negative"
    },
    {
      "title": "Friendly and supportive",
      "text": "Claire Sanders was amazing today. I am an existing customer needing help with a move and she really helped with solutions and not just words. Makes me happy to be with Dudley and will always recommend. Thank you Claire",
      "rating": 5,
      "date": "20th October 2022",
      "product": "Mortgages Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Friendly and community spirited",
      "text": "We have had a mortgage now with the society for nearly thirty years and I have to speak as I find, they are amazing, through the tough times, we have had a few, they listen, advise and they treat you with respect and kindness as much as if You were about to deposit a million pound. Thank you so much to Claire Sanders, Gemma and Laura and the team Jane",
      "rating": 5,
      "date": "31st August 2022",
      "product": "Mortgages Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Great service and very understanding every time , take time with any issue",
      "text": "My experience has been great with Dudley Building society they have supported me in a very big way and each time took time listening to me please please have your mortgages with Dudley building society you dont need to struggle great proffesional who will listen and guide you too .",
      "rating": 5,
      "date": "27th August 2022",
      "product": "Mortgages Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Help with mortgage areas",
      "text": "Claire sandres has been very helpful and supportive. I have been going through financial and medical difficulties Claire has guided me through the process and her advice has really helped not just financially but mentally too.",
      "rating": 5,
      "date": "24th August 2022",
      "product": "Mortgages Reviews",
      "sentiment": "positive"
    },
    {
      "title": "The Worst Lender EVER",
      "text": "Avoid Dudley at all costs!! 2 months down the line and still no further forward, I work for a broker and have dealt with hundreds of lenders over 6 years, but Dudley is by far the worst I have ever dealt with.",
      "rating": 1,
      "date": "23rd August 2022",
      "product": "Mortgages Reviews",
      "sentiment": "negative"
    },
    {
      "title": "Absolutely shocking",
      "text": "Took 2 months to respond to a request to re-finance. Hiked up the monthyl repayments by 18% without explanation.",
      "rating": 1,
      "date": "14th August 2022",
      "product": "Mortgages Reviews",
      "sentiment": "negative"
    },
    {
      "title": "Poor underwriting process",
      "text": "The society has massive delays on underwriting mortgages. The excuse is low staffing. They also change timescales without warning.",
      "rating": 1,
      "date": "10th August 2022",
      "product": "Mortgages Reviews",
      "sentiment": "negative"
    },
    {
      "title": "A Customer Friendly Society",
      "text": "A friendly, helpful workforce. Very knowledgeable operatives on the phone. Very clear information when circumstances change. Good informative website, although sometimes difficult to access.",
      "rating": 5,
      "date": "25th July 2022",
      "product": "Mortgages Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Disappointed service",
      "text": "I have a expat mortgage with DBS and the incompetent staff who don’t listen and action what I’m asking for. I want to switch my mortgage and it’s taking ages to complete due to the poor communication and listening skills.",
      "rating": 1,
      "date": "19th July 2022",
      "product": "Mortgages Reviews",
      "sentiment": "negative"
    },
    {
      "title": "Good criteria generally",
      "text": "Generally good, but today I have been on hold on two occasions and after 10 minutes asked to leave a message as no-one available and I would get a call back. Call-backs are not being actioned. BDM out of office and mortgage sales email gets a return message saying will respond within 5 days. This is not great service, when you cant speak to anyone at all. Not been my experience with Dudley or regional lenders in the past so quite disappointing.",
      "rating": 3,
      "date": "14th July 2022",
      "product": "Mortgages Reviews",
      "sentiment": "mixed"
    },
    {
      "title": "Self build mortgage",
      "text": "Dudley have been entirely professional and supportive through a complex self build; they literally helped me to keep my project on track",
      "rating": 5,
      "date": "28th June 2022",
      "product": "Mortgages Reviews",
      "sentiment": "positive"
    },
    {
      "title": "mortgage processing",
      "text": "easy system to use and very quick on agreeing cases",
      "rating": 5,
      "date": "21st June 2022",
      "product": "Mortgages Reviews",
      "sentiment": "positive"
    },
    {
      "title": "An Amazing Building Society",
      "text": "Been with Dudley for over three years now. I must say they were the only one willing to take a risk on me. Thank you Dudley",
      "rating": 5,
      "date": "17th June 2022",
      "product": "Mortgages Reviews",
      "sentiment": "positive"
    },
    {
      "title": "rescue service",
      "text": "At a time when as pensioners we needed help, the Dudley Building society came to our rescue,,, a Society that cares",
      "rating": 5,
      "date": "17th June 2022",
      "product": "Mortgages Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Time wasters",
      "text": "Awful experience - complete waste of time. Lack of communication made it impossible to know if there was any progress - they clearly had no intention of sticking to the Mortgage in Principle they gave us.",
      "rating": 1,
      "date": "3rd June 2022",
      "product": "Mortgages Reviews",
      "sentiment": "negative"
    },
    {
      "title": "Mortgage",
      "text": "Dudley building society gave us a mortgage when no other would so for that alone I applaud them . Amazing service",
      "rating": 5,
      "date": "2nd March 2022",
      "product": "Mortgages Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Excellent personal service",
      "text": "The Dudley are very easy to contact. I never have to wait on hold in a long queue, the phone is always answered by a person straight away. They listened well to our personal situation when severely affected by COVID and with their flexibility we were able to come through it. If they want to get hold of us they will phone, unlike other companies who send a txt asking you to phone them, which usually involves a length wait time on hold. Being phoned by the company is much better. I would definitely recommend the Dudley building society.",
      "rating": 5,
      "date": "17th February 2022",
      "product": "Mortgages Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Poor Support",
      "text": "Faced with an issue of needing to reset my password I contacted the Help Desk. I explained that the reset password link was not generating an email. The canned response was that I should use the reset password link….",
      "rating": 2,
      "date": "26th January 2022",
      "product": "Mortgages Reviews",
      "sentiment": "negative"
    },
    {
      "title": "Will never utilize Dudley again and encourage others to avoid",
      "text": "Since obtaining an mortgage with Dudley, my customer experience has been very far from satisfactory. Dudley does not put the customer first and is very limited with communications or advice. I have wasted a lot of time and money being with this provider and have learnt the hard way. Beware....",
      "rating": 1,
      "date": "8th November 2021",
      "product": "Mortgages Reviews",
      "sentiment": "negative"
    },
    {
      "title": "Fantastic service wonderful team",
      "text": "I have had a mortgage for many years with the Dudley, and they have always been informative, courteous, helpful and so easy to talk to, finger on the pulse, up to date information, I trust them fully to be fair and manage my affairs with transparency. All the staff are lovely and friendly, so when I finish my mortgage next month I intend to use the Dudley to invest my savings with an e account, thanks again for all your help you are truly a great team",
      "rating": 5,
      "date": "29th October 2021",
      "product": "Mortgages Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Friendly and effective customer service",
      "text": "After being locked out of my account due to technical issues I rang up DBS and spoke to Brenda. Brenda was very friendly and reassuring. She helped direct my query to the appropriate department to resolve my technical issue and gave me some guidance on another query that I had regarding a mortgage account.",
      "rating": 5,
      "date": "21st October 2021",
      "product": "Mortgages Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Kingswinford branch review",
      "text": "Allowed my family lifetime discout off my first mortagge (0.5%( for the term (in 1986), motivated us to stay with society when moved twice after that",
      "rating": 5,
      "date": "16th August 2021",
      "product": "Mortgages Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Good All Rounder",
      "text": "Dudley are a great lender with niches that other lenders dont have. Great for expat.",
      "rating": 5,
      "date": "23rd July 2021",
      "product": "Mortgages Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Safe, steady, and responsive",
      "text": "Dudley is easy to deal with. The online service now makes seeing status & balances much easier and still with that friendly tough",
      "rating": 5,
      "date": "16th June 2021",
      "product": "Mortgages Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Helped us when most needed",
      "text": "We were really pleased Dudley could help us with our mortgage",
      "rating": 5,
      "date": "15th June 2021",
      "product": "Mortgages Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Very helpful underwriting with Dudley BS",
      "text": "You can get all support with your case from beginning to the completion.",
      "rating": 5,
      "date": "28th May 2021",
      "product": "Mortgages Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Nice building society nice people",
      "text": "Gemma was professional and friendly and dealt with my request for information about my mortgage in a confident and knowledgable way.",
      "rating": 5,
      "date": "5th May 2021",
      "product": "Mortgages Reviews",
      "sentiment": "positive"
    },
    {
      "title": "New online facility",
      "text": "Bit disappointed in your new on line facility. I was hoping there would be some more tools you could use especially in making repayments on your mortgage if you wanted an idea how much you can make overpayments and what effect this will have to the outstanding balance. It has very limited use to the customer apart from telling you the outstanding balance. I think if you want more customers to use it additional tools needed to be added.",
      "rating": 1,
      "date": "25th April 2021",
      "product": "Mortgages Reviews",
      "sentiment": "negative"
    },
    {
      "title": "Taking the risk",
      "text": "When I was looking for a lender to help me buy my flat, Dudley was prepared to do so when so many others had turned me down. I am thankful they took a risk to help me out. I have recently renewed my mortgage with Dudley for the next 5 years.",
      "rating": 5,
      "date": "18th April 2021",
      "product": "Mortgages Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Product suitability excellent customer service",
      "text": "Offered mortgage when other societies not doing so for over 60+. Succinct easy to understand information on phone & in writing. Competitive rates. Prompt efficient professional yet friendly staff/ customer service. Thank you",
      "rating": 5,
      "date": "13th April 2021",
      "product": "Mortgages Reviews",
      "sentiment": "positive"
    },
    {
      "title": "An excellent service",
      "text": "DBS have provided a excellent service that has enabled us to be on the property ladder, within a short period of time",
      "rating": 5,
      "date": "11th April 2021",
      "product": "Mortgages Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Dudley your the best.",
      "text": "Great products and service. Friendly ans supportive staff. More than a bank, building a community through providing great all-round service.",
      "rating": 5,
      "date": "10th April 2021",
      "product": "Mortgages Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Excellent all round service",
      "text": "As a .Ex Pat applying for a buy to let mortgage Dudley helped me with my application with very little fuss Also excellent customer service and advice",
      "rating": 5,
      "date": "9th April 2021",
      "product": "Mortgages Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Family supportive Building Society",
      "text": "My family, parents, sisters and nephews have all been members of the Dudley for many years, with savings and.mortgage accounts. The support and service provided over the years has been greatly appreciated, especially through recent challenging times due to COVID. Thank you!!!!!",
      "rating": 5,
      "date": "9th April 2021",
      "product": "Mortgages Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Dudley Building Society gave me a new lease of life.....",
      "text": "When my original mortgage ran out at age 75 I needed another mortgage to pay off a still outstanding debt. Dudley came to my rescue by offering a repayment mortgage that helped me remain in my own home. I have always found them to be very courteous and caring in my dealings with them. Dudley might be small but they have a BIG Heart and will always be Special To Me.",
      "rating": 5,
      "date": "9th April 2021",
      "product": "Mortgages Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Offered us a great mortgage",
      "text": "Provided us with a great mortgage and when it came to renewing it was such a quick and easy process with sorting another great deal.",
      "rating": 5,
      "date": "9th April 2021",
      "product": "Mortgages Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Dudley building society- mortgage application simplicity",
      "text": "What a pleasurable experience from application to the acceptance of our mortgage application. No criticism just praise.",
      "rating": 5,
      "date": "9th April 2021",
      "product": "Mortgages Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Service with a smile",
      "text": "I have been a member of DBS for a number of years, I have both savings and mortgage products with DBS and always found the service to be informed and very helpful, offering advice with any query or problem I may have.",
      "rating": 5,
      "date": "9th April 2021",
      "product": "Mortgages Reviews",
      "sentiment": "positive"
    },
    {
      "title": "The understanding Society",
      "text": "When all other options for a mortgage were rejected 5 years ago Dudley came to our rescue and loaned us the money to buy our house.. we have never looked back and thank them for the trust and support.",
      "rating": 5,
      "date": "9th April 2021",
      "product": "Mortgages Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Poor communication",
      "text": "Poor communication, don’t carry out tasks on time and generally a really poor service - worst I have seen from a bank!",
      "rating": 1,
      "date": "1st April 2021",
      "product": "Mortgages Reviews",
      "sentiment": "negative"
    },
    {
      "title": "Heylo , self build, ex pat resi",
      "text": "A great specialist lender with various products also their underwriter Chanelle is brilliant at her job",
      "rating": 5,
      "date": "1st April 2021",
      "product": "Mortgages Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Joint account misogyny",
      "text": "I have always been very pleased with the service I have received at Dudley but one thing that constantly annoys is the fact that although I initially contacted, and have always been the one to contact them as I run the account, they chose to put my husbands name first on our mortgage. I recently joined online. It is my email and phone number on the online service but they wrote (as they always do) to my husband to confirm he had joined online. Why was this not at the least a letter addressed to us both? This is such an outdated and misogynistic practice.",
      "rating": 4,
      "date": "18th March 2021",
      "product": "Mortgages Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Very responsive and helpful during the recent payment holiday period.",
      "text": "Whilst the application process was ponderous and protracted, they were dealing with a fairly unusual one. We did resent having to give a second charge on our main London home in addition to the property mortgaged.",
      "rating": 3,
      "date": "18th March 2021",
      "product": "Mortgages Reviews",
      "sentiment": "mixed"
    },
    {
      "title": "Super helpful",
      "text": "So helpful during a stressful time buying a house. Great deal offered. No hassle renewing mortgage after the three years.",
      "rating": 5,
      "date": "11th March 2021",
      "product": "Mortgages Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Friendly and Professional",
      "text": "When I bought my flat nearly 4 years ago, I was very surprised to receive a huge welcome box of goodies from Dudley. This year, my mortgage was up for renewal and I decided to stay with Dudley for another 5 years. It was a pleasure to speak with the staff; they are attentive and helpful in their reply; very patient in answering my many questions; sending information and literature to help me in my decision making. I am very pleased to be their customer.",
      "rating": 5,
      "date": "10th March 2021",
      "product": "Mortgages Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Nice People To Do Business With....",
      "text": "Three years ago at the age of 75 I applied to Dudley for a mortgage to replace my old one that had expired. Every other building society turned me down because of my age, but Dudley didn’t and their mortgage gave me security of tenure ever since. I will always be grateful to Dudley Building Society and always speak highly of them to my friends because Dudley take a positive approach to mortgages. Thank You!",
      "rating": 5,
      "date": "10th March 2021",
      "product": "Mortgages Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Strong sense of family and community and being together.",
      "text": "Good service. Kind and friendly staff. Community and people focused. More than a business.",
      "rating": 5,
      "date": "10th March 2021",
      "product": "Mortgages Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Brilliant attention to personal need",
      "text": "As a self-employed foster carer with many, many miles on the clock, seventy plus in fact, most building societies and banks laughed me out of court. Not so with Dudley. They took the time to look at my needs and my capacity and the attention I received in applying for, and completing, my mortgage was outstanding.",
      "rating": 5,
      "date": "10th March 2021",
      "product": "Mortgages Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Great people in a fantastic part of the planet",
      "text": "They always want to do the right thing. They're friendly and normal.",
      "rating": 5,
      "date": "10th March 2021",
      "product": "Mortgages Reviews",
      "sentiment": "positive"
    },
    {
      "title": "The customer service provided by The Dudley is of the highest calibre I ever experienced.",
      "text": "Prompt response to enquiries, understanding of customer needs, nothing any trouble, a comprehensive range of products, nice touch like a gift box sent to my new home",
      "rating": 5,
      "date": "10th March 2021",
      "product": "Mortgages Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Super steady",
      "text": "A very good service where all queries are answered in a timely and polite way, good communications and recommend this building society whole heartedly.",
      "rating": 5,
      "date": "10th March 2021",
      "product": "Mortgages Reviews",
      "sentiment": "positive"
    },
    {
      "title": "helpful",
      "text": "great service, and always helpful",
      "rating": 5,
      "date": "10th March 2021",
      "product": "Mortgages Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Responsive",
      "text": "We were able to quickly get a mortgage. Very helpful in the process",
      "rating": 5,
      "date": "10th March 2021",
      "product": "Mortgages Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Dudley building society",
      "text": "Dudley have been great, keeping us posted every step through our mortgage",
      "rating": 5,
      "date": "10th March 2021",
      "product": "Mortgages Reviews",
      "sentiment": "positive"
    },
    {
      "title": "i was unable to set up online",
      "text": "after following the process the message recieved was that i did not have a mobile registered. So i was unable to set up online. Yet i have recieved a letter today welcoming me to the online system. If there is any assistance to set up i would welcome this. regards Mrs Fletcher",
      "rating": 1,
      "date": "27th February 2021",
      "product": "Mortgages Reviews",
      "sentiment": "negative"
    },
    {
      "title": "Helpful and quick phone response to questions",
      "text": "Easy to sort out problems and queries. Thank uou",
      "rating": 5,
      "date": "26th February 2021",
      "product": "Mortgages Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Great customer service always.",
      "text": "I have always found the customer service team to be very helpful and happy to help. I have a speech impediment but i am always made to feel comfortable when paying my mortgage over the phone. Can't thank the team enough.",
      "rating": 5,
      "date": "25th February 2021",
      "product": "Mortgages Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Fantastic friendly society with great criteria.",
      "text": "Flexible underwriting has resulted in a mortgage that I couldn’t of dreamed before.",
      "rating": 5,
      "date": "18th January 2021",
      "product": "Mortgages Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Excellent Service, highly recommended",
      "text": "I can not praise Dudley's staff and service enough, we have had our Mortgage with them for many years, they have always been so helpful, staff are so professional and very polite and friendly at all times, always willing to help in any situation. I would recommend Dudley to anyone without any hesitation whatsoever. Carry on with good work Dudley and thank you very much.",
      "rating": 5,
      "date": "13th January 2021",
      "product": "Mortgages Reviews",
      "sentiment": "positive"
    },
    {
      "title": "renewal enquiry",
      "text": "brilliant ... 2 telephone calls both dealt with very polite and friendly and informative i called 2nd time to say my paperwork hadnt arrived to which i was dealt with and a second lot posted ... ten mins after i put the phone down ...the first lot of paperwork arrived (oops me being a bit too keen ) anyway i filled out the paper work ..called the office and dropped it staight down to a lovely lady who i had been talking to on the phone and now i know my renewal is in safe hands thank you for putting up with an awkward customer",
      "rating": 5,
      "date": "12th January 2021",
      "product": "Mortgages Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Friendly Support",
      "text": "We have held a mortgage with Dudley Building Society for over 15 years. We love the fact that you can always reach an adviser who is friendly, helpful and happy to help. We wouldn’t change providers purely because of the exceptional support you get from the team.",
      "rating": 5,
      "date": "29th June 2020",
      "product": "Mortgages Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Non standard mortgage",
      "text": "As a borrower who was both 65 and self employed I found the approach of DBS to be refreshingly different to the high st banks who still prefer to lend to younger applicants who are employed",
      "rating": 5,
      "date": "10th August 2019",
      "product": "Mortgages Reviews",
      "sentiment": "positive"
    },
    {
      "title": "The Dudley deliver a thorough, personal, reliable and quality service.",
      "text": "Post completion I found the Dudley personnel to be helpful, patient and advisory. An excellent service.",
      "rating": 4,
      "date": "24th July 2019",
      "product": "Mortgages Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Brilliant service",
      "text": "Brilliant service with no hassles and problems. Will surely recommend to my family and friends.",
      "rating": 5,
      "date": "12th July 2019",
      "product": "Mortgages Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Unlike any other provider",
      "text": "Our application was not run of the mill. It was dealt with quickly and without any problems with updates every step of the way. A lovely surprise was the fantastic hamper we received on moving in to enjoy a lovely cup of tea and goodies. As we say 'Unlike any other provider'",
      "rating": 5,
      "date": "27th June 2019",
      "product": "Mortgages Reviews",
      "sentiment": "positive"
    },
    {
      "title": "terrible customer service",
      "text": "terrible customer service received, I have spoken too 3 different people with same results. Loyal customer didn't make a difference when going for a mortgage",
      "rating": 1,
      "date": "3rd May 2019",
      "product": "Mortgages Reviews",
      "sentiment": "negative"
    },
    {
      "title": "Wouldn't recommend",
      "text": "Took 9 weeks just to issue the mortgage offer.",
      "rating": 1,
      "date": "24th December 2018",
      "product": "Mortgages Reviews",
      "sentiment": "negative"
    },
    {
      "title": "Tailored product/s efficient courteous service",
      "text": "In 2016, being over 65 but with very good regular pension income & good equity in my home no other building societies would offer a mortgage or re mortgage that I required to help my daughter in financial hardship after marriage break up except Dudley BS via a financial management co. The initial 2yr fixed mortgage matured & Dudley BS provided options to continue with them. I chose a very competitive rate 3 Yr fix. Staff have proved efficient prompt polite helpful in all dealings with society. Process ' hassle free'. Literature/ options & statements clear. I am pleased to offer this very positive endorsement of their products & service.",
      "rating": 4,
      "date": "25th June 2018",
      "product": "Mortgages Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Registering power of attorney",
      "text": "Very friendly and efficient as always",
      "rating": 5,
      "date": "28th July 2022",
      "product": "Protection Advice",
      "sentiment": "positive"
    },
    {
      "title": "Staff lovely professional",
      "text": "Really excellent service given today, dealt with lovely advisers , and just spoken to Lorna credit to your company",
      "rating": 5,
      "date": "9th November 2021",
      "product": "Protection Advice",
      "sentiment": "positive"
    },
    {
      "title": "Checking about bank detail changes",
      "text": "Went through security and had my mind put at rest emedialey as there are so many scams at the moment and I wanted to make sure the email about your bank detail changes were from you knowing it was has put my mind at rest thank you",
      "rating": 5,
      "date": "5th November 2020",
      "product": "Protection Advice",
      "sentiment": "positive"
    },
    {
      "title": "Excellent service and people who care about people",
      "text": "Excellent service and people who care about people",
      "rating": 5,
      "date": "23rd January 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Opened a regular saver via the post.",
      "text": "Opened a regular saver via the post. All very quick and efficient. Great service.",
      "rating": 5,
      "date": "24th November 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Setting up the account felt rather old-fashioned...",
      "text": "Setting up the account felt rather old-fashioned with having to get ID verified on paper and completing the application on paper and by post, however, it was all completed and correctly. It would be nice if they could print on the back of the first page of the letter with the second half to save a piece of paper, or perhaps condense the correspondence to the essentials.",
      "rating": 4,
      "date": "11th November 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Carol Davies,served me and right from the start kind...",
      "text": "Carol Davies,served me and right from the start kindness was shown and nothing was to much trouble,considering it was early Monday morning and I came unannounced.well done.",
      "rating": 5,
      "date": "4th November 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Savings",
      "text": "Very professional with dealing with my financial problems",
      "rating": 5,
      "date": "18th April 2021",
      "product": "Will Writing",
      "sentiment": "positive"
    },
    {
      "title": "Brierley Hill Branch review",
      "text": "Lovely friendly staff. Nothing is too much trouble",
      "rating": 5,
      "date": "18th April 2018",
      "product": "Will Writing",
      "sentiment": "positive"
    }
  ]
}