{
  "society": "Ecology Building Society",
  "slug": "ecology-building-society",
  "smpUrl": "https://smartmoneypeople.com/ecology-building-society-reviews/products",
  "totalReviewsOnSMP": 669,
  "avgRating": 4.9,
  "scrapedAt": "2026-02-06T15:40:37.820413+00:00",
  "reviews": [
    {
      "title": "I am very happy.",
      "text": "I am very happy. Good job and good luck",
      "rating": 5,
      "date": "16th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Time wasters",
      "text": "Misleading application process, lack of updates, unprofessional customer service. Waste of time.",
      "rating": 1,
      "date": "6th December 2023",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "A personal bank that outs its money where its beliefs are",
      "text": "Our housing coop took a mortgage with Ecology Building Society almost 20 years ago. A man called Jon sorted it out for us. We're now building 29 new houses and need a new mortgage - guess what? Jon has sorted it for us.",
      "rating": 5,
      "date": "15th March 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Making our dream come true!",
      "text": "When we went for a mortgage with the bank we use for all our banking, one that says it supports people like us -farmers wanting to build a home and going that extra mile for us and then they turned us down and so did all the other normal banks just because our barn conversion was a little unique and different it was Ecology who gave us a mortgage and made our dream come true. It was easy and simple and more importantly sensible. Just common sense!",
      "rating": 5,
      "date": "14th March 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Underpinned a 50 year community for the last 10 years.",
      "text": "The Ecology Building Society provided a large loan for us to buy back half of a historic building that has been home to a changing community over 50 years. We have a social and environmental approach to sharing while we also all get on with our own lives. A grand house built for a rich family has been home to up to 19 people of all ages and backgrounds at a time. Without the Ecology we could not have done this.",
      "rating": 5,
      "date": "13th March 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Mortgages safe as houses",
      "text": "The Ecology Building Society has been helpful over the years in providing information and advice",
      "rating": 5,
      "date": "13th March 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very helpful",
      "text": "We needed a self-build mortgage for an unusual house built to high thermal eficiency standards. Elsewhere was often \"computer says no\". Ecology took the time to understand the concept and then couldn't have been more helpul. Great people, great philosophy. All lenders are not equal!",
      "rating": 5,
      "date": "12th March 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Community and friendly",
      "text": "Old school banking principles in a digital age",
      "rating": 5,
      "date": "27th April 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Imaginative and individual service",
      "text": "The Ecology supports the sympathetic preservation of old buildings and granted a mortgage on our 450-year-old home after a major building society withdrew its offer at the last minute on questionable grounds.",
      "rating": 5,
      "date": "16th April 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Mrs Carole Neal",
      "text": "They were the only Building Society that would finance our unusual eco project and provided support and took an interest right through to completion. We were invited to present our project to other members at their AGM in order to help those members in their own projects. We have not hesitated to recommend the Ecology Building Society to other people in our position. They provided finance up front which meant that we didn't have to get a bridging loan which is common practice for self builders, When we required more money late in the project that money was readily forthcoming. As both borrowers and savers we have attended many AGMs, which are always well attended, and have been made welcome and our points and opinions have been valued. It is truly a members' society.",
      "rating": 5,
      "date": "13th April 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Opportunity",
      "text": "The Ecology B.S through their mortgage products gave me the opportunity to fulfil my dream of a self build using non mainstream products ie car tyres and strawbale. I would like to thank both the founders of the society and the always helpful staff.",
      "rating": 5,
      "date": "13th April 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Best ethical mortgage provider/Customer Service Champion",
      "text": "We chose the Ecology Building Society because we wanted to build an Eco friendly PassivHaus. We knew nothing about them apart form the fact that this was the type of project to which they lent money. However, our journey with them has been very enjoyable. The staff at Ecology have been delightful and easy to deal with. They understood the building process and didn't delay decisions. They have treated us fairly and continue to do so, and their instructions are straightforward and understandable. We always feel like everything is transparent and there is no hidden red tape. We would wholeheartedly recommend them.",
      "rating": 5,
      "date": "10th April 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Always helpful, kind and professional, with a mission that is positive to the world",
      "text": "They gave us a self build mortgage at a time that no one else would as mortgages were tougher to get. Our house is environmentally positive with good insulation, solar panels, air source heat pump and underfloor heating, with no gas connection, which fits well with ecology's mission. We couldn't have achieved our dream home without their support. They made the process really easy to apply, with a lot of support throughout and stayed in contact throughout the build to ensure that we were always on the best rate that they could offer. Always helpful, kind and professional, with a mission that is positive to the world.",
      "rating": 5,
      "date": "8th April 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Eco focussed Loans",
      "text": "We obtained a mortgage for a piece of natural English woodland to enjoy the peace and tranquility of nature. Without Ecology and their products this would never been a reality. Thanks to Ecology and their forward thinking approach to sustainability we have been able to live the dream to own our own Woodland! I can't recommend them enough!",
      "rating": 5,
      "date": "8th April 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "True to their principles",
      "text": "The Ecology BS provided us with a mortgage when no one else would. It was a risky project but one true to Ecology's principles and a zero carbon future. The Ecology look at the big picture and support those of us working for a better, greener future.",
      "rating": 5,
      "date": "8th April 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Satisfied customer",
      "text": "We are delighted to have our mortgage with Ecology. We know that our money is doing good in the community and that social responsibility and ethics are taken very seriously. Without the Ecology, many socially responsible eco-housing projects across the UK would not have been possible. Their newsletter is very positive and inspiring. We have had no issues with the management of our mortgage over the past 15 years and we have made many energy-efficiency improvements to our home during that time. We wish them every success.",
      "rating": 5,
      "date": "8th April 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Game-changer",
      "text": "Without our loan from Ecology BS, we would never have got our community-led housing project off the ground.",
      "rating": 5,
      "date": "8th April 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent experience - Eco renovation mortgage",
      "text": "The Ecology Building Society (BS) have been exceptional. We bought an agricultural property, which had a number of restrictions that other lenders knew very little about and/or were not willing to consider (either at all or without a 20%+ deposit). The Ecology BS had fantastic working knowledge of agricultural ties and Mary Blackburn supported us throughout the application process - which involved a number of additional steps, due to the type of property. Their customer service is truly amazing, run by a small and incredibly friendly team. We are renovating the mortgaged property to a high energy efficient standard. The Ecology BS shared our enthusiasm for the project, advising on both short and long term options. We will soon complete Phase 1 of the retrofit, with the Ecology renovation mortgage offering C-Change discounts on the mortgage interest rate, to reward improved energy ratings. Amid the current context of a climate emergency, this type of financial incentive for Eco works is immensely valuable – both in terms of individual finances and the wider impact on the planet. It has been a genuine pleasure to deal with such an ethical and sustainable bank and I would 100% recommend them to anyone and everyone. Thank you Ecology!",
      "rating": 5,
      "date": "8th April 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent communication, efficient service",
      "text": "We have had a superb experience with Ecology. They have by far been the most helpful and easiest financial institution we have dealt with. The communication with staff has been excellent and service has been really efficient - something that is often lacking with financial institutions. I have already recommended them to others a number of time sand will continue to do so.",
      "rating": 5,
      "date": "8th April 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Keeping it simple",
      "text": "First time self building a home, so was very daunted by the prospect of this type of mortgage, however I needn't have worried. The flexibility offered by Ecology is second to none, allowing you to withdraw funds as and when you need, and the process to do so only involves a quick email. Can't recommend them highly enough",
      "rating": 5,
      "date": "8th April 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Simply Outstanding - A brighter, greener future to mortgage finance",
      "text": "Our experience of Ecology has been absolutely faultless from the very first phone enquiry that we made, throughout the mortgage application process and through the duration of our self-build so far. Their customer service is outstanding - questions and queries are dealt with very efficiently by friendly, helpful people, who seem to really know what they are doing. Each time we’ve made a draw down, the funds have reached our bank account on the same day. When we needed to request a short payment holiday, they facilitated that seamlessly. Whenever we speak to someone at Ecology, they seem very knowledgable and well informed and that means that our queries have been answered fully and swiftly. They also seem to really understand the challenges facing self-builders; their guidance and advice has always been clear and reassuring. Their commitment to sustainable approaches to building and development is fundamental to all that they do. They lend money to projects in ways which enable genuinely progressive approaches to building and renovating houses and communities. With a very modest budget, we have built an accessible timber frame home that is ultra energy efficient and sustainable in the true sense. It also complies fully with building regulations, yet because our house isn’t traditional bricks and mortar, Ecology were the ONLY lenders that would even consider offering us a mortgage. Home building must evolve to become more efficient and sustainable in order to meet the challenges of this century. The materials and technology to do this already exist, but if they are to be widely adopted in the mainstream it will require more mortgage providers to be like Ecology - supporting and funding projects which demonstrate how a brighter, greener future could be built.",
      "rating": 5,
      "date": "7th April 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "They try to understand you",
      "text": "People who will listen to projects and will support individuals by making decisions on merit. Clients are not just anonymous ticked boxes.",
      "rating": 5,
      "date": "7th April 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Saved the day",
      "text": "We were getting stuck in to our development when COVID hit and our lender pulled out. Ecology were quick to offer f8nance and proceed seamlessly. They have been very helpful throughout the process.",
      "rating": 5,
      "date": "7th April 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Saviours!",
      "text": "At the age of 67 no other mortgage provider would lend me the money to complete a timber build house in the West Highlands. Ecology had no hesitation in doing so. I found the staff very friendly and approachable and at all times I felt I was being treated with kindness and understanding when other lenders (particularly RBS with whom I had banked for 50 years) were dismissive.",
      "rating": 5,
      "date": "7th April 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "They get sustainability!",
      "text": "Our plans for our house were nodded through when other lenders seemed threatened by a degree of innovation. The questionnaire drove us to do more! They were on the ball from the start to the end and we were delighted with their help. We still save with them despite there being no interest to speak of because we want to see them help others as they did us.",
      "rating": 5,
      "date": "7th April 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "ecology building society",
      "text": "efficient and ethical service providing an environmentally friendly service at all times with a strong emphasis on the climate emergency.",
      "rating": 5,
      "date": "7th April 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Highly recommended",
      "text": "Very helpful service and a breath of fresh air compared to other mortgage providers.",
      "rating": 5,
      "date": "7th April 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Can't go wrong with great cause and excellent service",
      "text": "It's been a delight dealing with Ecology and everyone I've been in contact has been extremely kind and patient with me. A level of service that you don't see nowadays.",
      "rating": 5,
      "date": "7th April 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent mortgage provider who prioritise the environmental benefits of new build homes.",
      "text": "Delighted I was able to get my mortgage with Ecology, they consider the environmental benefits contained within the property. A great experience",
      "rating": 5,
      "date": "7th April 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Pure Haus",
      "text": "Ecology have been very supportive of our goal to revolutionise the built environment. We highly recommend them, they are a great team",
      "rating": 5,
      "date": "7th April 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Ethically and sustainably sound",
      "text": "We financed our old brick barn re-build in North Yorkshire through Ecology. One of the few if not only finance companies that actively encourage sustainable builds and renovations, If only all finance was as clean as Ecology!",
      "rating": 5,
      "date": "7th April 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Top Equal Opportunities Bank",
      "text": "With my partner being disabled and us having children recently, we were forced to close our company and claim benefits, hopefully temporarily. Ecology, we're the only bank we could turn to when considering a mortgage and treated us with discrimination. Brillian service all round, TOP BANK!",
      "rating": 5,
      "date": "7th April 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "One day all lenders will be like this",
      "text": "We built our own house and spent the best part of 9 months jumping through the hoops laid out by anither building society. In the end they left us high and dry so we turned to Wcology, expecting our build to be delayed while we negotiated a new set of hoops. Incredibly we spoke to a real person who asked relevant questions and who actually understood the answers. Suddenly our home was within reach and exchanged tears of frustration and worry for tears of joy. There was more to come and when our build costs rocketed and we were heading for doom, Ecology stepped in, calmed us down and lent us more money. Weeks of worry sorted with one phone call. One day all lenders will be like this. Listening, understanding, guiding and problem solving. All with a smile and great humour. Real people.",
      "rating": 5,
      "date": "7th April 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Renovation of 17th century thatched cottage",
      "text": "30 years ago the EBS were the only mortgage providers in the whole country that would lend on a property that had no bathroom. We are still living here (with a bathroom !) and had second thatch on roof with financial help from EBS. Thanks EBS.",
      "rating": 5,
      "date": "7th April 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Renovation mortgage",
      "text": "Helped us get our redevelopment project underway after years of planning and not finding a way forward till we spoke to Ecology",
      "rating": 5,
      "date": "7th April 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Interest rate went down, mortgage went down, good stuff",
      "text": "No issues so far, was the only company at the time who would do the Shared Ownership I needed",
      "rating": 4,
      "date": "22nd March 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Ecology made it Possible",
      "text": "Ecology's mortgage enabled us to complete our straw bale house which no other financial provider we approached would touch! Thank you for not being afraid of something non-mainstream. We now live comfortably in our lovely warm house.",
      "rating": 5,
      "date": "18th March 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Friendly, approachable Society",
      "text": "From initial contact through to mortgage release Ecology have been more than just a building society with friendly and helpful employees, I'd definitely recommend",
      "rating": 5,
      "date": "17th March 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent service - customer-focused and friendly",
      "text": "Gaining any mortgage can be a fraught experience, and this can be particularly true for a self-build house. Throughout the application and since, Ecology have focused on the outcomes I was trying to achieve, not simply on ticking their own boxes (though, of course, that still needed to be done!). They were extremely helpful in shaping their offer to best meet my needs and were always very prompt in responding to my queries. I believe I could not have done better in choosing Ecology to supply my mortgage needs.",
      "rating": 5,
      "date": "17th March 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "super-efficient friendly clear customer service",
      "text": "Ecology were fantastic during my self-build project. It was easy to get through to a human being on the phone and I always got a very clear answer to any query. When I needed action (e.g. a retention release) it always happened within 24 hours of requesting it.",
      "rating": 5,
      "date": "16th March 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "my eco friendly home made possible",
      "text": "I almost gave up on building my dream self build environmentally friendly home as I could not afford self build industry interest rates. Then I found Ecology building society and my dream became a reality. Excellent friendly customer service, the most competitive interest rates by far, a strategy not based on greed snd high fees but helping people build efficient homes. After watching grand designs for years I have build my home and enjoy it every day thanks to ecology building society. For me they were a lighthouse in a dark storm of despair.",
      "rating": 5,
      "date": "16th March 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great company to deal with, and with good values!",
      "text": "We were not able to get a standard mortgage through other lenders as the house we wanted to buy was in need of complete renovation. Researching our options led us to finding Ecology. We were able to get a mortgage with the aim to improve the energy efficiency rating of the property which lined up well with what we wanted to do anyway! The process of applying for the mortgage involved setting out our plans for the renovation which was time consuming and fairly challenging but any queries we had were dealt with quickly and we received great support from Ecology to guide us through this whenever we needed it. We would definitely recommend Ecology to anyone in a similar situation!",
      "rating": 5,
      "date": "15th March 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Ethical and user friendly",
      "text": "It feels like I'm taking to people who understand - not just a call centre. You can explain situations and agree resolution of issues that you would send no chance of achieving with the high street banks",
      "rating": 5,
      "date": "15th March 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Savings",
      "text": "On line news about the support given to good house builds by individuals or communities is an important way to use funds available.",
      "rating": 5,
      "date": "15th March 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Best customer service",
      "text": "We have had our self build mortgage with the Ecology Building Society from the start of our build. Our needs were very exacting, a large mortgage, and unusual build and the challenges of a self build. Having originally gone to a broker and failed we went directly to the EBS and they confirmed the mortgage in a matter in a few weeks. The EBS customer service is just amazing, I do not know of any other bank who would take such an interest in a build and actually come to site to see the build in progress. A great team offering an excellent product.",
      "rating": 5,
      "date": "15th March 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Self-build house",
      "text": "After meeting resistance from a high street mortgage lender we approached Ecoloy with our project for a low energy self-build dwelling with a degree of scepticism. Our concerns soon vanished as the whole process proved to be very straightforward with excellent communication both by email and telephone and with no annoying press 1,2,3, etc!. Overall we were very pleased with the outcome and very happy to be working with an ethical lender like Ecology.",
      "rating": 5,
      "date": "15th March 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Two BBC Awards",
      "text": "The EBS granted us their first green business loan in 1990 at a time when the banks did not have the vision. We were very successful & have saved with them ever since. They are personable, friendly and efficient. In 30 years we have never had a problem & feel closely loyal to them.",
      "rating": 5,
      "date": "14th March 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Real People making ethical decisions",
      "text": "Unlike the mass- market algorithm approach (\"computer says no\") the Ecology BS is staffed with real people. They listen to their customers; they not only consider unconventional projects they actively encourage them! The Ecology BS is supporting diverse projects and helping diverse people deliver them all over the UK. Well done !",
      "rating": 4,
      "date": "14th March 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Encouraging building the right way",
      "text": "Building an ecological home is highly challenging, but it makes a huge difference when you can rely on your mortgage provider to be supportive and encouraging of these endeavours. Great people with the right products to encourage people like me to do the right thing for the environment",
      "rating": 5,
      "date": "13th March 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Supportive, pragmatic and environmentally sound",
      "text": "Ecology Building Society supported me to self build/renovate an off grid Galloway Cottage. They were realistic and made draw down of funds during the build simple. I have continued my mortgage with them to support their environmental agenda.",
      "rating": 5,
      "date": "13th March 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Self Build Support",
      "text": "Amazingly easy to deal with, super-friendly staff you can speak to. Great to have this available to support our self-build and by far the least stressful element :)",
      "rating": 5,
      "date": "13th March 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Good quick efficient service",
      "text": "Very easy to speak to, very helpful explained everything in plain English, can't recommend them enough and have done to anybody who is looking for a self build mortgage",
      "rating": 5,
      "date": "12th March 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "great",
      "text": "great service. very friendly advice",
      "rating": 5,
      "date": "12th March 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "The best place to save your money and invest in the future without damaging our planet",
      "text": "I joined the Ecology Building Society as a TESSA saver and then as a new ISA saver to save for a future project whilst supporting this incredible organisation and their projects. Later, I gained a mortgage through them, paid through the Coop Bank, for a sustainable and sympathetic restoration of two cottages, divided many years ago and re-joined using local and natural reclaimed materials and improving the warmth of the home using UK natural sheep's wool insulation. Our shelter and future have been made possible whilst investing and sharing our planet, and with less damage to it.",
      "rating": 5,
      "date": "12th March 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "you and the planet..they care for!",
      "text": "Very easy to deal with,so friendly,relatively small but caring and capable...what is not to like!",
      "rating": 5,
      "date": "12th March 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Friendly, helpful, thorough and quick",
      "text": "We are self builders who needed more capital than expected, Ecology understood the situation, responded quickly and helpfully. Plain English paperwork, sensible and thorough questions and checks but always supportive of our modern construction methods and energy efficiency goals. Their pro-active customer service also makes them a delight to deal with once the mortgage is approved. Excellent all round!",
      "rating": 5,
      "date": "12th March 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Helping us build our dream",
      "text": "The Ecology Building Society has stuck with us for 18 years. As a coop we needed a mortgage to buy our first house. They were the only mortgage lender that understood us. Years later they helped us buy our second house and now they have not only provided a £2 million pound loan but also supported us to get other funding to build 29 eco houses and a common house for the whole community to share. We truly believe that it is only because of their strong ethical approach that they have been able to believe in us and our dream.",
      "rating": 5,
      "date": "12th March 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Finance with a human face",
      "text": "The Ecology were not only green before it was fashionable, but they still treat members with respect. They are one of the few modern institutions who still seem to value customer loyalty.",
      "rating": 5,
      "date": "12th March 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Ethical Friendly Service",
      "text": "We have had our mortgage with the Ecology for 23 years. They helped us realise our dream of land and a barn to convert when no other lender could understand the concept of being as energy efficient as possible. Since then they have helped us with further advances for more updated energy measures and the same small team and personal service still exists as it did 23 years ago. How many banks can retain that level of polite friendly service as they did 20 plus years ago! I'm pleased we never left for a 'better rate' only to be stung with unforeseen costs, I will be proud to have supported the bank that supported us when no one else would right to the end of 25 year term :)",
      "rating": 5,
      "date": "12th March 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Sustainability",
      "text": "Love the ethics of EBS and their tremendous support over the years . Austin",
      "rating": 5,
      "date": "11th March 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent service",
      "text": "Easy, friendly, supportive and always available",
      "rating": 5,
      "date": "11th March 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Ecology Make It Possible",
      "text": "Ecology was the only building society that would give a mortgage for an eco build in hempcrete.",
      "rating": 5,
      "date": "11th March 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Enabling active ecology",
      "text": "The Ecology Building society put their faith in me to build my home to the highest ecological standards. They have very exacting fiscal requirements, which shows good financial prudence, whilst also enabling ecology to be brought to life through creating my eco home.",
      "rating": 5,
      "date": "11th March 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Ideally matched lender for our needs and beliefs",
      "text": "In 2008 Ecology was the only lender we could find that would lend for a green self-build farmhouse with an agricultural occupancy condition. They have been flexible and responsive ever since, and the C-change discount for our A-rated EPC has been very welcome.",
      "rating": 5,
      "date": "11th March 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Ecology - self build mortgages made simple!",
      "text": "We took out a self build mortgage with Ecology. Aside from incentivising customers to really consider a new builds green credentials, we have found Ecology super to deal with. Very fast turnaround at every stage, always a real person available to speak to and find them very helpful and straightforward to deal with. Compared to other lenders we looked at, Ecology was by far the best in terms of the product on offer and their attitude and ethos, would highly recommend to anyone embarking on a self build project!",
      "rating": 5,
      "date": "11th March 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Assessed by real people, not by computer",
      "text": "We are in the final stages of building an unusual house, low carbon, ultra low heating, etc. Instead of a standard response (typically \"computer says no\"), the Ecology mortgage team member assigned to the case took the trouble to understand the build and the ethics behind it; she went through our finances and got back to us when she thought we'd overstated one of our costs; and they then made a very reasonable offer which we accepted. All the way through, it's been a pleasure to deal with them.",
      "rating": 5,
      "date": "11th March 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Personal touch worth weight in gold!",
      "text": "Selfbuild mortgages are more complicated than a highstreet mortgage, but it was so easy with Ecology and so important to have a person answer the phone or email. That personal touch means the world. Highly recommend to other selfbuilders.",
      "rating": 5,
      "date": "11th March 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Have enabled us to build a highly innovative home",
      "text": "Ecology building society have enabled the dreams of an engineer and environmental scientist couple. Other lenders we're not willing to support a project of this nature.",
      "rating": 5,
      "date": "11th March 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent mortgage provider for my eco self-build",
      "text": "Ecology were helpful every step of the way and I felt they listened to our requirements for the build etc as against a simple tick box or 'computer says no' attitude.",
      "rating": 5,
      "date": "11th March 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Friendly, knowledgeable staff",
      "text": "Always friendly and able to help",
      "rating": 5,
      "date": "11th March 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Log Home Mortgage!",
      "text": "High street banks just did not want to know regarding building a low carbon sustainable home for my family. Ecology welcomed us with open arms & cheque book :-) & could not have been friendlier about it . Its been that way with them for 10+ years now. Highly recommend Ecology",
      "rating": 5,
      "date": "11th March 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Accommodating and integrous",
      "text": "Ecology have been immensely supportive of our eco build. Their approach to ethical and environmentally responsible lending is second to none.",
      "rating": 5,
      "date": "11th March 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great company great ethos",
      "text": "Ecology are easy to deal with always helpful with any queries easy to contact and they care I would and have recommended them to friends and family",
      "rating": 5,
      "date": "11th March 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "A mortgage i was pleased to pay to help others. Always helpful and returned my calls.",
      "text": "I had a buy to let mortgage which allowed me to build the first flats in London to use ground source heat pumps. I was the winner of a FMB Master Builder of the Year in 2005. I would not have received this award without the support of the Ecology Building Society. I support their work without reservation. They support and loan to self builders where other lenders would not go. Thank you",
      "rating": 5,
      "date": "11th March 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Absolutely supportive in green building, fantastic customer service",
      "text": "Cannot fault their support in green and sustainable building, fantastic team and customer service",
      "rating": 5,
      "date": "11th March 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Ecology Cares",
      "text": "Have had my mortgage with Ecology for 5 years and have no plans of moving away. Ecology have treated is fairly and with consideration every step of our build and beyond.",
      "rating": 5,
      "date": "11th March 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Fast professional service",
      "text": "Ecollogy B. S are a breath of fresh air in the current mortgage market. None of the usual personal interrogation during the application process -just a straightforward process based on financial common sense",
      "rating": 5,
      "date": "11th March 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Brilliant to deal with",
      "text": "I am customer who has a self build mortgage with Ecology. They are absolutely brilliant to deal with and made the process of self building my home easy from a funding perspective. I always get to speak to a knowledgeable human, they are always sensible & flexible in their approach. Covid didn’t seem to affect their service delivery. Always impressive, friendly, helpful. I’ve recommended them continuously to fellow self builders. They have proven that a UK based bank/building society can easily deliver a good service, something that most seem unable to do.",
      "rating": 5,
      "date": "11th March 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great self build mortgage",
      "text": "After trying no end of mortgage providers we heard about ecology. They were fantastic guided us all the way through the application and when the house was completed swapped us over to a standard mortgage. Also over the first few months of the pandemic they were brilliant when everything was uncertain. Can't recommend them enough",
      "rating": 5,
      "date": "11th March 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "A refreshing change",
      "text": "We have an Ecology Building Society mortgage currently, we used the mortgage to build our dream home. Since being with ecology we have been contacted three times to check in and be offered options to lower our outgoings-how refreshing.",
      "rating": 5,
      "date": "11th March 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Fantastic company",
      "text": "Ecology’s ethos and unique provision of mortgages for woodlands allowed our family to fulfil a dream of owning our own woodland to preserve and develop. Their process was simple and their customer care faultless.",
      "rating": 5,
      "date": "11th March 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Ecology made it possible for us to buy our Community Land Trust home",
      "text": "When no other mortgage provider would consider lending to us, because we were buying one of London’s first Community Land Trust homes, Ecology stepped up and made our dream apartment a reality. We cannot thank them enough for supporting us and genuinely affordable housing.",
      "rating": 5,
      "date": "11th March 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Woodland Review",
      "text": "Ecology Building Society helped me to buy a small woodland in Northumberland & I am so grateful for all of their help & support. All of the staff are so friendly & helpful. They’ve really made my dreams come true!",
      "rating": 5,
      "date": "11th March 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Rewarding sustainable self-building",
      "text": "Ecology not only were prepared to loan to us on our timber framed self build, but reward sustainability, by lowering the interest rate as the eco-credentials of your house build improve. Win-win!",
      "rating": 5,
      "date": "11th March 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Self Build Mortgage",
      "text": "Having been robbed by a builder I unexpectedly had to organise a mortgage on a one third built build at the great age of 68 years old. Ecology were extremely helpful and a life saver for me. Also they encourage the building of out of the ordinary houses with good \"eco\" credentials, which is reflected in the interest rate of the mortgage. Can't recommend them enough.",
      "rating": 5,
      "date": "11th March 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent in every way",
      "text": "In 2013 I required a mortgage to complete an architecturally designed Siberian Larch 4 bedroom house in rural Argyll. RBS, with whom I have had personal and business accounts since 1963, were emphatic in their denial - as were many other lenders - because I was either too old (mid sixties and well able to repay any mortgage!) or because wood was not acceptable in rural Scotland! Fortunately, Ecology Building Society were more than happy to listen to.me and offer me an affordable mortgage. I felt I was dealing with empathetic staff who seemed to regard my building project as normal and who were prepared to lend the full mortgage I requested. Since then there has even been a reduction in my repayments. I cannot fault Ecology in any way and cannot commend them highly enough. Other lenders should take note!",
      "rating": 5,
      "date": "11th March 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent customer service and climate concious",
      "text": "I have a self-build mortgage and criteria is based on eco- credentials. Every interaction with Be Ecology has been fast, efficient, and friendly - what a difference from most banks!",
      "rating": 5,
      "date": "11th March 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very helpful. Last lender in UK who helped us",
      "text": "Very helpfully enabled us to build our dream home in the country after every other door closed on us. Each release of funds was smooth and painless. Thanks Kelly Tyson who dealt with us all the way through",
      "rating": 5,
      "date": "11th March 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Friendly, personal service and great product",
      "text": "Delighted to find this provider dedicated to and rewarding eco-conscious self-build projects such as ours, who don't demand design compromises as other providers did. We had a single point of contact throughout the application process who was friendly, personable and answered all our questions very promptly. The mortgage drawdown flexibility suits our schedule and the C-change discount is a great bonus.",
      "rating": 5,
      "date": "11th March 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Fantastic ethical building society",
      "text": "This bank was and is the most helpful company I have ever used! I’ve never said that about a finance company EVER! They were understanding , cared about the concept of our build. It was a strawbale eco house on tyre foundations making it carbon negative. The customer services has always been great and still is. If a company deserves this award then the ecology building society deserve to win this.",
      "rating": 5,
      "date": "11th March 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Trustworthy and on my side",
      "text": "I tried another lender for my own- build project but found them uncaring and they started to pile on ‘hidden’ fees. I was so relieved to find Ecology who have been dependable, straightforward and who have felt as though they are on my side throughout the project + I found them very reasonable as far as rates go. House now completed!",
      "rating": 5,
      "date": "11th March 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Ethical lending encouraging sustainability",
      "text": "Ecology provided us with a mortgage for our house in 1998. Since then we’ve remortgaged to install solar panels, a hydro scheme and extra insulation and benefited from a reduced interest rate. A force for good in the world!",
      "rating": 5,
      "date": "11th March 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Help full and friendly",
      "text": "Ecology help me with my self biuld project, without hassle , they were there the whole way if or when I needed them , even in these tough times they were easy too contact. I would definitely recommend ecology.",
      "rating": 5,
      "date": "11th March 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Best mortgage provider we have experienced in 50 years",
      "text": "Ecology BS matches our values about houses for the future. All should be Net Zero, all should provide healthy, happy, green and affordable housing. Ecology offers you the same personal adviser for all your transactions, so you always feel that you are valued and understood. Why can’t they all be like Ecology BS.",
      "rating": 5,
      "date": "11th March 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Friendly and Professional",
      "text": "Throughout our mortgage application The Ecology Building Society were amazing. They treated us as individual human beings and talked through all aspects of our application over the phone in a very friendly manner. It is because of their fantastic mortgages that we have been able to build our dream off grid home in our woodlands.",
      "rating": 5,
      "date": "11th March 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Restoration Life Saver and Family Spirit!",
      "text": "I found Ecology when searching the internet into the night for one last chance to save a father and son restoration project. From start to finish the team have been super friendly, you really feel confident and part of their way of life. I value their forward thinking, values and modern take on the world of mortgages, which can feel a bit old money. My solicitor commented many times during the process at how easy and friendly Ecology are to deal with. Everything feels right, professional, approachable and always looking forward. Looking forward to this continuing.",
      "rating": 5,
      "date": "11th March 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Self build mortgage",
      "text": "Ecology Building Society were one of very few building societies that would lend us a self build mortgage. They recognised we were trying to build a a sustainable barn conversion in a farm and once we provided a high SAP rating and even though on a farm with a shared driveway were willing to lend to us. The process whilst thorough was easy and they were helpful in what they could offer. We ended up with a mortgage that suits are needs and is affordable. I was really impressed with the process and would recommend them as a lender.",
      "rating": 5,
      "date": "11th March 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent customer service",
      "text": "Both pre-pandemic and during, Ecology's customer service has been excellent. They are understanding, efficient and helpful. The mortgage application was straightforward, and the fees were very competitive for a self build mortgage.",
      "rating": 5,
      "date": "9th March 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Human, personal society; with ethical ethos",
      "text": "A lender that supports atypical self builds; showed flexibility during the build and during the repayment phases; you can email or phone a named individual and get a personal response.",
      "rating": 4,
      "date": "9th March 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "20 years a customer",
      "text": "I've been with the Ecology for over 20 years, and always glad to be a customer. One of the very few financial institutions that has a genuinely ethical and responsible approach. No gimmicks or special offers, just simple savings products with decent interest rates. In the past, the online banking was cumbersome, but it's now fine. So good to know your money is supporting other people who need loans to buy, build and renovate properties, rather than going to pay banker bonuses. Also a small company based here in Yorkshire, so what is not to like.",
      "rating": 5,
      "date": "2nd June 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Ecology Online Banking",
      "text": "Only gave 4 stars because of the Online Banking, which is not the most up-to-date system. (There is not yet an app, but I believe this is in development). Savings: Good value for money, ISAs have good savings rate in line with other providers.",
      "rating": 4,
      "date": "11th April 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "ethical, and excellent customer service",
      "text": "I have always had helpful and friendly interactions when i have contacted customer services. It is reassuring o know that my savings are being used ethically.",
      "rating": 5,
      "date": "1st April 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "My experience",
      "text": "Staff answer calls promptly, are helpful and friendly - real people! The Society has a policy to ensure the ratio of salaries between staff and CEO/management are fairer than most societies although the ratios are not as good as they were, which is a shame.",
      "rating": 5,
      "date": "31st March 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Ethical Consumer gives the EBS an ethiscore of 100%.",
      "text": "Ethical Consumer gives the EBS an ethiscore of 100%. Where we put our money is one of the most powerful ways we have of changing the world, so that's really important.",
      "rating": 5,
      "date": "31st March 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "A small building society with big ambitions",
      "text": "I joined in 2022 and have been impressed with both their value for money and their approach to making the world a better place ever since. Even the AGM was fun!",
      "rating": 5,
      "date": "4th March 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Easy to deal with and an ethical provider.",
      "text": "Easy to deal with and an ethical provider. A happy customer.",
      "rating": 5,
      "date": "4th March 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Excellent Customer Service & Ethical Savings",
      "text": "I have been a saver with Ecology Building Society for a number of years. Their customer service is second to none: they are genuine and friendly and it is ALWAYS possible to speak to a human - no horrible call queues or phone bots. Any time I have had a query it has been quickly resolved. I like the fact that my savings are being put to genuinely green uses by the Society and that any interest my savings may generate is ethical. I thoroughly recommend them without hesitation.",
      "rating": 5,
      "date": "10th February 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "35 years of ethical saving.",
      "text": "I've been saving with Ecology for 35 years and not only are the savings rates competitive, the AGMs and Member Meet-ups are very enjoyable. I particularly enjoy visiting the unusual venues and meeting like minded people who care about where their savings are invested.",
      "rating": 5,
      "date": "9th February 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "British Company; British service!",
      "text": "Great customer services; British company; British people on the phone that you can understand; great ethics",
      "rating": 5,
      "date": "2nd February 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Helping to save the planet",
      "text": "Decent saving rates but helping to save the planet and that’s worth more than anything",
      "rating": 5,
      "date": "31st January 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Supporting individuals and cooperatives",
      "text": "I am very happy to save with ecology. I have both personal savings and the housing cooperatives I am involved with have been understood and supported with mortgages by ecology building society. We appreciate them taking the time to understand cooperative ownership as so many other large lenders do not understand cooperatives and ndo not provide suitable suitable options. The customer service is very good and they are a genuinely competitive option for saving, which is a joy of mutuals.",
      "rating": 5,
      "date": "26th December 2024",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "The best of both worlds",
      "text": "It is a privilege to be able to save knowing that my money is being used to benefit others - and a happy bonus that ecology customer service is always helpful and friendly.",
      "rating": 5,
      "date": "24th December 2024",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Don't change",
      "text": "I wanted a more ethical business to save with and I have been with the Ecology since they were founded. I have had excellent service. The phones are answered promptly and money can be moved with minimum fuss. Staff are always helpful and friendly. I hope they stay ethical, personal and small. I particularly liked the salary ration structure (so CEO and senior staff are not way above those who do so much of the work) albeit this has been diluted more recently.",
      "rating": 5,
      "date": "24th December 2024",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "I would recommend Ecology Building Society to anyone",
      "text": "I have been really impressed by Ecology Building Society. They are clear, transparent and straightforward. And when you communicate with them you speak to a real person who actually gets your situation. They were there for me this year when I needed them. I would definitely recommend them to anyone, especially those who want to have a positive social impact.",
      "rating": 5,
      "date": "24th December 2024",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Really please to use Ecology for my monthly savings...",
      "text": "Really please to use Ecology for my monthly savings - great to know it is being used for purposes that strongly align with my values.",
      "rating": 5,
      "date": "1st December 2024",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Great place for Cash ISAs.",
      "text": "I've been saving with ISA's for over 30 years with Ecology. Interest rates are competitive but what I really like are the unique AGMs and hearing about all the positive environmental activities.",
      "rating": 5,
      "date": "29th November 2024",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Savings for good - slow but steady!",
      "text": "The Ecology Building means savings are invested in positive change- although it’s definitely ‘slow banking’ over things like withdrawals, changing address, paper statements etc, this is a positive thing for me - my savings stay earning interest because I can’t quickly dip into them ! It takes 1-2 days. Customer service on the phone is good - they arranged an end of day Faster Payment when it was flagged for security, within 2hrs for house move. Good interest rates, only improvement is an app which is coming soon!",
      "rating": 4,
      "date": "29th November 2024",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Ethical, and so Supportive !",
      "text": "I love saving with a building society that does specific, practical things for the environment, and for housing (both so badly needed). Ethical - no investments in bombs or fossil fuels! The people who work for it are lovely! When I ring up to ask questions, I always get patient, friendly help and clear answers. Sure, the interest rate offered is modest - but this is outweighed by the peace of mind Ecology Building Society offers its customers.",
      "rating": 5,
      "date": "10th November 2024",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Genuinely Ethical",
      "text": "I first opened an account with Ecology Building Society in the 1990s, and only closed the account because I needed the money, so when I again had some savings I opened a new account a few years ago. I prefer to deposit my savings with a company I am confident will use it wisely. I am convinced the EBS are committed to protecting our precious environment and they would never knowingly invest my money in anything unethical.",
      "rating": 5,
      "date": "4th November 2024",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Get your money to do some good !",
      "text": "I've been with Ecology BS for over a decade; have always been v happy with their customer service and general comms. Although I could maybe be getting a better rate elsewhere, I know the money I've invested with them is doing good work to tackle the nature and climate crisis, investing in projects that make a difference. This makes me happy.",
      "rating": 5,
      "date": "31st October 2024",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "A genuinely ethical building society",
      "text": "A genuinely ethical building society, with a clear focus on customers, the environment and communities. Good to know that my savings are making a difference for good, without compromising on the interest rate.",
      "rating": 5,
      "date": "31st October 2024",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Everything to like about Ecology Savings",
      "text": "Everything is to like about Ecology, a good ISA with great interest rate. The online services are fine but limited. However they are upgrading the website shortly. It takes a while for credits to show and messages to be received it seems but they are human and not robots. And good humans at that...",
      "rating": 5,
      "date": "31st October 2024",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Human, friendly and super efficient",
      "text": "Human, friendly and super efficient AND they are as ethical as they come, what is not to like. I can't think of a better home for our reserves.",
      "rating": 5,
      "date": "31st October 2024",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "The place does not appear to be run by robots!",
      "text": "The place does not appear to be run by robots! I like to deal with real people who have commonsense and can answer my questions....my questions dont usually fit into a \"box\" so a ChatBot cant answer them satisfactorily. i wish to support and encourage this building society in their admirable endeavours.",
      "rating": 5,
      "date": "2nd October 2024",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Caring about how m money is used.",
      "text": "I had some money that I was looking to invest long term but I believe environmental degradation, loss of habitat and species diversity and the poor health of our oceans due to human activity are at such a critical point that I did not want my money going into any industry or organisation that contributed to this. I was delighted to find Ecology Bank and to see that they share my values and are open and transparent without “ greenwashing”. While my money is tied up for 180 days the 5% interest rate is extremely competitive. I am aware that this rate may go down following the BoE reduction but I will happily stay invested with this bank in the knowledge that not only am I getting a good rate but, more importantly, my money is being used to support businesses which reflect my values.",
      "rating": 5,
      "date": "2nd October 2024",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "I've invested with EBS for decades, completely happy",
      "text": "I have invested with EBS for decades, completely happy and relaxed that my savings are helping with ecological renovations and eco-conscious homes. Great staff,",
      "rating": 5,
      "date": "1st October 2024",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Proud to have been one of the first investors in 1981",
      "text": "I was one of the first investors in the Ecology Building Society in 1981, and have been a saver ever since. The Society has grown, but the staff are as ready to engage as they were when I was a Foundation Share Holder. The AGMs are always a highlight with guest speakers and reinforce how much good the Ecology does to improve and finance interesting community and private developments.",
      "rating": 5,
      "date": "1st October 2024",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Why would you *not* save with EBS?",
      "text": "Why would you not save with EBS? Good rates, savings in positive projects, friendly responsive costumer service.",
      "rating": 5,
      "date": "1st October 2024",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Sound values put into practice",
      "text": "I've been a member for 20+ years because the Ecology believes in the things I do, and they walk the walk. Everything works as it should. The interest rate I get isn't the highest, I don't suppose, but it's perfectly acceptable. They work hard to communicate and involve members about how they use their savings. The management evidently believe in the society's values, reporting the decent ratio in pay between the highest and lowest paid members of staff, and working to make teh Society's own operations sustainable.",
      "rating": 4,
      "date": "1st October 2024",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Good products, helpful staff",
      "text": "I have been very happy with the Ecology savings products I have had and in particular have found the staff incredibly helpful, responsive and efficient when I have needed to contact them.",
      "rating": 5,
      "date": "1st October 2024",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Ecology is a small society with a big vision.",
      "text": "Ecology is a small society with a big vision. They offer competitive interest rates and use the money to improve the energy efficiency of the properties they lend against. They do a lot, behind the scenes, to help make the world better.",
      "rating": 5,
      "date": "23rd February 2024",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "very helpful and friendly and ethical",
      "text": "very helpful and friendly and ethical",
      "rating": 5,
      "date": "16th January 2024",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Ethical investment made easy",
      "text": "I hate setting up new online anything, and sure enough, I ran into trouble when trying to get the password, ID and memorable phrase to work in harmony. I rang the helpline with low expectations but was answered quickly by a human who talked me though the quirks of the system. They remained patient despite my ADHD approach to data. I now save regularly and it all works perfectly. I am delighted to be with a properly ethical savings bank. The website is very simply laid out which suits me fine.",
      "rating": 5,
      "date": "2nd July 2023",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "No brainer",
      "text": "Invest in sustainable projects not destroying the planet for the next generation.",
      "rating": 5,
      "date": "6th April 2023",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "ethical savings",
      "text": "The projects which my savings support help to build a fairer society. The company has always communicated well and has increased rates when possible.",
      "rating": 5,
      "date": "24th March 2023",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "The most ethical savings account on the market, with a good interest rate too!",
      "text": "I've been banking with Ecology for about eight years now. I was drawn to them by a Move Your Money campaign that looked at how ethical the UK's banks and building societies are, and rated Ecology at the top of the pile. Ecology invests savings into mortgages for people building new eco-friendly homes, or making green modifications to existing ones. This helps to reduce the carbon footprint of the UK's notoriously draughty housing stock; reduce energy bills for homeowners and builders; and give people the chance to build their dream home. What's not to like! Their online web portal is easy to use, their team are friendly and easy to contact, and their savings rates are very competitive, much to my surprise as I'd previously thought that \"green\" = \"premium price/lower interest rates,\" but clearly that is not the case. I'd recommend Ecology to everyone, for savings and for mortgages.",
      "rating": 5,
      "date": "4th March 2023",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Ethical in every way",
      "text": "We have saved with Ecology for years, knowing that our money will be used for good.",
      "rating": 5,
      "date": "2nd February 2023",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Good ethics and good service",
      "text": "Great to be able to save with an organisation which respects the planet and also offers a decent return on your money",
      "rating": 5,
      "date": "18th January 2023",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Disappointment and frustration at every stage.",
      "text": "Unfortunately this was the out and out worst experience I have ever had in opening any account of any form. Contradictory emails, links that don't work, password reset function that does not function, no ability to speak to anyone on the helpline, a callback feature that doesn't work, correspondence that arrives out of date. Sad because I liked the credentials, but ultimately was a complete was of my time and effort.",
      "rating": 1,
      "date": "6th December 2022",
      "product": "Savings",
      "sentiment": "negative"
    },
    {
      "title": "Excellent Building Society Highly Recommended a Very Satisfied Customer",
      "text": "Very good kept interest rates stable when all the other building societies/ banks dropped the interest which meant I could put my money with them. Also do good sustainable and ecological support with their money and are ethical to invest in and very clear, truthful and trustworthy.",
      "rating": 5,
      "date": "26th August 2022",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Best Consistent Impeccable Building Society",
      "text": "Ecology Building Society maintained my interest rates over the last few years when all the others dropped in my other building societies and banks. I cannot recommend or praise them enough their ethics are aligned to mine and they publish a very good magazine outlining where the money goes to specific ecological refurbishment projects like the Isle of Iona, Scotland, Bristol. Keighley. etc. they are so good and should be used more often.",
      "rating": 5,
      "date": "26th August 2022",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Simply the best",
      "text": "We have been with the society from about 1984 most of the time not having very much in our accounts but we were and are always treated with the utmost respect. All of the staff we have dealt with over the years have been so friendly and helpful far far better than other banks, society's we have been with. We wish we could do all of our banking with them. 100% recommended them.",
      "rating": 5,
      "date": "22nd April 2022",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Postal Account where you can sleep at night",
      "text": "Have saved a small sum of money every month with Ecology for over ten years. Brilliant application of sound organisational operation with some ecological principles in mind. Always been well above the bank base rate on savings",
      "rating": 4,
      "date": "7th April 2022",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Awful online presence",
      "text": "Outdated online offering, way to longwinded application process, living in the pst",
      "rating": 1,
      "date": "4th April 2022",
      "product": "Savings",
      "sentiment": "negative"
    },
    {
      "title": "Saving Money Can Help Ecological Projects",
      "text": "It is so good to know that money saved with the Ecology Building Society is lent out to building projects that bring derelict or out of use buildings back into use",
      "rating": 5,
      "date": "23rd March 2022",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Simple and easy",
      "text": "I opened a savings account with Ecology Building Society a couple months ago. It's easy to use, secure.",
      "rating": 5,
      "date": "20th March 2022",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Environment",
      "text": "I like to do my little bit to protect the environment. Ecology Building Society has the correct products for me with competitive interest rates. Staff are efficient, effective and professional. I would have no problem recommending Ecology Building Society to family members and friends.",
      "rating": 4,
      "date": "20th March 2022",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Friendly customer service with a green heart",
      "text": "You rarely have to wait when you call. The staff are always friendly and helpful and I can save money in the knowledge that it is being used to fund green projects around the country",
      "rating": 5,
      "date": "18th March 2022",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "A great ethical, ecological building society",
      "text": "A building society that cares about the environment and a better future for our planet!",
      "rating": 5,
      "date": "17th March 2022",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Promoting saving the planet",
      "text": "EBS not only encourage minimising the ongoing environmental impact of using buildings such as by high standards of insulation they also address the environmental impact of the materials used in the construction of buildings. They also provide a friendly and efficient banking service.",
      "rating": 5,
      "date": "17th March 2022",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "To be trusted",
      "text": "I like their integrity, and what they provide mortgages for",
      "rating": 4,
      "date": "16th March 2022",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Above all EBS can be trusted",
      "text": "By keeping interest rates reasonable in the good times EBS has protected interest rates in the not so good.",
      "rating": 4,
      "date": "16th March 2022",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Ethically on the spot",
      "text": "I have been with the Ecology for a long time - for ISA investment. But what they do on lending etc is very impressive. And their overall care of customers is second to none. Well worth an award!",
      "rating": 5,
      "date": "15th March 2022",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Ethical and helpful",
      "text": "They helped me out when I lost my job in the pandemic. And they have genuinely rigourous ethics - unlike many banks and building societies who are funding things I'd rather not put my money into.",
      "rating": 5,
      "date": "15th March 2022",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Saving for something better",
      "text": "It’s great to know your savings are doing all the right things, free from fossil fuel investments and weapon manufacturing amongst others. Customer service are always great too and their interest rates are competitive. Ecology makes saving with beneficial impacts easy.",
      "rating": 4,
      "date": "14th March 2022",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "The climate crisis is a potential catastrophe",
      "text": "I am so pleased that the EBS is using my savings to support projects that will help save the planet - this sort of ethical banking is a breath of fresh air!",
      "rating": 5,
      "date": "14th March 2022",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Ethical savings",
      "text": "Great society and I have a clear conscience as to where my money is invested so am very happy",
      "rating": 5,
      "date": "14th March 2022",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Ethical and Practical",
      "text": "Exceptionally helpful and easy to contact and deal with over my long history saving with them which includes two house purchases and a translocation overseas",
      "rating": 5,
      "date": "14th March 2022",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Great service",
      "text": "I find the Ecology Building Society to be from polite helpful and efficient in dealing with them.",
      "rating": 5,
      "date": "14th March 2022",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Great efficient service",
      "text": "Easy to deal with - great online access - genuine provider of ethical savings accounts.",
      "rating": 5,
      "date": "14th March 2022",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Ethical supplier with top notch service",
      "text": "Ecology are a fantastic company to get a savings service with, they have excellent ethical values which could be taken up by the financial sector as a whole.",
      "rating": 5,
      "date": "14th March 2022",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Reliable ethical banking",
      "text": "Very supportive building society, I save with them to be ethical and sustainable. Their IT is catching up with that of the major high street banks, but their customer service is great and you can rely on their banking services.",
      "rating": 5,
      "date": "14th March 2022",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Excellent banking experience",
      "text": "Excellent banking experience and knowing my savings are going to good environmental causes",
      "rating": 5,
      "date": "14th March 2022",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Helping people and the planet",
      "text": "Ecology provides me with a method of financing a rejuvenation in housing stock abd also reducing the carbon footprint of accomodation. I also receive a fair return on my investment. It's a win, win, win situation!",
      "rating": 5,
      "date": "14th March 2022",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Caring for customers not just profit.",
      "text": "Despite the low interest rate the society has kept it's word and did maintain the 1% interest on one of it's accounts I fully expected they could have called a force majeur senario but honesty and integrety is what builds a good reputation. I am proud to be a member and supporting their green credentials too at a much needed time.",
      "rating": 5,
      "date": "13th March 2022",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Ethical saving",
      "text": "I have been saving with Ecology since 1990 mostly via their ISAs. It is the greenest of all my investments, so I know that my money is being put to good use. I enjoy reading their newsletters. It is the only financial organisation whose AGMs I attend, because they are informative, educational & great fun.",
      "rating": 5,
      "date": "13th March 2022",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Ethics provides meaning and direction",
      "text": "I am very happy to save and invest my money with the Ecology Building Society. Its ethical principles and governance ensure that the money is used to create a better future for all of us.",
      "rating": 5,
      "date": "13th March 2022",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Queries are sorted very quickly",
      "text": "Whenever I have contacted the Ecology Building society, any query was very quickly sorted, that includes withdrawals.",
      "rating": 5,
      "date": "13th March 2022",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Good company which makes members feel valued.",
      "text": "Good company which makes members feel valued.",
      "rating": 4,
      "date": "13th March 2022",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "A truly ethical bank",
      "text": "I feel my savings are safe with Ecology and the rate of interest received is fair. Better still I know that my money is being used to fund good causes, ie improving the environment, helping cut emissions and preserving old buildings. It's also great also to be able to talk to a human being, should any communication be required.",
      "rating": 5,
      "date": "13th March 2022",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Best for people and planet",
      "text": "Ecology building society have a brilliant telephone service, not put on hold with automated messages but get to speak to a real and knowledgeable person. They are supporting Britain to have more sustainable housing in the climate and ecological emergency we are in. All banks should be like them so that we limit the catastrophe of the climate and ecological emergency.",
      "rating": 5,
      "date": "13th March 2022",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Five stars for Ethical Organisation",
      "text": "Always a great personal service at Ecology Building Society. I love the fact that my savings are being invested in eco projects in an ethical way.",
      "rating": 5,
      "date": "13th March 2022",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Ethical, reliable and transparent",
      "text": "So many reasons for rating Ecology highly, but especially value their clear explanations for any changes made to accounts, and the way that they treat longstanding customers with consistent interest rates.",
      "rating": 5,
      "date": "13th March 2022",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Ethical savings account",
      "text": "As an Ecology Foundation Shareholder member, I'm proud to have been putting my money where my mouth is by saving with Ecology. Their customer service is second to none, too.",
      "rating": 5,
      "date": "13th March 2022",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "M money doing good!",
      "text": "The Ecology is an efficient, friendly and ethical institution. The rates on savings are decent and I know that my money is been lent to good projects and good people, doing their best for the future of all our children. What's not to like?",
      "rating": 5,
      "date": "13th March 2022",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Keeping my money safe and using it to do good work",
      "text": "I feel safe saving my money with EBS. And I know it is being used to build and retrofit homes for the future.",
      "rating": 5,
      "date": "13th March 2022",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Excellent service and reasonable returns on savings",
      "text": "Ecology Building Society easily outstrips the various other savings organisations I deal with in every way. Their support and communications are fast and efficient; their online system works flawlessly and in a user-friendly manner; their interest rates, at a time when others are offering pitiful fractions of a percent on savings, are reasonable. Most importantly of all, to my mind, their ethical approach shines through in everything they do.",
      "rating": 5,
      "date": "13th March 2022",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "A great organisation",
      "text": "A well run outfit which has been fair with our savings and provided excellent customer service for more than 10 years.",
      "rating": 5,
      "date": "13th March 2022",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Good interest rates with excellent customer service.",
      "text": "Good interest rates with excellent customer service.",
      "rating": 5,
      "date": "13th March 2022",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "One of the best",
      "text": "Great ethos and good customer service",
      "rating": 5,
      "date": "12th March 2022",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Excellent",
      "text": "The service is first class and their ethos, essential in a world where we must be more energy self reliant, permeates everything they do.",
      "rating": 5,
      "date": "12th March 2022",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "I know my savings will support brilliant sustainable and community housing",
      "text": "Ecology Building Society provides an excellent service and I feel confident that my savings will be well managed and support brilliant sustainable and community housing projects that are badly needed.",
      "rating": 5,
      "date": "12th March 2022",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Easy to manage savings",
      "text": "The online service is so easy to use - quick, transparent and reliable.",
      "rating": 5,
      "date": "12th March 2022",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Ecology sustains customers with first class service.",
      "text": "When ever I have had to contact Ecology Building Society I have spoken to someone who was immediately helpful. Difficult to think of any improvements.",
      "rating": 5,
      "date": "12th March 2022",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Great",
      "text": "Great, ethical, helpful, easy to get hold of, personable, good banking systems",
      "rating": 5,
      "date": "12th March 2022",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Doing your bit without even realising",
      "text": "Saving with the Ecology Building Society helps me set an example to my grandchildren, letting them know I care how finance impacts their future",
      "rating": 5,
      "date": "12th March 2022",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Professional organisation with ethical products",
      "text": "I have been with the EBS since 2021. I was attracted initially by the potential for an ethical savings product at a reasonable rate of return. This I got, but I have also been impressed by the friendly, proactive and professional service I have recieved from the staff and the functionality provided by their online presence.",
      "rating": 5,
      "date": "12th March 2022",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "What's not to love?",
      "text": "Reliable, ethical and genuine, this organisation is doing far far more than most financial institutions to tackle climate change and social inequality. I wish other banks and building societies were as thoughtful and caring about our potential future. Their service is faultless, throughout the 2 decades I have been saving with them.",
      "rating": 5,
      "date": "12th March 2022",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Saving with a purpose, amazing people",
      "text": "Ecology BS is an organisation with a great purpose. It offers fair interest rates (even at a time of low rates elsewhere) backed up by great service. They keep in touch, telling members how the money is used.",
      "rating": 5,
      "date": "12th March 2022",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Outstanding customer service and products",
      "text": "I have been with the EBS for many years as a saver as it closely aligns with my principles and ethics. Knowing that my money supports sustainable and ecological mortgages and projects, makes me happy to save. Any interactions with the EBS have always been positive.",
      "rating": 5,
      "date": "12th March 2022",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Building for the future",
      "text": "Fighting climate change, planning for the future.",
      "rating": 4,
      "date": "12th March 2022",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Efficient and ethical",
      "text": "No other bank or building society is doing more to build a fair and sustainable society.",
      "rating": 5,
      "date": "12th March 2022",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Amazing sustainable projects",
      "text": "A great society helping so many people with sustainable projects. A small society that packs a punch. Their savings' interest rates are some of the best. A very secure website, which is easy to use.",
      "rating": 5,
      "date": "12th March 2022",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Great building society thanks",
      "text": "Very happy with Ecology Building Society seems to have worked for me and the best of about 7 savings accounts I have. Thanks",
      "rating": 5,
      "date": "12th March 2022",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Make your money do some good in this world.",
      "text": "Ecology provide a professional service. However, far more important in my view, you can be confident that your money is working to do good at some level. Compare that to most financial institutions that are only interested in making as much for their investors and themselves, irrespective of any concerns about ethics.",
      "rating": 5,
      "date": "12th March 2022",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Excellent Savings Accounts",
      "text": "Easy to use online system. Good interest rates.",
      "rating": 5,
      "date": "12th March 2022",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "The Original Green Building Society",
      "text": "Long before it was 'trendy' to be green, the Ecology Building Society was working to encourage people to fund ethical projects. I've been with them for almost 40 years and they have consistently offered excellent service with a human face. You could always ring up and talk to a real person without waiting in a queue for an hour and they seem to go the extra mile to make sure that your queries have been satisfied.",
      "rating": 5,
      "date": "12th March 2022",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Support Climate Change action AND get a decent return!",
      "text": "Easy to set up an account. Moreover, in these hard and worrying times it feels good to have my savings in a safe place that not only gives a better return than a high street bank savings account, but which is committed to making a positive contribution to protecting our ecology.",
      "rating": 5,
      "date": "12th March 2022",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Ethical and Friendly",
      "text": "Friendly staff when there was a slight hiccup in opening an account. So pleased to find an ethical building society to save with.",
      "rating": 5,
      "date": "12th March 2022",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Straightforwardly Ethical",
      "text": "A simple, straightforward, honest, ethical, mutual. If only they were all like this.",
      "rating": 5,
      "date": "12th March 2022",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Ethically sound with great customer service",
      "text": "I feel confident and reassured to know that I am saving with an ethically sound organisation that shares my values and supports worthy projects which are moving us towards a greener future. EBS is open and accessible and customer friendly. Its services are well explained and efficiently run.",
      "rating": 5,
      "date": "12th March 2022",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "A rare find",
      "text": "I’ve been with the bank many years now and have received meticulous service in every way. Their communications are clear and not overly regular. Even though they only have the one branch they outdo their larger counterparts with ease. All this AND their ethical standards are second to none.",
      "rating": 5,
      "date": "12th March 2022",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "The most ethical bank on the market",
      "text": "Ecology Building Society is rated the most ethical bank in the UK by the Move Your Money campaign. Savings are invested in mortgages for people building eco-friendly homes, so have a directly positive impact on the environment and the housing shortage. Their online banking feature is easy to use, their range of products and savings rates is competitive, and unlike other supposedly ethical banks like Triodos who often invest in polluting companies like petrol lobbyists Toyota, Ecology really do make a positive difference.",
      "rating": 5,
      "date": "16th January 2022",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "A great ethical savings provider",
      "text": "A great ethical savings provider- Excellent ethos and clear information",
      "rating": 5,
      "date": "15th January 2022",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Honest and fair provider with a genuine ethical offering",
      "text": "You know you’re dealing with a genuine sustainable provider. No greenwash I can see exactly how my money is being put to use to support projects that have a positive impact.",
      "rating": 5,
      "date": "9th January 2022",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Ethically sound and great to deal with",
      "text": "I've been an investor with the Ecology Building Society for longer than I can remember - probably 20 years by now. They've always been my go-to savings provider. Yes, the interest rates may not be the highest, but it's a tiny price to pay for knowing that your money is 100% ethically invested - no ifs, no buts. They're great to deal with, too. You always get straight through to a person (not like some providers who subject long-suffering customers to endless queues with stupid music - you know who you are!) and they're infallibly efficient and friendly. What's not to like?",
      "rating": 5,
      "date": "1st May 2021",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "25 years saving with the Ecology",
      "text": "The magazine with inspirational eco-homes using passivehaus items imported and reclaimed materials.",
      "rating": 5,
      "date": "18th April 2021",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Fantastic service and ethical",
      "text": "Always efficient and it's ethical.",
      "rating": 5,
      "date": "18th April 2021",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Ethical, efficient, personal",
      "text": "I feel I'm dealing with real people at EBS, whereas other banks seem to be staffed by machines. And they are fruly ethical. That matters.",
      "rating": 5,
      "date": "16th April 2021",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Nobody I'd rather bank with",
      "text": "Ecology are great and continue to improve their services. I only wish I could have a current account with them too. I've been a customer for 11 years now and have had no issues at all - just a great ethical savings option.",
      "rating": 5,
      "date": "16th April 2021",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Ecology is Simply Genuine.",
      "text": "Ecology Simply Do what they set out to.... Ecological environmentally sound mortgages. And Savings. No waste of money on over glossy ads, over inflating claims of size. Ecology is honest. When they write inform me of product changes, it's real, straightforward and legible. Ecology employ genuine people who speak to me like a real intelligent person. There's no double speak. Just sincere friendly communication. I trust ecology integrity.",
      "rating": 5,
      "date": "16th April 2021",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "working for a better environment",
      "text": "Ecology have provided a consistently high standard of service, in line with their ethical principles!",
      "rating": 5,
      "date": "14th April 2021",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Great service combined with an ethical approach",
      "text": "I opened a monthly saver with Ecology. It was easy to set up and run, an ok interest rate, and no requirement to open an new account each year. Any dealings with the society have been efficient and friendly. Great to know my money is being invested in ecological and ethical ways.",
      "rating": 5,
      "date": "13th April 2021",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Ethical, easy and friendly",
      "text": "I've invested with Ecology for years now, since they were (one of) the first genuinely ethical savings provider out there. Their products are easy to understand and use, their customer service is excellent and it's great to know my savings are safe while doing good work!",
      "rating": 5,
      "date": "13th April 2021",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Ethical Savings",
      "text": "Good to have an ethical savings account. Also at a higher savings rate than most (less ethical) savings accounts. Great to take part in an ethical organisation",
      "rating": 5,
      "date": "13th April 2021",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "I know my savings are being used ethically",
      "text": "I know my savings are being used ethically and giving me a good return. The company is always easy to talk to and transactions happen smoothly",
      "rating": 5,
      "date": "12th April 2021",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Efficient Ethical Building Society",
      "text": "Ecology Building Society keeps me up to date abut their savings' products. I appreciate their snapshots of what properties they have loaned money for. I can always telephone their office and speak to a real person.",
      "rating": 4,
      "date": "11th April 2021",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Amazing ethics and customer service all rolled in to one.",
      "text": "The Ecology Building Society is a safe and smart place to save your money. Not only do you know that your money is being invested in ethical ways but also that you are getting a competitive rate of return.",
      "rating": 5,
      "date": "10th April 2021",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Great to know money is supporting worthwhile projects.",
      "text": "Using the 90-day notice account for funds from early inheritence, to be used for our children in the future. Reassuring to know that community projects can benefit from our savings. Ecology have kept me informed clearly of any developments over the past 12 months.",
      "rating": 5,
      "date": "10th April 2021",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Ethical, professional, reliable",
      "text": "Ethics excellent, communication excellent, and tailored to what we need, eg my daughter can’t spend time on a screen so gets all her communications by post.",
      "rating": 5,
      "date": "10th April 2021",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Good savings rates with excellent ethics",
      "text": "After spending quite a bit of time reviewing available ethical savings accounts, the Ecology Building Society regular saver account came out with one of the best rates whilst meeting all the ethical criteria i was concerned about. It also seemed a good longer term option as it wasn't just an introductory rate that would drop to near-zero after 12 months like certain competitor's offerings!",
      "rating": 5,
      "date": "10th April 2021",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Supports my principles",
      "text": "Great ethical organisation with which to save. Knowing my money is invested in projects, such as housing, that make a difference and are important to me.",
      "rating": 5,
      "date": "9th April 2021",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Great service from an Ethical provider",
      "text": "Ecology is a great small building society. I like the fact that my money is lent out on environmentally friendly projects.",
      "rating": 5,
      "date": "9th April 2021",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "The greater green good!",
      "text": "A wonderful organisation that thinks locally and acts globally. We are in climate emergency. Ecology Building Society do whatever it takes to do the right thing with their ethical savings products.",
      "rating": 5,
      "date": "9th April 2021",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Environmentally and economically very, very good",
      "text": "Very sound with advice, performance and customer services",
      "rating": 5,
      "date": "9th April 2021",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "great ethics great products great customer service :)",
      "text": "great ethics great products great customer service :)",
      "rating": 5,
      "date": "9th April 2021",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Excellent ethical company",
      "text": "We have invested with the Ecology Building Society for decades particularly because of their ethical and sustainable work. We need more banking companies with this ethos.",
      "rating": 5,
      "date": "9th April 2021",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "They are the most ethical financial provider, end of",
      "text": "Pretty much all the big banks (like Barclays, HSBC and others) are up their necks in investing in harm , ecocide and human rights abuses - with Ecology Building Society you can look yourself in the mirror knowing that your money isn't harming your kids' future, or anyone else's",
      "rating": 5,
      "date": "9th April 2021",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Honours its pledges",
      "text": "It is pleasing to see that the Ecology Building Society honours its pledges in that, at a time of ultra-low interest rates, it guarantees a minimum interest rate of 1% per annum to its loyal members.",
      "rating": 5,
      "date": "9th April 2021",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "The original 'green' building society",
      "text": "I've been saving with the Ecology Building Society for almost 40 years and have always appreciated the friendly, personal help from staff (no endless automatic labyrinth.) and peace of mind in knowing that my money is being invested in positive projects that don't contradict my principles.",
      "rating": 5,
      "date": "8th April 2021",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Banking with a conscience",
      "text": "I have complete peace of mind knowing that my money is being used for good purposes and invested in things that doesn't destroy our planet. The small scale, friendliness and approachability of the staff is also wonderful. Thank you :)",
      "rating": 5,
      "date": "8th April 2021",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Outstanding aims, ideals and vision. Excellent customer service.",
      "text": "So pleased to have found a truly ethical financial organisation with the values and vision that I can wholeheartedly support and feel I can trust with my savings.",
      "rating": 5,
      "date": "8th April 2021",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Spot on",
      "text": "Good ethical service, staff always really helpful too.",
      "rating": 5,
      "date": "8th April 2021",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Ethical, ecological and fair",
      "text": "Ecology building society is helping fund sustainable building and renovations and I pleased that my savings help this happen. I feel my money is safe with them because of their cautious approach. I think there interest rates are fair and they do not treat existing savers less well by lowering old account rates and offering high rates just to new customers. I am informed about changes to accounts or rates and there is an interesting newsletter. The staff are helpful. The society has a fair pay policy and lower CEO salaries than other building societies. I have been to AGMs where they are open with members and answer questions. The society and provide interesting information about more sustainable living and ethical banking. I do recommend the Ecology building society to family and friends.",
      "rating": 5,
      "date": "8th April 2021",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Why go elsewhere?",
      "text": "Ecology Building Society is the best UK ethical financial provider, and from experiences elsewhere is the best Building Society. They provided the best savings account when I looked for a new one. Customer service has been brilliant and I feel I've been treated fairly as a customer. So we will be applying for a specialist mortgage with Ecology as they are an excellent provider.",
      "rating": 5,
      "date": "8th April 2021",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Keeps up the professional end - and ethics too!!",
      "text": "I've been with EBS since 2007 and it is part of my personal/psychological furniture of being part of something positive that pioneers positive ethical/environmental/social change!! I'm proud to be part of the Ecological Building Society !!",
      "rating": 5,
      "date": "8th April 2021",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Environmentally Beneficial Saving",
      "text": "I've had several different accounts as a saver with EBS over a 20 year period during which I've been extremely satisfied with all the service. I have on occasion shopped around to see if my money would be better invested elsewhere and each time I have decided EBS is still the best provider for my needs. This is partly due to giving favourable interest rates compared with other lenders but also due to EBS playing an important role in bringing about environmentally beneficial changes in housing construction and renovation. It's important to me as an investor to know that my investments are being used to build homes that are sustainable, require less energy to heat and minimize the use of toxic substances. EBS keeps its members regularly informed about projects the society is investing in. There isn't any other bank or building society, that I'm aware of, that provides this ''ecological saving service''.",
      "rating": 5,
      "date": "8th April 2021",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Ethical Building Society with great customer service.",
      "text": "The Ecology BS support sustainable home building and put environmental issues at the heart of their business.",
      "rating": 5,
      "date": "8th April 2021",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Ethical. Leading by example",
      "text": "This building society is approachable. I have attended the AGM's in person a number of times. A good rate of interest offered and rarely changes. I know my money is being used ethically for practical ecologically projects.",
      "rating": 5,
      "date": "8th April 2021",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Great ethical savings and local community",
      "text": "Great to know savings and investments are used for good causes for the local community and with a great ethical ethos.",
      "rating": 5,
      "date": "8th April 2021",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Explanation of and information on green and sustainable building using natural materials",
      "text": "I read the Ecology Building Society Review as it is full of useful up to date information. When contacting the Ecology Building Society they are very helpful and well informed. We are lucky to have a Building Society with an emphasis on Ecology.",
      "rating": 5,
      "date": "8th April 2021",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Mr F J Knock",
      "text": "Always received free and friendly information on savings options",
      "rating": 5,
      "date": "8th April 2021",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Highly Commended",
      "text": "My Earthwise Cash ISA has quite a good interest rate . Also when I ring up with an enquiry I am always treated with the utmost respect and patience for which I am really grateful. My favourite Building Society I do not need the mortgage services but admire the fact that they only lend for environmentally sound builds and that the headquarters live up to their standards also I have really enjoyed the AGMs",
      "rating": 5,
      "date": "8th April 2021",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "great customer service and great neighbours!",
      "text": "the staff were very helpful to me when i was setting up a savings account. The head office is based in my home town and the building and grounds are a real community asset.",
      "rating": 5,
      "date": "8th April 2021",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Supporting sustainable building through ethical investment",
      "text": "Very friendly efficient service. Ecology enables me to make an ethical banking choice and for my money to support mortgages for sustainable building too.",
      "rating": 5,
      "date": "8th April 2021",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Best support and communication ever",
      "text": "I've been with Ecology Building Society for quite a few years and I never had a moment when I felt uninformed or confused about my savings. I feel the company values me and my investments. The company is very ethical and I feel reassured by the way my money is invested. Thank you!",
      "rating": 5,
      "date": "8th April 2021",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Great services and great customer experience",
      "text": "I've been with Ecology for quite a few years and I always come away from any dealings with them feeling positive - which is more than I can say for other financial institutions. I've always had the impression that they really care about their customers, and the quality and efficiency of their service, as well as prioritising people and planet with the way they operate. I feel like I can relax knowing that they're doing their best for me, even in these challenging times.",
      "rating": 5,
      "date": "8th April 2021",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Ethical and efficient",
      "text": "I have been saving with the EBS since 2003. For all of that time I have had their Eco-60 savings account and in the past I have also invested in their Earthsaver Bond. Over the years I have paid in and withdrawn from my account and all transactions have been done efficiently. I have also attended some AGMs which are informative and enjoyable.",
      "rating": 5,
      "date": "8th April 2021",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Well used resources",
      "text": "I am very pleased that the money that I have with the Ecology Building Society is used for ethical purposes.",
      "rating": 5,
      "date": "8th April 2021",
      "product": "Savings",
      "sentiment": "positive"
    }
  ]
}