{
  "society": "Furness Building Society",
  "slug": "furness-building-society",
  "smpUrl": "https://smartmoneypeople.com/furness-building-society-reviews/products",
  "totalReviewsOnSMP": 12,
  "avgRating": 4.25,
  "scrapedAt": "2026-02-06T15:42:21.484547+00:00",
  "reviews": [
    {
      "title": "They hang on to your money",
      "text": "When an account matures do not expect to get your money back quickly, as with other financial bodies. They run a Mickey Mouse system. The account matures at midnight - money back next day - no chance. money back maybe three days later - no interest paid for the three days. Matures midnight Friday Saturday, Sunday, then three days. I hope you are not in a hurry to get your money - good luck with that,",
      "rating": 1,
      "date": "25th February 2022",
      "product": "Insurance",
      "sentiment": "negative"
    },
    {
      "title": "kitchen",
      "text": "8 years workings form moldova !!",
      "rating": 4,
      "date": "22nd January 2021",
      "product": "Insurance",
      "sentiment": "positive"
    },
    {
      "title": "Turned it around",
      "text": "Tricky start but came up trumps!",
      "rating": 5,
      "date": "20th July 2019",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Fantastic",
      "text": "Personal, bespoke service and fantastic deals.",
      "rating": 5,
      "date": "7th November 2017",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Customer service is excellent",
      "text": "Customer service is excellent, friendly, helpful, clear in advice and instructions. I've had various savings accounts and have been happy with all of them.",
      "rating": 5,
      "date": "23rd January 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "They've always tried hard for me and been friendly i...",
      "text": "They've always tried hard for me and been friendly in the process",
      "rating": 5,
      "date": "10th September 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Customer service excellent.",
      "text": "Customer service excellent. Product have been competitive in the past, but lately not so good.",
      "rating": 5,
      "date": "9th July 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "helpful and pleasant staff",
      "text": "They have always been very helpful and pleasant to deal with.",
      "rating": 5,
      "date": "3rd April 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Very friendly and helpful company",
      "text": "Very friendly and helpful company",
      "rating": 5,
      "date": "27th February 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Unnecessary cost and delay to get money after a death",
      "text": "Furness building society insist that you apply for Probate if someone passes away and their account holds more than £15,000, even if the money is being transferred to a spouse. Probate will cost a minimum of £215 and it will take at least 6 weeks. At a time when people are at their most vulnerable, Furness Building Society insist that you incur unnecessary costs and delays. Other banks and building societies allow you to withdraw the money without getting probate. Aging or ill account holders may want to consider using another Bank or Building Society.",
      "rating": 1,
      "date": "22nd October 2021",
      "product": "Savings",
      "sentiment": "negative"
    },
    {
      "title": "Fast easy opening of Regular savings account",
      "text": "I have always been attracted to Furness Building Society all through my adult life they have supported me with their products, I have planned for my retirement which includes saving for future things, Car, House repair etc, I therefore opened a regular saver account this allows me to save a substantial amount every month and receive a very good interest rate.",
      "rating": 5,
      "date": "24th February 2020",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Traditional banking at its best",
      "text": "Furness Building Society provide an incredible in branch service. The staff (in any of their branches) have never been anything other than friendly, professional, polite and helpful. They always take an interest in my family, don't constantly pressure me to take out new products and, best of all, still have passbooks.",
      "rating": 5,
      "date": "4th February 2017",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Just opened an anniversary regular…",
      "text": "Just opened an anniversary regular saver with Furness BS. Mightily impressed. Opened the account very shortly after it became available on line and within less than 10 minutes everything was up and running. Sent first monthly deposit even though it failed COP (as expected so soon after opening) and just waiting for it to show on line, probable tomorrow.\n\nFor any Building Society, never mind a small one, the service has been impressive. Some of these others that open attractive accounts and then get stuck, unable to cope, should take lessons from Furness",
      "rating": 5,
      "date": "20th January 2026",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Fast and easy access",
      "text": "I downloaded the Furness Building Society app to open an account when it was first released. Since then I've had my maturity through and found switching my product really easy, all done through the app.",
      "rating": 5,
      "date": "8th January 2026",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "The app is user friendly and easy to…",
      "text": "The app is user friendly and easy to use which was great for my first account with the Furness. Also managing money was straightforward with the details they provided, very happy with the whole service. Thank you",
      "rating": 5,
      "date": "23rd December 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Excellent customer service from a…",
      "text": "Excellent customer service from a genuinely locally focused business",
      "rating": 5,
      "date": "18th December 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Excellent bespoke service",
      "text": "Furness helped me greatly with 2 expatriate buy to let mortgages.  They were complex but dealt with very professionally and with speed too.  The rates on offer were excellent.\n\nI would highly recommend them to anyone.",
      "rating": 5,
      "date": "17th December 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "I’ve been visiting the branch in Kendal…",
      "text": "I’ve been visiting the branch in Kendal for many years now and the team there always cheer up my day.",
      "rating": 5,
      "date": "16th December 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Favourable Lender",
      "text": "As an independent mortgage broker, Furness are a lender that I am always happy to recommend. Their service levels and  lending criteria are good and with a manual underwriting process, they are a lender that will listen and take a view on cases that some other lenders would not.",
      "rating": 5,
      "date": "16th December 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Great in branch service",
      "text": "Great in branch service. Very helpful with my mortgage queries",
      "rating": 5,
      "date": "2nd December 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Easy savings account opening",
      "text": "Opened an ISA here using their app and it was easy and straightforward. Providing ID was simple and accepted first time. Sending money to the account was easy too with the details they provided.",
      "rating": 5,
      "date": "28th November 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Great mobile app for savings",
      "text": "Great mobile app for savings.   Easy to open and easy to transact.  And smooth maturity process.  Staff will call if you need help.",
      "rating": 5,
      "date": "20th November 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Disgusting customer service. No support. No help. Avoid.",
      "text": "I had a 2-year fixed mortgage with Furness. Halfway through, I finally found the courage to leave an abusive partner. That decision left me jobless, with no income and nowhere to turn.\n\nI immediately told Furness about my situation, hoping for even the smallest bit of understanding or support. Instead, I was met with cold indifference. When my fixed term ended, my mortgage payments doubled overnight. Their only response: “You have to pay it.”\n\nI filed a complaint, desperate for help, only to be told that everything they did was “justified.” For over nearly 2 and a half years my home stood empty as I struggled to pick up the pieces of my life—while they showed not a shred of compassion or empathy.\n\nNow that I’ve finally sold the property, I can only warn others: Furness offered me nothing but cruelty and disregard at the lowest point in my life. No support. No humanity. No help.",
      "rating": 1,
      "date": "1st October 2025",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    },
    {
      "title": "No response from online forms",
      "text": "Filled in the online enquiry form for a new mortgage and never received a response. Called into a branch and asked and was just told I had to ring up to chase. \nWould have liked to have used a local BS but had no response from them!",
      "rating": 1,
      "date": "20th September 2025",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    },
    {
      "title": "infuriating registration process",
      "text": "It is almost as if the identity verification process has been designed specifically to frustrate your ability to apply for a simple savings account. Round and round in circles you go - nothing will satisfy the bot whose job it is to capture your likeness - and no working option to upload manually. A headache inducing waste of time.",
      "rating": 1,
      "date": "8th September 2025",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    },
    {
      "title": "Why change a working website???",
      "text": "When I placed savings with them in 2021 I had access to my savings online.  For reasons known only to them, they then decided to create a new website and I cannot now access my accounts online.\nI took note of the email I received a few months ago  and decided to register. WHAT A MISTAKE!!\nBecause I have to take a photograph of me and my passport I have to do this on a mobile device - why  ?  Other companies allow a scan of my passport !  But I persevered and used my tablet. The registration process broke down 5 times, and each time all the information was lost and I had to re-start. On the 5th time I decided enough is enough, I have better things to do with my time ! Why change a working website???",
      "rating": 1,
      "date": "19th July 2025",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    },
    {
      "title": "I was selling my house and purchasing a…",
      "text": "I was selling my house and purchasing a new one so needed to change my mortgage I contacted Furness and spoke to fern Cloudsdale and explained this was somthing I needed doing fast and In record time fern explained everything with me and got me approved and paperwork sent over. I have to say fern worked extremely hard and got done what I needed as promised with no stress. Thankyou again fern",
      "rating": 5,
      "date": "9th June 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Impossible registration process",
      "text": "I tried to register with the Furness this morning to transfer an ISA to them. I had  an ISA with them a few years ago and they were fine, but this time the registration process was awful. I gave up after about 2 hours and went elsewhere!",
      "rating": 1,
      "date": "4th April 2025",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    },
    {
      "title": "First experience with this building…",
      "text": "First experience with this building society. All I can say deposits are very slow to go into the account. Apart from that we will see how it goes.",
      "rating": 4,
      "date": "21st January 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Very happy customer",
      "text": "Very happy customer. Savings account wax set up online without any human contact. First class and simple app giving all the info you need. Thankyou.",
      "rating": 5,
      "date": "1st December 2024",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Tried to log into my account",
      "text": "Tried to log into my account. Sent a 6 digit number to access the account. I was then asked for a five digit passcode!! What is going on? Very poor service",
      "rating": 1,
      "date": "16th November 2024",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    },
    {
      "title": "Just came off the phone from a lovely lady…",
      "text": "Just came off the phone from a lovely lady at The Furness Building Society. Had some issues with getting 'onboarded' to their new digital platform. Issues will  be resolved manually by them. Sometimes it is how competently financial institutions resolve issues and respond to their customers that really counts. Supporting the Mutuals has probably never been more important as they can provide good old-fashion service along with the flexibility and transactional speed of a digital platform. Forgot to ask the lady's name; but thank you for your help and for being so patient with my hearing impairment.",
      "rating": 5,
      "date": "27th September 2024",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Poor Services",
      "text": "Extremely poor services,  please don't use this bank , avoid this services,  high rates and I repeat again , Extremely Poor Services provided . Shame on this entity.",
      "rating": 1,
      "date": "17th August 2024",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    },
    {
      "title": "So many problems doing something simple…",
      "text": "So many problems doing something simple like trying to log on to my account.\n Now have to download the app, usually not  a problem, won’t load. \nGo in through Google chrome as Safari won’t load. \nDon’t use an iPad only use an iphone, should be no problem, taken the photo , taken photos of driving license, accepted but …can’t get through to my account.\n I Will have to go into Lancaster office and see Helen to get it sorted.\nNOT impressed with new way of accessing my account.",
      "rating": 1,
      "date": "16th August 2024",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    },
    {
      "title": "Furness Data Breach!",
      "text": "Furness Data Breach!\n\nFurness Building Society sent me another customers data and breached GDPR. \n\nI don't trust Furness now and want to exit my mortgage agreement with them. They won't let me unless i pay £4k + to do so.\n\nFurness are not customer focused and need to waver these fees and let me move on to a more professional provider like Santander.\n\nFurness I would like you to reconsider your decisions and actions and let me out of my mortgage agreement with you.",
      "rating": 1,
      "date": "1st August 2024",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    },
    {
      "title": "My account got locked",
      "text": "My account got locked. Through no fault of mine. They are bringing in a new system which is totally useless and confusing. I for one will close my accounts and so will my wife on maturity. We will move our funds to somewhere that can deal with humans who are of a certain age and not wanting all this red tape. Having wasted hours they want more of our time ... its easier to leave. Do not get involved.",
      "rating": 1,
      "date": "23rd July 2024",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    },
    {
      "title": "Great service",
      "text": "Nice  local people answering calls, had a problem with my online passwords for my isa.\n\nVery helpful and polite, A pleasure to bank with furness building society, and good rates for a small building society. (Welldone)",
      "rating": 5,
      "date": "15th March 2024",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Great customer service",
      "text": "Great customer service",
      "rating": 5,
      "date": "16th January 2024",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Mortgage offer pulled at the 11th hour",
      "text": "I had a mortgage in principle and everything going fine, surveyor was booked in for the following week, 2 days before survey I received a phone call from the surveyor that they where asked to cancel the survey with no reason given, I spoke to my mortgage broker and they informed that the mortgage offer had been withdrawn as they had changed there criteria, I've had no other communication to explain the reason why. Utterly disgusting, I would avoid at all costs. I think that previous reviews just shows what this building society is like",
      "rating": 1,
      "date": "29th July 2023",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    },
    {
      "title": "I haven't even been able to get off the…",
      "text": "I haven't even been able to get off the starting block!\nI opened this account on 29th June.  I couldn't find a transfer form - it came up with an error message to which you have never replied.  You sent the account details.  When I tried to transfer funds it kept coming up with a message saying that it didn't match the account name.  I used the details you sent!  I only transferred £1 because of this but even this is not showing on my account.  Please find it and send it back.  I am not impressed. I have just tried to phone and can't even get through.",
      "rating": 1,
      "date": "10th July 2023",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    },
    {
      "title": "First class service",
      "text": "I needed to close 2 of my fixed rate isas,pay a penalty  and move the funds into a better rate fixed rate isa.I requested 2 isa transfer forms---they arrived NEXT DAY by first class post together with a first class stamped self addressed envelope.The completed forms were returned the same day and the transfer was the next day.It is so unusual to get such service these days that it deserves mention",
      "rating": 5,
      "date": "10th February 2023",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Ridiculous  bureaucracy",
      "text": "I wanted to open a monthly saver account. You can't do it online. When I sent the application form and cheque, they said I need to send two pieces of ID  signed by a doctor, solicitor etc.\nThis is crazy and utterly unnecessary.\nThe annoying thing is that I was a previous member -so I'm sure all my details would still be on their records\nI was going to say that Furness Building Society need to move into the 21st Century but I don't think they've even reached the 20th Century yet- they  are stuck in the 19th Century",
      "rating": 1,
      "date": "1st February 2023",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    },
    {
      "title": "Refused mortgage at 11th hour",
      "text": "Had a mortgage agreed in principle prior to the mini budget. Valuer raised issue with a stepped crack, agreed to get all reports requested included structural engineer and drainage. \nConfirmed issue and solution to address. Furness requested quote from builder which we obtained, total cost under £2000\nAt the 11th hour refused to mortgage. Clearly has no intention of allowing repair to be undertaken. Most likely didn’t want to commit to a low interest rate!! \nAVOID and go with a sensible lender",
      "rating": 1,
      "date": "8th December 2022",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    },
    {
      "title": "Ridiculous stress test",
      "text": "Ridiculous stress test , never been refused a mortgage before but some woman underwriter decides different. Not surprised you only get 3 stars , that’s probably too high anyway",
      "rating": 1,
      "date": "30th June 2022",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    },
    {
      "title": "It is impossible to get through on the…",
      "text": "It is impossible to get through on the telephone to have any queries answered. I wish to obtain an application pack for an ISA transfer but this has not been possible despite many attempts to phone.",
      "rating": 1,
      "date": "16th May 2022",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    },
    {
      "title": "I went to the Lancaster branch",
      "text": "I went to the Lancaster branch, Helen was brilliant. She was very clear about what I needed to do, and clearly understood about POAs. I went 3 weekends in a row to sort things out and she was always prepared and happy for me  to ask questions. Helen made everything easy and even gave me the information to ring the branch direct. \nSuper service, super products and there open on a Saturday!!!!",
      "rating": 5,
      "date": "1st May 2022",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "So grateful to Helen for all her help…",
      "text": "So grateful to Helen for all her help and understanding. She's marvellous!! Thank you",
      "rating": 5,
      "date": "1st April 2022",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "I’ve been a mortgage customer with this…",
      "text": "I’ve been a mortgage customer with this Society for over 20 years & have never missed a payment unfortunately loyalty counts for nothing now when trying to remortgage in my sole name.",
      "rating": 1,
      "date": "23rd June 2021",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    }
  ],
  "trustpilotUrl": "https://uk.trustpilot.com/review/furnessbs.co.uk"
}