{
  "society": "Hanley Economic Building Society",
  "slug": "hanley-economic-building-society",
  "smpUrl": "https://smartmoneypeople.com/hanley-economic-building-society-reviews/products",
  "totalReviewsOnSMP": 900,
  "avgRating": 4.83,
  "scrapedAt": "2026-02-06T15:43:53.487454+00:00",
  "reviews": [
    {
      "title": "I would like to thank Lana Beech at Hanley Economic...",
      "text": "I would like to thank Lana Beech at Hanley Economic Building Society for her excellent support throughout my mortgage application. Lana was consistently friendly, professional, and extremely efficient, and she was particularly helpful in guiding me through a challenging and complex valuation stage. Her clear communication, persistence, and willingness to help made a very stressful process far more manageable. I’m very grateful for her support and would highly recommend her to anyone dealing with a mortgage application, especially where additional complexity is involved.",
      "rating": 5,
      "date": "5th February 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "I have had a mortgage with Hanley Economic Building...",
      "text": "I have had a mortgage with Hanley Economic Building Society for over 11 years. They always keep me up-to-date with how my account is managed. They're transparency is refreshing.",
      "rating": 5,
      "date": "3rd February 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "I was delighted to be offered a mortgage with Hanley...",
      "text": "I was delighted to be offered a mortgage with Hanley economic when the home I had rented for 42 years was sold to developers.. As I was 85 at the time many Banks and building societies would not offer me a loan Hanley 's came to the rescue with a lifetime mortgage Now I am happily settled and enjoying life. The staff are always polite and helpful when I have needed to talk to them and keep me well informed. I really would recommend this company to my friends",
      "rating": 5,
      "date": "23rd January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Mortgage experience with Hanley has been good.",
      "text": "Mortgage experience with Hanley has been good. Everything is explained in full in the paperwork.",
      "rating": 5,
      "date": "22nd January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Since purchasing a mortgage from Hanley I have been...",
      "text": "Since purchasing a mortgage from Hanley I have been vey satisfied with the customer care received, whenever I have called customer services I’ve never waited more than a minute to speak with a customer service representative. I have always the customer service representatives to be very polite, understanding and extremely helpful indeed. I also believe the products they offer as very comprehensive and good value for money.",
      "rating": 5,
      "date": "21st January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great experience to secure a mortgage",
      "text": "Needed a mortgage to buy my mother in law an apartment. Very helpful throughout the process and got just what I needed thanks",
      "rating": 5,
      "date": "20th January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "The smoothest mortgage experience I've ever had.",
      "text": "The smoothest mortgage experience I've ever had. Quick, efficient and friendly.",
      "rating": 5,
      "date": "20th January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great provider, friendly & knowledgeable.",
      "text": "Always had good service from them, staff are friendly and have been able to help / answer any queries I’ve had. When it comes time for mortgage renewal they’ve automatically offered me a competitive deal so have never needed to shop around for an alternative supplier",
      "rating": 5,
      "date": "20th January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "All positive, excellent customer care, quick and eff...",
      "text": "All positive, excellent customer care, quick and efficient",
      "rating": 5,
      "date": "19th January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "HEBS Review L&S",
      "text": "We transferred our Mortgage to the HEBS in June 25, in doing so we were impressed by the level of service provided, each step was clearly explained and all our queries were resolved in a timely manner.",
      "rating": 5,
      "date": "19th January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Transition between self-build product to a standard...",
      "text": "Transition between self-build product to a standard mortgage, assisted with my finances and outcomes.",
      "rating": 5,
      "date": "19th January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great mortgage product",
      "text": "Friendly, helpful. staff. Really good interest only retirement mortgage product, very good value even in these uncertain times.",
      "rating": 5,
      "date": "19th January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Mortgage Service",
      "text": "I initially contacted Hanley because I was attracted by their mortgage products which were very competitive at the time I applied. I received excellent customer service from start to finish with the processing of my mortgage application. The staff were always polite, friendly, very knowledgeable and nothing was too much trouble. Special thanks to Stacey for pulling out all the stops to arrange my mortgage appointment at short notice, and to Lana for expertly guiding me through the process.",
      "rating": 5,
      "date": "19th January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent service",
      "text": "My re-mortgage was handled professionally and efficiently throughout by the Hanley. The type of mortgage suited my needs and the rate was competitive.",
      "rating": 5,
      "date": "19th January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "The Human Touch",
      "text": "On the rare occasions that I’ve needed to contact them about my mortgage I cannot even bring to tell you how nice it is to just speak to a normal person without umpteen button presses. Even better, the person can almost always deal with the query themselves, and only occasionally do they need to transfer directly to a specific department.",
      "rating": 5,
      "date": "19th January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "My mortgage rate is excellent and they’ve always hel...",
      "text": "My mortgage rate is excellent and they’ve always help me when I’ve contacted them",
      "rating": 5,
      "date": "19th January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Easy to talk to very helpful in times of crisis.",
      "text": "Easy to talk to very helpful in times of crisis. Always getting in touch regarding new products",
      "rating": 5,
      "date": "19th January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent and balanced support",
      "text": "Excellent and balanced support at discussions on two occassions when mortgage has reached fixed rate term expiry",
      "rating": 5,
      "date": "19th January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Easy to deal with, good online mortgage account portal",
      "text": "Easy to deal with, good online mortgage account portal",
      "rating": 5,
      "date": "19th January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "So glad I chose The Hanley Economic",
      "text": "The Hanley makes the whole mortgage process easy. I honestly can’t fault the mortgage process with Hanley Economic. From start to finish it was clear, smooth, and so well handled. Everything was explained in a way that actually made sense, communication was spot on, and I never felt rushed or left wondering what was happening next. The whole process felt far less stressful than I expected, and that’s entirely down to how professional and supportive they were. I’d 100% recommend them to anyone going through a mortgage application.",
      "rating": 5,
      "date": "19th January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great service and a market leading product",
      "text": "We had a long drawn out property transaction but Jane at the Hanley stayed with us patiently and efficiently every step of the way.",
      "rating": 5,
      "date": "19th January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Professional and expert mortgage service",
      "text": "The Hanley provided the right product that was exactly what we needed. Jane Longmore who navigated the whole process for us made the experience fabulous. Even when we faced difficulties moving forward, again Jane expertly handled our application. Jane’s professionalism and proactive approach made the whole process straightforward. Thank you Jane and the Hanley.",
      "rating": 5,
      "date": "12th January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Professional Mortgage Advisors",
      "text": "Jane was a very informed advisor who was always very responsive and helpful",
      "rating": 5,
      "date": "12th January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "I went for the rent to buy scheme aka 100% mortage m...",
      "text": "I went for the rent to buy scheme aka 100% mortage my advisor Lana beech was unbelieveble. She looked out for us in so many ways and made sure we got to the finish line. My trust in her will always be there and Hanley Economics is a better place for having her there. I owe her so much because never in my life did I think i would own a home but Lana made it happen",
      "rating": 5,
      "date": "6th January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Had a mortgage telephone call with one of the adviso...",
      "text": "Had a mortgage telephone call with one of the advisors Jane Longmore, lovely lady helped out a lot with all information as were first time buyers",
      "rating": 5,
      "date": "15th December 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "A very helpful and thorough mortgage advisor",
      "text": "A very helpful and thorough mortgage advisor",
      "rating": 5,
      "date": "17th June 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Superb support throughout the application process.",
      "text": "I scoured the market for an equity release product that suited my needs for over a year and eventually found the Hanley. They recognise that people may use savings to fund their living expenses instead of drawing income - and are therefore willing to look at assets (e.g. pension funds) when reviewing affordability. The advisor on my case, Jane Longmore, was absolutely fantastic - friendly, helpful and efficient. She supervised and guided throughout the whole process until a successful conclusion.",
      "rating": 5,
      "date": "2nd June 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Fantastic mortgage support",
      "text": "I contacted Hanley Economic directly for some mortgage advice after I had some issues going through a broker. I dealt with Lana Beech who heard my situation and was straight on the case to sort my mortgage. It was quick, efficient and pain free! A huge thank you to Lana for her support and fantastic communication.",
      "rating": 5,
      "date": "7th May 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Superb customer service.",
      "text": "Our Mortgage Application, was handle by Lana Beech who was amazing, supportive, helpful and knowledgeable a joy to work with. I recommend The Hanley Economic to anyone for their customer service and their competitive products.",
      "rating": 5,
      "date": "28th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Always get a friendly and efficient service",
      "text": "Always get a friendly and efficient service",
      "rating": 5,
      "date": "19th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "They are always helpful.",
      "text": "They are always helpful. They have respond isssues quickly, and given good advise",
      "rating": 4,
      "date": "17th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very helpful staff in agreeing our best tracker deal...",
      "text": "Very helpful staff in agreeing our best tracker deal which was market leading and still is",
      "rating": 5,
      "date": "17th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Best Service",
      "text": "I have the best mortgage rate and customer service from Henley for years now.",
      "rating": 5,
      "date": "17th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Mortgage arrangement was an easy process.",
      "text": "Mortgage arrangement was an easy process. Changes to mortgage rates are clearly set out. Easy process to continue mortgage at a preferred rate.",
      "rating": 5,
      "date": "17th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great work",
      "text": "Great customer service. Available and coherent and organised! Well done",
      "rating": 5,
      "date": "17th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Wonderful people work there, so friendly and efficient.",
      "text": "Wonderful people work there, so friendly and efficient. They took all the fears I had away when I was re mortgaging after my divorce. They have a feel of old school customer service, like I mattered not that I am just a number",
      "rating": 5,
      "date": "17th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Local company with fantastic staff.",
      "text": "Local company with fantastic staff.",
      "rating": 5,
      "date": "11th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Grateful thanks to Hanleys..",
      "text": "I was pleased and grateful to my broker for finding Hanleys and to be given a lifetime mortgage when some places would not offer because of being over 80. Having been evicted by developers I was unable to find anywhere to rent . My phone calls have always been answered swiftly and in a polite and friendly manner.",
      "rating": 5,
      "date": "10th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Helpful and informative service in securing the Morg...",
      "text": "Helpful and informative service in securing the Morgage from HEBS",
      "rating": 4,
      "date": "10th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "A great rate of interest on my variable mortgage.",
      "text": "A great rate of interest on my variable mortgage. Very understanding when my circumstances changed a week nefore mortgage was due to finalise!",
      "rating": 5,
      "date": "9th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "I have had a mortgage at an excellent rate.",
      "text": "I have had a mortgage at an excellent rate. Whenever I have contacted them they have always been helpful and solved any issues.",
      "rating": 5,
      "date": "9th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Helpful kind staff helped me buy my first house",
      "text": "Helpful kind staff helped me buy my first house",
      "rating": 5,
      "date": "9th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Good service.",
      "text": "Good service. Minimal waiting times, when calling via phone",
      "rating": 5,
      "date": "9th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Easy to explain our needs",
      "text": "Easy to explain our needs. RIO customer adviser was first class.",
      "rating": 5,
      "date": "9th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "So helpful when in hard time and staff were been ama...",
      "text": "So helpful when in hard time and staff were been amazing and so understanding excellent",
      "rating": 5,
      "date": "9th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Understood the need for a specialist mortgage",
      "text": "Undertaking a barn conversion I needed a mortgage product that understood the risks and the flexibility to provide a self build mortgage solution",
      "rating": 5,
      "date": "9th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great service.",
      "text": "Great service. Always available and efficient.",
      "rating": 5,
      "date": "9th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Professional and outstanding service",
      "text": "The service from the initial contact through to the mortgage completion was outstanding. Jane, the mortgage advisor was very professional, listened to us and showed us the possible mortgage options. There was no pressure and it was clear that Jane wanted us to make a decision that was right for us.",
      "rating": 5,
      "date": "8th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Local on shore people to help the community",
      "text": "Local on shore people with a passion to help people",
      "rating": 5,
      "date": "8th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "At last! A provider that understands my needs.",
      "text": "Over the past 2 years I have spend countless hours exploring various options for Equity Release. While I have adequate funds invested in my pension I could show little income to providers because I have been financially sensible saving into and then living off my ISA investments. The Hanley was the only provider I could find that was savvy enough to realise that people with solid investments should be able to use those investments as evidence of income potential and therefore allow a lifetime interest only mortgage product to be offered",
      "rating": 5,
      "date": "27th March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very helpful.",
      "text": "Jane was great - very helpful. I've heard a lot of horror stories on self build mortgage companies but Jane couldn't have been more helpful. I'm sure I was a nightmare repeatedly asking the same questions but clarification was always provided.",
      "rating": 5,
      "date": "26th March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "I meeting in person would be more preferred before m...",
      "text": "I meeting in person would be more preferred before my renewal of mortgage..",
      "rating": 5,
      "date": "26th March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Mortgage renewal was simple and quick to complete",
      "text": "Mortgage renewal was simple and quick to complete",
      "rating": 5,
      "date": "26th March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Needed a re-mortgage",
      "text": "Needed a re-mortgage - it took about 2 months to put it in place - staff were informative and very friendly throughout. Very pleased.",
      "rating": 5,
      "date": "26th March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Hanley have been brilliant mortgage providers.",
      "text": "Hanley have been brilliant mortgage providers. I love that they have the human touch threaded through every stage. They see you as a person, not just another number.",
      "rating": 5,
      "date": "26th March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "3 re-mortgages later",
      "text": "I've been with The Hanley for over 6 years and they've always been competitive when it comes to mortgaging. The process has been straight forward to follow and I've been happy with the service.",
      "rating": 5,
      "date": "26th March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent customer service",
      "text": "I’ve been a customer of HEB for many years. I have always found their customer service first class.",
      "rating": 5,
      "date": "26th March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "The staff are helpful, patient and explain things well.",
      "text": "The staff are helpful, patient and explain things well. Thank you.",
      "rating": 5,
      "date": "26th March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "The perfect mortgage",
      "text": "With the previous mortgage lender we were stuck in a limbo of high variable interest rate not linked to the BoE. With Hanley we've found the perferct offer linked to the BoE base rate.",
      "rating": 5,
      "date": "26th March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "I have a very good feedback, and very easy to work w...",
      "text": "I have a very good feedback, and very easy to work with you and good services.",
      "rating": 5,
      "date": "26th March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "friendly, helpful, knowledgeable people and good deals",
      "text": "Always dealt with any queries in a friendly helpful manner and no having to talk to a robot/computer, it’s always a real person I spoken to. At each renewal time for my mortgage they’ve offered a competitive deal so I’ve always been with them",
      "rating": 5,
      "date": "26th March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Amazing Service",
      "text": "All the Mortgage Advisors are friendly, understanding and extremely experienced and helpful. I feel I can trust their advice and expertise. The service in general is professional, timely and communicative.",
      "rating": 5,
      "date": "26th March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Easy to deal with",
      "text": "Easy to deal with and understanding of customer needs",
      "rating": 5,
      "date": "26th March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Highly recommend",
      "text": "Great experience all round - top customer service and good prices",
      "rating": 5,
      "date": "26th March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "First class personalised service",
      "text": "First class personalised service from a Society which cares for its members. Mortgage advisers help you through every stage of the process and follow up afterwards.",
      "rating": 5,
      "date": "25th March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Always great customer service",
      "text": "Always great customer service and it was easy to discuss and arrange my mortgage and when i needed to extend my fixed rate for a further two years.",
      "rating": 5,
      "date": "25th March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Mortgage review",
      "text": "Good customer service. Flexible financial offer but limited for best market rates.",
      "rating": 5,
      "date": "25th March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Good experience",
      "text": "Although it take a while, I got there in the end and am very happy.",
      "rating": 5,
      "date": "25th March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very good and personable experience.",
      "text": "Very good and personable experience. Always a human on the phone and very attentive.",
      "rating": 5,
      "date": "25th March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Staff are great",
      "text": "always get excellent customer service, offered different rates at time of renewal, currently going through a remortgage and the team are very helpful",
      "rating": 5,
      "date": "25th March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "SVR not come down after 3 interest rate cuts.",
      "text": "SVR not come down after 3 interest rate cuts. Savings rates have come down. SVR goes up immediately interest rates go up. Gross profiteering imo.",
      "rating": 1,
      "date": "25th March 2025",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "Sensible and reasonable rate renewal of FT period",
      "text": "Sensible and reasonable rate renewal of FT period",
      "rating": 5,
      "date": "25th March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent Service and Product",
      "text": "Provided exactly the product I was looking for. And once all was agreed service was quick and friendly",
      "rating": 4,
      "date": "25th March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "SVR increases with BoE rate but never decreases",
      "text": "I have written to Hanley couple of times on the topic of SVR but every time I get same reply. I simply don't understand that why you would keep on increasing SVR with BoE rate and not decrease it. I understand that theoretically there is no direct correlation but evidence suggests otherwise. I have complained on this topic which was not upheld so I will be writing to Ombudsman now. This is simply unfair to the customers who are on SVR. Though credit to the customer service team, response was very prompt.",
      "rating": 1,
      "date": "25th March 2025",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "Very helpful staff and timely response.",
      "text": "Very helpful staff and timely response.",
      "rating": 5,
      "date": "25th March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Brilliant mortgage company for first time buyers",
      "text": "Brilliant mortgage company for first time buyers",
      "rating": 5,
      "date": "25th March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great mortgage experience",
      "text": "Very helpful and knowledgable mortgage advisor made my remortgage journey very easy.",
      "rating": 5,
      "date": "25th March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "The Hanley was the only building society our mortgag...",
      "text": "The Hanley was the only building society our mortgage broker could find that would give my son and I a mortgage in order to assure the future for him and his family. I will always be very grateful for the Hanley who jhave been brilliant from the day forward.",
      "rating": 5,
      "date": "25th March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Customer service that goes the extra mile - 4 years...",
      "text": "Customer service that goes the extra mile - 4 years in we are always impressed with the customer service. They go the extra mile to be approachable and informative, explaining things simply. We are really pleased with the support available and the personal touch to communications.",
      "rating": 5,
      "date": "25th March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "I have had a mortgage with Hanley for over 10 years.",
      "text": "I have had a mortgage with Hanley for over 10 years. Very competitive rate. Excellent customer service.",
      "rating": 5,
      "date": "25th March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Always had good service, They have been better than...",
      "text": "Always had good service, They have been better than most other mortgage banks",
      "rating": 5,
      "date": "25th March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "The best most informative team.",
      "text": "The best most informative team. Helped me with my mortgage and were there every step of the way with anything I needed.",
      "rating": 5,
      "date": "25th March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Really easy to deal with, friendly, helpful and stra...",
      "text": "Really easy to deal with, friendly, helpful and straightforward",
      "rating": 5,
      "date": "25th March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Not considering mortgage customers",
      "text": "When interest rates went up, Hanley was quick to follow suit. As interest rates have declined, Hanley has made no changes to its standard variable rate. It has no regard for the wellbeing of its mortgage customers, and has no excuse, with many other lenders reducing rates.",
      "rating": 1,
      "date": "25th March 2025",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "Allowed me to buy my first home.",
      "text": "Allowed me to buy my first home and for that I’ll always be grateful as I am on the property ladder.",
      "rating": 5,
      "date": "25th March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great at renewal of mortgage.",
      "text": "Great at renewal of mortgage. Always happy to help",
      "rating": 5,
      "date": "25th March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "The team was very helpful in negotiating my mortgage...",
      "text": "The team was very helpful in negotiating my mortgage deal. In the end I was offered an exceptional mortgage deal that I was very happy about. The whole process went very smooth and trouble free",
      "rating": 5,
      "date": "25th March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Jane made it simple.",
      "text": "Jane made it simple, I needed to raise money to gift my son to enlarge his home for a growing family but I didn’t want equity release because I could afford the monthly repayments. A retirement interest only mortgage at a rate just al little above the usual mortgage rate and with a building society was ideal",
      "rating": 5,
      "date": "24th March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "HEBS-Highly recommended",
      "text": "Over the previous 5yrs I have had a number of different mortgage products from HEBS changing over time from self-build finance, mortgage, further advance, repayment to interst only- changing as my circumstances have changed. On every occassion that I have had dealings with HEBS I have received honest,accurate, useful financial information- always delivered in a clear and friendly manner. My personal preferences have always been sought by them, and they have not hesitated to point out the pros and cons of any decision we have been making. They have always gone the extra mile to find a suitable and appropriate product - but have always had my best financial interests at the heart of any recommendation they have made. All members of staff have been efficient, courteous and professional, but I must give a special mention to Jane Longmore from HEBS mortgage dept who has, over the years been absolutely exceptional in the quality of service she has provided. She has given honest,realistic , clear information at every stage of my applications; dealing with my various requests for information /advice in a calm, professional yet friendly and understanding manner. I cannot praise her highly enough and thank her for the service she has provided over the years. On the basis of her thoroughly professional approach I have , and will continue, to recommend HEBS to friends and family.",
      "rating": 5,
      "date": "16th March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Brilliant service from Jane Longmore",
      "text": "The Hanley have been great from the very first minute i enquired with them for my mortgage. My advisor, Jane Longmore, has been amazing and so professional at every moment. From first enquiry to completion, I feel like Jane has been a big help at every step and excellent at explaining things to a first time buyer.",
      "rating": 5,
      "date": "3rd March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Hanley staff were always pleasant and welcoming and...",
      "text": "Hanley staff were always pleasant and welcoming and answered telephone calls and emails promptly. They treated me with respect in spite of my age (85). They understood my requirements and found a mortgage that met my specific needs and was affordable with my pension income. They encouraged my solicitor to get the remortgage done in a timely manner.",
      "rating": 5,
      "date": "17th February 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Smooth and straightforward",
      "text": "The mortgage process with Hanley Economic was smooth and straightforward.",
      "rating": 5,
      "date": "8th February 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Held my mortgage with HEBS since 2009, won’t change.",
      "text": "I’ve held my mortgage with HEBS since 2009 and won’t move. Whenever I get close to the end of an agreed period, they offer a competitive renewal and then make the process really easy. Any problems and there’s always someone helpful at the end of the telephone, no annoying “automated answering systems”",
      "rating": 5,
      "date": "8th February 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "A safe place in a financial sea of uncertainty...",
      "text": "HEBS offers continuity over generations - a safe place in a financial sea of uncertainty for 170 years - including two generations of mortgagees in my family.",
      "rating": 5,
      "date": "7th February 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "New products but only for new customers",
      "text": "I have a RIO mortgage with the Hanley taken out nearly 5 years ago. I have 2 issues:-1) recently they introduced a new RIO deal with a lower interest rate but specifically prevented me from moving to it --- just for new customers only. I thought this practice was frowned on these days 2) there have been 3 BOE rate reductions recently but the Hanley has not yet reduced its SVR",
      "rating": 1,
      "date": "7th February 2025",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "I have a RIO mortgage and Hanley was the only Buildi...",
      "text": "I have a RIO mortgage and Hanley was the only Building Society I could get one from and they have also been extremely helpful and informative if I have ever had to contact them. I would not have been able to own my own home again at my age without Hanley Building Socitey, so my eternal thanks to you.",
      "rating": 5,
      "date": "7th February 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Stress free and nice people, great to interact with...",
      "text": "Stress free and nice people, great to interact with and great value.",
      "rating": 5,
      "date": "7th February 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Too long winded in responding",
      "text": "When contacting you I should not have to get a access code to view your response from the email you sent this is wasting time in reading your response",
      "rating": 3,
      "date": "7th February 2025",
      "product": "Mortgages",
      "sentiment": "mixed"
    },
    {
      "title": "Wanting to self build a bungalow .",
      "text": "Wanting to self build bungalow in garden of existing house - they well very helpful going though the options. We were in our 70s. We eventually settled on a Retirement Interest only mortgage on existing house as the best option.",
      "rating": 5,
      "date": "7th February 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "excellent coms",
      "text": "It was fast and communication was excellent",
      "rating": 5,
      "date": "7th February 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great service",
      "text": "Great service easy to speak to a human not a robot and always helpfull on the phone",
      "rating": 5,
      "date": "6th February 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Professional, informative.",
      "text": "Professional, informative. Have had a mortgage with them for over 10 years. Always keeps me appraised of my account and notifies me of any offers that are available.",
      "rating": 5,
      "date": "6th February 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Helpful and understanding",
      "text": "One of only a couple of companies that helped me an interest only mortgage",
      "rating": 5,
      "date": "6th February 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "The best",
      "text": "Excellent service and very knowledgeable staff.",
      "rating": 5,
      "date": "6th February 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "A great bank to deal with, straight forward, always...",
      "text": "A great bank to deal with, straight forward, always available to chat about things, upfront and honest. Dealing with them has been so easy. So much so we stayed at the end of our initial deal and took a new one. They definitely have the personal touch that loads of banks lack.",
      "rating": 5,
      "date": "6th February 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Nice friendly service.",
      "text": "Nice friendly service. Nothing too much trouble. Explain their products perfectly.",
      "rating": 5,
      "date": "6th February 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Fanatastic and friendly Building Society",
      "text": "A great experience for the last 10 years, always well informed and polite staff. Wouldn't hesitate to recommend this small and friendly society.",
      "rating": 5,
      "date": "6th February 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Hanley is really reliable and on your side",
      "text": "I've had a fixed rate mortgage with Hanley since 2015, the first term ended in 2020 and the second one will end this December. I found Hanley very helpful in explaining what my different options were and I've been fortunate in getting a very reasonable rate throughout. Given my age (75) my mortgage options were limited but Hanley gave me a very competitive rate (currently 2.9%) despite this.",
      "rating": 5,
      "date": "6th February 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Just a great process from start to finish, friendly...",
      "text": "Just a great process from start to finish, friendly knowledgeable staff.",
      "rating": 5,
      "date": "6th February 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Long term mortgage customer and very happy.",
      "text": "I switched my mortgage to the Hanley over 10 years ago because they offered excellent rates. I've stayed with them and moved house because they are excellent!",
      "rating": 5,
      "date": "6th February 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Always had a great experience with the Hanley Economic.",
      "text": "Always had a great experience with the Hanley Economic. Very helpful",
      "rating": 5,
      "date": "6th February 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent",
      "text": "We first took out our mortgage around 6 years ago our mortgage advisor was fantastic and switching products has been easy every time our fixed rate has ended",
      "rating": 5,
      "date": "6th February 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great personal service and good rates",
      "text": "Great personal service and good rates",
      "rating": 5,
      "date": "6th February 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "All good, never had any issues.",
      "text": "All good, never had any issues. Good mortgage rate. Recommended to my nephew who also took out a mortgage",
      "rating": 5,
      "date": "6th February 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great Building Society",
      "text": "We have been with Hanley for a number of years and they have provided us with clear, concise and fair information. We are happy with their rates and when we needed a product review they found us the best product that was still with Hanley.",
      "rating": 5,
      "date": "6th February 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent products and service",
      "text": "Excellent products with a very professional service to accompany it. Always been delighted with all the people I’ve dealt with at Hanley Economic.",
      "rating": 5,
      "date": "6th February 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very nice and easy!",
      "text": "Very nice and easy! Top staff, !",
      "rating": 5,
      "date": "5th February 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Knowledgable staff",
      "text": "Knowledgable staff who are happy to answer questions.",
      "rating": 5,
      "date": "5th February 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great service from the Hanley",
      "text": "My experience with The Hanley has been faultless. They great communicators and documentation is clear and well presented.",
      "rating": 5,
      "date": "5th February 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Plus 1 customer service always!!",
      "text": "Always have plus 1 customer service at any of the Hanley Branches I visit. I have also just had a quick phone call with regards to a retention product & Sherry was very knowledgeable and professional. She gave me all of my current mortgage figures/balances & platformed when I should hear about the upcoming rates that will be relevant to my mortgage when it is due.",
      "rating": 5,
      "date": "5th February 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent remortgage experience",
      "text": "A remortgage done very quickly and without and problems",
      "rating": 5,
      "date": "31st January 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "A company who values their clients",
      "text": "We have recently secured a second product with the Hanley after a successful 2 years of self build mortgage borrowing. This process has been challenging for both the mortgage company and ourselves as clients. Specifically, Lana, our advisor, and Danielle and Lauren in Underwriting were particularly supportive and helpful throughout and without their knowledge, expertise and a great deal of patience, we wouldn't have got through to mortgage offer stage. The Hanley have worked with us to find a suitable product and it felt like a collective process rather than one in which suits the lender only. Thank you for having a 'big picture' approach to lending, something we very rarely see these days.",
      "rating": 5,
      "date": "29th January 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Their mortgage adviser was very friendly, profession...",
      "text": "Their mortgage adviser was very friendly, professional and took the time to explore our needs.",
      "rating": 5,
      "date": "27th January 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great service, Hanley did my remortgage last year an...",
      "text": "Great service, Hanley did my remortgage last year and I couldn’t recommend them more. Friendly staff and knowledgable mortgage advisers.",
      "rating": 5,
      "date": "26th January 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent Mortgage Products & Customer Service",
      "text": "I initially contacted Hanley because I was attracted by their mortgage products which were very competitive at the time I applied. I received excellent customer service from start to finish with the processing of my mortgage application. The staff were always polite, friendly, very knowledgeable and nothing was too much trouble. Special thanks to Stacey for pulling out all the stops to arrange my mortgage appointment at short notice, and to Lana for expertly guiding me through the process.",
      "rating": 5,
      "date": "23rd January 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Super friendly and knowledgeable staff",
      "text": "Super friendly and knowledgeable staff",
      "rating": 5,
      "date": "20th January 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent staff.",
      "text": "Excellent staff. Vicki was absolutely amazing.",
      "rating": 5,
      "date": "18th January 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "I have recently taken my mortgage to Hanley Economic.",
      "text": "I have recently taken my mortgage to Hanley Economic. The service and advice has been superb.",
      "rating": 5,
      "date": "17th January 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Amazing experience from start to completion",
      "text": "Amazing experience from start to completion of my mortgage application. Was updated consistently throughout with updates of where the application was up to. A special mention to Jane Longmore who was always on hand to assist us with any queries we had.",
      "rating": 5,
      "date": "15th January 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "I have had excellent service from Jane in helping me...",
      "text": "I have had excellent service from Jane in helping me take out a later life mortgage. She is knowledgeable and understanding through the whole process. I can recommend the service received from Jane at the Hanley Ecconomic.",
      "rating": 5,
      "date": "7th January 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Special thanks to Jane!",
      "text": "Jane was so helpful throughout the whole process. She was informative, patient and knowledgeable. The whole process was a great experience.",
      "rating": 5,
      "date": "5th December 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "My ROI mortgage",
      "text": "I have just finalised my RIO mortgage, Jane Longmore was my advisor she was engaging, friendly and professional. Jane kept me informed throughout the whole process either via emails or telephone. Explained all the necessary information regarding the RIO so I had a complete understanding of the product, she was excellent throughout.",
      "rating": 5,
      "date": "3rd December 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "The best mortgage experience I have ever had.",
      "text": "The best mortgage experience I have ever had. Been kept informed throughout the process which couldn't have been easier. Made all the more amenable by the wonderful assistance of Jane Longmore, mortgage advisor, who couldn't have been more helpful. Wonderful.",
      "rating": 5,
      "date": "3rd December 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Best lender, special thanks to Jane Longmore personally",
      "text": "To my experience, over 20 years, Hanley is probably best lender ever. Not only they have the best and unique lifetime tracker product; unlike high street lenders, AI or algorithm led, with \"computer says nooo!\" attitude, they have real people with experience, ready to listen to individual circumstances and needs, considering actual bank statements, rather than what Mickey Mouse reference agencies hold in record. 100% recommend!",
      "rating": 5,
      "date": "26th November 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "mortgage application",
      "text": "We have recently had two meetings with Jayne Longmore and been advised regarding a mortgage application. We were very happy with the thorough and detailed information we received.. Jayne was very friendly and helpful, nothing was too much trouble and we would highly recommend to others The Hanley Economic Building Society.",
      "rating": 5,
      "date": "14th November 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Self Build Mortgage made easy",
      "text": "I recently completed a self build mortgage with Hanley and the whole experience from start to finish was seamless. Lana Beech who looked after me from taking the application and all the way through underwriting was a pleasure to deal with and I have no hesitation in recommending Lana and Hanley to anyone looking to put a self build mortgage in place",
      "rating": 5,
      "date": "6th November 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Lana Beech, mortgage adviser, was incredibly helpful",
      "text": "Lana Beech our mortgage adviser was incredibly helpful in both explaining the type of mortgage we were entering into, the costs and progress of our mortgage request. We felt she had a genuine interest in obtaining the right loan for us.",
      "rating": 5,
      "date": "6th October 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Highly Recommend",
      "text": "Can’t recommend my mortgage adviser Lana Beech highly enough! Throughout the process she was knowledgeable, professional, personable and efficient. I found the Hanley RIO product attractive as there are no penalty charges for early repayment.",
      "rating": 5,
      "date": "2nd October 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Lana Beech Remortgage Advice",
      "text": "Lana Beech was our one contact to arrange a re-mortgage. Lana proved to be a very knowledgeable and friendly person. Interested in finding exactly what would be the right product for us in a very human way. Answers to questions were dealt with promptly.",
      "rating": 5,
      "date": "5th September 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Highly Recommended",
      "text": "Buying a house is one of the most stressful situations but we are very grateful to have had the help of Hanley Economic. We first saw Rachel Ecclestone in the Longton branch who perfectly explained what a mortgage is and we went through what would best suit the both of us. Then we were introduced to our mortgage advisor Lana Beech who throughout the whole process has been professional and extremely supportive. Lana was always checking up on us to see how we were doing and was always keeping us up to date with what was going on. No questions at all went unanswered. We can’t thank you enough for the help and support! I would highly recommend Hanley Economic especially for first-time buyers.",
      "rating": 5,
      "date": "3rd September 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Outstanding service and help throughout",
      "text": "From the beginning of our contact with the Hanley we have received outstanding service and help. Buying a house is known as a very stressful experience and so having the support from both Jane and Clare really helped to give us the reassurance that our money was being safely and securely transferred for the house purchase and the mortgage deal we were offered was exactly what we were looking for. We have nothing but praise and thanks for all the help that we received.",
      "rating": 5,
      "date": "29th August 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "We are writing to express our sincere gratitude for...",
      "text": "We are writing to express our sincere gratitude for the exceptional service provided by Jane Longmore during our recent mortgage application process. Despite the complexities and length of the process, Jane’s professionalism, patience, and dedication were outstanding and truly appreciated. Janes thorough knowledge of the mortgage landscape were evident throughout our interactions. Jane consistently went above and beyond to ensure that we were wellinformed and comfortable with each step. Jane’s quick communication made such a significant difference to our experience in keeping us updated throughout. It’s unavoidable that mortgage applications can be a long drawn out process but we never felt out of the loop. We are grateful for Jane making what could have been a stressful process much smoother and more manageable. Please extend our thanks to Jane for her hard work and dedication. In light of Jane’s exceptional service, we highly encourage that she receives recognition for her work. Jane’s ability to maintain customer satisfaction, even when circumstances are less than ideal, is a rare quality that deserves commendation. We believe that acknowledging Jane’s efforts not only rewards her dedication but also sets a positive example for the entire team. Thank you once again for having such a valuable member on your team.",
      "rating": 5,
      "date": "20th August 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Lana Beech was fantastic and very helpful with my mo...",
      "text": "Lana Beech was fantastic and very helpful with my mortgage and the underwriting process was smooth.",
      "rating": 5,
      "date": "15th August 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Self build mortgage",
      "text": "I recently completed on a self build mortgage with Hanley Economic. I was assisted throughout the application process by Lana who was extremely supportive, kept me updated regularly and responded to any of my questions promptly. I wouldn't hesitate to recommend Lana and Hanley Economic to others",
      "rating": 5,
      "date": "14th August 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Can't recommend this local building society enough!",
      "text": "Following an extremely informative and helpful meeting with a mortgage advisor, I have decided to remain with the Hanley on a variable rate mortgage. There were no delays to the paperwork and I was kept fully informed throughout the process.",
      "rating": 5,
      "date": "13th August 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "In branch service review",
      "text": "Staff have been really, really helpful and lovely throughout my mortgage application - I can't thank them enough for all their help.",
      "rating": 5,
      "date": "9th August 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "A fuss free experience",
      "text": "Jane Longmore handled our mortgage application very effeciently. The communication was clear and Jane was polite and helpful. This was one part of the house move that didn't add any stress so thank you!",
      "rating": 5,
      "date": "5th August 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great customer service",
      "text": "Applied for a mortgage with the hanley and Jane longmore dealt with my application very well. The customer service was great and Jane was very friendly and helpful. Very glad I chosen the hanley and would recommend this building society to other people.",
      "rating": 5,
      "date": "5th August 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Remortgage",
      "text": "Recently completed a remortgage with the support of Lana Beech (Mortgage Advisor). Couldn't have asked for a better service from Lana. Friendly, communicative, knowledgable and responsive. Nothing was too much trouble. Outstanding service. Highly recommend.",
      "rating": 5,
      "date": "1st August 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Fantastic service from Lana @ Hanley, always on hand...",
      "text": "Fantastic service from Lana @ Hanley, always on hand to answer any questions, very knowledgeable, and made sure the process was as smooth as possible :)",
      "rating": 5,
      "date": "1st August 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Lana was lovely, professional and cared",
      "text": "I recently completed on my house purchase with The Hanley. My mortgage advisor was Lana. Lana was amazing. She made the process seamless. She gave us updates throughout. She made us aware upfront of what we needed so we could provide all the documents so nothing would be delayed. She was so lovely and friendly. She even sent us a congratulations card when we moved in, which we both said was a lovely touch. I would recommend The Hanley as they have a fantastic advisor (Lana) and the products offered were really good compared to other lenders.",
      "rating": 5,
      "date": "31st July 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Nice guys to deal with.",
      "text": "Initial contact has been very pleasant and positive. Great attitude showing the right balance between friendly and professional, and very caring too.",
      "rating": 5,
      "date": "22nd July 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Couldn’t recommend enough",
      "text": "The guidance and support we received throughout, made the whole process as stress free as possible. Choosing a local building society made us feel like we were in very safe hands as we were provided a service that hasn’t been matched elsewhere in our experience. Couldn’t recommend enough.",
      "rating": 5,
      "date": "9th July 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Jane Longmore, Mortgage Advisor, introduced me to a...",
      "text": "Jane Longmore, Mortgage Advisor, introduced me to a RIO mortgage which fitted my requirements perfectly. She was very knowledgeable, courteous and efficient and had a very pleasant personality. Not pushy at all but explained everything about RIO mortgages that the Building Society offered. My application was completed carefully and thoroughly and everything completed within the expected time line. I would highly recommend Jane and the Hanley Economic to anyone seeking a mortgage and I readily give a 5 star review.",
      "rating": 5,
      "date": "3rd July 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Lana is a fantastic mortgage advisor.",
      "text": "Lana is a fantastic mortgage advisor. Great experience from start to finish. Great communication throughout the entire process and everything went smoothly.",
      "rating": 5,
      "date": "2nd July 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Avoid these chancers",
      "text": "In short I run a BTL business which obviously has a mortgage liability but runs at a consistently high profit. Hanley rejected my application for a personal mortgage (so completely separate to my Ltd) because of the liability attached to my Ltd, but refused to consider the cash flow that the Ltd generates. They took so long to come to a decision that I am now unable to find an alternative lender and will have to stick with my current provider at a higher rate. This is really basic stuff - if they are getting it so wrong at this level I can only imagine how poorly run the rest of the business is. Avoid at all costs.",
      "rating": 1,
      "date": "21st June 2024",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "First time buyer",
      "text": "I chose to take my first mortgage out with Hanley due to their highly competitive rates. My mortgage advisor Jane was lovely and really helpful, the process overall was a bit slow but this due to a backlog with the over writers.",
      "rating": 5,
      "date": "17th April 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Easy to switch my mortgage to Hanley",
      "text": "Lana Beech dealt with my mortgage enquiries and application. She had made a complex journey really smooth and easy. She always replies to my enquiries on a timely manner. Hanley also offered a flexible mortgage product that suits our needs.",
      "rating": 5,
      "date": "3rd April 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Lifetime tracker and Anna mortgage advisor",
      "text": "Anna dealt with my mortgage enquiries and application and made a potentially complex journey really painless and easy. She always replies to emails in a timely manner and was so pleasant to speak to on the phone. Hanley also offered a great mortgage product that I couldn’t find anywhere else.",
      "rating": 5,
      "date": "19th March 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Mortgage Advisor brilliant and very good product",
      "text": "Mortgage Advisor was brilliant and pushed through the mortgage really quickly. Good mortgage product for us, giving us the repayment flexibility that we wanted and without huge set up fees.",
      "rating": 5,
      "date": "5th February 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "I remortgaged to the Hanley in December.",
      "text": "I remortgaged to the Hanley in December. The mortgage advisor was great, kept me informed and followed up any delays and issues. Great service and great product.",
      "rating": 5,
      "date": "1st February 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Thank you Hanley Building Society",
      "text": "At such a daunting and uncertain times for the mortgage market, I am so very pleased we chose to mortgage our new home with The Hanley. From our very first enquiry, all the bumps along the way and right up until the very end, Jane Longmore was profressional, warm and helpful the entire way through. Having brought a new property, it was never going to be a quick process however, Jane was patient and efficient every step of the way. We really cannot thank her enough, Even down to the lovely card Jane sent on completion, it’s the little things. Merry Christmas to everyone at The Hanley and Jane From Mr and Mrs Cuthbert",
      "rating": 5,
      "date": "19th December 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Perfect Services! Transparent, clearly explained, timely and friendly.",
      "text": "From the very beginning of the process to having our mortgage raised, until the very end of completion, the service we received was perfect. We stayed with the same adviser - Jane - throughout the whole process, which gave us confidence that we hadn't been lost or forgotten in \"a system\". Jane carefully and thoroughly took us through every step of the way, of the process, in a timely way, explaining why she needed to know the answers to what she was asking us. Where there were options, she explained them, giving us the possible pros and cons of any particular path of direction we were choosing to go. We did not feel overwhelmed as we had several different conversations over a period of time, and did not move on until we felt satisfied that we completely understood what we were agreeing too. We never felt rushed to make a decision, or silly to ask any question. Jane took her time in explaining anything we asked, without assuming we understood! She was very kind and patient from the beginning to end of the process. She had great integrity, always telling us what was going to happen and when, and it always did! We were delighted with the whole service, and couldn't fault Jane or Hanley Economic Building Society over anything. Thank you for making everything so pleasant and straight forward.",
      "rating": 5,
      "date": "26th October 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great rate, personal service",
      "text": "I hadn't appreciated quite what a faff remortgaging to a different company is, but having applied for a very competitive rate from Hanley, was guided through the whole process expertly. Advisor Lana was helpful and responsive throughout - I particularly appreciated her chasing the solicitor at the end, to get the remortgage over the line in time. I'm very happy with the loan, and feel like I had great service.",
      "rating": 5,
      "date": "18th September 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Personal service and great value",
      "text": "Lana Beech the mortgage advisor dealt with us throughout our house move over a period of 9 months, from the earliest days of switching products on our old house, then considering what we could borrow if we moved, some grilling by us over the detail of how that would be affected by job moves, some last minute tweaks to the amount borrowed, to the point of exchange - all with the same friendly person by email and phone. A real personal service from a local business and still so competitive - why go elsewhere?",
      "rating": 5,
      "date": "13th September 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent And Efficient Process",
      "text": "Very happy with the process of moving my mortgage to the Hanley, Jane Longmore was professional and made it very easy and stress free.",
      "rating": 5,
      "date": "31st August 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "LANA is AMAZING",
      "text": "100000% would recommend- Lana is amazing. She has the patience of a saint and supported us through everything. She was always on hand to answer our questions and explained everything throughly. Lana is a credit to Hanley economic and we will always return to her in the future.",
      "rating": 5,
      "date": "26th August 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent Service",
      "text": "Offered a very competitive deal and excellent service throughout. Mortgage adviser was very helpful and supportive with every step of the process, never put on any pressure and met all deadlines. Definitely recommend the service.",
      "rating": 5,
      "date": "15th August 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Wouldnt want to go anywhere else",
      "text": "Taking a mortgage out with The Hanley was so easy thanks to our Mortgage Advisor Jane Longmore. Jane explained everything really well and kept in contact to make sure everything was running smoothly even when the mortgage application process had moved on from Jane making both myself and my partner feel comfortable and confident in The Hanley. We look forward to being customers for many years and have recommend them to everyone!",
      "rating": 5,
      "date": "15th August 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very happy and would recommend",
      "text": "Anna from Hanley has been so helpful and friendly and has stepped us through the whole process in a clear and transparent way. Really easy to do business with and very personable and professional. Would highly recommend.",
      "rating": 5,
      "date": "30th June 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Thorough and Professional",
      "text": "I have applied for a Retirement Interest Only Mortgage. Anna Whitehead thoroughly went through all the details that were required in a very professional manner. It was carried out in a very courteous manner and it was a very pleasant experience. She answered all questioned that i raised and clarified everything i raised. The interest rates are very competitive and I would recommend Hanley Economic Building Society to anyone.",
      "rating": 5,
      "date": "23rd June 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Fantastic Customer Service",
      "text": "This experience can be daunting - our advisor Lana Beech, explained the services offered and guided us through every step of the way in a professional and easy to understand way. The whole process was well handled, and she was never more than a phone call away. I would highly recommend her services - professional, efficient and friendly. Thank you Lana! Victoria H",
      "rating": 5,
      "date": "15th June 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "AN OUTSTANDING AND DEDICATED MEMBER OF THE HANLEY TEAM - LANA B",
      "text": "Lana B was so helpful, understanding and knowledgeable regarding our RIO re-mortgaging process. She managed to project her friendly and open manner in conjunction with the professional and masterful skills required of a mortgage advisor: all-in-all simply top-notch. Nothing seemed to phase her and her advice was clear and easily understood. She certainly played a key part getting us to where we are now. Simply the best ..........",
      "rating": 5,
      "date": "7th June 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Brilliant Service - Jane Longmore",
      "text": "Jane has been brilliant from the start to finish. She is exceptionally professional, helpful, efficient and knowledgeable. From the initial call through to the actual application and follow-up, Jane has always been very attentive, patient, friendly and responsive. We are delighted we chose Hanley Economic for all of our mortgages.",
      "rating": 5,
      "date": "1st June 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent efficient service",
      "text": "I have recently switched my mortgage to Hanley and wish to comment on the excellent service provided by my advisor Lana Beech. From the initial call with her right through to the mortgage completion she has been so helpful and attentive. It's so refreshing to have someone talk to you rather than hide behind an email. Thanks Lana. MIles Parker",
      "rating": 5,
      "date": "18th May 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Good service",
      "text": "After a few issues changing our mortgage to move house we did speak to the customer services team. Our issue was resolved very quickly and we were allocated Jame Longmore to sort our new mortgage. Jane went the extra mile to advise us on the best product. She kept us updated through the process and the mortgage part of our house move was completed very quickly. Jane also followed up after the move and completion to check everything was ok. I would absolutely recommend Hanley economic.",
      "rating": 5,
      "date": "15th May 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very easy",
      "text": "Lana at Hanley helped me to get my new mortgage and made the process very easy and friendly",
      "rating": 5,
      "date": "8th May 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Self Build Mortgage",
      "text": "Hanley have been brilliant from start to finish a self build is a rollercoaster ride and all the way through the process they have been supportive and also they have put me on a very fair mortgage product once finished that would be hard to beat elsewhere - can't praise them enough",
      "rating": 5,
      "date": "15th April 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Clear, concise and efficient",
      "text": "Daniel Mason from Hanley guided us through the process in an extremely clear and efficient way. He kept us fully informed throughout. Many Thanks Dan.",
      "rating": 5,
      "date": "13th April 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Mortgage Process - Thank you Anna",
      "text": "Anna Whitehead was extremely helpful throughout the whole mortgage process while buying our first home. She was very approachable and answered any questions we had, both over the phone and email very quickly. Thank you Anna for all your help during what can be a stressful period, your help, professionalism and advice is very much appreciated. I would recommended to others to have a chat with the team at the Hanley regarding mortgages.",
      "rating": 5,
      "date": "11th April 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Outstanding service from Lana Beech and the Hanley Economic team",
      "text": "Lana has been incredibly helpful, friendly and prompt in dealing wth our buy to let mortgage which we were pushing to get over the line before the financial year. What can I say - they did it! The valuation was booked in within a couple of weeks and everything went smoothly. For anyone reading this I would recommend The Hanley and also Tinsdills (Andrew Burrows) who worked hard to get this done within the limited time frame we had. Thank you",
      "rating": 5,
      "date": "30th March 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Wonderful Experience Very Professional",
      "text": "Just completed our remortgage with the Hanley Economic Building Society and the entire process could not have been better. Throughout, Jane was so friendly, professional and helpful, making the whole experience smooth and extremely speedy. We are delighted we chose the Hanley Economic, they have proved to be first class and we would highly recommend them.",
      "rating": 5,
      "date": "28th March 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "An anxious remortgager",
      "text": "As a lady of a certain going through a separation, just thinking about all the financial upheaval was stressful. After speaking to Anna at The Hanley regarding a remortgage was enough to keep my anxieties at bay and move forward. Such a professional, lovely lady. I have been with The Hanley for a number of years, great products and lovely, local service.",
      "rating": 5,
      "date": "23rd March 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent mortgage products and service.",
      "text": "Lana was extremely helpful in making the re-mortgage process very straightforward and saw the process through from start to finish - I am delighted to now be a Hanley customer and can recommend them highly. John",
      "rating": 5,
      "date": "14th March 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Brilliant service",
      "text": "The staff are very friendly and all helpful. Jayne was great at providing advise to me as a first time buyer, she was thorough and very helpful and made the process a breeze. I appreciate all the work and services provided and recommend the hanley. Thank you!",
      "rating": 5,
      "date": "2nd March 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent Customer Service",
      "text": "I initially contacted Hanley because I was attracted by their mortgage products which were very competitive at the time I applied. I received excellent customer service from start to finish with the processing of my mortgage application. The staff were always polite, friendly, very knowledgeable and nothing was too much trouble. Special thanks to Stacey for pulling out all the stops to arrange my mortgage appointment at short notice, and to Lana for expertly guiding me through the process.",
      "rating": 5,
      "date": "1st March 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Best company ever",
      "text": "Could not expect a smoother process and better customer service",
      "rating": 5,
      "date": "5th February 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent service from Lana",
      "text": "Lana was my mortgage adviser who helped me through the mortgage application process to purchase my new home. She was very knowledgeable and friendly. She was also flexible to speak to me around my working hours. I would recommend Lana and Hanley Economic to all of my friends.",
      "rating": 5,
      "date": "2nd February 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Remortgage to bigger house",
      "text": "First I'd like to say a big thank you to Jane and all in the underwriting, with going all the way with one property for a year for it to withdraw a week before completion. Then going though all paperwork and getting it up and ready asap would highly recommend friendly, professional and great communication within the time that feel like forever we are now happy in our new house thank you Hanley",
      "rating": 5,
      "date": "30th November 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Help with mortgage",
      "text": "Jane longmore at the Hanley made the experience a pleasant one . She couldn’t do enough to help . She was very knowledgeable, and informative. She helped us every step of the way . She kept us regularly informed of how it was progressing. She is a credit to the Hanley economic , and in my opinion,worth her weight in gold . Can’t thank you enough Jane ! It’s people like Jane who keep me at the Hanley .",
      "rating": 5,
      "date": "22nd November 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Mortgage Process with Lana!",
      "text": "I have had the pleasure of dealing with Hanley economic since May 2022 and I have to say their service from the very first phone call right through to the mortgage transfer for the completion of my home has been exemplary. A special mention to Lana Beech who is one of their mortgage advisors, she has been a pleasure to wok with throughout the process. Lana always did what she said she was going to do within the time frame she had stated and when this wasn't possible she always made an effort to make contact and explain why it was delayed. Lana also made it a point to remember facts in previous conversations and ask about these later on; for example my daughters birthday or my work trips. This type of service is rare and one people should appreciate. Thank you",
      "rating": 5,
      "date": "26th October 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "High quality service",
      "text": "Dear Jane, it was a great relief to know that our mortgage application has been accepted by the Hanley Economic Building Society. The Society through its staff has been thorough and also friendly towards us as applicants and given us the confidence to feel we would be treated with respect and support in this huge step. We are glad we were accepted but also that we felt appreciated. Thank you. Jim and Rosie Hastie.",
      "rating": 5,
      "date": "18th October 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Highly recommended",
      "text": "You are more than a number to them. A bespoke approach to mortgage underwriting. We have been with them since 2014. Whenever renewal comes up, the headline rate might not be as competitive than other lenders but once you factor in the extra costs, it is worth staying with them.",
      "rating": 5,
      "date": "30th September 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Friendly and personal service",
      "text": "Anna explained everything really clearly and was friendly and helpful throughout.",
      "rating": 5,
      "date": "28th September 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Remortgage support from Sheree and Anna",
      "text": "Really helpful team at Hanley. I spoke to Sheree on the Thursday and got an appointment with Anna on the Friday. By the end of the day all was sorted in relation to getting the application in. Couldn't ask for more!",
      "rating": 5,
      "date": "26th August 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great, friendly and professional customer service",
      "text": "Hanley were easy to contact, helpful, professional and competitive",
      "rating": 5,
      "date": "1st August 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great personable service",
      "text": "From our very first discussion, Lana Beech the mortgage advisor with Hanley, made the whole process of obtaining a new self build mortgage clear and straightforward. Lana was always available to provide help and assistance and was genuinely interested in our project. Although the mortgage has now been completed Lana still keeps in contact with us to offer ongoing support.",
      "rating": 5,
      "date": "3rd July 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Fantastic and friendly service",
      "text": "Jane was an absolute star through the whole mortgage journey !!. She was approachable, friendly and responsive, She updated me every step of the way . Thank you Jane for the amazing service!! Danielle who booked my initial appointment was also very helpful and courteous. It was my first experience dealing with Hanley EBS. Thanks to both Danielle and Jane it was definitely the best experience I've had with any lender out there on high street...10/10",
      "rating": 5,
      "date": "19th June 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Amazing, Stress Free, Experience with the Human Touch",
      "text": "My wife and I have just remortgaged with the Hanely, having taken a mortgage with them a few years ago to buy a new build house. They are a joy to deal with compared to some of our experiences in the past. Simple, straight forward communication both on the phone, with really knowledgeable members of staff and in writing. They are happy to talk you through the process and our remortgage, on a really competitive deal, could not have been any more straight forward. I would recommend them to everyone. This is banking as it should be.",
      "rating": 5,
      "date": "10th June 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Professional, Swift, and Informative",
      "text": "My husband and I were seeking additional funds for our self-build mortgage. The mortgage advisor, Jane Longmore, was so helpful, professional, and informative. The full process was very smooth, and the additional funding request was approved in record time. Would definitely recommend.",
      "rating": 5,
      "date": "6th April 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Fantastic service from start to finish",
      "text": "We applied for a new build mortgage and the customer care service we received from Lana Beech at the Hanley was professional, friendly, responsive and highly efficient. Fantastic service from start to finish!",
      "rating": 5,
      "date": "31st March 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent personal service",
      "text": "Our Mortgage Advisor was very customer focussed, responsive to our request and gave us the right information to make informed decisions. Our needs were quite specific as we were funding a significant house renovation. She understood our needs and was very clear about what was possible and not possible with the products available.",
      "rating": 5,
      "date": "5th March 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "A person not a number",
      "text": "Cashier’s know people by name ,and are always helpful. Go beyond to be helpful.",
      "rating": 5,
      "date": "11th February 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Lana was a legend!",
      "text": "Me and my wife had a very individual situation, moving from Singapore to then being self-employed in the UK had its own rings to jump through. As soon as we approached the Hanely we had a very welcoming and helpful team help us obtain and sort a mortgage to buy our dream home. Throughout the process, we had our own advisor (Lana) who not only was very helpful she was also very understanding and personable with our situation. I'm not going to stand and say that buying a house is stress free. But we were lucky to have someone responsive and helpful throughout the process.",
      "rating": 5,
      "date": "10th February 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "amazing staff!",
      "text": "helpful , knowlegable staff that gave lots of information and help with getting the right mortgage",
      "rating": 5,
      "date": "12th January 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Ideal for my needs.",
      "text": "I was recommended the retirement mortgage by a good friend who had just taken one out herself with the Hanley. Jane Longmore handled her application. Jane also handled my application . ....She was pleasant ,polite and professional. Guided me through the whole process patiently. It was easy to get in touch with her when I needed , by both email and telephone. She always responded promptly. I am now in my new home I would not hesitate to recommend the Hanley to others looking for a mortgage.",
      "rating": 5,
      "date": "10th December 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Fantastic service",
      "text": "As a first time buyer, I was clueless when it came to the process of buying a house and getting a mortgage. Jane at The Hanley was there every step of the way to support me with my application to ensure I was able to secure my AIP and ultimately the mortgage that had allowed me to buy my first home. The customer service from Jane and the team is second to none. Thank you again for your support and dedication during what I am sure has been one of the busiest times, it has really been appreciated.",
      "rating": 5,
      "date": "29th November 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great service and products",
      "text": "It's been a great experience working with the Hanley. It can be a real challenge in navigating all of the documentation and options available. I dealt with Lana who is exceptional at being by your side helping to guide you through the process. She's patient, calm and so knowledgeable and I feel is a reflection of the Hanley Economic culture. I feel in safe hands and would recommend them (and Lana) to anyone.",
      "rating": 5,
      "date": "15th October 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very reassuring building society to be part of",
      "text": "10/10 for the service provided by Jane Longmore when we applied for a mortgage. Couldn't ask for better. Overall rating only 4 stars because there were a couple of hitches involving the Hanley underwriters which were unnecessary and caused us significant stress at critical times during the application. However, it's good to be part of this Society now.",
      "rating": 4,
      "date": "11th October 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent service from Jane",
      "text": "From the very first telephone conversation right through to our Mortgage acceptance Hanley Economic have been so easy to deal with. Jane Longmore who dealt with us from that initial telephone conversation has not only shown how Professional and efficient she is at her job, she has also been very friendly and helpful in understanding our needs and indeed when technical support was needed was there to assist us with that also. We would certainly recommend Hanley and are thoroughly satisfied with the service and product we received.",
      "rating": 5,
      "date": "4th October 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Sound honest advice",
      "text": "From the first telephone call to the latest Jane Longmore was helpful and very professional.She explained every option in detail and made sure I chose the right product to suit my requirements.Overall we are very pleased and grateful for the service we received.",
      "rating": 5,
      "date": "24th September 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Brilliant Service 5*",
      "text": "Lana offered great service from the start of the application and throughout what became a complicated and drawn out sale. Very quick to respond to any query I had and any advice required. Explained everything in an easily understandable way to a first time buyer - would highly recommend!!",
      "rating": 5,
      "date": "8th September 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Efficient effective service from my adviser Anna",
      "text": "The Hanley help me with a mortgage offer as an existing customer moving house. They have been extremely helpful and diligent in their dealings with me and found a product that worked for my needs.",
      "rating": 5,
      "date": "24th August 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Friendly and supportive",
      "text": "We recently had a mortgage with the Hanley which I felt was a smooth and easy process. As we are fist time buyers Jane explained everything to us in detail and nothing was ever too much trouble. She made us feel comfortable every step of the way.",
      "rating": 5,
      "date": "19th August 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Lana Beech - outstanding Mortgage Adviser!",
      "text": "There were some nuances to our application which Lana quickly got to the bottom of and discussed with Credit to ensure there would not be further issues down the line. She managed expectations and delivered on promises to call at the times she said she would. Lana was very accessible and responded to emails / voicemails promptly. Despite no doubt having a large caseload, Lana has an incredible knack of making you feel looked after and you have confidence that your application won't be lost in a black hole. Despite the application process being excellent, responses from Underwriting took far too long and required chasing several times by Lana. To make the process from end to end as good as it can be, this is an area which requires much improvement.",
      "rating": 5,
      "date": "4th August 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Lana for Prime minister",
      "text": "Lana made this process stress free and was always on the other end of the phone if I had any questions and would always come back with an answer, even if it meant going out of her way to find the answer. Can’t thank her enough for everything she did from start to finish and still after we’d finished she was happy to help.",
      "rating": 5,
      "date": "13th July 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Retention Team lie in order to keep your business",
      "text": "Be very careful if you are renewing your mortgage. The Hanley promise flexibility if you need to change your product but then hit you with all sorts of fees and just basically make it impossible. It's a shame because when I first went with them it was a great experience but now it's just one nightmare after the next!",
      "rating": 1,
      "date": "1st July 2021",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "Great advice and support",
      "text": "Mark, my adviser was really helpful and guided me through the application process with ease and professionalism. This was a bit of a complicated application, and the underwriting team, particularly Danielle, were efficient and very helpful, ensuring that I was on track with everything. So thank you to all the team.",
      "rating": 5,
      "date": "24th June 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Lana is amazing",
      "text": "Would just like to thank lana for all the help she gave whilst arranging my mortagage. She was outstanding, very proffesional and answered every question i had. She made such a daunting process an absolute breeze for me and i would definitley reccomened her to everyone.",
      "rating": 5,
      "date": "28th May 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Brilliant product and amazing service",
      "text": "I recently took on a Retirement Interest Only Mortgage with the Hanley. I shopped around with other organisations, but they had neither the product or the people to compete. The mortgage is really simple and straightforward, and early repayment is penalty-free, which was a key requirement for me. However the real deciding factor for me was the support of Jane Longmore, Mortgage Advisor. Jane took me through the process carefully, explaining everything fully. She was prompt in replying to my emails and voicemails and proactive catching up with me by phone throughout. She even sent me a 'New Home' card, which was a lovely touch. I would recommend the company to anyone looking for a mortgage. Excellent!",
      "rating": 5,
      "date": "27th May 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great Service",
      "text": "Mark was very helpful and informative and made the whole process run as smooth as possible. All our queries were dealt with promptly.",
      "rating": 5,
      "date": "13th May 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Incredible customer service in the Newcastle Branch",
      "text": "I wished to change my DD mandate for my mortgage. The relevant team wasn't available and so Jessica wrote up a letter for me to sign and for them to forward on to customer services so I wouldn't need to get in touch again. Fast and smooth service that went above and beyond.",
      "rating": 5,
      "date": "8th May 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Really helpful, friendly and made everything really easy",
      "text": "Jane Longmore at the Hanley branch was amazing. As first time buyers we didn’t really know much about the buying process or mortgages but she explained everything so clearly and made the whole process simple and straight forward for us. Truly great professional service. Hayley & Dan",
      "rating": 5,
      "date": "7th May 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Lana Beech - Outstanding service, highly recommend",
      "text": "Over the past few months I have been dealing with Lana at the Hanley to apply for our first self build mortgage. What should be a very daunting process as we knew very little has honestly been incredible. Lana is an expert, super friendly, approachable and couldn’t be any more helpful. She has honestly made this experience a dream and has lifted a lot of the stress off our shoulders. She guided us throughout the whole process giving us all of the information we need and is so knowledgeable. I am so pleased we chose to go with the Hanley and would recommend it to all other self builders, I couldn’t fault them at all! Thank you so so much!",
      "rating": 5,
      "date": "5th May 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Such a refreshing combination of personal warmth and solid professionalism",
      "text": "The people at Hanley have been extremely helpful, professional and personable through all my interactions with them in the process of setting up my mortgage. Always friendly, personable, and highly professional, I have really enjoyed working with them. I feel dealt with as a person, not a number, and just for this reason alone would recommend anyone to work with them - quite apart from the punctuality, responsiveness and clarity with which they have demonstrated every step of the way.",
      "rating": 5,
      "date": "30th April 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Laura Beech excellent service!",
      "text": "Laura Beech went way beyond the necessary to help guide us through the process and made what could have been impossible seem easy. We could not fault her, the advice and support she gave was unstinting and prompt. An outstanding public face for the Hanley.",
      "rating": 5,
      "date": "24th April 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Mortgage provision",
      "text": "Highly professional environment, focused on customer service! I fully recommend it",
      "rating": 5,
      "date": "18th April 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Genuine first class personal customer service combined with competitive rates.",
      "text": "Recently took my second mortgage with the Hanley. I was initially attracted by the most competitive rates for the type of mortgage I wanted. However, what soon became apparent dealing with the Hanley was that I had a readily available single point of contact for all my mortgage questions and needs. I find this very unusual nowadays when dealing with financial institutions but the positive difference it makes to the customer cannot be over-stated. Several years later I moved and needed another mortgage and was taken care of by the same mortgage advisor who remembered me And gave me the same standard of exceptional customer service. I would therefore like to mention Jane Longmore personally and say a big thank you for making the process as painless as possible x 2. I only have 1 point of very minor feedback for the Hanley. It is utter trivia in the grand scheme of a mortgage but in the interest of offering constructive Help: My solicitors did not know that the transfer fee would be deducted from my mortgage when deposited into their holding account. This resulted in a slight delay on the day of completion because the expected totals didn’t quite add up. Easily solved with a phone call and paying the difference. Very minor but useful feedback I hope.",
      "rating": 5,
      "date": "12th April 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Lana Beech, amazing customer service",
      "text": "I recently completed a self build mortgage with The Hanley Economic. I can honestly say this was the easiest mortgage I have ever obtained. Outstanding customer service from Lana, absolute credit to the company. Always made time to explain and go the extra mile. Shows a genuine interest in your project and is always there every step of the way offering help and support. Lana is outstanding in her role and prompt in returning calls and emails. I would highly recommend The Hanley Economic to anyone who is considering a mortgage. Thank you :-)",
      "rating": 5,
      "date": "8th April 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Lana Beech is my saviour!",
      "text": "I initially had a new build mortgage with the Hanley after every other source of funding refused to finance my project. Lana was so professional from the start but she also explained all of the process to me from the beginning to the end. Without the Hanley Economic Building Society I would never have finished my project which is now the best looking house in our street and something that I am very proud of achieving. After my project was finished, the pandemic started and I was concerned that I may lose my project build and also my first property. In stepped the Hanley again and allowed me to refinance to an interest only mortgage which took away all of the worries that I had. All of the staff that I dealt with there were absolutely brilliant and so helpful. I can definitely say that they all went above & beyond their remit to help me. I still occasionally chat to Lana now just to let her know about life in general and she is always a pleasure to speak to. If any of the other building societies or banks happen to read this review, then please take a leaf out of the Hanley Economic Building Society's book and get your staff to behave like theirs! They are all a credit to their employer.",
      "rating": 5,
      "date": "6th April 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Retirement Interest Only Mortgage",
      "text": "I contacted the Hanley after finding them via a Google search for the type of mortgage I was looking for, and the whole process was plain sailing from start to finish. Jane Longmore was my contact throughout and kept me fully up to date with progress. She even sent me a 'New Home' card, which was a lovely touch, and followed up with a phone call a couple of days after my purchase completed. I would recommend the Hanley to anyone looking for a smooth and trouble free transaction.",
      "rating": 5,
      "date": "24th March 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "New build mortgage",
      "text": "We chose this bank due to struggling to find low deposit mortgages for new builds. Lana beech the mortgage advisor there has been absolutely brilliant From start to finish! She always went the extra mile to help us. Would definitely recommend.",
      "rating": 5,
      "date": "23rd March 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Effective & Efficient Service",
      "text": "Experience with Hanley Economic, specifically with their adviser Lana, was excellent. Always clear and concise advice and help with the transaction. Many thanks. AL",
      "rating": 5,
      "date": "22nd March 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Self-build, AVOID!",
      "text": "The Hanley said they would remove my ex-partner from our mortgage if I met their affordability criteria. I met their criteria and then they moved their self-defined goalposts as it, 'increased their risk'. As a consequence neither of us could move on with our lives. They then refused release of final stage payment unless I paid another exorbitant fee. The Hanley severely damaged my health and delayed the project significantly all while I was paying them ~6% interest. They had the following statement on their website, “Ensuring the customer is at the heart of everything we do”. It couldn't be further from the truth. They knew the potential consequences of their actions, they didn't care. Avoid.",
      "rating": 1,
      "date": "9th February 2021",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "Professional Friendly Efficient",
      "text": "Branch staff very helpful. The process was easy to understand. Lana Beech our Mortgage Advisor was Professional Friendly and always there to speak to Excellent Service.",
      "rating": 5,
      "date": "29th January 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Fantastic service on a self-build mortgage!",
      "text": "Our mortgage advisor, Jane Longmore, provided fantastic service throughout our application for a self-build mortgage. Right from the start Jane offered us support, information and time, and we never felt pressured or stressed when considering the different mortgage offers. Throughout our self-build process so far, Jane has been the most friendly and supportive external party we have worked with - she was always contactable even if we called her several times a week! Jane’s fantastic service led us to choose The Hanley Economic and we would thoroughly recommend to others based on this! The underwriting team were also easy to contact throughout and supportive.",
      "rating": 5,
      "date": "29th January 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Self-Build mortgage",
      "text": "Completed a self-build mortgage with the Hanley Economic and our advisor, Jane Longmore. Even in these difficult circumstances, we always felt that Jane was incredibly accessible and she definitely went out of her way to provide us with comprehensive information regarding the mortgage. Each step was explained clearly and made the process very manageable. Towards the completion date, there was some confusion between what we understood from Jane and what the Underwriting Team were then telling us, but this problem was quickly resolved to complete what has otherwise been a very smooth process. Thank you to the Hanley and to Jane for all of your support.",
      "rating": 5,
      "date": "25th January 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "The best mortgage advisor!!!",
      "text": "We are first time buyers and decided to go with The Hanley for our purchase. Our mortgage advisor was Lana Beech and she made the process effortless from our side, she helped to handle everything from start to finish. As we are first time buyers we were completely out of our depth on where to start but Lana helped us through the whole process and made it really easy - she was very responsive and always got back to us on the same day. The service was amazing and really took a lot of stress out of the journey for us. Tomorrow we get the keys for our first home and we are so excited!! Thank you Lana :)",
      "rating": 5,
      "date": "21st January 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "helpful friendly efficient",
      "text": "I was dealt with by Jane Longmore who was available pleasant helpful and efficient",
      "rating": 5,
      "date": "21st January 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Poor systems and incompetent underwriters",
      "text": "Very poor experience. Our mortgage broker applied for a mortgage, a decision in principal was given as it passed credit checks and affordability. Happily took £300 then they came back and said I didn't pass affordability (despite no changes). Provided evidence of pay rise (that hadn't been declared as it was yet to come into effect) AND offered to pay off a small loan which would have more than met the requirement (still using savings) but wouldn't accept. No explanation for the logic behind the decision (since everything else was fine with the application), no refund provided for their system allowing application to go ahead anyway. This happened literally days before they pretty much stopped lending above 60% LTV, coincidentally. No onwership of the issue and money taken. Oh and took a month and a half of going backwards and forwards to achieve nothing. Went to Leeds Building Society, happy to accept pay rise, house is now nearly complete just three weeks later. I recommend trying Leeds first, no application fee, they have competent staff with common sense and their affordability checking system works!",
      "rating": 1,
      "date": "16th January 2021",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "Friendly, professional service.",
      "text": "If you are after anyone to treat you like a friend throughout the whole process then I can’t recommend Lana highly enough. Her friendly but professional advice was outstanding. Lana Beech + Jill Condliffe I can’t Thank-you enough for all the hard work you guys put in to get me where I am. A More than satisfied customer.",
      "rating": 5,
      "date": "15th January 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Fantastic Service",
      "text": "I would highly recommend The Hanley as a mortgage provider. Lana our mortgage advisor was 10/10! She made the whole process so straight forward and as stress free as possible - thank you!",
      "rating": 5,
      "date": "5th January 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Mortgage offer",
      "text": "Thank you! Brilliant work and quick responses!",
      "rating": 5,
      "date": "17th December 2020",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Further advance",
      "text": "We have just taken out a further advance on our mortgage, from our initial enquiry the Hanley have been brilliant. They got back to us shortly after to get the process started, Anna who handled our case was very helpful and friendly and dealt with us mainly over the phone apart from nipping into branch to take in signed forms. We have been with the Hanley for a good number of years now with our sons child trust fund and mortgage and have always found Their products very competitive and they have always been easy to do deal with even now during this covid crisis . I would have no hesitation in recommending the Hanley to friends and family.",
      "rating": 5,
      "date": "3rd December 2020",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Above and Beyond",
      "text": "We completed our house purchase two weeks ago, and we quite simply would not have been able to buy this house were it not for the tireless efforts of Lana Beech, our mortgage advisor at the Hanley. Our situation was particularly complicated, and we faced several set-backs along the way. Lana navigated every obstacle with professionalism, enthusiasm, and a level of dedication I've never experienced from any other financial services provider. We really appreciated the individual approach, and the fact that we were treated as humans, not just customers. Above and beyond doesn't even begin to describe it.",
      "rating": 5,
      "date": "30th November 2020",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent *****",
      "text": "In a very difficult period of my life, during the COVID-19 pandemic, and when all other providers were declining a mortgage, Hanley gave me advice and helped me to get a mortgage. I am very happy that these people came to my way and helped me to make my dream come true. Personally, a huge thank you to Lana Beech. Her friendly behaviour and her professionalism helped the process and made this journey end happily. I will never forget what she did for us. X",
      "rating": 5,
      "date": "24th November 2020",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent service and support throughout the whole mortgage process",
      "text": "The whole experience of completing my mortgage application with the Hanley Economic has been excellent. Mortgage advisor Jane Longmore handled the whole process with me with complete professionalism throughout, by taking time to listen and understand what I was looking to achieve with my mortgage, and provided clear advice that I could understand and answered every question without problem. Communication from Jane and the wider Hanley team has been superb and I would fully recommend the Hanley for their professional service and customer focus - excellent!",
      "rating": 5,
      "date": "24th November 2020",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Always Brilliant",
      "text": "I've only ever used The Hanley Economic for my mortgage requirements. They are always quick to respond and very helpful. If you are lucky enough to have Mark Watson as your advisor then you are in safe hands. I will recommend The Hanley 10 times over.",
      "rating": 5,
      "date": "30th October 2020",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Positive experience",
      "text": "We had great communication from Jane at the Hanley. Clear and regular lines of communication were maintained and explanation was always given if we were unsure. Underwriter and our solicitor were able to communicate which is not always possible with the bigger firms.",
      "rating": 5,
      "date": "28th October 2020",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Dissapointing",
      "text": "This company held my application for three months asked for heaps of informations and in the end still declined based on information they had from day one. They then charged me for this. AVOID AVOID AVOID",
      "rating": 1,
      "date": "26th October 2020",
      "product": "Mortgages",
      "sentiment": "negative"
    }
  ]
}