{
  "society": "Harpenden Building Society",
  "slug": "harpenden-building-society",
  "smpUrl": "https://smartmoneypeople.com/harpenden-building-society-reviews/products",
  "totalReviewsOnSMP": 446,
  "avgRating": 3.26,
  "scrapedAt": "2026-02-06T15:44:14.415985+00:00",
  "reviews": [
    {
      "title": "Lack of SVR reduction",
      "text": "Despite having to consider various factors you lifted the bar quickly in response to the base rate, however in 2025 the base rate reduced by 1 % but you only reduced the bar by 0.15 and by 0.4 since rate reductions started in comparison to a Bank of E drop of 1.5%",
      "rating": 2,
      "date": "14th January 2026",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "Amazing for Selfbuild",
      "text": "Very quick & very understanding when you own your own business",
      "rating": 5,
      "date": "7th July 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Unfair mortgage rates for existing customers",
      "text": "Not a good value for money. Mortgage terms are very opaque with arbitrary SVR variable rates with only possible goal to overcharge their customer. They have been very quick to pass on all Bank of England rate increases to the borrowers but the same standards do not apply to the reductions. At this point in time the BOE reduced the rate by 1% from their peak in 2024. Harpenden BS passed on only a third of that to the mortgage accounts leaving them hundreds £ worse off every month.",
      "rating": 2,
      "date": "26th May 2025",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "Disappointed. Did not live up to expectations",
      "text": "I signed up for a discounted mortgage because of the low rate, by the time my application had been accepted, it went up twice. As rates have fallen, Harpenden have only moved their mortgage rates lower and slower than the base rate, whilst fully reflecting the decreases to savers. I feel conned and ripped off and wishing I'd gone with a bigger, more professional organisation. The customer service is hard to access and clunky, which I wouldnt mind if the rates reflected a lower cost operation. I'm all for supporting the little guy, but it's all been very unsatisfactory. Beware.",
      "rating": 1,
      "date": "25th February 2025",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "A tracker mortgage that tracks up but not down...",
      "text": "We have a tracker mortgage with Harpenden - when interest rates were going up they were quick to track the increase and our mortgage payments changed regularly. Unfortunately it's not been the same going down - they have yet to commit to a reduction since the 6th November 2024 interest rate reduction - and they were slow to act after the first reduction. Not what most would consider a fair 'tracker' mortgage....",
      "rating": 1,
      "date": "11th December 2024",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "I have a commercial mortgage when it was Covid busin...",
      "text": "I have a commercial mortgage when it was Covid businesses found it very hard The interest rates have gone up and up and up we have had to wait until this September for it to start going down. The bank of England was 5% and Harpington was charging me 9.4%. Why is this? ????",
      "rating": 4,
      "date": "4th September 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "The Brilliant work of Harpenden",
      "text": "Harpenden are our go to lender at present. Having now placed 5 cases with them in a short period i could not be more impressed. The business development team are very friendly and supportive. I can not praise Chelsea highly enough and she is a fantastic asset to Harpenden. The underwriting is efficient and knowledgeable. I have been particularly impressed by their additional queries which are well throughout and relevant. All in all, a fantastic lender who i have found are really following through with their pre agreed cases.",
      "rating": 5,
      "date": "12th July 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Efficient, expensive, approachable",
      "text": "The service was outstanding and the team were approachable and understanding.",
      "rating": 5,
      "date": "29th February 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "In branch service review",
      "text": "I didn't deal directly through the Building Society but through an agent. Our indirect experience was good, although sometimes a little slow.",
      "rating": 4,
      "date": "5th February 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Old-fashioned, slow and low tech",
      "text": "Old school and therefore reliable, but very slow and low tech.",
      "rating": 4,
      "date": "5th February 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very impressed with the way, they took the time to u...",
      "text": "Very impressed with the way, they took the time to understand my circumstances and tailor an offer around them. My mortgage broker had regular calls with his Harpenden contact.",
      "rating": 5,
      "date": "5th February 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Harpenden Building Society Branch Review",
      "text": "You took a very long time to approve our mortgage with a drip-drip of further questions and requests for more documents. Our solicitor charged extra due to the drawn out process and we paid for 2 months at the high default rate.",
      "rating": 1,
      "date": "19th January 2024",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "I need to know what your intention is with regard to...",
      "text": "I need to know what your intention is with regard to your mortgage rates",
      "rating": 3,
      "date": "6th January 2024",
      "product": "Mortgages",
      "sentiment": "mixed"
    },
    {
      "title": "TIMEWASTERS!",
      "text": "Our Broker recommended this Building Society as they seemed to fit the bill for our needs. HOW WRONG HE WAS! Three months down the line and about to have our rental property we lived in put on the market due to how long they took to scrutinise our bank accounts etc, they declined us. Why? Because we paid a COMPANY business debt off A MONTH EARLY!!! To say we were gobsmacked was to say the least. We had rented the property for 11 years with no issues about paying the rent. Landlords urgently needed the property sold (we had first refusal to purchase and at BMV) so the pressure was on. I had to detail miniscule payments out of my personal bank account. One to my Son for £40! The other to a seller on Markketplace for a mere £80. We then applied to Santander and it all flew through. So save yourself A LOT OF TIME AND STRESS apply to them in the first instance. It completed within 2 months of application. How this Building Society gets any mortgage clients is beyond me. They rank something like 41. I can now see why!!!",
      "rating": 1,
      "date": "12th July 2022",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "Worst Customer Experience Ever",
      "text": "If you want to purchase a house using Harpenden I suggest starting 12 month in advance and you will still more than likely be disappointed. Their SLA's are a joke in the modern world, saying everything is done in person is a massive cop out and doesn't ring true. They will miss most SLA's then ghost you and ignore all communication attempts and not return calls. Avoid like the plague!",
      "rating": 1,
      "date": "11th May 2022",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "Not passing on Bank of England base rate reduction",
      "text": "The Bank of England have announced a 0.5% drop in the base rate to support the economy and Harpenden have decided not to reflect this in the SVR and therefore discounted mortgages where as the majority of the market has moved - i would recommend avoid getting a mortgage through them.",
      "rating": 1,
      "date": "13th March 2020",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "Exceptional telephone Staff.",
      "text": "I would like to express how extremely helpful the staff members were on the telephone when dealing with Cash ISA questions, namely Jane, Laura and Catherine. They were all very knowledgeable with an excellent manner, and a credit to Harpenden Building Society which I highly recommend.",
      "rating": 5,
      "date": "2nd February 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Leighton Buzzard Branch Staff...",
      "text": "The manageress & staff of the Leighton Buzzard Branch were extremely helpful in walking me through the forms & actions I needed to enable me to change my Branch based savings & ISA accounts to the online versions",
      "rating": 5,
      "date": "26th January 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Great staff very helpful and knowledgeable",
      "text": "Great staff very helpful and knowledgeable",
      "rating": 5,
      "date": "23rd January 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "the best most personal bank in Hertfordshire",
      "text": "excellent customer service and always go the extra mile to help.....they take time and always address you by name, maybe not the best on rates but have a new very competitive account for local residents,",
      "rating": 5,
      "date": "22nd January 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Staff were very welcoming and friendly",
      "text": "Staff were very welcoming and friendly, dealt with my transaction quickly and efficiently. Very impressed with the new location. Thank you ladies.",
      "rating": 5,
      "date": "20th January 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "A really seamless Trust account opening procedure wi...",
      "text": "A really seamless Trust account opening procedure with excellent comms from Laura Tomlinson.",
      "rating": 5,
      "date": "17th January 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Surprise interest rate drop",
      "text": "I opened an ISA this October, understanding it was an interest rate of 4.35%. Just checked today and it is 1.6%. Was not told about this, unlike other societies.",
      "rating": 1,
      "date": "17th December 2025",
      "product": "Savings",
      "sentiment": "negative"
    },
    {
      "title": "I received a telephone call yesterday for a request...",
      "text": "I received a telephone call yesterday for a request regarding a charity donation nomination Found this quite surprising but if you do need an answer anything to do with young people (boys and girls ) especially if they play football would be good. If you do not have that any organisation that's close will be OK. You can choose. Regards Charles Forrester",
      "rating": 4,
      "date": "12th December 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "I am unable to log in",
      "text": "I am unable to log in as I have the wrong internet browser. This seems to be an ongoing problem which needs to be addressed ASAP. Please get it sorted.",
      "rating": 1,
      "date": "10th December 2025",
      "product": "Savings",
      "sentiment": "negative"
    },
    {
      "title": "Very good Customer Service",
      "text": "Quick to respond to queries whether by email or by telephone. Friendly and helpful when I called to ask for assistance.",
      "rating": 5,
      "date": "10th October 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Suspended before I start!",
      "text": "I received my activation detals 2 days ago; I have used them this morning and told my user ID is suspended. Not a great start and now I have to waste time next week whena t work phoning you as your helpline is not open at weekends. Not user-friendly.",
      "rating": 2,
      "date": "4th October 2025",
      "product": "Savings",
      "sentiment": "negative"
    },
    {
      "title": "ISA Account opening",
      "text": "I have just applied to open an ISA and the process was straight forward. However, I feel the Form which needs to be completed to fund my account from another provider is not in my opinion user friendly. Rather than completing an extensive Form, I feel it would be a better customer service experience, if as part of the application process, there were far fewer fields for populate. Most other financial service providers, only request a sort code, account number, name of provider where the funds are to be requested from and whether this is to be released immediately or the end of a notice period/upon maturity.",
      "rating": 3,
      "date": "3rd October 2025",
      "product": "Savings",
      "sentiment": "mixed"
    },
    {
      "title": "ISA tax free status transfer requirement",
      "text": "Wishing to keep savings in an ISA. I question about a nominated account, it should also state that account (or/plus transfer to another ISA account) to keep funds tax free.",
      "rating": 4,
      "date": "27th September 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "hard to understand their products",
      "text": "hard to understand their products",
      "rating": 3,
      "date": "5th September 2025",
      "product": "Savings",
      "sentiment": "mixed"
    },
    {
      "title": "Why saving rates keep falling but mortgages do not?",
      "text": "Very poor practice at this BS. They keep reducing savers rates ( twice in the last two months) but not the mortgage interest. Their Standard Variable rate is completely arbitrary.",
      "rating": 1,
      "date": "1st September 2025",
      "product": "Savings",
      "sentiment": "negative"
    },
    {
      "title": "good speaking to Anya and very helpful, much better...",
      "text": "good speaking to Anya and very helpful, much better than digital conversations etc",
      "rating": 5,
      "date": "29th August 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Excellent Customer Service",
      "text": "Excellent Customer Service, both in branch and by phone to head office. A good selection of accounts but the interest rates are not especially competitive.",
      "rating": 5,
      "date": "28th August 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Fed up with online attemp.",
      "text": "Tried to register fo an online account as an existing customer , was asked to provide ID certification , and account was set up , but now I cannot get into system as something has been deactivated. No answer to telephone call , no waiting time given. This has been one obstacle and frustration after another . Will probably just let attempted account lapse as am fed up trying.",
      "rating": 2,
      "date": "12th August 2025",
      "product": "Savings",
      "sentiment": "negative"
    }
  ]
}