{
  "society": "Hinckley & Rugby Building Society",
  "slug": "hinckley-rugby-building-society",
  "smpUrl": "https://smartmoneypeople.com/hinckley-rugby-building-society-reviews/products",
  "totalReviewsOnSMP": 1990,
  "avgRating": 4.64,
  "scrapedAt": "2026-02-06T15:45:51.276219+00:00",
  "reviews": [
    {
      "title": "Smooth process",
      "text": "my heartfelt thank you for all , you guided me through the entire process with professionalism, transparency, and patience.",
      "rating": 5,
      "date": "28th January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent customer experience from clearly, an extr...",
      "text": "Excellent customer experience from clearly, an extremely dedicated team. Phone calls, emails all answered promptly and clear concise information and instructions given.",
      "rating": 5,
      "date": "26th January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Katherine is a star",
      "text": "Katherine from the mortgage team is exceptional, really lovely girl who looked after us whilst we changed mortgage rate. Thank you for everything Katherine",
      "rating": 5,
      "date": "26th January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Phenomenal completion team!",
      "text": "I wanted to make a special effort to say how fantastic Callum and Danielle in the completions team have been. Phenomenal customer service and really went above and beyond.",
      "rating": 5,
      "date": "12th December 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "H&R have a fantastic common sense approach to lendin...",
      "text": "H&R have a fantastic common sense approach to lending and underwriting. They never make you feel like you are just corresponding with a portal. The whole experience was excellent and I couldn't recommend them any higher.",
      "rating": 5,
      "date": "12th December 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Fantastic customer service",
      "text": "I was advised to get an offset mortgage at a time I was going through a divorce but the finances weren't settled and I would get money for a deposit that I could pay in with fewer penalties. That was in 2012. I have stayed because 1, it made sense financially with the offset and I had flexibility.2, the customer service is the best I have experienced in any company. I can leave a message and you call back. I get to talk to a human being who seems genuinely interested. It is the customer service that kept my business",
      "rating": 5,
      "date": "28th November 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "excellent service for my first case",
      "text": "excellent service for my first case",
      "rating": 5,
      "date": "17th November 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Smooth process from start of application to finish",
      "text": "Smooth process from start of application to finish",
      "rating": 5,
      "date": "5th November 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "When my partner got arrested as couldn't return to t...",
      "text": "When my partner got arrested as couldn't return to the joint property the people I spoke to were absolutely amazing. With me every step of the way and so reassuring.",
      "rating": 5,
      "date": "30th October 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "I owe them for giving us a chance to get...",
      "text": "I owe them for giving us a chance to get on the ladder",
      "rating": 5,
      "date": "24th October 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Popped in to make a withdraw.",
      "text": "Popped in to make a withdraw. Staff were really welcoming and friendly. I was one of the first customers of the day, staff were prepared and ready to meet customers at the counter. I have to say that it was the most pleasant experience I've had in a financial establishment!",
      "rating": 5,
      "date": "15th October 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Danielle Painter has been extremely helpful and pati...",
      "text": "Danielle Painter has been extremely helpful and patient with me :)",
      "rating": 5,
      "date": "14th October 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent service",
      "text": "Excellent experience from start to finish with my mortgage application",
      "rating": 5,
      "date": "10th October 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "It was good.",
      "text": "It was good. Very helpful and informative about how to go forward as a first time buyer, we couldn’t have made it without the help of H&R building society. Many many thanks.",
      "rating": 3,
      "date": "3rd October 2025",
      "product": "Mortgages",
      "sentiment": "mixed"
    },
    {
      "title": "Jeanette and her team are excellent",
      "text": "Jeanette and her team are always friendly helpful and totally professional. I have banked with Hinckley and Rigby for 38 years and have always been extremely satisfied with the excellent service I have received.",
      "rating": 5,
      "date": "26th September 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Response",
      "text": "Very fast response easy to work with",
      "rating": 5,
      "date": "18th September 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great to work with!",
      "text": "Have used Hinckley and Rugby for two mortgage applications now and throughout the whole process they are happy to pick up the phone and are always responsive. Both underwriters we have worked with Lauren & Becky have been excellent in working collaboratively with us in order to achieve the best outcome for our clients, our BDM Lisa is also Top Notch in helping move our deals along. As the administrator the only drawback I would say is all documents needing to be signed via a wet signature.",
      "rating": 5,
      "date": "17th September 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "RK review",
      "text": "early in the process but hopefull it will be good",
      "rating": 4,
      "date": "1st September 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "First class customer service. .",
      "text": "First class customer service and prompt attention.",
      "rating": 5,
      "date": "4th August 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Happy Mortgage Client",
      "text": "Provided me with a mortgage which was a tricky scenario to accommodate. Whenever I’ve liaised with them they’ve been very helpful and always done what they’ve promised.",
      "rating": 5,
      "date": "12th July 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "HRBS are wonderful.",
      "text": "HRBS are wonderful. Probably the best mortgage experience I have ever had",
      "rating": 5,
      "date": "12th July 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Hinkley & Rugby have provided a very good service -...",
      "text": "Hinkley & Rugby have provided a very good service - not the cheapest but I am generally impressed",
      "rating": 5,
      "date": "26th June 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "H&R provided a flexible mortgage which suited my ne...",
      "text": "H&R provided a flexible mortgage which suited my needs , many of the big banks building societies did not or has numerous restriction's. H&R customer service was excellent",
      "rating": 5,
      "date": "10th May 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "We cannot fault , we are sad to leave and only did s...",
      "text": "We cannot fault , we are sad to leave and only did so as HR could not match a deal we got and times are very hard.",
      "rating": 5,
      "date": "8th May 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very good, helpfult customer service and mortgage qu...",
      "text": "Very good, helpfult customer service and mortgage quickly sorted.",
      "rating": 5,
      "date": "2nd May 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "experience and very helpful staff",
      "text": "experience and very helpful staff",
      "rating": 4,
      "date": "7th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Quick, quality and Friendly service",
      "text": "Quick, quality and Friendly service",
      "rating": 5,
      "date": "18th March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "My experience with Hinckley & Rugby during my first...",
      "text": "My experience with Hinckley & Rugby during my first home purchase in the UK was incredibly smooth and satisfying. They provided me with a unique opportunity by offering a mortgage, giving me the reassurance and security of owning my own home. I am beyond grateful for their support and cannot thank them enough for everything they have done for me.",
      "rating": 5,
      "date": "4th March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Credibility",
      "text": "Hinckley & Rugby Building Society was thorough and it speaks to their credibility.",
      "rating": 5,
      "date": "19th February 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Hinckley and Rugby service has been excellent.",
      "text": "Hinckley and Rugby service has been excellent. They are super fast, and they are flexible to accommodate your circumstance. You are sure to get a deal with them. The only reason they don't have a 5-star right now is the interest rate—it's a bit high, relatively",
      "rating": 5,
      "date": "11th February 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "It's easy and approchable,always receiving response...",
      "text": "It's easy and approchable,always receiving response very quickly",
      "rating": 4,
      "date": "20th December 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very fast processing.",
      "text": "Very fast processing. I was expecting this to be taking more time but it was very fast. I am very pleased.",
      "rating": 5,
      "date": "10th December 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Ought to be a good experience for engaging with Hinc...",
      "text": "Ought to be a good experience for engaging with Hinckley and Rugby Building Society",
      "rating": 5,
      "date": "9th December 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Good customer service",
      "text": "Always helpful and can an always speak to an actual person which is fairly rare these days",
      "rating": 5,
      "date": "7th November 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Good service and criteria around foreign nationals w...",
      "text": "Good service and criteria around foreign nationals was excellent. Case moved along at a good speed. Only downside was there were many questions asked after the case was submitted, some were relevant but I felt some questions were not necessary. Overall good experience and would definitely use you again for future cases.",
      "rating": 4,
      "date": "7th November 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "I am very happy I have very quick sorted my mortgage...",
      "text": "I am very happy I have very quick sorted my mortgage and I will recommend that bank for my friends and family.With this bank I don't been having so much stress and they do amazing job.",
      "rating": 5,
      "date": "4th November 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Fair and clear so easy to understand",
      "text": "Fair and clear so easy to understand",
      "rating": 5,
      "date": "3rd November 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great communication and options",
      "text": "Advance communication of the fixed term period coming to a was excellent and to be immediately provided with a variety of options in rates and periods was really good. Everything was set out in a way that was easy to understand.",
      "rating": 5,
      "date": "25th October 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Good experience",
      "text": "This process was really quick and the result turned out to be really good",
      "rating": 5,
      "date": "23rd October 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "(Product & Services",
      "text": "It’s been good with happy ending, Good product and services. I will recommend to any one. Whether families , friends or-joint mortgage, it’s has been excellent service with quick decision. This is the first time I have heard about this building society . I will like to know more about where you have other braches",
      "rating": 5,
      "date": "20th October 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very difficult to deal with.",
      "text": "Very difficult to deal with. I’m an existing customer who has never missed a payment. I was treated like a new customer despite providing pension and savings of evidence if £600,000 and owning a house I sold for £465,000 against a £103,000 mortgage. My new house cost £362,000, Your employee thought it cost £650,000. Completely ignorant of my circumstances. I complained. You gave me a CHEQUE for £25. Uncashed! Very very poor",
      "rating": 3,
      "date": "16th September 2024",
      "product": "Mortgages",
      "sentiment": "mixed"
    },
    {
      "title": "Excellent customer service",
      "text": "Qualities listed below, you hardly get in “modern customer service” anymore. Good listening skills, empathy, patience, communicating at the pace of customer. Cheerful. Making the customer feel good about the experience. Well done Simone and Hinckley & Rugby.",
      "rating": 5,
      "date": "13th September 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "The communication and level of support has been reas...",
      "text": "The communication and level of support has been reassuring. Callum always listened and addressed all concerns raised with him in a professional and timely manner. There is always someone to speak with and answer the questions.",
      "rating": 5,
      "date": "11th September 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Super smooth service",
      "text": "Super smooth process and incredibly helpful and friendly team on the phone, made the transition from my old HRBS mortgage to the new one very straightforward.",
      "rating": 5,
      "date": "14th August 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Disappointing comms",
      "text": "Disappointing to not receive more information about mortgage completion process",
      "rating": 3,
      "date": "3rd August 2024",
      "product": "Mortgages",
      "sentiment": "mixed"
    },
    {
      "title": "The lady who I spoke to was very polite and...",
      "text": "The lady who I spoke to was very polite and helpful",
      "rating": 5,
      "date": "26th June 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "World class service",
      "text": "We couldn’t be more grateful for all the help and support we have had. Everyone in the team has been patient, empathetic, and willing to challenge policy to make sure we got great service.",
      "rating": 5,
      "date": "19th June 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent customer care",
      "text": "Just spoken to Simone in “customer care.”excellent, extremely good communication skills, has a sense of humour, accurate in her responses, and showed much empathy towards myself the client.",
      "rating": 5,
      "date": "17th June 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "very polite, knowledgeable and efficient",
      "text": "very polite, knowledgeable and efficient",
      "rating": 5,
      "date": "29th May 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Slow, poor value and unhelpful",
      "text": "Took 8 months to arrange a remortgage, response to any communication always exceptionally slow and often asked to provide the same information multiple times. Made the already stressful process of renovating a house even more challenging than it needed to be. Largely unhelpful throughout.",
      "rating": 1,
      "date": "24th May 2024",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "Over 30 years great service.",
      "text": "We have had our mortgage with H&R for over 30 years and have always had excellent service. Whenever we have had questions or needed to take further borrowing for work on the house the process has been clear and support helpful.",
      "rating": 5,
      "date": "22nd May 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Why are you asking irrelevant questions?",
      "text": "I think you haven’t bothered to read my previous mortgage submission to you, since I am an existing customer porting my existing mortgage and you don’t seem to know that. If you had you would know that I am retired and can’t offer a P60 or income statements. That’s why I was advised to use you in the first place. This has been made clear numerous times to Laura Thornton. Your first pension offer made it perfectly clear that I could port my current mortgage to my new house and ALL new details were supplied. Yet you are treating me as a new customer. You either want to retain me as an existing , fully paid up customer or you don’t, in which case I’ll discontinue your services. Please let me know which.",
      "rating": 2,
      "date": "22nd May 2024",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "A very helpful and pleasant phone call.",
      "text": "A very helpful and pleasant phone call. All questions were answered in a professional and relatable way.",
      "rating": 5,
      "date": "16th May 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Absolutely great to be able to actually speak to som...",
      "text": "Absolutely great to be able to actually speak to someone that is in the uk, and is able to deal quickly and intelligently with a query.",
      "rating": 5,
      "date": "13th May 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Amazing customer service",
      "text": "It doesn’t matter who you speak to, the team go above and beyond to help and answer every question politely, with a smile on their voice and treat you like a human being. They remember speaking to you and make you feel valued.",
      "rating": 5,
      "date": "9th May 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Whenever I call Hinckley & Rugby I am greeted with s...",
      "text": "Whenever I call Hinckley & Rugby I am greeted with staff who are willing to help and always return my calls. I have been with the society for four years and not once I can remember any bad service",
      "rating": 5,
      "date": "29th April 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent customer service from Georgina.",
      "text": "Excellent customer service from Georgina. Thank you.",
      "rating": 5,
      "date": "18th April 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Efficient",
      "text": "Efficient Efficient and informative my life story is not up for publishing",
      "rating": 5,
      "date": "17th April 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Phone was answered quickly and proffesionally.",
      "text": "Phone was answered quickly and proffesionally. Resolved my issues fast and answered my stupid questions. Thank you.",
      "rating": 5,
      "date": "15th April 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Karen and her team were very helpful, thank you!",
      "text": "Karen and her team were very helpful, thank you!",
      "rating": 5,
      "date": "28th March 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Fast friendly knowledgeable service",
      "text": "Fast friendly knowledgeable service",
      "rating": 5,
      "date": "25th March 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Re-Morgage",
      "text": "Have spoken to both Louise and Jo regarding my Re-mortgage and they were both very helpful.",
      "rating": 5,
      "date": "25th March 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great Service",
      "text": "Staff are so polite and helpful, always making you feel valued. They are knowledgeable about the products, processes and procedures. If you need to be transferred to a different person, you don’t have to repeat yourself as your initial clearance/conversation will have been relayed. It doesn’t sound like you’re talking to someone in a massive call centre so it’s easy to hear and follow the conversation.",
      "rating": 5,
      "date": "23rd March 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Customer service is excellent at Hinckley and Rugby.",
      "text": "Customer service is excellent at Hinckley and Rugby. All the people who have answered the phone to me recently have been polite, clearly spoken, patient, well informed, helpful and friendly. Waiting time to talk to them is also minimal. All very refreshing compared to many other companies.",
      "rating": 5,
      "date": "22nd March 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "The best mortgage offer!",
      "text": "H&R offered the best mortgage deal among other offers, which I was happy to accept, thank you!",
      "rating": 5,
      "date": "13th March 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "fantastic service provided by knowledgeable, friendl...",
      "text": "fantastic service provided by knowledgeable, friendly and helpful decision makers. Deborah and Angela were both able to assist and deal with my query efficiently, providing great customer service. Speaking to people who are empowered and fully understand. The products is so helpful and also so rare these days.",
      "rating": 5,
      "date": "7th March 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Fantastic service - knowledgeable and helpful.",
      "text": "Fantastic service - knowledgeable and helpful. Deborah & Angela dealt with my query very efficiently and provided good insight. A pleasure to deal with people who are friendly, decision-makers. Would recommend the H&R team.",
      "rating": 5,
      "date": "7th March 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "The society’s way of doing things is like in Victori...",
      "text": "The society’s way of doing things is like in Victoria time. We are in the digital 21st century and I don’t know how the society can attract young customers or retain middle age customers. Very tick-box mentality",
      "rating": 1,
      "date": "7th March 2024",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "Didn’t have to wait, in a queue to speak to an advisor.",
      "text": "Didn’t have to wait, in a queue to speak to an advisor. Also very helpful.",
      "rating": 5,
      "date": "5th March 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very helpful and efficient, clear precise informatio...",
      "text": "Very helpful and efficient, clear precise information and a friendly approach to service. Thank you.",
      "rating": 5,
      "date": "4th March 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Calm, Clear Response To Query",
      "text": "I was confused about an issue and the member of staff was extremely patient and lead me through the query very calmly and clearly.",
      "rating": 5,
      "date": "3rd March 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent service & very helpful staff",
      "text": "Excellent service & very helpful staff",
      "rating": 5,
      "date": "1st March 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Cannot access egress mail as there is no link",
      "text": "Cannot access egress mail as there is no link",
      "rating": 1,
      "date": "27th February 2024",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "Fab customer service, patient, professional - nice...",
      "text": "Fab customer service, patient, professional - nice to talk to a real person and not someone script reading and going through the motions which is sadly the norm these days. Friendly, efficient - great service",
      "rating": 5,
      "date": "26th February 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Compliance issues, GDPR Breaches and incompetence",
      "text": "I’ve never written an online review but felt this necessary. I recently had the misfortune of dealing with Rugby Hinkley for my mortgage (which I now have with them), and the experience was and currently is, nothing short of a nightmare. From GDRP breaches to flat-out lying! If I could give them zero stars, I would. From start to finish, their ineptitude and lack of professionalism left me questioning how such a company could still be in business. Firstly, the communication was abysmal. My inquiries [via my broker] fell into a black hole, never to receive a timely or coherent response. Phone calls went unanswered, emails were ignored, and the few times I did manage to get my questions answered, they seemed clueless about my file. It was as if their left hand didn't know what the right hand was doing. Not only that they sent me confidential documents of another mortgage application that had nothing to do with mine. I replied to that email to let them know and I simply got a reply “Ignore that email” – Talk about a GDPR breach! The incompetence extended to the handling of my application. Documents were lost, information was incorrectly recorded, and I was constantly asked for the same information multiple times. It was a frustrating and time-consuming process that left me wondering if they even understood the basics of mortgage processing. Not only that the exchange was pushed back and back due to lost files. On the last day, I had a deadline to send them a direct debit mandate that was sent months prior, during the initial application process. This was hours before my 4pm deadline [or the exchange and completion were not going to happen] which would have caused the whole chain to collapse. I took two days off work to babysit their ineptitude and excuses. The sellers of the property managed to get hold of my number [not the done thing] so we could try and work together to work this out. But perhaps the most infuriating part was the lack of transparency. Claiming they had not received documents when I had proof from my solicitors. Quote from my solicitor “In 13 years as a mortgage solicitor, I’ve never seen anything like this. I will be recommending clients stay clear of them.” It's a blatant lack of integrity that I find utterly unacceptable. To add insult to injury, the exchange and completion process was a disaster. Dates were missed, causing unnecessary delays and putting my entire home purchase in jeopardy. It was clear that Rugby & Hinkley had no regard for their customers' time or the gravity of the financial decisions we were making. I cannot wait until my two years is up to change provider. In summary, dealing with Rugby & Hinkley was a regrettable experience that I wouldn't wish on my worst enemy. Their incompetence & lack of communication, make them a prime example of what's wrong with the mortgage industry. If you value your time, money, and sanity, I strongly advise you to steer clear of this company. There are plenty of reputable mortgage providers out there – Rugby & Hinkley is not one of them. UPDATE 1: I didn’t post this when I originally intended to as I felt the dust had settled and I would gain anything from it. However, since then my first payment was due to come out on the 15th of January and it didn’t. A few days later I had a letter from R&H claiming I didn’t send them my mortgage direct debit mandate. How is this even possible? To exchange the property they required it and my solicitor sent it to them on the final day (for the 4th time) they now have 4 direct debit mandates! And official correspondence to my solicitor stating that they have received it. UPDATE 2: The saga continues. I’ve now received an email from their completions department from a ‘Lending Support Officer’ stating that I owe £849.60 in interest because I didn’t set up a direct debit mandate! I am seeking legal advice to get out of the mortgage and transfer to another company on the grounds of compliance issues and GDPR breaches.",
      "rating": 1,
      "date": "24th February 2024",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "Very helpful professional advice from Jo Tidey thank...",
      "text": "Very helpful professional advice from Jo Tidey thank you very much",
      "rating": 5,
      "date": "23rd February 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "staff went out of there way to be extra helpful",
      "text": "staff went out of there way to be extra helpful",
      "rating": 5,
      "date": "17th February 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Jo was incredibly helpful in very challenging circum...",
      "text": "Jo was incredibly helpful in very challenging circumstances. My wife had walked out and taken everything making it very difficult to provide some of the info needed but she put me at ease immediately and helped me to provide all of the necessary information to enable her to assist with my query.",
      "rating": 5,
      "date": "16th February 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Phone was answered by a person hooray.",
      "text": "Phone was answered by a person called Simone who listened, explained, had understanding was very pleasant and professional. It was so good to speak to someone immediately who answered your call rather than the norm for a lot of other businesses where you have to click on various options and click here and there and then the line go dead. Well done Hinckley and Rugby.",
      "rating": 5,
      "date": "12th February 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Friendly, informative and very helpful",
      "text": "Friendly, informative and very helpful",
      "rating": 5,
      "date": "9th February 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Karen was lovely.",
      "text": "Karen was lovely. To the point, helpful but friendly. The perfect balance",
      "rating": 5,
      "date": "9th February 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Getting me mixed up with another lender",
      "text": "Getting me mixed up with another lender",
      "rating": 1,
      "date": "3rd February 2024",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "Filling in information on line a pain and takes so m...",
      "text": "Filling in information on line a pain and takes so much time",
      "rating": 3,
      "date": "23rd January 2024",
      "product": "Mortgages",
      "sentiment": "mixed"
    },
    {
      "title": "Excellent team member who was very helpful and knowl...",
      "text": "Excellent team member who was very helpful and knowledgable.",
      "rating": 5,
      "date": "19th January 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very polite customer service and never a problem whe...",
      "text": "Very polite customer service and never a problem when calling.",
      "rating": 5,
      "date": "18th January 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great all round customer service",
      "text": "All my interactions with HRBS have been handled in a very professional and friendly way. The information I have received is always easy to understand and focuses on the matter in hand. Response times to queries and actions is always very good and hold times when calling in are excellent. The call handler is always able to assist - no being passed around. Great service!",
      "rating": 5,
      "date": "17th January 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Pleasent",
      "text": "Pleasant & very easy to communicate with",
      "rating": 5,
      "date": "12th January 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Mortgage Questions",
      "text": "Simone was helpful, knowledgeable and professional. She made time to answer my mortgage questions and ensured I was happy with the answers. She followed up by emailing information quickly. Thanks for great service today",
      "rating": 5,
      "date": "10th January 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Good service!",
      "text": "Good! Great communication! advisor we spoke with helped us with all questions we had!",
      "rating": 5,
      "date": "9th January 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Friendly and helpful staff, don't have to wait long...",
      "text": "Friendly and helpful staff, don't have to wait long for your call to be answered.",
      "rating": 5,
      "date": "9th January 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Mortgage questions swiftly answered",
      "text": "I spoke with Jo Tidey, from the contracts variations team regarding a query relating to the term of my mortgage. I found Joe to be super helpful and knowledgeable.",
      "rating": 5,
      "date": "8th January 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "I have aways found all your staff to be most helpful...",
      "text": "I have aways found all your staff to be most helpful and informative, do not insist on e mail but will take the time to converse. It is a pleasure to deal with all star who I have had reason to speak to",
      "rating": 5,
      "date": "5th January 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great service",
      "text": "Simone was very pleasant, helpful and efficient",
      "rating": 5,
      "date": "4th January 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very efficient and friendly staff.",
      "text": "Very efficient and friendly staff. Always able to help and will do their best to make sure you are happy with the outcome of your enquiry.",
      "rating": 5,
      "date": "4th January 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "When dealing with H&R, I have made contact with a hu...",
      "text": "When dealing with H&R, I have made contact with a human who could deal with my business without having to wait in an automated queue that played repeated, awful music. Each agent was polite and knowledgeable. Recently, you have been calling me every once in a while, indicating regular human review of my account.",
      "rating": 5,
      "date": "4th January 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "The lady I spoke with was very helpful and knowledge...",
      "text": "The lady I spoke with was very helpful and knowledgeable. She provided a very comprehensive overview giving me the full and complete information.",
      "rating": 5,
      "date": "3rd January 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Mortgage delay",
      "text": "In terms of customers service, Angela Reuss gets five stars. She was excellent. However, I’m not sure I would recommend the company to family and friends because of how long H&R took to finalise the mortgage. In addition, it would be significantly easier for customers if there was an online portal where they could see the updated value of their mortgage.",
      "rating": 5,
      "date": "21st December 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent professional and personalised service.",
      "text": "My request for a product transfer after expiry of a fixed term was a seamless process from choosing a new product via the clear website to making the change. It was very refreshing to be able to telephone and receive instant and clearly explained guidance from a person rather than via webchat. Special mention for Louise.",
      "rating": 5,
      "date": "21st December 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Always helpful",
      "text": "We've had a mortgage with them for almost 20 years. They're always helpful, always friendly, and always there for us. They check payments in and out and genuinely look after their customers. Just what a local building society should be.",
      "rating": 5,
      "date": "14th December 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very disappointing",
      "text": "Hello, This was our first time applying for a mortgage and we were quite disappointed in the service we received from HRBS. The biggest factor in this was timeline, and that almost every time we were given a timeline for decisions/replies they were never stuck to. We appreciate that this is likely due to a high caseload and not down to any one person or intentional, but nonetheless it was a significant source of stress during the house buying process.",
      "rating": 1,
      "date": "13th December 2023",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "brilliant process from start to finish",
      "text": "everyone we came into contact was so helpful and supportive throughout the process and i couldnt have asked for a better set of advisors to help us on this journey. it took alot of the stress out of the process",
      "rating": 5,
      "date": "4th December 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "EASY TRANSITION",
      "text": "All through the transition period the communication was excellent, they were very helpful all along the way and explained thoroughly the process",
      "rating": 5,
      "date": "28th November 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Awful service, avoid at all costs",
      "text": "We had a terrible experience with H&R, poor communication, never kept to any timescales (always another 7 days), and after 6 weeks of having our application and taking fees they declined on the basis of information they had at the start. Our broker said he has never experienced such shocking service.",
      "rating": 1,
      "date": "27th November 2023",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "Very helpful",
      "text": "Extremely helpful yet again dealing with the staff at HRBS",
      "rating": 5,
      "date": "9th November 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Brilliant Customer service",
      "text": "Karen was really helpful when I called today. She went through everything for me clearly and in a friendly manner",
      "rating": 5,
      "date": "8th November 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great products and customer service",
      "text": "I've always had quick and clear advice to my queries, and a very satisfying experience overall when I needed it.",
      "rating": 5,
      "date": "1st November 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Answered quick",
      "text": "Jo helped me answer a question very quickly",
      "rating": 5,
      "date": "25th October 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Phone call",
      "text": "Happy with the conversation and information I received",
      "rating": 5,
      "date": "25th October 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very Satisfied",
      "text": "From choosing a product and opening an account to renewing our product most recently, we have always received clear information and instruction and the friendly team have always been quick to help with our queries.",
      "rating": 5,
      "date": "23rd October 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent staff",
      "text": "Staff have always been, efficient, friendly and helpful.",
      "rating": 5,
      "date": "5th October 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Easy to contact and friendly",
      "text": "I phoned with a general enquiry about my Mortgage SVR and Louise was extremely helpful and friendly. Very impressed with no waiting time and quick response.",
      "rating": 5,
      "date": "3rd October 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Helpful",
      "text": "I got intouch today for a redemption figure The mortgage assistant was very helpful it was quick and easy to understand a few security questions etc and she is sending me papers over.staff at Hinckley and Rugby are always friendly when I need to get intouch.",
      "rating": 5,
      "date": "2nd October 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very friendly and helpful",
      "text": "Very helpful and friendly on the phone",
      "rating": 5,
      "date": "27th September 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "One of the best !",
      "text": "An excellent B.S. very supportive through 25 years of mortgage with excellent borrowing rates and 2nd to none customer service.",
      "rating": 5,
      "date": "22nd September 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Mortgage switch",
      "text": "We are in the process on switching mortgages and I had to call with a few questions. Jo was very helpful and friendly and answered all of my questions fully.",
      "rating": 5,
      "date": "19th September 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Efficient, clear and helpful.",
      "text": "In order to clarify a misunderstanding concerning the redemption of my existing mortgage debt, I telephoned and discussed the matter with Ms Jo Tidey who corrected the situation and amended the associated documentation clearly within a short time frame. She made me feel at ease.",
      "rating": 4,
      "date": "13th September 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Friendly and adaptive",
      "text": "Always responsive to any email or call, very pleasant to speak to. Ready to adapt my mortgage whenever I asked and helped by suggesting options I wasn’t aware of.",
      "rating": 5,
      "date": "9th September 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Really helpfull",
      "text": "Simone was helping me with our new product query and answered all my questions perfectly",
      "rating": 5,
      "date": "7th September 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Remortgage.",
      "text": "Professional and efficient service by the Team keeping me updated on progress.",
      "rating": 5,
      "date": "4th September 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Disorganised",
      "text": "I am writing to express my deep dissatisfaction and frustration with the ongoing mortgage process with your company. My experience so far has been marked by extreme inefficiency, disorganization, and a complete lack of effective communication. From the very beginning, it has been evident that your company is struggling to keep track of the documents I have submitted. Files have been overlooked, emails have gone unanswered, and there seems to be a general lack of awareness regarding the status of my mortgage application. Miscommunication has become the norm rather than the exception. At nearly every point of contact, there have been inconsistencies and contradictory information provided. It's disheartening to be on the receiving end of such confusion, especially when the stakes are so high and the process is already inherently stressful. What is even more frustrating is the apparent need for constant follow-up and prodding on my part just to get any updates or information. It feels like I have to chase your team at every stage to receive any feedback about the progress of my application or to be notified of any setbacks. This is not how a professional and customer-focused company should operate. I understand that there can be challenges in any complex process like mortgage approval, but the level of service I have received from your company falls far below acceptable standards. As a customer, I expect a seamless and transparent experience, which unfortunately has been sorely lacking. I trust that you will treat this complaint with the seriousness it deserves. I hope to see a significant improvement in the quality of service moving forward.",
      "rating": 1,
      "date": "30th August 2023",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "Brilliant Service",
      "text": "Excellent service, very friendly staff and extremely quick processing.",
      "rating": 5,
      "date": "9th August 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Enquiry on renewing the mortage",
      "text": "Good straight forward conversation",
      "rating": 4,
      "date": "9th August 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Helpful, Friendly and Approachable",
      "text": "Recent product redesign completed with total efficiency, dealing with people who express genuine interest in my requirements. All stages followed as advised with constant explanations and alternatives. Offers of advice were available, but not required. A most satisfying experience once again.",
      "rating": 5,
      "date": "8th August 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Exceptional service",
      "text": "Over the years that I have been a customer of Hinckley & Rugby Building Society, every time I have needed to speak to someone, they have been incredibly helpful, friendly and very efficient. This really makes them stand out compared to other banks and building societies. I wouldn’t hesitate to recommend them.",
      "rating": 5,
      "date": "4th August 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very Happy",
      "text": "I have dealt with H & R via a broker to date. Never again, speaking to them direct was so easy and answered all my questions straight away.",
      "rating": 5,
      "date": "2nd August 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Professional, helpful, and friendly",
      "text": "I had lots of queries which were all answered swiftly. The process was clear and Deborah was very helpful.",
      "rating": 5,
      "date": "2nd August 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great Service Really helpful and clear",
      "text": "Every communication is always pleasent and professional. Very clear and on the side of the customer.",
      "rating": 5,
      "date": "31st July 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent service.",
      "text": "I had some complicated questions about changing my mortgage and Karen Crudgington answered them quickly and with authority. I recommend HRBS to anyone as the rates are reasonable the service is outstanding.",
      "rating": 5,
      "date": "27th July 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Friendly, helpful, supportive",
      "text": "Really helpful assistant, fun, friendly, efficient and clear. Excellent help",
      "rating": 5,
      "date": "27th July 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Finalising my mortgage and offset savings accounts",
      "text": "Very professional and checked out all my concerns. My sure everything was in order before leaving the call",
      "rating": 5,
      "date": "26th July 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "very friendly and efficient",
      "text": "Most of the time I have been completely satisfied with the service - however on a few occasions I have been promised call backs and they never happened at all.",
      "rating": 5,
      "date": "24th July 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Friendly/Helpful Staff",
      "text": "I would recommend this building society as I found them extremely helpful in my hour of need they dealt with the dilemma I found myself in quicker and efficiently with their no fuss attitude",
      "rating": 5,
      "date": "22nd July 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great company",
      "text": "Very kind and helpful staff, always easy to talk to, and always ready to help.",
      "rating": 5,
      "date": "21st July 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Confirmation",
      "text": "I was contacted to say my money was received and email confirmation I requested was sent promptly. Always lovely, polite and efficient service from H&R",
      "rating": 5,
      "date": "20th July 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Brilliant",
      "text": "I have been dealing with H & R for a long time and staff always friendly always want to help and go above and beyond to help you to the best of their abilities.",
      "rating": 5,
      "date": "19th July 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "My review",
      "text": "Very helpful, polite and English speaking",
      "rating": 5,
      "date": "17th July 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "5 year fix end date",
      "text": "Great communication skilfully answering all questions",
      "rating": 5,
      "date": "14th July 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Engaged and Helpful",
      "text": "Simone was very polite, engaged, listened to my query, investigated and actioned a resolution very quickly.",
      "rating": 5,
      "date": "14th July 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Best staff of any financial institution",
      "text": "I have the (mis)fortune of also dealing with VirginMoney and other banks/building societies and, without fail, your staff are the friendliest, most polite and most helpful. 5 star customer service,thanks.",
      "rating": 5,
      "date": "14th July 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Satisfied customer",
      "text": "So nice to actually talk to someone who is English speaking, very professional and courteous Adviser.",
      "rating": 5,
      "date": "12th July 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "The Great Sylwia Zawada",
      "text": "I had a long conversation with Ms. Zawada who asked me many questions about my spending habits and attitutes before recommending me for a mortgage. This level of questioning made me think that the H&R are being very thorough before they offer mortgages to customers. This is find very reassuring. In addition to this, Ms. Zawada made the whole experience very enjoyable and I am very grateful for this excellent service (which we don't see very often any more in my experience). The only negative comment I have is beyond the control of H&R, that is, the very high interest rates. On the plus side, when you charge me more for my mortgage this increases your profits by a large margin. Therefore I expect to hear from your CEO very soon that the great Ms. Zawada's wages have been increased, let's say by the same amount as mortgage rates have increased since last year. and of course, if you increase rates further, I expect further notification that you have increased her wages in line with your own rate. Let's call it 'Mark's Tracker salary'. Thank you Sylwia for your great service.",
      "rating": 5,
      "date": "7th July 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Long standing customer for a good reason",
      "text": "An H&R customer for 17 years I've had few reasons to contact the Society directly. But on the few occasions I have called them the staff have always been friendly, helpful, honest and professional.",
      "rating": 4,
      "date": "6th July 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Fab service",
      "text": "As a first time owner I was so incredibly grateful for all of the information that my lovely case handler gave. I am due to remortgage early next year, therefore I had a load of questions as this is my first time remortgaging. She was amazing and answered all my questions and reassured me I was in safe hands.",
      "rating": 5,
      "date": "4th July 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Feedback",
      "text": "Very pleasant, polite and professional advisor.",
      "rating": 5,
      "date": "3rd July 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent service - would recommend!",
      "text": "Very good service from a building society where you can still get customer focused help when needed & excellent communication all round. Dealt with them over 25yrs in all as a mortgage provider & would highly recommend",
      "rating": 5,
      "date": "30th June 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Really helpful",
      "text": "Really clear and helpful , I was nervous about the whole remortgage process and the agent was really clear and understanding when I I bombarded her with questions.",
      "rating": 5,
      "date": "28th June 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "excellent service and empathetic customer people",
      "text": "in the last two months i have spoke to Karen Crudgington and another whose name I did not get. Both were fantastic. They re-assured me that HRBS would come up with the right deal and it has, partly because of the organisation's values and partly because it trains people properly. I have several mortgages - one with another building - and none of them offer anything like the products or service that Hinckley provides. Unlike others, HRBS appears to have customers' interests at heart. Let me know if you want me to write or say any of this in public.",
      "rating": 5,
      "date": "23rd June 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great customer service",
      "text": "One of the main things I've enjoyed about being with Hinckley and Rugby is that I've always been able to talk to someone, over the phone, with really helpful staff. So much so I've chosen to port my mortgage to my new property knowing I'll receive the same great service and have already reccomended to others",
      "rating": 5,
      "date": "22nd June 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Always a great service",
      "text": "No long waits on hold, knowledgeable and understanding employees, treat you as a person not a number",
      "rating": 5,
      "date": "21st June 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Customer service",
      "text": "I got a swift telephone response to my online query and the mortgage service assistant was very efficient. There was a small charge for the service I needed, and was offered a document as an email or in a paper version. When I couldn’t open the secure email I was immediately offered a paper version to be posted.",
      "rating": 5,
      "date": "21st June 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Remortgage help",
      "text": "Called to get assistance as having issues logging on.",
      "rating": 5,
      "date": "19th June 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Service received from Simone Jones today",
      "text": "This lady offers the most efficient and friendly standard of customer service. She could not be more helpful. She stands out in her performance. For completeness, I have to say some of the staff at the society are not helpful. My ratings relate today relate to Miss Jones only.",
      "rating": 5,
      "date": "13th June 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Simone Jones is a credit to her organisation!",
      "text": "Simone Jones was incredibly patient, polite, professional and thorough in our discussion today regarding our product switch internally at HRBS. With everything going on in this unstable marketplace we are all in and to able to speak to someone like Simone (Jones) who treated my call with such respect and courtesy speaks volumes. Please pass my encouraging words onto your colleague and any new starters at your organisation need to listen to our call in training as an example of how it should be done!",
      "rating": 5,
      "date": "12th June 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Mortgage",
      "text": "Overall really good but took some time to clarify legitimacy of source of funds, which shouldnt have taken so long",
      "rating": 4,
      "date": "9th June 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great communication and efficient staff and process",
      "text": "We received great support throughout and every step was explained. An excellent service with a great outcome.",
      "rating": 5,
      "date": "7th June 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "One of the best lender",
      "text": "The service was excellent, great commination prompt response via emails. Compatible rate!",
      "rating": 5,
      "date": "7th June 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Consistently Excellent Service",
      "text": "I have held a mortgage with Hinckley & Rugby for over 20 years prior to recently redeeming my mortgage.From application to redemption, the staff have been so helpful and friendly. Nothing has ever been too much trouble. They have made redeeming my mortgage, following the death of my wife, so simple. Special callouts to Eloise and Deborah for excellent service. I have recommended H&R to many of my friends. Thank you!",
      "rating": 5,
      "date": "1st June 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Happy customer",
      "text": "I called H&R due to a query. I had the pleasure of speaking with Jo from the contracts verification team. Jo was knowledgeable, efficient and reassuring. My query was answered and resolve in a matter of minutes.",
      "rating": 5,
      "date": "31st May 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great service as usual!",
      "text": "My mortgage product is coming up to its maturity and so time for a new one. I love the simplicity that HRBS employs when a renewal is due. I decided to make a call to the helpline to validate my thinking was correct and was very impressed with the level of service that Jo Tidey provided. Thanks again, HRBS!",
      "rating": 5,
      "date": "30th May 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Advice request",
      "text": "Phoned to ask advice on mortgage payment wonderful member of staff very efficient very helpful and cheerful as always with your staff members",
      "rating": 5,
      "date": "27th May 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Friendly, helpful, very detailed and lengthy process",
      "text": "The staff I dealt with were universally friendly, polite and helpful. The process of arranging a simple top-up mortgage at very low loan to value and for a customer who can clearly afford the top-up payments many times over was incredibly overburdened with repetitive and nit-picklng detail. I do believe the process could be considerably truncated if the personnel had the power to do so, but they are completely constrained by their 'handbook' of process which is absolutely inflexible and ossified in stone. However, of course, it is the company's money and not mine and they are free to dispense it in any way they wish. I think they are wasting time and money by not being able to take a more sensible and business-minded approach to their applications. It's almost as if they are frightened to lend and need to over convince themselves before daring to do one of the 2 most important things this financial company does - lending and taking deposits.",
      "rating": 5,
      "date": "25th May 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Outstanding service",
      "text": "I have just arranged for my existing mortgage to go onto a new mortgage product. This was mainly arranged by Simone Jones, who gave me outstanding customer service, so I would highly recommend Hinckley and Rugby and I am very happy to remain a happy and loyal customer. I hope that Simone Jones will be commended by her managers as it is the fantastic service that she gives, which makes Hinckley and Rugby a great building society and mortgage provider. Thank you.",
      "rating": 5,
      "date": "23rd May 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Query regarding charge on land registry title",
      "text": "I contacted H&R regarding a mortgage we'd repaid a few years regarding a land registry charge that had not been removed. Eloise Thompson took my call and it was a delight dealing with her. I first called late on a Friday just before close of business and she was brilliant. Although I had some incorrect information she was not flustered or tried to rush because of the late hour. I later spoke to her again on Monday with the correct information and she resolved my issue within minutes.",
      "rating": 5,
      "date": "15th May 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very open communication",
      "text": "Where some lenders will not give you any progress updates or insight into when your application may be completed. Hinckley and Rubgy gave me both every time I asked.",
      "rating": 5,
      "date": "24th April 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Recomendation",
      "text": "Impressive and very helpful efficient and knowledable",
      "rating": 5,
      "date": "21st April 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent experience",
      "text": "Nice and simple mortgage application, with clear communications. Ecspectations were managed really well along all the steps of the process.",
      "rating": 5,
      "date": "18th April 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Good telephone service!",
      "text": "It was good to speak to Angela at exactly 9am this morning and she very efficiently answered all my queries.",
      "rating": 5,
      "date": "6th April 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "I am very happy that my mortgage is finished. Brilliant service.x",
      "text": "Never had an issue, so not needed to get in touch.",
      "rating": 5,
      "date": "29th March 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "First rate",
      "text": "friendly, efficient and professional service",
      "rating": 5,
      "date": "23rd March 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Efficient and personable",
      "text": "Very helpful and professional support throughout a prolonged and interrupted house purchase involving transfer of mortgage",
      "rating": 5,
      "date": "9th March 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent service and best rates",
      "text": "I have been with H and R for 22 years and have found their mortgage the best!",
      "rating": 5,
      "date": "2nd March 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Inquiry",
      "text": "Very good service today and sort my query very quickly!",
      "rating": 5,
      "date": "7th February 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "mortgage offer",
      "text": "very expericence staff jo lovely very helpful.",
      "rating": 5,
      "date": "3rd February 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Friendly and efficient service",
      "text": "Fiona and Simone provided excellent service and addressed all of my questions quickly and efficiently. One of the main reasons we have been a customer with H&R for a long time.",
      "rating": 5,
      "date": "27th January 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Smashing Customer Service Person",
      "text": "Polite, Friendly, and helpful. Was very professional, but also 'human' in her approach. Was very pleased I had this lady look after my query and would hope to get her again.",
      "rating": 5,
      "date": "27th January 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Enquiry to get more explanation and options",
      "text": "Excellent help - listened to my query and we explored options to help monthly payments. Worked up options in helpful manner and checked I understood them.",
      "rating": 5,
      "date": "23rd January 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent customer service.",
      "text": "I made a call to ask about my mortgage. I immediately heard the voice of a woman who helped me solve my problem.",
      "rating": 5,
      "date": "19th January 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Easy Product Switch",
      "text": "Had to renew a buy to let mortgage in difficult times. The team at Hinkley & Rugby were incredibly helpful, offering a personal service with competitive rates.",
      "rating": 5,
      "date": "13th January 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Exploring new products",
      "text": "Very helpful advice. Thank you",
      "rating": 5,
      "date": "9th January 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Efficient friendly service",
      "text": "I was dealing through buildstore for a self build mortgage with Hinckley and Rugby but they were simply awful. I gave up and went direct and it was a revelation. Fast efficient service, staff that talked sense and gave straight answers. Moved my application more in a few days than build store did in weeks.",
      "rating": 5,
      "date": "2nd January 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Essential helpful advice with our mortgage",
      "text": "We received a phone call from the Hinckley and Rugby staff that helped us understand the implications of our current mortgage deal coming to an end. We might not have acted quickly enough or made the right decision without them pointing out the deadlines and giving us the new monthly sums to consider. Thanks to the woman who explained everything clearly and pleasantly so that we can move forward with a greater understanding of their mortgage products.",
      "rating": 5,
      "date": "30th December 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Professional Consideration",
      "text": "Following the passing of my late wife HRBS was excellent in attitude, respect and trust. No harassment, flexible and patient at all times. This compared very favourably with some other parties. Information provided was accurate and timely and the original mortgage terms were maintained beyond its expiry date.",
      "rating": 5,
      "date": "29th December 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Help with direct debit mandate",
      "text": "Very helpful with sorting out problems setting up a new mortgage direct debit mandate, dealt with the issue promptly and efficiently, in a friendly manner. All sorted now!",
      "rating": 5,
      "date": "16th December 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Amazingly fair and helpful",
      "text": "I have to say well done H&R building society for guiding me through my enquiry",
      "rating": 5,
      "date": "7th December 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Exemplary customer service",
      "text": "I called with a query that I fully expected to be resolved in a number of days. Tracey Lord resolved the issue whilst I was on the phone...fantastic!",
      "rating": 5,
      "date": "2nd December 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Thank you to Louise Goodenough",
      "text": "Special thanks to Louise Goodenough who was very patient and helpful in answering all our questions before we committed to re-signing our mortgage with H&R. Thank you, really appreciated.",
      "rating": 5,
      "date": "2nd December 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Eighteen years brilliant service",
      "text": "Have had mortgage for eighteen years with H&R could never fault service or staff at anytime",
      "rating": 5,
      "date": "29th November 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "I needed help with my morgage",
      "text": "Simone Jones helped today and was a very friendly and helpful member of staff. I had been helped by Louise Goodenough yesterday and she went through everything to enable me to send paperwork online via Egress. Without both of their help I would have been totally lost. Thank you so much.",
      "rating": 5,
      "date": "25th November 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "I had my morgage renewal and needed help to process online",
      "text": "I dealt with a young lady today and Louise Goodenough yesterday. They were both very very helpful and would not have been able to resolve the issue I had without their help. Thank you so much",
      "rating": 5,
      "date": "25th November 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "customer service team",
      "text": "Always very bubbly over the phone and very helpful every time i call. Always looking to help you with any question or quires i have. Feels like a family run business which makes a huge difference then when speaking to a giant lender that keeps you on hold for a long time and don't seem to care generally. (e4) :)",
      "rating": 5,
      "date": "25th November 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "FRIENDLY AND HELPFULL STAFF",
      "text": "Both Jo and her colleague (Dawn?) were very helpful, patient and informative. Both where happy to give their time, no question too small or silly.",
      "rating": 5,
      "date": "22nd November 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Exceptional Service",
      "text": "Your website and portal are very user friendly and my contact - Louise Goodenough - made everything so clear and easy to follow. We are happy to renew our mortgage with you as you have looked after us so well from the beginning.",
      "rating": 5,
      "date": "9th November 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Professional & Efficient",
      "text": "The service from Karen in the Mortgage Team has been amazing. She is efficient, professional and the turnaround on our mortgage was amazing! Thank you.",
      "rating": 5,
      "date": "8th November 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "H & R really are the BEST!",
      "text": "H & R The best mortgage company for sure. I have been with them for five years now and they are very fair, efficient and it feels like a family and they really do their best to suit your requirements. I highly recommend this company who also have knowledgeable and friendly staff",
      "rating": 5,
      "date": "4th November 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Execellent customer care",
      "text": "Good and effective communication",
      "rating": 5,
      "date": "31st October 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Paying off a mortgage",
      "text": "I was asking about paying off my mortgage early. The information shared was clear and the required documentation was dispatched within 24 hours",
      "rating": 5,
      "date": "28th October 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "PLEASANT EFFICIENT REASSURING",
      "text": "Simone was really excellent having plenty of time to assist me and being very clear and professional. I thoroughly recommend Hinckely Building Society",
      "rating": 5,
      "date": "26th October 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "great when joining but when needed you go awol as a business.",
      "text": "I wouldnt recommend your business",
      "rating": 2,
      "date": "24th October 2022",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "Well done on your customer service",
      "text": "easy to get through on phone, always very helpful, many thanks!",
      "rating": 4,
      "date": "22nd October 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Borrowing made easy",
      "text": "Quick, helpful & understanding of our situation. A sensible lender who listen to you rather than scoring you via a computer. They will be top of my list for any future lending requirements",
      "rating": 5,
      "date": "20th October 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Greatly appreciate the service provided by Zainab",
      "text": "I would like to thank Zainab Syed for her guidance and support throughout the last few weeks. She assisted me with a number of queries and has made the process of managing my mortgages account in a more efficient way. I'd highly recommend speaking to Zainab if my friends consider moving to H&R.",
      "rating": 5,
      "date": "19th October 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Re-mortgage process",
      "text": "All good, apart from very lengthy delays from appointing and paying the approved valuer to undertaking the valuation. A month seemed excessive for the valuer to choose an appointment date, until we realised that the valuer had called in sick on the agreed day in question and didn't then return for a further month. This meant that from receiving an offer in principle in late May, the mortgage funds only became available in early October.",
      "rating": 4,
      "date": "5th October 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent Service",
      "text": "Efficient, courteous. Consistently helpful. No long waiting on the phone.",
      "rating": 5,
      "date": "5th October 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Mortgage Switching",
      "text": "It was a very easy, quick and clear process to switch my mortgage product",
      "rating": 5,
      "date": "28th September 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Like talking to friends",
      "text": "Been with H&R for several years now and just remortgaged with them. It's such an easy process, and contacting the contracts team is like chatting with friends; they tell you what you need to know in an easy to understand, clear way without ant waffle. So nice to call a company that you can talk to real people. Mortgage rates always good. Our remortgage was dealt with by Simone, who was efficient and friendly and made the process quick and easy. I would definately recommend.",
      "rating": 5,
      "date": "24th September 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great to talk to H&R",
      "text": "H&R are in a minority of lenders providing bespoke and flexible solutions for their mortgage customers - especially useful when you need thinking outside the box - no computer says no at H&R - thanks H&R",
      "rating": 4,
      "date": "19th September 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very protracted",
      "text": "Difficult times to organise a buy to let mortgage for a 69 year old and a 66.",
      "rating": 3,
      "date": "17th September 2022",
      "product": "Mortgages",
      "sentiment": "mixed"
    },
    {
      "title": "Good service",
      "text": "I was kept informed of all stages",
      "rating": 4,
      "date": "16th September 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "A fantastic experience",
      "text": "Helpful and clear interaction throughout the lifetime of our mortgage. It’s a delight, and a welcome change, to be able to chat with an HRBS colleague to conduct business. We continue to recommend you whenever friends ask about mortgages.",
      "rating": 5,
      "date": "15th September 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Professional",
      "text": "Listened to what was required, Dealt with it efficiently",
      "rating": 4,
      "date": "6th September 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Outstanding Service remortgage",
      "text": "I had not come across this lender and they were outstanding from start to finish. A pleasure to deal with.",
      "rating": 5,
      "date": "30th August 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Easy switch and helpful staff",
      "text": "Extremely efficient and helpful with regards to my mortgage product switch",
      "rating": 5,
      "date": "25th August 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Friendly staff, painful systems and processes",
      "text": "Rarely leave negative feedback on sites, as I appreciate that most people are trying to do the best they can, often in situations where they are under resourced. However, renewing our mortgage through H&R was hands down the most torturous process I have ever experienced, so felt compelled to say something. As existing customers, who previously had a positive experience with the Building Society, we made the mistake of thinking that changing our mortgage deal (to better reflect our circumstances 4 years down the line) and requesting a small mortgage extension (£10k) would be reasonably straightforward. How wrong we were. We even explained to the staff at the beginning of the process that we wouldn't bother with the extra borrowing, if it were likely to complicate or slow the process. With interest rates rising and cost of living crisis looming, we basically just wanted to make sure that we were on their most competitive deal. Regardless, we were assured it would be relatively straigtforward and decided to push on with the process. What followed was the most protracted, confusing, inefficient and sometimes farcical application process I have ever experienced. Endless hours of discussing hypthetical scenarios over the phone with different advisors, having to provide all information and documentation as if we had just walked in off the street (as opposed to being existing mortgage holders), being asked to provide the same information repeatedly, being bumped from one person to the next with no advance notice, etc, etc. There was even a laughable situation where H&R wouldn't accept their own paper bank statements as evidence that we lived in the property, that we had mortgaged through H&R. They then asked us for evidence of savings, which again were held at H&R! There didn't seem to be anyone in control of the process, with little thought given to continuity of contact for customers. To be honest, it got to a stage where I would happily have walked away and taken our business elsewhere. I appreciate that companies have a clear duty to ensure that their mortgages are affordable for customers, but the level of scrutiny applied here felt massively disproportionate to the ask. We also made the mistake of mentioning that we were expectig a baby, which then sparked a further rounds of questions on how we were going to pay our way during my wifes' short maternity period. You could honestly have sworn this was the first time that the Building Society had experienced a customer having a child, as they made us feel that this was some sort of irresponsable financial risk, rather than it being a happy and normal life event. Again, I appreciate that all customers have to be treated the same, but we are a couple in our late 40s, who lucky enough to be financially secure, have significant equity in our property, and were asking for a mortgage that was 12k less than we originally borrowed when we first came to H&R (loan to value of approx 23%). The payments for the new mortgage were to be less than what were already paying. Why then were we subjected to months of painful, repetitve questioning around hypothetical scenarios, and why was seemingly no credit given to the fact that we'd been solid, reliable customers of H&R for 4 years. I dread to think how customers experiencing any degree of financial challenge would be made to feel. On a more positive note, the staff that we dealt with were friendly and helpful. It felt as if many of the staff were new to the company, and were trying to make sense of outdated, clunky processes. I felt sorry for the staff to be honest. Deadlines were repeatedly missed, and we found ourselves having to chase a completion of the process as my wife went into labour. We now have our mortgage in place on a 2 year deal, but it is hard to see how we would ever put ourselves through that process again with H&R. The Society made us feel like we were doing something wrong, that we somehow represented a risk, and that H&R didn't really want our business. People deserve better.",
      "rating": 1,
      "date": "25th August 2022",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "Transfer of Equity",
      "text": "Simone was really accommodating and understanding of my request. She contacted my solicitor to speed the process up and always kept me informed.",
      "rating": 5,
      "date": "18th August 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Treated terribly",
      "text": "Treated ourselves and our mortgage broker terribly,",
      "rating": 1,
      "date": "15th August 2022",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "fixed rate mortgage",
      "text": "Advice was very good, the questions asked prior to taking out the 5 year fixed were in depth, ensuring I'm clear on the rationale for taking a 5 year fixed and pros and cons. Laura was very thorough, polite and helpful, and reflected the excellent customer focus of the Building Society",
      "rating": 5,
      "date": "8th August 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "In tune with my needs",
      "text": "A very positive experience helping me to buy a property under the JMSP scheme.",
      "rating": 5,
      "date": "5th August 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "New member",
      "text": "I arrange a remortgage with H&R and they were first class. I would recommend to anyone to speak with them",
      "rating": 5,
      "date": "2nd August 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Efficient and professional",
      "text": "Our experience with our mortgage application was seamless and effortless",
      "rating": 5,
      "date": "1st August 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Mortgage Redemption Support",
      "text": "I recently contacted H&R to ask about redeeming my mortgage. I was helped by Deborah Winterton who gave me excellent support. Throughout the redemption process Deborah communicated regularly and promptly and gave me all of the information and help that I needed.",
      "rating": 5,
      "date": "28th July 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Broken Commitment",
      "text": "I went through an independent mortgage advisor and HRBS was one of the offers we looked at. The offering was perfect for my age and position. We applied for the mortgage supplying all the detail requested. I was asked to increase the deposit which we did. I was then told that the mortgage had been approved. The developer was also told that the mortgage was approved. With this approval I was able to pay my holding monies, agree the price and negotiate some betterment into the deal. My broker and I were then told that the paper work was been sent for signing and that we would have the mortgage with in 5-7 working days. On this we planned our move out of our rented property and served notice. The developer pushed forward to get the house completed for the 6th May 2022. On the 5th May my broker was told by the underwriter that an error had been made and that HRBS could not provide this offer and that we had to start again. My Broker provided all the evidence that an offer had been made but the reply was simply sorry an error has been made. All previous agreements were in my view broken. The behaviour from that point was disgusting to say the least. Poor communication, all the information we had sent had to be resent. I had to put all my belongings into storage and had to move in with my sister-in law for 8 weeks. I am taking advice on making a formal complaint and a claim for costs I have incurred due to the unprofessional behaviour of HRBS. If, as the underwriter stated the person should not have made this offer what is that person doing committing HRSB to a deal. Except HRBS just ignore the situation and believe they operate above contract law. For the avoidance of doubt I intend to take this as high as I need, to recover my costs but also to make HRBS more accountable for their behaviours.",
      "rating": 1,
      "date": "25th July 2022",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "The process",
      "text": "The process was quick and efficient",
      "rating": 5,
      "date": "25th July 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Help with documentation",
      "text": "Quick call, sent over documents (that were originally lost in my email) clear instructions how to proceed - very helpful",
      "rating": 5,
      "date": "21st July 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Your staff are your greatest asset, some of your procedures need to change",
      "text": "Every member of staff I spoke to was great however the fact that my mortgage application was sat on/not started for 8 weeks and I wasn’t informed almost cost me the sale of my house.",
      "rating": 3,
      "date": "19th July 2022",
      "product": "Mortgages",
      "sentiment": "mixed"
    },
    {
      "title": "Great Service and Rate",
      "text": "Really happy with the Service and Rate that H&R gave us for our first home. Thanks :)",
      "rating": 5,
      "date": "19th July 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Simple Remortgage",
      "text": "I’ve used H&R in the past and have always been impressed by their range of offers and straightforward approach.",
      "rating": 4,
      "date": "19th July 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great Company (wo)manned by real people.",
      "text": "What a great company and a great product- the staff are all super helpful and I wish all my mortgages could be switched to H & R",
      "rating": 5,
      "date": "6th July 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Re mortgage",
      "text": "Very helpful and courteous ,Jo was very friendly , helpful and knowledgeable. Thank you.",
      "rating": 5,
      "date": "17th June 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Good Service, slightly slow procedure",
      "text": "Really good clear communications and best deal available, I felt the time it took to complete was longer than expected but probably still an effect from covid restrictions, working from home etc",
      "rating": 4,
      "date": "14th June 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Mixed feelings.",
      "text": "I would start by firstly praising Sylwia - she is such an asset to your team & had I only dealt with her id have been screaming only good things from the rooftops about H&R she is exceptional. However, other members of the team & a few things after the initial acceptance really let you know and nearly cost us our move out date which upset both vendor and buyers. The employment reference was a joke - after stating a few times my partners boss hadn’t received and email it took weeks to sort because you’d only accept an email - more so the lazy and careless attitude of whoever it was doing that part was frustrating. - then she’d not sent out solicitor their copy of the mortgage offer so 4 days later I chased and nothing. That put us behind & then having to wait an extra two days to clarify that we weren’t needing to pay an exit fee meant that we signed and exchanged the day of our move it was stressful and unorganised it could’ve been avoided.",
      "rating": 4,
      "date": "14th June 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Remortgage",
      "text": "Remortgage of existing buy to let property with H&R, very easy process with H&R offering to move to new improved rate before redemption period and at no cost. Fab experience from H&R again.",
      "rating": 5,
      "date": "8th June 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "A brilliant team",
      "text": "We have been with you for 20 years and can honestly say had no problems at all, every person I have spoken with has always been very helpful .",
      "rating": 5,
      "date": "6th June 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great customer service, although the final part of the process lacked",
      "text": "This company has been more than helpful from the start they’ve been great and talking through each step of the process. Where it fell over for me was the fact that the money did not reach my solicitor in time for the exchange and it made a very stressful day in constant chasing. I’m not sure where the mistake lied although if you were to know that part of the process I’ll be more than happy to return as a customer.",
      "rating": 3,
      "date": "1st June 2022",
      "product": "Mortgages",
      "sentiment": "mixed"
    },
    {
      "title": "Mr Matthew Gauntlett",
      "text": "Everything went well, and it was made clear exactly what was needed to complete the mortgage.",
      "rating": 3,
      "date": "21st May 2022",
      "product": "Mortgages",
      "sentiment": "mixed"
    },
    {
      "title": "A friendly mortgage provider",
      "text": "Ever since being recommended to Hinckley and Rugby I have been 100% impressed by their service, the friendly approach of their staff and the excellent range of mortgage products on offer. H & R are by far the best mortgage provider that I have ever dealt with and would recommend them highly to any prospective customer.",
      "rating": 5,
      "date": "18th May 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Review of H&R",
      "text": "Only want to take this opportunity to thank Sylwia.. my oh my she is a CREDIT to your team. So so friendly, efficient, personable & explains everything so well. Absolutely fabulous service from her - I’ve only dealt briefly with another two members - a very lovely guy I don’t recall his name. & Kimberley.. I didn’t find her all too helpful with the whole saga of sending my partners boss a employee report, or easy to contact.. poor communication skills there but I always contacted Sylwia who directed me to the right person. I’m not complaining of anyone I just like to point out those members of staff that communicate well and do a great job really make a difference in the whole experience and how we then go on to recommend.",
      "rating": 4,
      "date": "18th May 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Outdated system",
      "text": "Please step into the modern era, not only was the process heavily outdated but we were constantly asked for documents and information that we'd already provided The rates were very strong though so kudos for that",
      "rating": 2,
      "date": "4th May 2022",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "Champions!",
      "text": "From start to finish, a great experience! Thank you!",
      "rating": 5,
      "date": "3rd May 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very happy",
      "text": "Great service, very happy customer",
      "rating": 5,
      "date": "3rd May 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Service received Wednesday from Zainab Sayed was excellent but getting through to the Society can be very hard at times",
      "text": "Advisor was friendly and very efficient and provided excellent customer service",
      "rating": 5,
      "date": "1st May 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great Customer Service (because they are easy to get hold of and speak to, and deal with queries quickly and efficiently).",
      "text": "In April 2022 I corresponded with Alisha, Jo, and Simone from the Contract Variations Team with regard to switching my existing mortgage product. I found all of them to be very polite, courteous and helpful. As a bonus, all of them were happy, jovial and cheerful - making the whole customer experience more enjoyable. I am also grateful to them for dealing with my mortgage switch very quickly, which again highlights their commitment to great customer service.",
      "rating": 5,
      "date": "26th April 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent Building Society",
      "text": "I have been a customer now for 5 years. This is a remortgage for me, with H&R. All the staff are so courteous and professional. And things get done, at pace. I love this organisation. I'll be keeping my mortgage with H&R until it's paid off in future.",
      "rating": 5,
      "date": "22nd April 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Fantastic service",
      "text": "Very friendly staff always on there if you need any advice",
      "rating": 5,
      "date": "22nd April 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Far to slow in administering the mortgage application",
      "text": "I first applied for a a mortgage in January and it took until April for it to be completed. This was for a £100,000 loan on a property without any mortgage which is worth over £1,000,000.",
      "rating": 2,
      "date": "22nd April 2022",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "Super fast remortgage",
      "text": "I had an existing mortgage with H&R which was coming to the end of its fixed rate term. A pack was sent to me with new mortgage offers, and the turnaround time was so quick - a matter of a few days to get the new (better rate) mortgage set up and done, all via electronic comms. Really impressed and excellent!",
      "rating": 5,
      "date": "21st April 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Expectations hugely exceeded",
      "text": "I received a letter from Hinckley & Rugby dated 6th April advising that my existing mortgage product was coming to an end in 3 months time. I then selected one of the new product options which were offered and very easily and quickly completed the application process online. I called the contract variations department the following day explaining I would be on holiday when the new mortgage offer was being sent (4 weeks before the new mortgage start date) and I was told I would receive the new mortgage offer in 7 working days which was in itself brilliant. The lady on the phone was very friendly and helpful. However I received all the paperwork the following day by secure email. The day after I emailed a signed copy of my acceptance which allowed me the option of starting this new product within 7 days without incurring any early redemption charges. I then received an email advising I would receive a completion letter in a few days. However I received this letter, again by secure email, on the same day. The whole process from start to finish took 3 days. Quite remarkable!",
      "rating": 5,
      "date": "14th April 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great service as always",
      "text": "We had a mortgage with this company over 20 years ago and when we moved and needed a shorter term mortgage, they have been great again. Always helpful.",
      "rating": 5,
      "date": "14th April 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Personal and responsive service",
      "text": "We were impressed how straightforward it was to communicate with H&R. The people we spoke to were extremely responsive, helpful and professional. They offered a very personal service which is hard to find in this day and age.",
      "rating": 5,
      "date": "13th April 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Amazing!",
      "text": "Hinckley & rugby have been great, helping us with a complex mortgage offer and The help I have received every time I have phoned as been amazing, quick and helpful, especially Shannon & Jessica! thank you so much. X",
      "rating": 5,
      "date": "12th April 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Bankole",
      "text": "Very straightforward and helpful",
      "rating": 5,
      "date": "11th April 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    }
  ]
}