{
  "society": "Leek United Building Society",
  "slug": "leek-united-building-society",
  "trustpilotUrl": "https://uk.trustpilot.com/review/www.leekunited.co.uk",
  "scrapedAt": "2026-02-06T16:31:42.825793+00:00",
  "reviews": [
    {
      "title": "When Leek BS launched",
      "text": "When Leek BS launched, they provided one of the most competitive ISA rates available, earning a solid 5 stars for their product offerings. I applied for a new ISA online, but found the website's design and functionality lacking compared to other providers. After completing the application, I was notified that I couldn't access account management features until receiving a verification code. This included being unable to view account details for making a deposit. The code arrived by mail after four days, which feels slow compared to the smoother, quicker processes other providers offer, even without prior banking relationships. This aspect deserves 2 stars. Meanwhile, the outstanding service at the Derby Branch deserves a full 5 stars.",
      "rating": 5,
      "date": "7th January 2026",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "jfeoij",
      "text": "I have to say, my experience with Leek Building Society has been extremely frustrating and disappointing. I’ve been a customer for several years, and it’s become clear that their customer service is lacking, their communication is poor, and their processes are incredibly slow.\n\nFirst off, the online platform is outdated and clunky. Trying to manage my account or even just check simple information takes longer than it should. It’s clear that the website and app need a major overhaul to keep up with the times.\n\nWhat’s worse, I’ve had multiple issues trying to get in touch with their customer support team. It took forever to get through to anyone, and when I did, the staff weren’t very helpful or knowledgeable. They didn’t seem to care much about my concerns and left me feeling frustrated and unheard.\n\nI also had a recent issue with a mortgage application that took far too long to process. The communication was minimal, and I had to chase them multiple times for updates. When I finally got through, I was told contradictory things, and it was clear no one was on the same page.\n\nTo top it off, I felt like their rates and fees weren’t as competitive as other building societies or banks. You would think a smaller, more customer-focused organization would have better offers, but that wasn't the case at all.\n\nOverall, I’m thoroughly disappointed and will be looking elsewhere for my financial needs. I expected more from an institution that prides itself on customer service. Definitely not a place I’d recommend.",
      "rating": 1,
      "date": "10th September 2025",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    },
    {
      "title": "Amazing customer service",
      "text": "I recently completed a re-mortgage and additional borrowing with Leek Building Society. The customer service support from the mortgage advisor Nicola, the underwriter Alex and the completions officer Louise was outstanding. Communication was prompt and despite having a difficult solicitor, they continually answered questions promptly and politely. Would highly recommend.",
      "rating": 5,
      "date": "24th April 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Website is a bit rubbish",
      "text": "At time of opening, Leek BS offered one of the best ISA rates on the market.  So 5* for product offering.\nApplied online for new ISA.  Website design and functionality seems relatively poor compared to other providers.  Once the application was completed I was informed that I couldn't manage the account until the verification code arrived.  This included not being able to see the Account details to arrange a payment into the account.  The verification code took 4 days to arrive by post.  In today's age, other providers opening process is easier/quicker even if you don't already have a banking relationship with them.  So 2* for that.\nExcellent service from Derby Branch in meantime and would warrant 5*.",
      "rating": 3,
      "date": "11th April 2025",
      "product": "General",
      "sentiment": "neutral",
      "source": "trustpilot"
    },
    {
      "title": "Very slow to process ISA",
      "text": "Very slow to process ISA. After 4 days of waiting for verification code to be sent by post, I called up to cancel process. Told the call handler, ''I'm applying for an ISA, not to join MI6. I could have travelled to Australia and back much more quickly.'' I opened a new ISA with a different company (UBL UK) \nand verification was done online the same day. Leek BS need to realise this is the 21st Century.\n\nEdit: See the mealy-mouthed justification from Leek BS for their less than prompt processing. Other financial institutions (UBL UK included), are quicker by far. Instead of digging a deeper hole by attempting to justify themselves online, Leek BS could direct their resources to improving their verification services online, instead of relying on archaic postal verification methods.",
      "rating": 1,
      "date": "10th April 2025",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    },
    {
      "title": "Always a 5 star service at St Edward Street Branch",
      "text": "I visit the branch at least once a month to get my passbooks updated and to do a withdrawal too. Becky, Lucy, Kayleigh, Amy, Sarah & Joe are always so welcoming and friendly and so efficient in how they serve me. Not only do I receive a warm welcome and great customer experience but they always ask how I am and check on how my savings are working for me and did I want to review them. I feel like that are looking in on me and checking how my savings are doing and find this friendly and professional manner a breath of fresh air in today’s world.  If you want 5 stars then this is the branch to visit and feel so lucky to have them as my local branch.",
      "rating": 5,
      "date": "30th January 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "opened a savings account in sep 24 and…",
      "text": "opened a savings account in sep 24 and dye to cold weather i was unable to go into the branch which closes every day at 1pm i tried setting up internet banking which i was told by the branch manager they offer internet banking due to forgetting my online details they closed my account with out notifying me i am so glad im not with Leek building society. reading through other peoples comments i agree with them also the women i spoken with in the savings department are useless miserable bats!",
      "rating": 1,
      "date": "30th January 2025",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    },
    {
      "title": "The Mortgage Comedy Club",
      "text": "Nothing short of a nightmare, where do I start.\n\nWe started our full mortgage application with Leek 7 Weeks ago. Throughout the process we’ve been asked for the same documents multiple times, asked the same questions multiple times and provided the same attachments multiple times. Simple things such as locating payments and matching amounts to documents in addition to basic maths proved tricky for these guys. Things I would deem to be entry level administration. After 7 long, painfully frustrating weeks we were declined for 2 things that were visible in week 1… speechless. \n\nDon’t waste your time.",
      "rating": 1,
      "date": "8th November 2024",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    },
    {
      "title": "I have been a mortgage customer of Leek…",
      "text": "I have been a mortgage customer of Leek for the last 2 years. Our current deal is expiring in the summer so we have been sent a list of new mortgage rates that we are entitled to. The paperwork states that my house is worth £300,700 and therefore I am only entitled to rates for a 95% LTV. \n\nWe have had 2x valuations from other mortgage providers who have both valued our property at £330,000. This therefore means our LTV drops below 85%. \n\nI have called Leek today to speak about remortgaging as I don't want to switch lenders and also discuss their valuation of my property. One of my questions was how have they valued my property at £300k when they haven't seen it in person? The response was that they use an average calculator online that takes into account any sized house and gives the average value. How is that an accurate valuation of my house? Of course a smaller house will drop the value of our 4 bed. There are 4 bedroom houses on my estate for sale for £330k+ so I do not understand this valuation. \n\nThe low valuation also throws off the LTV %. Should my property be valued at more than £324k, we are entitled to rates for 85% LTV. Should I want a 'reevaluation' I need to pay £110 for them to send someone to my property. I believe Leek have done this just to secure more money. How sad capitalizing on people - is the 5.5% mortgage rate not enough for you?!\n\nThe mortgage advisor escalated this to senior management to see if we could have the £110 charge removed but this was declined. As explained on the phone, should this have been a couple of thousand difference I would accept it, but your 'valuation' is out by £30,000 - clearly an error on your part, not mine.",
      "rating": 1,
      "date": "12th April 2024",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    },
    {
      "title": "Highly recommended.",
      "text": "Efficient, excellent customer service. Joannne Morgan made it so easy for me to understand my remortgaging options. Job well done..thank you!",
      "rating": 5,
      "date": "14th March 2024",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Best ever customer service",
      "text": "I have my mortgage through Leek United Building Society, for the last 10 years. I wanted to write a review, because I have never experienced better customer service in any industry than I do with Leek. Every phone conversation and email is helpful and prompt.\nThank you!",
      "rating": 5,
      "date": "1st November 2023",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Fabulous customer service",
      "text": "Yesterday I had a fabulous customer service experience at Leek Building Society's Derby St branch. I had a number of different queries to resolve. The trickiest was to find out why my online access wasn't working. Lucy on the counter was patience personified. Working with Sarah on the phone in the savings department at Head Office  together they resolved my problem. I'd have found this very difficult on my own at home. The solution was simplicity itself. Don't mistake 1s for Is! All in all a really good experience. Thank you.",
      "rating": 5,
      "date": "30th September 2023",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "New customer experience",
      "text": "I have opened a savings account with Leek online. As a new customer I found the procedure was quick and seamless. Before opening I contacted the call centre.  My phone call was answered  very quickly and the member of staff was very helpful and knowledgeable.",
      "rating": 5,
      "date": "17th July 2023",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Beth @theCheadlebranch has just helped…",
      "text": "Beth @theCheadlebranch has just helped my mum and I through the bereavement process. She was pleasant, professional and very helpful. Thanks for being the human side of a horrible experience.",
      "rating": 5,
      "date": "17th May 2023",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Uttoxeter Branch",
      "text": "Having recently been dealing with the Leek United in Uttoxeter I just wanted to write a review to say what a lovely branch it is.  All the staff are professional, friendly and very helpful.  They remember who you are and they have all be extremely helpful to me over the past few months.  Thank you everyone",
      "rating": 5,
      "date": "28th January 2023",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Very helpful",
      "text": "Very helpful",
      "rating": 5,
      "date": "28th October 2022",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Excellent mortgage rates and real people to talk to",
      "text": "What a superb lot they are at Leek United!  Yet again I called in and got through almost immediately to someone without endless menus to direct me.  The staff I spoke to are friendly, helpful and knowledgable about products and the account status.  Communications are great, always plenty of notice with jargon-free letters explaining in simple English when rates are changing and quick, clear recommendations of the options for a better deal.  This has consistently been my experience as a Leek United mortgage customer over the last 20 years.  I regularly look to switch via comparison websites and they have always offered me another product with a better deal than what I could get through other lenders - and without me having to ask.  I think they are up with John Lewis for excellent products and quality service. Well done Leek United, (and take note rubbish provider such as NatWest, who are truly pants in almost every area, in my experience).",
      "rating": 5,
      "date": "25th October 2022",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "First class service",
      "text": "Absolutely first class service received from Leek United. I filled in a savings account opening form with St. Edward Street Branch in Leek and in a matter of minutes, formalities had been completed and I was presented with my passbook. Well done Leek United!",
      "rating": 5,
      "date": "13th July 2022",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Unbelievably time consuming",
      "text": "Unbelievably time consuming, slow service. Applied for a mortgage in April and have now been let down over a title query at the last minute. Delay after delay after delay in their decision making progress. The rates might be interesting but don’t touch with a barge pole.",
      "rating": 1,
      "date": "12th July 2022",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    },
    {
      "title": "Re-mortgage",
      "text": "I made an application for re-mortgage all went through, decision in principle and valuation all went through fine and after 6 weeks of waiting for an offer, they turned it down with a silly excuse! Caused me lots of frustration etc. Stay away from them.",
      "rating": 1,
      "date": "13th May 2022",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    },
    {
      "title": "I’ve given one star as you can’t give…",
      "text": "I’ve given one star as you can’t give less. I went to our branch in Uttoxeter today, to get some cheques for our holiday. The branch is closed for refurbishment, although there were members of staff sitting eating there dinner. It looked like the refurbished had been completed. After being a member for many years I’m going to close my account as the only benefit of being in the building society was the convenience of being able to get at your money locally, when you want, they don’t even offer bank transfers. This isn’t the first time I’ve gone to find them shut.",
      "rating": 1,
      "date": "31st March 2022",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    },
    {
      "title": "No integrity",
      "text": "No integrity. Staff need training. Would seriously be concerned if you’ve monies invested. No words!!!!!!",
      "rating": 1,
      "date": "30th March 2022",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    },
    {
      "title": "Always closed",
      "text": "Always closed , opening less hours all the time. If you are very very lucky to get in big ques . Hopeless may as well shut up shop!!!",
      "rating": 1,
      "date": "22nd December 2021",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    },
    {
      "title": "Remortgaged to Leek United on September…",
      "text": "Remortgaged to Leek United on September 2016 , was the best 5 year fix on the market and is the best and easiest process we have had with any bank or building society.   Actioned quickly with good communication from same person throughout .  5 year fix ends on 31st August,  already agreed new deal with Leek offered existing customer better deal than new ones.  Competitive amongst the market.  New 5 year deal already completed and implemented to start Aug 2021.  Again excellent throughout.   Fantastic again. Thanks",
      "rating": 5,
      "date": "15th July 2021",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "I am being generous by giving 3 stars…",
      "text": "I am being generous by giving 3 stars to LUBS. Their saving account interest rates are not in the least competitive , we were given incorrect information by one of their clerks following a death in the family , if you have an account here you will have your wages paid by your employers bank to LUBS `s bank and then to LUBS itself which caused many problems for us over the years.\nI dont know why we stuck with them so long it was such a relief when we changed to Santander where we actually met an old LUBS employee .\nLast but not least some of the staff at the Hanley branch are as miserable as sin especially the Scottish woman",
      "rating": 3,
      "date": "4th November 2020",
      "product": "General",
      "sentiment": "neutral",
      "source": "trustpilot"
    }
  ]
}