{
  "society": "Mansfield Building Society",
  "slug": "mansfield-building-society",
  "smpUrl": "https://smartmoneypeople.com/mansfield-building-society-reviews/products",
  "totalReviewsOnSMP": 1794,
  "avgRating": 4.66,
  "scrapedAt": "2026-02-06T15:51:32.543006+00:00",
  "reviews": [
    {
      "title": "Great experience - lovely staff.",
      "text": "Great experience - lovely staff.",
      "rating": 5,
      "date": "23rd January 2026",
      "product": "Insurance",
      "sentiment": "positive"
    },
    {
      "title": "If they need to be in touch they will try and contac...",
      "text": "If they need to be in touch they will try and contact you regular as you may miss the call as well as keeping you up to date with emails. Nice people to speak with and offer good advice.",
      "rating": 5,
      "date": "5th February 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Good communication and an easy experience to swap my...",
      "text": "Good communication and an easy experience to swap my products all questions answered in a timely manner. Thank you",
      "rating": 4,
      "date": "3rd February 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Self Build Mortgage",
      "text": "Helpful for my self build mortgage, easy stage releases and good communication throughout.",
      "rating": 4,
      "date": "29th January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "First Time buyer, 5% deposit, adverse credit, approved!",
      "text": "We had a FTB Resi Purchase with 5% deposit and some adverse credit. All of the highstreet said no and specialist rates were a lot higher, I brought it to yourselves and was very pleasantly surprised that you could consider the case, and in fact it actually went all the way through to completion.",
      "rating": 5,
      "date": "27th January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "more tailored options can look at cases that dont fi...",
      "text": "more tailored options can look at cases that dont fit 100% criteria and looked at case by case. Clients and brokers can then have a more adapted service",
      "rating": 5,
      "date": "27th January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "the alternative choice",
      "text": "not one of the big name high street lenders that usually consume the majority of application, mansfield stands waiting in the wings for the niche stuff that doesnt quite fit.",
      "rating": 3,
      "date": "27th January 2026",
      "product": "Mortgages",
      "sentiment": "mixed"
    },
    {
      "title": "Good service and response times.",
      "text": "Good service and response times. Competitive mortgage products, and flexible criteria. Staff and BDM's I have spoken to, have been helpful. Overall, a good lender to use.",
      "rating": 4,
      "date": "26th January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Mansfield experience",
      "text": "I have experience working with Mansfield Building Society mortgage cases, supporting advisers and clients through the full mortgage process. This includes managing residential and remortgage applications in line with Mansfield's lending criteria, liaising directly with the Society, solicitors, and clients to resolve queries efficiently, and ensuring cases progress smoothly to completion. I am confident in working with Mansfield's specific requirements, and they prioritise clear communication and compliance throughout. They focus on delivering accurate, timely updates while maintaining excellent customer service and attention to detail in every case.",
      "rating": 3,
      "date": "26th January 2026",
      "product": "Mortgages",
      "sentiment": "mixed"
    },
    {
      "title": "Excellent as always.",
      "text": "Excellent as always. The Mansfield is a lovely Building Society",
      "rating": 5,
      "date": "26th January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great staff who are friendly and communicate well.",
      "text": "Great staff who are friendly and communicate well. straight forward application process.",
      "rating": 5,
      "date": "26th January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "always happy to help",
      "text": "Always happy to help and very knowledgeable when call, don't usually have to wait too long to speak with helpline or bdm, and always helpful",
      "rating": 5,
      "date": "26th January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "You have been sourcing very well, particularly for R...",
      "text": "You have been sourcing very well, particularly for RIO products single applications. Can't fault communications at all. Downside if i had to find anything - it's the reliance of paper based wet signature on DD and Dec that then has to be posted to you",
      "rating": 5,
      "date": "26th January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Nice BS to deal with.",
      "text": "Nice BS to deal with. Good for bespoke solutions",
      "rating": 5,
      "date": "26th January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very good criteria, however DIP system can be slow",
      "text": "Very good criteria, however DIP system can be slow",
      "rating": 4,
      "date": "26th January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Good experience no problems at all.",
      "text": "Good experience no problems at all. would use again if needed",
      "rating": 5,
      "date": "26th January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "great experience - lovely staff.",
      "text": "great experience - lovely staff.",
      "rating": 5,
      "date": "23rd January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "My mortgage was up for renewal, wi",
      "text": "My mortgage was up for renewal, with your mortgage offers given to me the offer was 4.8 which was high. My LVT was still set at 80% when in actual fact it was around 55% I called one of your staff asking for a review and possibly a better deal as my better LVT should have given me a better deal. They plainly said no other deal and didnt bother looking in to",
      "rating": 3,
      "date": "20th January 2026",
      "product": "Mortgages",
      "sentiment": "mixed"
    },
    {
      "title": "Specialist Lender",
      "text": "Good range of specialist products and staff are generally helpful and are able to assist with criteria enquiries",
      "rating": 4,
      "date": "17th January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "experience with Mansfield was fine, but......",
      "text": "experience with Mansfield was fine, i dont think there conveyancers Harrop White, Vallance & Dawson have been very good. Making errors with forms that led to delays and therefore cost incurred.",
      "rating": 4,
      "date": "16th January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very smooth",
      "text": "Very smooth even though Mansfield asked for a lot of information, as to be expected.",
      "rating": 5,
      "date": "15th January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very helpful and understanding building society",
      "text": "Very helpful and understanding building society on all our mortgage enquiries and applications, the BDM we find anyways available to help.",
      "rating": 5,
      "date": "13th January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "I recommend them based on my experience",
      "text": "My interest rate is a little higher than the national rate, but every time my fixed term discounted rate is coming to an end I get offered 3 different reduced rates, which keeps my mortgage to a very reasonable outgoings. Had a decent time when at the start of my mortgage I had a spate of being underpaid, got my arrears cleared within 14 months and everyone was happy.",
      "rating": 5,
      "date": "13th January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Flexible lender with good adverse offering",
      "text": "Flexible lender with good adverse offering",
      "rating": 5,
      "date": "12th January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great lender, easy system and lovely team",
      "text": "Great lender, easy system and lovely team",
      "rating": 5,
      "date": "12th January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Always answer phone quickly.",
      "text": "Always answer phone quickly. Advisors are knowledgable.",
      "rating": 5,
      "date": "12th January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "i've always found Mansfield to be there when i need...",
      "text": "i've always found Mansfield to be there when i need them, they're not your normal go to lender but then the light bulb moment, MANSFIELD and then i'm always pleasantly surprised to find they can help me.",
      "rating": 5,
      "date": "12th January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Always helpful and knowledgeable with criteria queries",
      "text": "Always helpful and knowledgeable with criteria queries",
      "rating": 5,
      "date": "12th January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Helpful for difficult cases",
      "text": "Mansfield are the only company that were able to fulfill all my requirements. I used them through a mortgage broker First Mortgage and after a bit of back and forwards we were able to get everything agreed. My one criticism is that I don't think there's a portal or anything to access to view my mortgage and make additional payments - I would like to feel more in control.",
      "rating": 3,
      "date": "6th January 2026",
      "product": "Mortgages",
      "sentiment": "mixed"
    },
    {
      "title": "Great company and staff are very helpful",
      "text": "Great company and staff are very helpful",
      "rating": 5,
      "date": "23rd December 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "They were very helpful during our self-build and hel...",
      "text": "They were very helpful during our self-build and helped us to swap stage releases around when needed",
      "rating": 5,
      "date": "22nd December 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Brilliant service.",
      "text": "Brilliant service. Quick turn over and always kept informed",
      "rating": 5,
      "date": "22nd December 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Always attentive and professional and accommodating.",
      "text": "Always attentive and professional and accommodating.",
      "rating": 5,
      "date": "22nd December 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "They have always been fair and helpful",
      "text": "They have always been fair and helpful",
      "rating": 5,
      "date": "20th December 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Our rates for remortgaging were okay, not as competi...",
      "text": "Our rates for remortgaging were okay, not as competitive as other organisations. Difficult to move mortgage provider due to conveyancing costs. Feel stuck.",
      "rating": 4,
      "date": "15th December 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent customer service",
      "text": "Whilst it took a few weeks for our application to be approved - mainly because of multiple separate requests for specific paperwork - communication has been excellent: professional but personal, clear and timely.",
      "rating": 5,
      "date": "13th December 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Helpful advisor",
      "text": "Easy to complete the task I needed to over the phone",
      "rating": 4,
      "date": "11th December 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "When doing the debt consolidation within the mortgag...",
      "text": "When doing the debt consolidation within the mortgage it is a real pain having to provide updated statements on a regular basis until completion. There is clearly a trust issue with the society and its customers. I just cannot understand the necessary requirements for the society to settle these directly? Probably a minority of customers not doing the right thing and the majority of customers being affected by it. The society really needs to review this policy.",
      "rating": 3,
      "date": "4th December 2025",
      "product": "Mortgages",
      "sentiment": "mixed"
    },
    {
      "title": "Being retired is nice to know that Mansfield Buildin...",
      "text": "Being retired is nice to know that Mansfield Building Society do not rule us oldies out when seeking a mortgage.",
      "rating": 5,
      "date": "4th December 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Just renewed for the 2nd time.",
      "text": "Just renewed for the 2nd time. Terms agreeable so did not feel the need to look elsewhere. The admin was very slick and efficient.",
      "rating": 4,
      "date": "28th November 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Haven’t had any issues with Mansfield.",
      "text": "Haven’t had any issues with Mansfield. The one thing I really like about them is they answer the phone pretty quickly and it’s always someone who can speak good English and understand good Scottish. Ideally I’d like to be paying a bit less every month but who wouldn’t?",
      "rating": 4,
      "date": "28th November 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Friendly helpful approachable team.",
      "text": "Friendly helpful approachable team. Kept us well informed. We are only redeeming as we have sold the property.",
      "rating": 5,
      "date": "25th November 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "High rate so decided to move.",
      "text": "High rate so decided to move. No issues with the experience itself.",
      "rating": 4,
      "date": "24th November 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "The documents I received made things very clear, and...",
      "text": "The documents I received made things very clear, and I was able to use the website easily to renew my mortgage.",
      "rating": 4,
      "date": "24th November 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "I haven’t really had any experience yet with Mansfie...",
      "text": "I haven’t really had any experience yet with Mansfield BS other than the mortgage offer.",
      "rating": 5,
      "date": "21st November 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Mansfield Mortgage Experience",
      "text": "The experience of having a mortgage with the Mansfield has been good on the whole.",
      "rating": 4,
      "date": "19th November 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Staff very friendly and always helpful.",
      "text": "Staff very friendly and always helpful. We paid for a valuation through yourselves and we were not happy with the valuation given it was £40k less then we have been told from our own evaluation and was considerably less in comparison to recent house sales on our street. Obviously the more equity in your house the better the internet rate so we feel a little cheated. We have renewed with you for a fixed 2 yrs as time was ticking and we just wanted an easy renewal this time round.",
      "rating": 5,
      "date": "17th November 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Friendly and Helpful",
      "text": "We have found them friendly among many things as well as helpful",
      "rating": 5,
      "date": "13th November 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Middle of the road",
      "text": "Not the cheapest mortgage provider, but they did give me one in unusual circumstances so can't complain about that. Majority of correspondence is done by post which can be a little inconvenient sometimes. Easy to contact by phone and typically friendly telephone operators.",
      "rating": 3,
      "date": "10th November 2025",
      "product": "Mortgages",
      "sentiment": "mixed"
    },
    {
      "title": "I would have lived to stay with Mansfield for anothe...",
      "text": "I would have lived to stay with Mansfield for another two years at the least but I wasn't offered anything close to what we got from leeds building society. It was enough savings that it was worth the headache of remortgaging with them",
      "rating": 5,
      "date": "4th November 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Grateful thanks",
      "text": "You gave us a mortgage even though we are at retirement age to buy a house for our son who has and is very ill. This meant that he did not have to move and kept his consultants and hospital care. Thank you Mansfield, we are indebted to you.",
      "rating": 5,
      "date": "3rd November 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "EXCELLENT CUSTOMER SERVICE",
      "text": "When contacting Mansfield we found the staff dealing with our request very courteous and helpful, guiding us through the process quickly and with ease. Ensuring we understood everything that was going on",
      "rating": 5,
      "date": "31st October 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Amazing service,smooth process & glad we chose Mansf...",
      "text": "Amazing service,smooth process & glad we chose Mansfield",
      "rating": 5,
      "date": "24th October 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "remortgage quick and easy!!",
      "text": "easy,quick good commuction. The remortgage was smooth.",
      "rating": 5,
      "date": "23rd October 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Really happy with the rate received.",
      "text": "Really happy with the rate received.",
      "rating": 5,
      "date": "23rd October 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "They were extremely helpful at all stages when apply...",
      "text": "They were extremely helpful at all stages when applying for the mortgage and made me feel that I had made the correct decision choosing them",
      "rating": 5,
      "date": "15th October 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Changed their rate just before completion!",
      "text": "Provided an initial rate that was good, which is why I picked Mansfield. They decided to bump the rate a few points just before completion making it not worthwhile.",
      "rating": 2,
      "date": "14th October 2025",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "Happy with process.",
      "text": "Happy with process. Would have preferred more clarity about the Additional Security Fee as my broker said its something I have tp pay but am not allowed any details of the policy",
      "rating": 4,
      "date": "10th October 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Common sense lender",
      "text": "Very easy and straightforward product switch. Good rate option for interest only. Common sense lender.",
      "rating": 5,
      "date": "10th October 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "What a great business Mansfield Building Society is.",
      "text": "What a great business Mansfield Building Society is, excellent service, great products with high quality staff. It is such a treat to talk to actual people and they even call you back if the say they will. Caroline Maddox deserves a special mention, an outstanding employee and individual.",
      "rating": 5,
      "date": "9th October 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great Customer Care",
      "text": "Good communication and clear information was given throughout, which made the process much easier and straightforward.",
      "rating": 5,
      "date": "8th October 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "help and advice.",
      "text": "I have always received help and advice when I had reason to call about something I did not understand.",
      "rating": 5,
      "date": "3rd October 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Premature survey",
      "text": "Why are you sending me a survey about yourself when I do t even know when my first payment is due to you?",
      "rating": 3,
      "date": "3rd October 2025",
      "product": "Mortgages",
      "sentiment": "mixed"
    },
    {
      "title": "They are always helpful and polite",
      "text": "They are always helpful and polite",
      "rating": 5,
      "date": "25th September 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "My experience with Mansfield Building Society during...",
      "text": "My experience with Mansfield Building Society during my mortgage process was straightforward and professional. The staff were friendly and helpful, answering my questions clearly and guiding me through the steps efficiently. While the process had some complex paperwork, I felt supported throughout and appreciated the clear communication. Overall, I’m satisfied with the service I received.",
      "rating": 5,
      "date": "11th September 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "I have been with the Mansfield BS for 4 years.",
      "text": "I have been with the Mansfield BS for 4 years. My fixed term was coming to an end and I wanted to be able to take a 5 years fixed term moving forward. I have had the most wonderful experience with Mansfield and would highly recommend them to anyone. I am passionate about customer service, and Mansfield have never ever disappointed on that front. They are professional, polite, welcoming and responsive. a good old fashioned way of working with their customers. I am extremely sad to be leaving Mansfield, but unfortunately, on this occasion it was the rate being offered that I had to consider. Please consider you rates Mansfield so that more of your customers remain with you. Than you for everything - one day I might be back!!!!",
      "rating": 5,
      "date": "9th September 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Best rates in the market and very sleek process.",
      "text": "Best rates in the market and very sleek process.",
      "rating": 5,
      "date": "8th September 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very high interest rates and no choice but to stay w...",
      "text": "Very high interest rates and no choice but to stay with them, we remortgaged with them in December 2024 then sold our property, if we didn’t stay with them then we would’ve had a large early repayment fee.",
      "rating": 3,
      "date": "3rd September 2025",
      "product": "Mortgages",
      "sentiment": "mixed"
    },
    {
      "title": "Very efficient and friendly service",
      "text": "Very efficient and friendly service",
      "rating": 5,
      "date": "1st September 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Mansfield have provided an excellent service",
      "text": "Mansfield have provided an excellent service at all times",
      "rating": 5,
      "date": "30th August 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Issue free, effective service.",
      "text": "There have not been any issues, when we needed an extension that was dealt with effectively",
      "rating": 5,
      "date": "22nd August 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Responsive and friendly customer services",
      "text": "Responsive and friendly customer services",
      "rating": 5,
      "date": "19th August 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Clear Options",
      "text": "Gave a good clear explanation of our options which made it easier to make a decision",
      "rating": 5,
      "date": "18th August 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very helpful and responsive to any questions thought...",
      "text": "Very helpful and responsive to any questions thought the process",
      "rating": 5,
      "date": "15th August 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Customer Ser",
      "text": "Customer service is very good, always keep me updated and responsive",
      "rating": 4,
      "date": "12th August 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great all round service and processes",
      "text": "Overall, everything ran really smoothly, however when I did encounter a couple of hicups the team at Mansfield were great and went over and above to get this sorted so that the application could continue.",
      "rating": 5,
      "date": "7th August 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "The Helpful and Friendly Real People Building Society!",
      "text": "The ability to speak to a friendly and helpful real person is so pleasing.",
      "rating": 5,
      "date": "31st July 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Mr and Mrs B Hargreaves",
      "text": "I found it was easy to work with the team.",
      "rating": 5,
      "date": "31st July 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Mansfield are extremely professional and helpful",
      "text": "Mansfield are extremely professional and helpful",
      "rating": 5,
      "date": "30th July 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent service, poor value for money",
      "text": "Customer service was excellent however the renewal deal was an insult and would have cost us approx £200 a month more than the provider we moved to.",
      "rating": 3,
      "date": "29th July 2025",
      "product": "Mortgages",
      "sentiment": "mixed"
    },
    {
      "title": "Been looking for a good mortgage provider",
      "text": "Been looking for a good mortgage provider and our broker recommended Mansfield and we never looked back",
      "rating": 5,
      "date": "28th July 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Mansfield was a great mortgage provider for myself a...",
      "text": "Mansfield was a great mortgage provider for myself and my partner. Unfortunately, when we broke up they were unable to allow me to take over the existing mortgage by myself. So, I had to go elsewhere.",
      "rating": 4,
      "date": "24th July 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent service from start to finish",
      "text": "Communication was excellent and my mortgage process was smooth and I was guided with excellent service all the way through from start to finish",
      "rating": 5,
      "date": "22nd July 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "No complaints good service with setting up mortgage",
      "text": "No complaints good service with setting up mortgage",
      "rating": 5,
      "date": "22nd July 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Quick response, Quick process, kind and profession...",
      "text": "Quick response, Quick process, kind and professional staff",
      "rating": 5,
      "date": "17th July 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Super / Efficient",
      "text": "Very flexible approach at all times and takes each case on its own merit.",
      "rating": 5,
      "date": "14th July 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "The mortgage met my needs but high interest rate",
      "text": "The mortgage met my needs, as they were very specific due to circumstances, but was extremely expensive with a high interest rate. Fees for early termination were also very high. Customer service was wonderful, however I had to call every month to pay my mortgage as they were unable to update the DD date. Overall experience was ok, has I not required a very specific product I would have gone with another company with better interest rates.",
      "rating": 4,
      "date": "11th July 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "I couldn’t recommend Mansfield unfortunately due to...",
      "text": "I couldn’t recommend Mansfield unfortunately due to them not reporting to credit agencies. 2 years of paying my mortgage and none of my credit reports reflect this as no reporting by Mansfield.",
      "rating": 4,
      "date": "10th July 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Everything went smoothly , and customer service was...",
      "text": "Everything went smoothly , and customer service was good",
      "rating": 5,
      "date": "9th July 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "It was quick and easy, which is how we wanted...",
      "text": "It was quick and easy, which is how we wanted it to be",
      "rating": 5,
      "date": "4th July 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very easy to work with, listened to the reasons rath...",
      "text": "Very easy to work with, listened to the reasons rather than just making decisions based on scores",
      "rating": 5,
      "date": "27th June 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Mansfield Review",
      "text": "Excellent packages for our particular circumstances. Not the best rates, however for us , being retired and funds invested in stocks and shares, good packages offered.",
      "rating": 5,
      "date": "23rd June 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Well done Mansfield BS",
      "text": "thoroughly satisfied from enquiry stage through whole process",
      "rating": 4,
      "date": "16th June 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Been a customer since 2018 and have never had an issue.",
      "text": "Been a customer since 2018 and have never had an issue. Very straightforward service with friendly, insightful staff.",
      "rating": 5,
      "date": "11th June 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Professional",
      "text": "Every touch point I have with Meg Fisher is exceptional, professional yet friendly. Timely and attentive, couldn't ask for more.",
      "rating": 5,
      "date": "2nd June 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "mortgage clearance",
      "text": "I do not have an awful lot to say but the customer service when I have needed to call has been excellent",
      "rating": 5,
      "date": "30th May 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent service and rates, they truly care!",
      "text": "We struggled to find a mortgage as we had a unique situation but Mansfield helped us and gave us a good rate. The communication has always been excellent and they have always been very helpful whenever we have needed to contact them",
      "rating": 5,
      "date": "27th May 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very compassionate when I've been experiencing finan...",
      "text": "Very compassionate when I've been experiencing financial difficulties",
      "rating": 5,
      "date": "23rd May 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "great customer service",
      "text": "I've just closed my mortgage with them after 7 years, moving to a better rate. Only moving on the advise of my mortgage broker to get the best deal. Customer service is normally always top tier, and it being a smaller business sometimes you speak with the same people, which can be a nice touch. One great experience i had, was trying to understand my redemption statement, i spoke to a lovely lady who was very patience and took the time to help me understand. Only negative it that sometimes no one answers the phone, its rings and then cuts off in the end, but i guess that the downside of being a smaller business. It would be good it they had an online account or quick queries or to check details like loan amount, when it expires etc.",
      "rating": 4,
      "date": "23rd May 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "A seamless experience.",
      "text": "A seamless experience. From start to finish the entire process was immaculate.",
      "rating": 5,
      "date": "16th May 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent customer service, friendly staff, prompt t...",
      "text": "Excellent customer service, friendly staff, prompt to answer the phone and resolve your query. Highly recommend all staff consistently professional, respectful and care",
      "rating": 5,
      "date": "15th May 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very good service everyone is so happy to help",
      "text": "Very good service everyone is so happy to help",
      "rating": 5,
      "date": "10th May 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great experience - would recommend",
      "text": "Knowledgeable and friendly staff, always able to get the answer over the phone, with little to no wait times.",
      "rating": 5,
      "date": "10th May 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent customer service at all times",
      "text": "Excellent customer service at all times",
      "rating": 5,
      "date": "9th May 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Good prompt responses when asking questions.",
      "text": "Good prompt responses when asking questions. Friendly staff who are happy to help.",
      "rating": 5,
      "date": "2nd May 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Easy and straightforward experience",
      "text": "Easy and straightforward experience",
      "rating": 5,
      "date": "29th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Fantastic from day one just fixed for another 3 year...",
      "text": "Fantastic from day one just fixed for another 3 year had a couple of phone calls from the same person witch was nice to give me some options before my new deal started fantastic company and very happy with my new rate after only 2 years of been with them",
      "rating": 5,
      "date": "28th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "efficient but could have been quicker",
      "text": "efficient but could have been quicker",
      "rating": 5,
      "date": "28th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Evan who helped me through my 3 year renewal of mort...",
      "text": "Evan who helped me through my 3 year renewal of mortgage was really good!",
      "rating": 5,
      "date": "23rd April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "common sense approach, service oriented!!",
      "text": "Good to be able to discuss with service department plus underwriters. Only issue was that could not open offer letter with password, had to wait for postal copy in end.",
      "rating": 5,
      "date": "15th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "I liked Mansfield building society but I switched to...",
      "text": "I liked Mansfield building society but I switched to get a better interest rate. I would have liked to have managed my account online instead of having to phone up and hopefully that is a service you will do in the future. I don't like making phone calls but when I did the staff were helpful",
      "rating": 5,
      "date": "15th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Feel a bit stuck",
      "text": "Feel a bit trapped with Mansfield and that they take advantage of this. The re mortgage offers we receive aren’t particularly competitive but given the costs involved in moving providers, we end up staying. The process for remortgage is always simple, but I feel the product availability is limited, and different to new customers.",
      "rating": 3,
      "date": "11th April 2025",
      "product": "Mortgages",
      "sentiment": "mixed"
    },
    {
      "title": "Great customer Service...rates could be better",
      "text": "The customer service is first class and very responsive. The rates are high in comparison with other companies.",
      "rating": 4,
      "date": "3rd April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Always been very helpful throughout the term of my m...",
      "text": "Always been very helpful throughout the term of my mortgage contract with them. With mortgage breaks in Covid, phone calls and in person contact any of the team are always happy to help and sort any problem that you may have.",
      "rating": 5,
      "date": "31st March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Their communication is prompt, easy to understand an...",
      "text": "Their communication is prompt, easy to understand and very helpful.",
      "rating": 5,
      "date": "31st March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Interest rates uncompetitive",
      "text": "Interest rates are very uncompetitive as that’s a big reason for redeeming our mortgage soon",
      "rating": 4,
      "date": "31st March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Always easy to access telephone service no AI or stu...",
      "text": "Always easy to access telephone service no AI or stupid chat bots",
      "rating": 5,
      "date": "31st March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Really great service throughout",
      "text": "Really great service through the application phase and then closing. Exceptionally helpful and friendly customer service throughout, no questions were ever too obvious or too small to have an answer. I’d often submit an email question and then be called back to give me a really detailed, explanatory answer. Would have liked to have had an online account to be able to keep an eye on things, but customer service always answered any queries we had anyway.",
      "rating": 5,
      "date": "26th March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Always had a great experience when needed to speak t...",
      "text": "Always had a great experience when needed to speak to somebody",
      "rating": 5,
      "date": "24th March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Good company to work with.",
      "text": "Always pleasant and responsive staff. Competitive rates and hassle free. I have been a mortgage holder since 2019 with them",
      "rating": 5,
      "date": "23rd March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Changed to require a revaluation when it was a remor...",
      "text": "Changed to require a revaluation when it was a remortgage, very delayed, stuck on an interim rate for longer than required, eventually after I contacted directly we seemed to speed it up",
      "rating": 3,
      "date": "6th March 2025",
      "product": "Mortgages",
      "sentiment": "mixed"
    },
    {
      "title": "Great service",
      "text": "Great service, no issues. Good communication",
      "rating": 5,
      "date": "5th March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Overall good customer service, unfortunately, the ra...",
      "text": "Overall good customer service, unfortunately, the rate offered at renewal was way to high compared to the one i moved too",
      "rating": 4,
      "date": "4th March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "I’ve been with Mansfield for about 9 years.",
      "text": "I’ve been with Mansfield for about 9 years. I’ve found them very helpful. Good staff and customer service. not the best interest rates.",
      "rating": 5,
      "date": "28th February 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Never had any problems",
      "text": "Never had any problems I continue to renew as they seem to offer me the best deal in my current circumstances",
      "rating": 5,
      "date": "25th February 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Sad to be moving to another provider",
      "text": "Sadly i am leaving Mansfield for B2L provider, but i have been with them for the last 7 years and they are always, super friendly and helpful. I've not once found a mistake in there paperwork or information and they very timely in their responses.",
      "rating": 5,
      "date": "25th February 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "I've been a mortgage customer with Mansfield BS for...",
      "text": "I've been a mortgage customer with Mansfield BS for 18 years and have found them to be reliable, efficient and always giving excellent customer service. Their financial information is always balanced, accurate and helpful.",
      "rating": 5,
      "date": "24th February 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "The Building Society was very easy to communicate wi...",
      "text": "The Building Society was very easy to communicate with, quick to respond to questions and everyone was friendly.",
      "rating": 5,
      "date": "23rd February 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very friendly and pleasant to work with.",
      "text": "Any interaction with Mansfield BS has been good, they’ve been friendly, helpful and quick to respond. We’ve had no issues in the 5 years we’ve been with them. Renewing our mortgage onto a new deal has been no issue at all, a very seamless process with everything explained.",
      "rating": 5,
      "date": "21st February 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very personable, you feel valued and not just a numb...",
      "text": "Very personable, you feel valued and not just a number to them. The fact that you speak to actual people and not just a computer means a ridiculous amount in today’s society. Renewing are mortgage was so easy and took all the anxiety we were feeling out of it.",
      "rating": 5,
      "date": "21st February 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "We had a self build mortgage then moved to standard...",
      "text": "We had a self build mortgage then moved to standard rate whilst we found a cheaper rate. I found it difficult not being able to manage my account online",
      "rating": 4,
      "date": "21st February 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "perfect,quick service, easy process",
      "text": "perfect,quick service, easy process",
      "rating": 5,
      "date": "20th February 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Easy, clear, informative",
      "text": "Very easy and clear information about options available when renewing my mortgage. Good range of accounts available , particularly for older applicants like myself.",
      "rating": 5,
      "date": "14th February 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Mansfield BC Self Build Loan",
      "text": "Mansfield BC provided my Self Build Loan. I found them extremely helpful throughout the process. If a query needing answering they were easy to contact and a response provided in a timely manner. I found the process of staged drawn downs simple and efficient. I would have absolutely no hesitation in recommending them for similar.",
      "rating": 5,
      "date": "11th February 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Communication could be a bit better.",
      "text": "There was some confusion over payment days which has lead to a bad mark on my credit history. So communication wasn't the absolute best. Also, my new mortgage rate comes into effect now-ish and I've had no communication regarding that.",
      "rating": 4,
      "date": "10th February 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Speaking to a real person",
      "text": "I love that when I call the Mansfield I get to speak with an actual person and not a call centre. Everything is easily done and explained and the comparative rates are set out clearly.",
      "rating": 5,
      "date": "3rd February 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great service!",
      "text": "As a pensioner needing a mortgage, Mansfield BS has listened, helped and been encouraging over the past 15 years. My mortgage is now almost repaid. Heartily recommend their service and understanding!",
      "rating": 5,
      "date": "30th January 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "My experience has been mixed.",
      "text": "My experience has been mixed. The staff and customer service are good, however, the approach to new build mortgages are expensive - really high interest rates, fees are incredibly high (I paid £400 for each visit by valuer - my neighbour paid £150 per visit). The interest rate meant that the build was at risk due to monthly repayments skyrocketing. We completed the mortgage through Buildloan, who also load on additional fees and add nothing to the process.",
      "rating": 3,
      "date": "30th January 2025",
      "product": "Mortgages",
      "sentiment": "mixed"
    },
    {
      "title": "A good experience",
      "text": "The process took a little longer than was communicated. However, we were very happy with our overall experience",
      "rating": 4,
      "date": "29th January 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Good efficient service.",
      "text": "Good efficient service. Quick response to enquiries.",
      "rating": 5,
      "date": "29th January 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "All staff that I have had the pleasure of speaking t...",
      "text": "All staff that I have had the pleasure of speaking to have been wonderful. I have just stair cased to buying 100% of my property (shared ownership) the process of completing was a long frustrating process to say the least. all staff that helped me with advice were fantastic. My mortgage plan had run out so had to pay extra each month. Each month one of your staff called to update me on addition costs so that I could budget. They were very understanding of my situation and helped me understand that Mansfield would always support until the house had completed. My questions were always answered and emails replied to promptly. thank you big shout out to Ashley Poole",
      "rating": 5,
      "date": "28th January 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "MBS inspired trust and confidence",
      "text": "A lot of negotiation with MBS was via my broker. However, when assistance or information was sought from MBS - either by myself directly, or through my broker, the response from MBS was prompt and professional. I felt trust and confidence in having MBS as my lender and greatly appreciated the fact that it could find a product to fit my needs when many of its competitors couldn't.",
      "rating": 4,
      "date": "26th January 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Only didn’t renew as got cheaper elsewhere",
      "text": "Only didn’t renew as got cheaper elsewhere",
      "rating": 4,
      "date": "21st January 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Always helpful staff and managed us through the self...",
      "text": "Always helpful staff and managed us through the self build process really well. Thank you",
      "rating": 5,
      "date": "15th January 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "No App, cant get through!",
      "text": "No App, very challening to keep track of your finances. Alao difficult to get through to speak to a person for basic account info.I chose Mansfield based on their range of products, but they withdrew a number of products so I have taken my money elsewhere.",
      "rating": 1,
      "date": "28th December 2024",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "Mansfield have always been exceptionally helpful and...",
      "text": "Mansfield have always been exceptionally helpful and understanding. Always willing to explain in detail any queries we may have making sure we feel confident we are choosing the right product for us.",
      "rating": 5,
      "date": "20th December 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Friendly, answer the phones quickly or just an email...",
      "text": "Friendly, answer the phones quickly or just an email away. Had mortgage with them for 6 years.",
      "rating": 5,
      "date": "20th December 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Absolutely faultless procedure quick and easy throug...",
      "text": "Absolutely faultless procedure quick and easy through our broker",
      "rating": 5,
      "date": "19th December 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "great thanks for everything, would recommend",
      "text": "great thanks for everything, would recommend",
      "rating": 5,
      "date": "17th December 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Friendly, clear info.",
      "text": "Friendly, clear info. Price could be much more competitive.",
      "rating": 4,
      "date": "17th December 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "No problems experienced with Mansfield, just moved m...",
      "text": "No problems experienced with Mansfield, just moved my mortgage to a more competitive rate once my fixed rate ended.",
      "rating": 5,
      "date": "17th December 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "remortgage",
      "text": "V efficient and straightforward, good to have an ethical mortgage",
      "rating": 5,
      "date": "16th December 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "The staff were very helpful and help with our comple...",
      "text": "The staff were very helpful and help with our complex requirements.",
      "rating": 4,
      "date": "11th December 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "You can tell mansfield building society are customer...",
      "text": "You can tell mansfield building society are customer focused and take a personal approach when making decision's, always feel like they are on your side. Great customer service also, always able to help over the phone.",
      "rating": 5,
      "date": "10th December 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Concise information.",
      "text": "Concise information. Friendly advice.",
      "rating": 5,
      "date": "29th November 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent.",
      "text": "Excellent. The only reason I have changed lenders is because I wanted a different type of mortgage (equity release) and what i wanted was not available with Mansfield otherwise I would have still been a customer.",
      "rating": 5,
      "date": "26th November 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great experience arranging a mortgage, quick efficie...",
      "text": "Great experience arranging a mortgage, quick efficient and friendly service",
      "rating": 5,
      "date": "24th November 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Shared ownership available",
      "text": "It was one of the few places offering shared ownership at the time of getting my mortgage so was the best option. The down side is that you are not able to check balances etc online.",
      "rating": 4,
      "date": "21st November 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "I was put in touch with Mansfield via a broker.",
      "text": "I was put in touch with Mansfield via a broker. They have been very flexible and great with the process which has seemed incredibly easy.",
      "rating": 5,
      "date": "18th November 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Positive feedback",
      "text": "Good communication, easily accessible, helpful support",
      "rating": 5,
      "date": "15th November 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Superb customer service and great product quality",
      "text": "Superb customer service and great product quality",
      "rating": 5,
      "date": "11th November 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Mansfield have been amazing!",
      "text": "Mansfield have been amazing, I haven’t had the best solicitors so had to do a lot of chasing myself. Every time I have had to call Mansfield everybody I have spoken to has been really understand and really helpful too!",
      "rating": 5,
      "date": "7th November 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "You really dug us out of a hole.",
      "text": "You really dug us out of a hole. We lost our mortgage free house in the aftermath of the financial crash of 2010 and you allowed me a mortgage that took me to 86 years old. No one else would. The death of my mother, aged 101, allowed me to be mortgage free once more!",
      "rating": 5,
      "date": "7th November 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Really easy to deal with and good to be able to spea...",
      "text": "Really easy to deal with and good to be able to speak to an actual person straight away, I would recommend Mansfield to any of my friends and family",
      "rating": 5,
      "date": "30th October 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Staff at Mansfield were responsive, helpful and know...",
      "text": "Staff at Mansfield were responsive, helpful and knowledgeable. As our situation was complex, it did take time, but we were kept updated.",
      "rating": 4,
      "date": "30th October 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Everything went smoothly",
      "text": "Everything went smoothly in the process, apart from a small mistake which was quickly rectified",
      "rating": 5,
      "date": "18th October 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Mansfield is a good old fashioned building society w...",
      "text": "Mansfield is a good old fashioned building society where you can still speak to a human being who know what they’re talking about .. don’t ever change",
      "rating": 5,
      "date": "15th October 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Helpful, knowledgeable and courteous at all times",
      "text": "Helpful, knowledgeable and courteous at all times",
      "rating": 5,
      "date": "11th October 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "My experience has been great, communication is very...",
      "text": "My experience has been great, communication is very clear.",
      "rating": 5,
      "date": "30th September 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Good company to deal with",
      "text": "Haven't had much cause to contact (and our mortgage advisor has been the go-between), but no complaints with the service and price we've had.",
      "rating": 4,
      "date": "30th September 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Remortgage process was very smooth, and happy with t...",
      "text": "Remortgage process was very smooth, and happy with the service.",
      "rating": 5,
      "date": "27th September 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent communication",
      "text": "Mansfield were very clear and communicated well throughout my application process. I knew what was going on with my application at the various stages",
      "rating": 5,
      "date": "18th September 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Deal expiry",
      "text": "As my old deal expired you made it very easy to take out a new one with you. This was a no brainer as I have been very happy with you over the previous 3 years",
      "rating": 5,
      "date": "18th September 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great service, friendly customer service & quick res...",
      "text": "Great service, friendly customer service & quick responses",
      "rating": 5,
      "date": "16th September 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent service",
      "text": "You have very good front-end contacts, quick, knowledgeable, efficient. No long telephone queues, without exception your people understood what was wanted, dealt with it quickly and sensibly. It restores my faith in companies that do the job efficiently, pleasantly, without claiming to be very busy. Well done all round. Oh, and we reckon we got a fairly good deal as well.",
      "rating": 5,
      "date": "16th September 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Was very good, would recommend to people and would u...",
      "text": "Was very good, would recommend to people and would use again if I was to buy a house again",
      "rating": 5,
      "date": "11th September 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "The Best Customer Service!",
      "text": "The mortgage application process was super easy and simple to do, as we are first time buyers we were very nervous about this part of our home buying journey, but the team at Mansfield made everything as stress free as possible. I want to say a huge thank you especially to Michaela and Molly who where extremely kind and took the time to explain the process to us.",
      "rating": 5,
      "date": "11th September 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent online service",
      "text": "Simple and easy experience transferring to new fixed rate mortgage. All done online, quick and straightforward to do. Thank you.",
      "rating": 5,
      "date": "7th September 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Highly recommend.",
      "text": "Highly recommend. The experience was smooth and profession couldnt be any better.",
      "rating": 5,
      "date": "5th September 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Friendly customer service.",
      "text": "Friendly customer service. Good contact about the change of rate",
      "rating": 5,
      "date": "2nd September 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Good friendly and helpful staff.",
      "text": "Good friendly and helpful staff.",
      "rating": 4,
      "date": "2nd September 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Fantastic service and support been with me all the way.",
      "text": "Fantastic service and support been with me all the way. Pleased with the product",
      "rating": 5,
      "date": "29th August 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "It’s good to be able to speak to a human!",
      "text": "It’s good to be able to speak to a human!",
      "rating": 5,
      "date": "28th August 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Customer service are really good.but",
      "text": "Customer service are really good. We were on a RIO mortgage and now find ourselves on an SVR. Rates are eyewatering taking our monthly payment from September 2024 to nearly double what we were paying.",
      "rating": 4,
      "date": "28th August 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "True service excellence",
      "text": "We had little to no communication from the solicitors so had to contact Mansfield direct on occasion for updates, the staff we friendly, efficient and supportive. Simply excellent customer service!",
      "rating": 5,
      "date": "21st August 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Family buy to let mortgage",
      "text": "We took out a family buy to let mortgage over six years ago to provide a safe and secure home for our daughter - no other lender offered such flexible terms given our ages and the nature of the property we wished to buy.",
      "rating": 5,
      "date": "16th August 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very easy to understand and very quick",
      "text": "Very easy to understand and very quick",
      "rating": 5,
      "date": "16th August 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "The personal touch goes along way these days.",
      "text": "Always happy to help, the best mortgage provider I have used.",
      "rating": 5,
      "date": "13th August 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very good at communicating.",
      "text": "Very good at communicating. Easy to understand and navigate. Very helpful in getting things done. Easy to get hold of.",
      "rating": 5,
      "date": "11th August 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Redemption due to no direct sales team",
      "text": "With no direct sales team for further borrowing, and I didn’t want to go via a broker a Remortgage elsewhere was my only option. Shame when it’s a mutual Building Society and you can no longer deal directly. However I did complete a remortgage in 10 days with a great rate.",
      "rating": 2,
      "date": "8th August 2024",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "Best Company based on my needs",
      "text": "I have been looking for a mortgage company to suit my needs and Mansfield have provided the service I needed.",
      "rating": 4,
      "date": "5th August 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Self Build to Standard Mortgage with ease",
      "text": "The very helpful advisor made the transition from my self build mortgage to repayment mortgage swiftly and a simple process. Would highly recommend.",
      "rating": 5,
      "date": "31st July 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "First time homeowner with the help of Mansfield Buil...",
      "text": "First time homeowner with the help of Mansfield Building Society - great customer service the day before completion when I rang to check on the status of the advance.",
      "rating": 5,
      "date": "29th July 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Helpful staff who answer the phone",
      "text": "The above title says it all - sadly these days that is all too rare. Well done Mansfield - the personal touch is much appreciated. Mansfield also offered a range of products which suited our circumstances which were not available for major players in the market.",
      "rating": 5,
      "date": "29th July 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Always kept upto date with any changes & never any i...",
      "text": "Always kept upto date with any changes & never any issues if I need to contact",
      "rating": 5,
      "date": "29th July 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Top company",
      "text": "I have been with Mansfield for nearly 9 years and they have been excellent they loaned me the money to buy my house when no one else would.",
      "rating": 5,
      "date": "26th July 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Really good experience start to finish.",
      "text": "Really good experience start to finish. Very personal approach when conducting mortgage",
      "rating": 5,
      "date": "25th July 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "We are very happy with the Mansfield. Truly 5 star.",
      "text": "We are very happy with the Mansfield. I sometimes have to call twice because you must be busy. Once I get through, there is always someone who knows makes me welcome, and gives the help I need. I also like how easy it is to make an over payment.",
      "rating": 5,
      "date": "23rd July 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Exceptional customer service",
      "text": "Throughout our time as a customer with Mansfield, we have experienced such professional and kind customer service. Jennifer Taylor has been exceptional with her understanding and support during a very difficult few months for us. She has done everything she can to ease the hardship and help us. Cannot praise Mansfield and Jennifer enough for always going the extra mile for us.",
      "rating": 5,
      "date": "17th July 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Absolutely outstanding service",
      "text": "Absolutely outstanding service and so glad there are companies out there willing to help people who had prior credit issues they look past them and are very good at what they do would not have been able to buy our dream home without them. Also any interaction with staff he’s been exceptional best service I have ever received. Thank you and keep doing what you do",
      "rating": 5,
      "date": "13th July 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "I really can't fault them.",
      "text": "I really can't fault them. I have a Debt Management plan due to an old relationship breakdown and so most places won't give me the time of day, but I can say that Mansfield really treat you as a person.",
      "rating": 5,
      "date": "10th July 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Had a mortgage with Mansfield for 2 years , we would...",
      "text": "Had a mortgage with Mansfield for 2 years , we would quite happily stayed if they could match our new mortgage , would recommend mansfield , very good to be with",
      "rating": 5,
      "date": "27th June 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Brilliant company. Highly recommended",
      "text": "Seamless process, strong affordability checks but kept my broker updated at all stages.. Mortgage funds sent to lawyer early, allowing them to settle early on Thursday.",
      "rating": 5,
      "date": "16th June 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very helpful and a good range of products",
      "text": "Any time I needed to contact them they were helpful and provided the information I needed. Lots of options too when it came to choosing a different mortgage product.",
      "rating": 5,
      "date": "4th June 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Exceptionally uncompetitive interest rates made me move",
      "text": "Generally the mortgages provided by the Mansfield were good. As with all financial institutions I find they are quick to increase interest rates and costs and slow to reduce but that goes for all. The remortgage offers provided to me were unrealistic and basically awful. The cheapest was still over £500 per MONTH more expensive that the Halifax we moved to.. Let that sink in.... Per Month MORE expensive.. it was unviable for me to remain at the Mansfield and I moved my business",
      "rating": 3,
      "date": "3rd June 2024",
      "product": "Mortgages",
      "sentiment": "mixed"
    },
    {
      "title": "Excellent mortgage provider delightful experience ov...",
      "text": "Excellent mortgage provider delightful experience over seven years",
      "rating": 5,
      "date": "30th May 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Mortgage Experience",
      "text": "Had the mortgage for about 8 years and when times were hard the support received was first class. I felt that they always listened and sort an outcome which suited both parties. Highly recommended (which I have already!)",
      "rating": 5,
      "date": "24th April 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "The team work so hard",
      "text": "The team work so hard to help and make the process as streamline as possible, I feel like I am in safe hands. Although the process has been a long one and at times very detailed, the team have been really supportive and answered any questions I had when i called the first time they knew who i was i have never known such a personal touch. Thank you so much for helping me",
      "rating": 5,
      "date": "22nd April 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Renewal was quick and easy, was even contacted when...",
      "text": "Renewal was quick and easy, was even contacted when new products were available to see if we wanted to change",
      "rating": 5,
      "date": "25th March 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Always a pleasure to speak to and always helpful, al...",
      "text": "Always a pleasure to speak to and always helpful, always do what they say and will call you back if needed always had good experiences",
      "rating": 5,
      "date": "22nd March 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Prompt and efficient service",
      "text": "We used a broker however any correspondence has been prompt and overall we are happy with the attention to detail and overall service provided.",
      "rating": 5,
      "date": "1st February 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excelent support and service, always accessible and...",
      "text": "Excelent support and service, always accessible and responsive and very verey helpful",
      "rating": 5,
      "date": "29th January 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent experience",
      "text": "very professional, helpful, considerate, understanding and supportive",
      "rating": 5,
      "date": "30th November 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Self-Build Mortgage",
      "text": "Organising my mortgage with Mansfield has been simple and efficient. I am self-employed and was looking for a self-build mortgage. The Mansfield underwriting team reviewed all info quickly and in timescales noted. I would recommend Mansfield to others who are either self-employed, or looking for a self-build mortgage, or both.",
      "rating": 5,
      "date": "29th October 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "The best customer service and wonderful provider",
      "text": "As a first time buyer, with a shared ownership mortgage, I couldn't recommend Mansfield BS more. Every query has been answered quickly and remortgaging was so easy with them. They are so competent and helpful. If their rates were more competitive I never would have left. Thank you for being a great provider over the last 5 years.",
      "rating": 5,
      "date": "26th September 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Product Transfer",
      "text": "Have been a very happy customer with Mansfield. Staff are friendly, helpful and knowledgeable. My only complaint was having my new mortgage payment come out today but have had no notification of the new amount prior. Given the increase it would have been good to have had a letter or email prior to the payment going to have planned for the big increase.",
      "rating": 3,
      "date": "26th September 2023",
      "product": "Mortgages",
      "sentiment": "mixed"
    },
    {
      "title": "Excellent Service",
      "text": "Thankyou for the time that you managed my mortgage. I only changed as I was able to get a much better deal with a different mortgage provider which suited my income at this testing time of interest rate increase. Every dealing I have had with you has been professional and excellent customer service, particularly Evan who has supported me through the standing order changes with each interest hike. Thanks",
      "rating": 5,
      "date": "13th September 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Personal and supportive service",
      "text": "The team were honest, open and really supportive throughout the application process. Every person I dealt with was professional and wanted to find the best solution for my needs. My chain would have collapsed without their support- would 100% recommend.",
      "rating": 5,
      "date": "30th August 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great lender",
      "text": "Offered me more money than any other lender I contacted which meant that I could purchase the property I wanted, before coming out of the fixed term they offered other options, good communication, would definitely recommend",
      "rating": 5,
      "date": "25th July 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Really helpful personable approach",
      "text": "We have just secured our mortgage with Mansfield and have to say we were very impressed with the professional, yet personable approach. We actually felt like we had a dedicated team just working for us who kept us infirmed at every step and reassured us when things weren't going so straight with our purchase. A genuine lovely team who made the stressful process of buying a house a bit easier.",
      "rating": 5,
      "date": "18th July 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "A happy customer",
      "text": "Highly recommended, great rates, great communication and great customer service. Thank you Mansfield Building Society",
      "rating": 5,
      "date": "14th July 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Perfect Service",
      "text": "The Mansfield have been excellent with all our mortgage requirments, nothing is too much trouble and the rates are very competitive contacting before the latest deals finish and offering diffrent oprions to renew a new deal. Even letting us know when we have made too many overpayments so we dont incure more costs, would recommend to anyonew to give them a go.",
      "rating": 5,
      "date": "10th July 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Choose The Mansfield",
      "text": "We have had a great experience with the Mansfield Building Society. The staff were always available to speak to and provided excellent advice and support.",
      "rating": 5,
      "date": "8th July 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Unable to manage mortgage online",
      "text": "I never had an issue but the fact that I want able to manage or see my mortgage details online felt like I was in the stone ages really. All of my family and friends had banks that allows them online management of their mortgages",
      "rating": 3,
      "date": "3rd July 2023",
      "product": "Mortgages",
      "sentiment": "mixed"
    },
    {
      "title": "Offering a very positive experience",
      "text": "I cannot tell you how fantastic dealing with Mansfield has been . They provided an extremely positive experience in a world of negativity. Everyone I dealt with from Receptionist to Samantha who dealt with our application were so approachable and kind whilst being totally professional. Thankyou to everyone.",
      "rating": 5,
      "date": "23rd June 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Caring service team",
      "text": "The Mansfield team may be relatively small compared to larger mortgage lenders but they offer a personal and caring service approach to customers. Everything went smoothly and I would thoroughly recommend them to any propective mortgage applicant.",
      "rating": 5,
      "date": "20th June 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Happy customer for over 12 years",
      "text": "I’ve really appreciated being a customer of Mansfield and am very sorry to be leaving. This is purely a question of product and interest rates - we will save nearly £500/month by moving to a more competitive product. Thank you so much for many years of professional and friendly service and hopefully we will return in different economic conditions when we renew again in two years.",
      "rating": 4,
      "date": "9th June 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Thank you",
      "text": "Thank you to all who have been involved with my re-mortgage, and especailly Meg Fsher. The sensitivity and support has been above and beyond what I expected. It has been a difficult time but I feel very well cared for as a customer and I am very pleased it has been approved and completed.",
      "rating": 5,
      "date": "31st May 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great experience",
      "text": "Easy to deal with and great experience setting up our mortgage.",
      "rating": 5,
      "date": "3rd May 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "First time buyer",
      "text": "Just got a mortgage with Mansfield and everything has been perfect so far quick to respond to emails and enquiries Duran the application process and completed today and couldn’t be happier than you",
      "rating": 5,
      "date": "28th April 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "A mortgage in later life!",
      "text": "We were so happy to be offered a Mortgage at our age! Thankyou Mansfield!",
      "rating": 5,
      "date": "17th April 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Brilliant Service / Amazing Products",
      "text": "Im a mortgage broker with 17 years experience and I recently found Mansfield as a lender who will help clients with complex needs and some lighter historic adverse credit. The service from them over the last 4 months has been exemplary and other lenders could take a few pages from their book - real life mortgage lender for real life people. Thanks to our business debelopment manager Anna Squires. She is a legend! - Brad - Mortgage Expert - Haysto",
      "rating": 5,
      "date": "13th April 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Always easy to deal with",
      "text": "Friendly staff in UK answer the phone, always easy to deal with. Mortgage fees were high but that's due to the specialist mortgage product we wanted",
      "rating": 5,
      "date": "5th April 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Awe inspiring advice",
      "text": "Definite positive advice even though knew we were operating outside their reflection",
      "rating": 5,
      "date": "23rd March 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Staged release mortgage",
      "text": "The Mansfield allowed us to realise our dream of converting a barn",
      "rating": 4,
      "date": "13th March 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Good service",
      "text": "I’m really pleased with your service thank you",
      "rating": 4,
      "date": "2nd March 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Friendly, knowledgeable people and easily contactable",
      "text": "Never a problem to deal with. We left simply because we were offered a better deal with the bank where our current accounts are held. We did find the admin burden when previously remortgaging with you onerous but I know you were seeking to improve that already.",
      "rating": 4,
      "date": "25th January 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "One of the few who catered for my needs",
      "text": "There are very few BTL Family mortgage providers. The Mansfield provided a competitive rate and underwriting was done on a manual basis not \"computer says no\" arrangement. They only raised rates when they had to and overall their service was more than acceptable.",
      "rating": 4,
      "date": "23rd January 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "New Mortgage Application",
      "text": "Very good process from start to finish. Took a little longer than I would have liked with arranging a valuation, but on the whole as painless as can be with these things.",
      "rating": 4,
      "date": "29th November 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Retired couple no hassles",
      "text": "We were over 60 when we took out our mortgage. No problems ever and good communication when required",
      "rating": 5,
      "date": "25th November 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Nothing bad to say",
      "text": "I can’t say anything bad about Mansfield, customer service has been amazing. Communication though email is perfect. Only reason we left was due to high interest rate when looking for new rates",
      "rating": 5,
      "date": "23rd November 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Self build mortgage",
      "text": "The Mansfield have been easy to interact with (always pick up quickly!), their stage release process has been easy to follow and monies have been released promptly. We’d recommend for any other self builder.",
      "rating": 5,
      "date": "18th November 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Variable mortgage",
      "text": "Great for getting a mortgage post divorce at a tricky time. Great variable deals however unfortunately I couldn't find a fixed deal to suit. Great customer service..would be good to have online access to my account",
      "rating": 4,
      "date": "7th November 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Easy",
      "text": "Efficient and easy to get support",
      "rating": 5,
      "date": "1st November 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very helpful, contactable and fair provider",
      "text": "I had never heard of them but a broker helped us find them when my wife's self enployed covid grants were making it difficult with High Street lenders. They were brilliant to deal with, easy to get in touch with and flexible around payment dates.",
      "rating": 5,
      "date": "26th October 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Customer Service",
      "text": "Incredible staff - always willing and pleased to help - not one surly response/manner in the years I was with Mansfield - when the staff said they would do something - you could take it as done.",
      "rating": 5,
      "date": "19th October 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "A building society you can actually get a answer from",
      "text": "I had a 2 year fixed mortgage plan which ended during the on going economic pandemic!!! Unfortunately Mansfield weren’t able to match a different provider. Shame because I had no other reason to leave",
      "rating": 5,
      "date": "14th October 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very efficient",
      "text": "I requested a rate review and it was simple and very efficient.",
      "rating": 5,
      "date": "11th October 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "No issues at all",
      "text": "Mansfield was the only lender that would lend me enough to buy my first home. Am very grateful and never had any issues with anything - always felt like I was dealing with real and friendly people instead of call centres etc",
      "rating": 5,
      "date": "4th October 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "10 years problem free",
      "text": "The initial process of setting up my mortgage took quite a long time. I believe the underwriting at Mansfield BS is (or was) still quite manual and not reliant on credit scores. I stayed with MBS for 10 years and didn’t experience any issues. The only reason I didn’t stay when I moved house was that I secured a much lower rate through a broker. My only issue was that I was unable to change my payment date easily which should have been a simple request.",
      "rating": 4,
      "date": "3rd October 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    }
  ]
}