{
  "society": "Market Harborough Building Society",
  "slug": "market-harborough-building-society",
  "smpUrl": "https://smartmoneypeople.com/market-harborough-building-society-reviews/products",
  "totalReviewsOnSMP": 7,
  "avgRating": 3.86,
  "scrapedAt": "2026-02-06T15:51:43.014208+00:00",
  "reviews": [
    {
      "title": "Gutless",
      "text": "How can someone with £625,000 deposit and an income of £50,000 pa who is looking to purchase a £795,000 property with an up and running business that makes £20-25,000 a year be considered a risk? Apparently it is according to Market Harborough B.S. Risk averse is a posh word for cowardice. Your loss, quite literally. Avoid.",
      "rating": 1,
      "date": "6th February 2018",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "Disgraceful rip off",
      "text": "I had a 2 yr fixed mortgage with them. When coming to the end of the deal I decided to fix for another 2 yrs with them. I went for non advised as I thought it would be quicker and easier and last time I went the full advised route with them it dragged on for about 6 months before they were happy with all the info I provided them (inefficient, useless service). They wrote to me a very long winded confusing letter explaining everything. My deal was due to expire on 20th August so I made sure I got the signed agreement for my new deal back to them prior to this. Apparently this was not good enough and they needed it back before the end of the previous month in order for me to avoid going to SVR for a month. So my deal ended on the 20th and my new deal didnŠ—Èt start until the 1st of the following month. So for those 10 days they put me on SVR and charged me an additional Î£250 interest!!! I complained but apparently in the long winded confusing letter they sent me they basically have their arses covered so my complaint was not upheld. They gave me the usual take it to the ombudsman rubbish. Complete and utter rip off of a loyal customer. I was left completely skint for a month. There was absolutely no need for me to pay that interest to them. Unfortunately IŠ—Èm now tied into the gready ******** for another 2 yrs. AVOID LIKE THE PLAGUE.",
      "rating": 1,
      "date": "11th October 2017",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "Excellent local building society,",
      "text": "Excellent local building society, very friendly and knowledgeable staff always prepared to take time to talk and ensure the customers are happy. When opening a new product they always make certain you fully understand the terms of the account before they proceed. The branch has good opening hours allowing almost everybody the opportunity of a personal service.",
      "rating": 5,
      "date": "22nd January 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Excellent local building society",
      "text": "Excellent building society, friendly, knowledgeable staff, counter always well manned, interest rates not always the highest but one of the best on the high street, best of all, you can still get am old fashioned pass book to maintain your account.",
      "rating": 5,
      "date": "12th June 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Friendly society on the high street",
      "text": "Although not always offering the best rates available, MHBC have changed that with this regular savers account. Not only does it offer an attractive interest rate, it allows the saver to be flexible with the amount they save each month, very handy if you're working on a restricted budget. For me, the fact I can manage my account in branch is a huge benefit, the staff are friendly and very know on their products. I find being able talk to an advisor face to face is a far better experience than either a phone call or online chat. The fact that you are still offered a passbook is another big plus in my opinion, it feels nice to have something physical in your hand and to be able to look at your balance without going online.",
      "rating": 5,
      "date": "26th February 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Excellent customer service",
      "text": "Knowledgeable and helpful people to help me open an account",
      "rating": 5,
      "date": "23rd October 2024",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "small company who care",
      "text": "Lovely old fashioned company - not a big player in the market. Rates are competitive and staff friendly",
      "rating": 5,
      "date": "29th August 2015",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Very helpful and efficient",
      "text": "Very helpful and efficient. Answered all my questions.",
      "rating": 5,
      "date": "6th February 2026",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Could not be easier.",
      "text": "Very efficient friendly staff it could not have been easier to open an account.",
      "rating": 5,
      "date": "6th February 2026",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "The service was prompt and efficient…",
      "text": "The service was prompt and efficient carried out by  pleasant cashier j",
      "rating": 5,
      "date": "6th February 2026",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Excellent quick answers thank you",
      "text": "Excellent quick answers thank you",
      "rating": 5,
      "date": "6th February 2026",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "I was greeted by 3 welcoming and…",
      "text": "I was greeted by 3 welcoming and helpful members of staff today in the Desborough branch (Leigh, Charlie & Keeley) who were friendly and invited my daughter and my dog in as it was raining outside. They helped with my queries and I am a happy member of MHBS and would recommend to friends and family.",
      "rating": 5,
      "date": "6th February 2026",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "There is hope out there!",
      "text": "I would just like to say what an outstanding experience banking with MHBS has been. It has been so easy in every aspect, whether sending secure messages with a great response time, or phoning and actually speaking to a local member of staff. Wonderful, look forward to using them in the near future.",
      "rating": 5,
      "date": "3rd February 2026",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Really friendly staff Laura made us…",
      "text": "Really friendly staff Laura made us feel comfortable and could not do enough for us it is lovely to talk to real people keep it up",
      "rating": 5,
      "date": "3rd February 2026",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Great service very friendly from Eluira.",
      "text": "Great service very friendly from Eluira.",
      "rating": 5,
      "date": "2nd February 2026",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Service",
      "text": "The service is first class. You can talk to real people in customer services. No chat- bots here! They will ring you back,  send you emails, help you navigate the complex website. This is the ideal place to save your money, especially if, like me,  you're elderly and not brilliantly computer literate!",
      "rating": 5,
      "date": "30th January 2026",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Elvira was very helpful and talked me…",
      "text": "Elvira was very helpful and talked me through all options I would recommend the market Harborough branch it’s so nice being served and treated like a person that they want to help",
      "rating": 5,
      "date": "24th January 2026",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Good Experience",
      "text": "Very straightforward to open an account. Staff ver friendly and helpful",
      "rating": 5,
      "date": "23rd January 2026",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Open but no staff serving at any counter",
      "text": "I visited the branch on Market Harborough today to find it open with no staff to serve at any of the desks. I waited over 10 minutes & gave up. There is no way to get attention even though I tried shouting “hello”. I returned at 1min past 4 so I’d missed giving it another try but there were still no staff visible. It’s a great shame to have to rate low as the reviews are generally very positive regarding customer service.",
      "rating": 1,
      "date": "19th January 2026",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    },
    {
      "title": "Excellent counter service again from…",
      "text": "Excellent counter service again from the team in the Market Harborough branch. \n\nShout out to Jay in particular, she was super helpful, informative and professional. \n\nThank you again. \nAntonio Paolo Sellecchia",
      "rating": 5,
      "date": "19th January 2026",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Wonderful bereavement help",
      "text": "The lady who helped me was so patient and helpful as we sorted the accounts following  a bereavement.",
      "rating": 5,
      "date": "13th January 2026",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Very responsive customer service",
      "text": "Really impressed with the responsiveness of MHBS customer service. I used the secure messaging facility via the website. The online conversation involved different members of staff, but because the messages were all visible, the service was streamlined and consistent. Added to the great service MHBS offers very competitive interest rates.",
      "rating": 5,
      "date": "13th January 2026",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Andrew was extremely patient and…",
      "text": "Andrew was extremely patient and helpful assisting with opening a couple of accounts and explaining the pros and cons.  Many thanks.",
      "rating": 5,
      "date": "9th January 2026",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "I only ask you to do 2 things and got 1 right",
      "text": "I ask you to use the old share book so all our details were in one book.\nYou must thought that you \"had\" to give us a a new book, but why?\nOther than it all taking 2 weeks and 2 phone calls you did open the right account.\nHappy new year",
      "rating": 4,
      "date": "7th January 2026",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Clear explanation of necessary…",
      "text": "Clear explanation of necessary transaction.We both had a smile when l realised how straightforward it was!!!!",
      "rating": 5,
      "date": "7th January 2026",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Very good front-of-house staff",
      "text": "Very good front-of-house staff, extremely helpful.",
      "rating": 4,
      "date": "7th January 2026",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "I visited with an appointment",
      "text": "I visited with an appointment, having been advised that my wife was not required, as long as I had her passport and driving licence. Sadly this proved not be the case. The advisor we saw was extremely helpful and we were able to complete all the paperwork pending my wife's signature. It was refreshing to be able to walk in and talk to a person!! Not perfect but these things happen.",
      "rating": 4,
      "date": "6th January 2026",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Quick and easy",
      "text": "Quick and easy",
      "rating": 4,
      "date": "3rd January 2026",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Very efficient service",
      "text": "Very efficient service",
      "rating": 5,
      "date": "3rd January 2026",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Very helpful at the desk sorting…",
      "text": "Very helpful at the desk sorting anything out for you & not having to come back in to collect money you get it transferred into my bank which is very helpful.",
      "rating": 5,
      "date": "3rd January 2026",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Just walked into the branch and asked…",
      "text": "Just walked into the branch and asked about a savings account. The cashier explained everything and I opened the account there and then.",
      "rating": 5,
      "date": "2nd January 2026",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Fantastic service",
      "text": "Fantastic service, very helpful staff.",
      "rating": 5,
      "date": "2nd January 2026",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Excellent service by pleasant and…",
      "text": "Excellent service by pleasant and courteous staff, well done you should be proud to have such staff.",
      "rating": 5,
      "date": "2nd January 2026",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "The staff on the telephone are always…",
      "text": "The staff on the telephone are always very kind, patient, and helpful.",
      "rating": 5,
      "date": "2nd January 2026",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Poor rates",
      "text": "Quick xfers",
      "rating": 4,
      "date": "2nd January 2026",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Grateful for easy Branch contact",
      "text": "I opened a one year bond with you and made an error , i telephoned the Branch and the Lady sorted it out for me . Given that it was a lot of money this was a massive relief great to be able to talk to an English speaking person",
      "rating": 5,
      "date": "2nd January 2026",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "No encouragement for the young Couldn’t open an account for my 5yr…",
      "text": "Couldn’t open an account for my 5yr old, they wouldn’t take the coins from her money boxes as said it exceeded their limit and wouldn’t allow me to withdraw money or put in my daughters coins as no ID although been banking there for 40yrs and was with my mother who goes in every week, even bakes them a cake now and then. Not the impression I want my daughter to have about banking. Will be closing my accounts down. Sent an email but no response after nearly 2 months",
      "rating": 2,
      "date": "2nd January 2026",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    },
    {
      "title": "Craig Severn was incredibly helpful in…",
      "text": "Craig Severn was incredibly helpful in advising on accounts. Very welcoming and accommodating for elderly customers who require careful explanation and wheelchair access.",
      "rating": 5,
      "date": "30th December 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Excellent service with a smile -thanks…",
      "text": "Excellent service with a smile -thanks lorraine -so nice to deal with a real person",
      "rating": 5,
      "date": "30th December 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Quick & efficient without an…",
      "text": "On behalf of Mr Harris.\nA quick & efficient service, opened new account without an appointment. Thanks very much for a great service.",
      "rating": 5,
      "date": "22nd December 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "When ever you phone the excellent customer support.response is so…",
      "text": "When ever you phone the response is so polite and helpful ,nothing is to much trouble and that’s very reassuring being an investor.",
      "rating": 5,
      "date": "15th December 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Very helpful and good advice",
      "text": "Very helpful and good advice",
      "rating": 5,
      "date": "13th December 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Staff helpful and always pleasant.",
      "text": "Staff helpful and always pleasant.\n\nToby at Desborough persuaded me to complete this survey by saying he believed in me and promising it wouldn't take longer than 2mins!",
      "rating": 5,
      "date": "12th December 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Laura at the Kettering branch was very…",
      "text": "Laura at the Kettering branch was very efficient and sorted everything for me when I visited the branch. Much appreciated.",
      "rating": 5,
      "date": "11th December 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Am so impressed with the staff",
      "text": "Am so impressed with the staff: speed and transparency of responses (online).  Consistently fab!  Thank you so much.",
      "rating": 5,
      "date": "10th December 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "V easy to open and manage the account",
      "text": "V easy to open and manage the account",
      "rating": 5,
      "date": "7th December 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Really Helpful staff",
      "text": "Served by Leigh this morning and I couldn’t fault her at all, really helpful and a pleasure to be served by her",
      "rating": 5,
      "date": "6th December 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Helpful friendly staff",
      "text": "I went to the Rothwell branch this morning and found the staff helpful and friendly. Toby helped me with the issue and helped resolve efficiently and displayed a good knowledge of all procedures and products available. Very pleased with the service provided.",
      "rating": 5,
      "date": "5th December 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Now all the banks closed. you can see some face to face",
      "text": "I have been a member over 60 years I started with a savings account,Then I had a 25 year mortgage,\nI am now a saver again if I have any questions the staff are very helpful you can give them a phone call or call in the office if you want to put in cash or take some out.\nThe Mkt Harboro Building Society are local and do a lot of charity for the town and the surrounding area,\nThis is a great asset for the town  now that all the Banks in the town have closed.",
      "rating": 5,
      "date": "5th December 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "The online experience takes a bit of getting used to",
      "text": "I had difficulty navigating through the online site after our 3 year savings bond matured but a call to the branch , speaking to a very helpful lady helped me tremendously.",
      "rating": 5,
      "date": "4th December 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Really friendly & helpful",
      "text": "Really friendly & helpful staff and great savings rates make this an ideal place to save.",
      "rating": 5,
      "date": "4th December 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Prompt response",
      "text": "Prompt response",
      "rating": 5,
      "date": "2nd December 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "I arrived at closing time  but the…",
      "text": "I arrived at closing time  but the staff were still courteous and dealt with my business without any problem. Thank you.",
      "rating": 5,
      "date": "2nd December 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Branches that can be visited.A real…",
      "text": "Branches that can be visited.A real banking bonus\n  Thank you",
      "rating": 5,
      "date": "2nd December 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "staff were very good",
      "text": "well come as we came in . staff were very curtious and helpfull . and respect customer",
      "rating": 5,
      "date": "2nd December 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "I was able to speak to a member of…",
      "text": "I was able to speak to a member of staff privately.\nMy options for reinvestment were explained to me.",
      "rating": 4,
      "date": "2nd December 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Very helpful and knowledgeable staff.",
      "text": "Very helpful and knowledgeable staff.",
      "rating": 5,
      "date": "2nd December 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Everything worked as expected",
      "text": "This was the maturity of a three year bond. I opted to split the proceeds, reinvesting some in another bond and receiving the surplus in cash to my linked account.\nNothing went wrong and the funds were transferred when I had been told they would.",
      "rating": 4,
      "date": "2nd December 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Excellent Society",
      "text": "The society provides competitive rates and the staff are friendly.",
      "rating": 5,
      "date": "1st December 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Positive outcome.",
      "text": "Request for maturity has been carried out accurately and quickly. This should be expected with all financial institutions but is not always the outcome.",
      "rating": 5,
      "date": "1st December 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Very helpful staff",
      "text": "Very helpful staff, dealt with my queries very efficiently.",
      "rating": 5,
      "date": "1st December 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Good Customer service",
      "text": "Good Customer service. Very polite staff.",
      "rating": 5,
      "date": "1st December 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Very easy web site to use.",
      "text": "Very easy web site to use. Great service.",
      "rating": 4,
      "date": "1st December 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "The staff at Kibworth are always so…",
      "text": "The staff at Kibworth are always so very helpful, polite, and efficient. Most professional too!",
      "rating": 5,
      "date": "1st December 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Easy to set up and use",
      "text": "Easy to set up. Prompt interest payments.",
      "rating": 5,
      "date": "1st December 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Opening a new ISA account",
      "text": "Courteous and helpful staff member enabled me to open a new ISA account quickly and easily , although the lack of  in house wi fi made the transfer of funds from my bank to mhbs a bit tricky( it took 3 attempts)!",
      "rating": 5,
      "date": "1st December 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Everyone was so helpful",
      "text": "Everyone was so helpful",
      "rating": 5,
      "date": "1st December 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "No queuing .",
      "text": "No queuing .",
      "rating": 5,
      "date": "1st December 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Very helpful people on the phone.",
      "text": "Very helpful people on the phone.",
      "rating": 5,
      "date": "1st December 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Brilliant helpful great advice on paper…",
      "text": "Brilliant helpful great advice on paper ..",
      "rating": 5,
      "date": "1st December 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Good welcoming ,friendly service but…",
      "text": "Good welcoming ,friendly service but some customers who have lengthy problems and hold up others queuing should be dealt with at a specified till to free other tills or in private",
      "rating": 4,
      "date": "1st December 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "No mistakes made and everything happens…",
      "text": "No mistakes made and everything happens on time",
      "rating": 5,
      "date": "1st December 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Thanks",
      "text": "Thanks, Early notification of Maturity,    competitive rates with easy to follow renewal process,",
      "rating": 5,
      "date": "1st December 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Craig was very helpful and concise.",
      "text": "Craig was very helpful and concise.",
      "rating": 5,
      "date": "1st December 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Market Harborough Building Society",
      "text": "I had an appointment with Hannah at MHBS for advice regarding opening a new account. She answered my many questions regarding how to transfer funds using the online service. To meet and speak to a human being was refreshing. She was most polite and professional throughout.",
      "rating": 5,
      "date": "28th November 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "I recently  opened a new account",
      "text": "I recently  opened a new account and was assisted by Elvira, who made the whole process smooth, clear, and surprisingly enjoyable. She was patient, professional, and genuinely friendly — a rare combination that made the visit feel less like paperwork and more like a pleasant chat.\nI have to say, I left hoping our conversation wouldn’t be the last — her warmth and sense of humor definitely made the experience memorable. If the building society ever offered coffee appointments instead of forms, I’d be first in line!\nOverall, excellent service, and Elvira’s friendliness really brightened my day — I’d happily look forward to crossing paths again.",
      "rating": 5,
      "date": "28th November 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Claire Reedman at Market Harborough…",
      "text": "Claire Reedman at Market Harborough Building Society was very welcoming and knowledgeable of your products.She clearly explained all aspects of the accounts. Being new customers and having been to other providers, we were impressed by how much more information was given to us.",
      "rating": 5,
      "date": "28th November 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Zoe was very patient with this old…",
      "text": "Zoe was very patient with this old guy.and was a delight to deal with. A five star experience !\nProfessor Don Shaw",
      "rating": 5,
      "date": "25th November 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Exceptional Service",
      "text": "Being a non internet banking customer, it was so rewarding to walk into the branch and be able to open an account with no hassle. Claire Reedman could not have been more polite, helpful or efficient. This lady is a credit to MHBS.",
      "rating": 5,
      "date": "24th November 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Excellent  professional and went beyond…",
      "text": "Excellent  professional and went beyond EXCELLENT CUSTOMER SERVICE, \n10 out of 10\n\nThanks \nRobert Smith",
      "rating": 5,
      "date": "24th November 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Visited the Rothwell branch",
      "text": "Visited the Rothwell branch today very helpful, gentleman called Toby. Explained everything thoroughly. Helped me understand which account I need to open. Thanks",
      "rating": 5,
      "date": "21st November 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Even though we are no longer local",
      "text": "Even though we are no longer local, MHBSoc is great for savings.",
      "rating": 5,
      "date": "14th November 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Punishing prudence – not the member-focused society they claim to be",
      "text": "I approached Market Harborough with what any reasonable borrower would assume to be a simple, responsible, and forward-looking request: a conversation about short-term flexibility on a mortgage during a predictable, temporary lull in rental income. No arrears. No crisis. Just prudence - the kind of early engagement that every lender, regulator, and financial-wellbeing guide encourages.\n\nWhat I encountered instead was a masterclass in how not to handle customers who are trying to stay ahead of the curve.\n\nThe initial silence was telling. Weeks passed with no acknowledgement, no holding reply, no sign that anyone was paying attention. For a building society that trades so heavily on mutuality, community values, and personal service, this felt like a curtain being pulled back to reveal a far more indifferent reality. When a reply finally arrived, it read like a template churned out after reluctantly dusting off the inbox: references to missing emails, apologies that rang hollow, and an invitation to resend everything as though the burden naturally sits with the customer rather than the institution.\n\nThe substance that followed was even more disheartening. Rather than engaging with the perfectly reasonable idea that a short, well-defined period might warrant proportionate, preventative support, the focus fixed instantly on “affordability assessments”, “financial difficulty”, and the need for detailed income-and-expenditure forms. Not as part of a tailored conversation, but as a default barrier to even discussing options.\n\nIn regulatory terms, what troubles me most is how this experience sits against the FCA’s own expectations of lenders. The FCA’s mortgage support guidance and Dear CEO communications on the cost of living make it clear that firms should offer prospective and tailored forbearance where customers indicate they are, or reasonably expect to be, in payment difficulty - including BEFORE any payment is actually missed – and that support should be appropriate to the customer’s individual circumstances rather than driven by rigid process. Layered on top of that, the Consumer Duty now requires firms to act to deliver good outcomes, avoid foreseeable harm and support customers in pursuing their financial objectives, not simply protect their own risk metrics. Against that backdrop, the slow response, the lack of meaningful engagement, and the default push into a full “hardship” framing with credit-file warnings - rather than a proportionate, constructive conversation about short-term flexibility – feels, in my view, out of step with both the letter and the spirit of what the FCA says good mortgage lenders should be doing.\n\nThis, for me, is where the experience strayed furthest from the principles MHBS claims to uphold. A customer taking proactive steps to plan carefully should not be met with suspicion, bureaucracy, and an implication that only hardship cases deserve attention. The FCA’s own guidance encourages lenders to support borrowers before difficulties escalate, to tailor their approach to individual circumstances, and to use discretion where a customer’s situation is temporary, logical, and easily resolved. Yet the impression here was of a lender more concerned with protecting its internal process map than with exercising common sense or acting in a member’s best interests.\n\nThe tone throughout was transactional, not mutual. Defensive, not supportive. A society that prides itself on doing things “the right way” should not make customers feel like an inconvenience for trying to engage early and responsibly. And it should certainly not treat every enquiry as though it must be funnelled into the same bureaucracy that applies to long-term, distressed borrowers.\n\nIn short, this experience left me with the view that MHBS struggles to live up to the values it promotes. If you are looking for a lender that genuinely listens, applies proportionality, and engages constructively with members who act in good faith, you may find the gulf between their marketing and their behaviour uncomfortably wide.",
      "rating": 1,
      "date": "13th November 2025",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    },
    {
      "title": "Easy to use website.",
      "text": "Easy to use website.\nHelpful customer service.\nGood rates on their products.",
      "rating": 5,
      "date": "12th November 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Online registration",
      "text": "I rang MHBS yesterday and got through to Rachel in customer services who very kindly helped me register online as there are no branches available near me. After finishing the registration process, she explained that I would have to wait until I receive my customer number to call back the following day. When I rang again today, I got through to Claire who was very helpful as well. Both the ladies are highly professional, friendly and very knowledgeable. They are a great asset to MHBS.",
      "rating": 5,
      "date": "7th November 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Account closure online",
      "text": "I wanted to close my account as there are no branches near me anymore. I spoke to Rachel at customer services and she was extremely helpful, patient and very efficient. She helped me go through the registration process online and I managed to close my account without having to visit a branch as the online closure process as very simple. Please convey my sincere thanks to Rachel. She is a true asset to MHBS.",
      "rating": 5,
      "date": "6th November 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Elvira was excellent",
      "text": "Elvira was excellent. Gave us sound advice and made opening our new accounts really straight forward.",
      "rating": 5,
      "date": "5th November 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Very Polite",
      "text": "Well, I had a wonderful experience at the Market Harborough Building Society. I came in with a list of questions, and they were all answered brilliantly. Polite and friendly staff. It good to talk to local people. Highly recommend.",
      "rating": 5,
      "date": "5th November 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "I had a meeting this morning with Andy…",
      "text": "I had a meeting this morning with Andy at the Kettering branch to discuss my savings and how to get the best option for the future. Andy could not have been more helpful and explained the different types accounts open to me, all done with a smile and a coffee.I really like the fact I can talk face to face , you can’t beat the personal touch many thanks!",
      "rating": 5,
      "date": "4th November 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Visited MHBS needed advice was taken to…",
      "text": "Visited MHBS needed advice was taken to a private room , we were seen by lovely lady , unfortunately didn’t get her name because but was polite and friendly helped with advice to make the most of our funds , it’s a pleasure to be able to see a person face to face , with all the bank closures we don’t do online banking ,so we use MHBS thank you",
      "rating": 5,
      "date": "3rd November 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "My transaction handled efficiently and…",
      "text": "My transaction handled efficiently and staff very polite and friendly.",
      "rating": 5,
      "date": "3rd November 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Good Company!",
      "text": "Great website, good products, easy to deal with, great customer service.",
      "rating": 5,
      "date": "3rd November 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Very friendly company.",
      "text": "Very friendly company.",
      "rating": 5,
      "date": "2nd November 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "the staff that i spoke to were very…",
      "text": "the staff that i spoke to were very helpful and helped me with the questions i had about the online application",
      "rating": 5,
      "date": "2nd November 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "New account",
      "text": "Hanna was very helpful in explaining how to manage the new account,and how to close the old one.",
      "rating": 5,
      "date": "2nd November 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Easy to do business with online",
      "text": "Easy to do business with online",
      "rating": 5,
      "date": "1st November 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Simple process and explanations along…",
      "text": "Simple process and explanations along the way",
      "rating": 5,
      "date": "1st November 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "You carried out my instructions quickly…",
      "text": "You carried out my instructions quickly and accurately. \nNowadays many Building Societies let customers do it themselves.\nCan’t remember the exact date.",
      "rating": 4,
      "date": "1st November 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Friendly welcome from staff",
      "text": "Friendly welcome from staff, good information given",
      "rating": 5,
      "date": "1st November 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Desborough Men’s Shed",
      "text": "I am the treasurer of the Desborough community Men’s Shed. \nI am in the Desborough office at least twice per week. \nI , on behalf of the Members of the Shed are very happy with the service we get from all the staff at the Desborough MHBS.",
      "rating": 5,
      "date": "1st November 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "The colleagues are really warm and…",
      "text": "The colleagues are really warm and friendly. Everything is dealt with quickly and efficiently. Even though you deal with a different colleague each time it all feels joined up with the communication.",
      "rating": 5,
      "date": "1st November 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "My late mother account sorted easily",
      "text": "My late mother account sorted easily",
      "rating": 5,
      "date": "1st November 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Easy to get started",
      "text": "Easy to get started",
      "rating": 5,
      "date": "1st November 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "I haven’t ever opened an account on…line",
      "text": "I haven’t ever opened an account on line and your staff helped me and said that if I ever get any queries not to hesitate to ring so it’s really important to me to have someone who can explain things if I have any difficulty",
      "rating": 5,
      "date": "1st November 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Helpful and took the time to explain…",
      "text": "Helpful and took the time to explain and sort things out",
      "rating": 5,
      "date": "1st November 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Satisfied repeat customer",
      "text": "This week I opened my second account in the quaint but modern branch office in the yesteryear village of Kibworth. Friendly professional service. Free local parking is a bonus",
      "rating": 5,
      "date": "1st November 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Simple process to open and fund",
      "text": "Simple process to open and fund account. No problems at all.",
      "rating": 5,
      "date": "1st November 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Being busy didn’t phase them",
      "text": "Despite being very short staffed and busy everyone was very polite and professional",
      "rating": 5,
      "date": "1st November 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Straight forward and easy to use",
      "text": "Straight forward and easy to use",
      "rating": 5,
      "date": "1st November 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Friendly staff sorted out my enquiries…",
      "text": "Friendly staff sorted out my enquiries to my complete satisfaction",
      "rating": 5,
      "date": "1st November 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Excellent service in helping me set up…",
      "text": "Excellent service in helping me set up my new savings account with MHBS.",
      "rating": 5,
      "date": "1st November 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "There is only one reason and that’s the…",
      "text": "There is only one reason and that’s the help from Rachel, , if I had any issue’s she has helped me out  and sorted it\nThank You",
      "rating": 5,
      "date": "1st November 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Great staff and a very professional…",
      "text": "Great staff and a very professional financial organisation. As a fairly new customer - really impressed!",
      "rating": 5,
      "date": "1st November 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "generally very good",
      "text": "generally very good.  One suggestion - either a text or email when you receive a bank transfer and is credited to my. account.  Had to keep logging in.",
      "rating": 4,
      "date": "1st November 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "£100kdue back today (Friday) Nothing…",
      "text": "£100k due back today (Friday) Nothing repaid. Very lucrative for MHBS to keep my funds over the weekend, and pay me nothing, Very cynical! Hopefully I will eventually get my funds back next week.\nBest to avoid.\n\nNow we know Friday maturity means MHBS keeps your funds over the weekend - convenient (for MHBS). So you lose two days interest on maturity.\n\nMaturity on Friday in my book says repayment on Friday. I can make same day electronic payments so why can't MHBS? Cynical response, so you lose two days interest. \n\nSo MHBS assert the maturity date is not exactly the maturity date, Convenient (for MHBS).\n\nExcuses, excuses -free money for MHBS over the weekend - Great if you can get it at zero interest. \n\nStrangely even the current offerings mature on a Friday (What a coincidence!). YOU LOSE THE INTEREST TO WHICH YOU ARE ENTITLED!\n\nLast B/S I will invest with in the future. I have not seen this cynical attitude with any of the many deposit takers I deal with.",
      "rating": 1,
      "date": "31st October 2025",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    },
    {
      "title": "Lorraine,",
      "text": "Lorraine,\nWas polite, listen to what we both wanted to say, very understanding of our concern at not able to do on-line banking.\n\nLorraine, was kind, supportive, professional and knowledgeable, and we left the building Society with confidence in what we achieved",
      "rating": 5,
      "date": "31st October 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Superb service at Market Harborough Building Society",
      "text": "Thank you so much to Hannah at Market Harborough building society.\nShe was friendly, efficient and could not have been more helpful- it was lovely to meet someone so approachable rather than try to navigate the details of a savings account on a computer screen.\nThelma",
      "rating": 5,
      "date": "30th October 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Elvira's excellent service",
      "text": "Elvira at your Kettering branch gave us all the information we needed and answered all our questions.\nShe very efficiently opened our new accounts. Overall we were very impressed with her attention to detail and friendly manner.",
      "rating": 5,
      "date": "29th October 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "A lovely  Building  society",
      "text": "Recently  I went to Market Harborough  Building  society  and opened a new savings account,  they are such a lovely group of very caring and helpful people.\nThe lady I saw was Hannah Sunny such a lovely helpful  and caring person thanks  very much Hannah for all your help it made my day. X",
      "rating": 5,
      "date": "24th October 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Very efficient account opening",
      "text": "Very efficient account opening service from Claire.",
      "rating": 5,
      "date": "20th October 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Superb customer service",
      "text": "Went in to open three different accounts. Despite being short-staffed they accommodated me without an appointment there and then. Very professional, very polite, nice cup of tea, all done efficiently and with a smile. I dealt with Claire Reedman who was amazing. Very strongly recommend.",
      "rating": 5,
      "date": "20th October 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "New savings account opening",
      "text": "Visited the branch in Market Harborough as the account could only be opened in branch. Out of the way for me but they were extremely efficient. Three staff serving, and the lady (Claire) opened the account even though all three staff were busy at the counter. As existing customer she found my details. She asked if I had read how the account works online (I had) and provided the new account number and explained how to set up the standing order. I already had a regular saver with them, she understood that I didn't need everything explained. Very good perception of what the customer needs. Receipt given, no need for  passbook as withdrawals can't be made, and a copy of the key facts given.\nA very good example of how to deal with a customer in a busy place. Well done to MHBS.\n\nI did notice they had a machine inside that was used by others for deposits etc, freeing up time for cashiers. I noticed people were also able to deposit coins.",
      "rating": 5,
      "date": "20th October 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Great value for money",
      "text": "The product they were offering had one of the best interest rates available and suited my requirements",
      "rating": 5,
      "date": "19th October 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Great customer service",
      "text": "I have required assistance from the customer support team at Market Harborough on a couple of occasions in the last few months over my savings account.  On both occasions I received prompt, courteous and excellent customer service - in particular from Amelia.  I am glad to be a member of Market Harborough Building Society.",
      "rating": 5,
      "date": "15th October 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Excellent and professional service…",
      "text": "Excellent and professional service opening an account this morning from Jenni, also Keely and Leigh always friendly and helpful at the Desborough branch.",
      "rating": 5,
      "date": "14th October 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Opening new account",
      "text": "We were fealty with in an efficient and friendly manner.  Given a drink whilst we were being dealt with.",
      "rating": 5,
      "date": "11th October 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Everything OK.",
      "text": "Everything OK.",
      "rating": 4,
      "date": "10th October 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "You made everything so easy to follow!",
      "text": "You made everything so straight forward and easy online to open an account with you. Everything completed quickly and efficiently which is rare nowadays!",
      "rating": 5,
      "date": "8th October 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "First class service from Claire Reedman…",
      "text": "First class service from Claire Reedman at MHBS this morning.  Despite being short staffed she went out of the way to answer my queries and to open a new account for me.  Professional, friendly and entirely competent, thank you.",
      "rating": 5,
      "date": "8th October 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Excellent company",
      "text": "Excellent company. No issues at all. Friendly service. Very helpful. Been with this company for 42 years",
      "rating": 5,
      "date": "8th October 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Always a professional and friendly…",
      "text": "Always a professional and friendly service from Keely and Leigh at the Desborough branch.",
      "rating": 5,
      "date": "8th October 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Brilliant service lady on front desk…",
      "text": "Brilliant service lady on front desk explained in full about my next 2 year plan and set it all up for me",
      "rating": 5,
      "date": "8th October 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Visit to local branch",
      "text": "I visited my local branch and it was a good experience. The lady behind the counter was friendly and very helpful when I asked about my accounts.",
      "rating": 5,
      "date": "3rd October 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "we had a review of our accounts",
      "text": "they gave us the imformation we needed and did the changes necessary",
      "rating": 5,
      "date": "2nd October 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Money transfer",
      "text": "My message was dealt with promptly and efficiently with great communication",
      "rating": 5,
      "date": "2nd October 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Staff were friendly",
      "text": "Staff were friendly, helpful and approachable.",
      "rating": 5,
      "date": "1st October 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Meeting with Jay",
      "text": "Meeting with Jay, she was lovely , polite and friendly. Did everything for us that we requested very efficiently.",
      "rating": 5,
      "date": "1st October 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "As always kind",
      "text": "As always kind, patient and professional",
      "rating": 5,
      "date": "1st October 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Transfer of funds",
      "text": "The Transfer was made quite quickly and I understood in this account it would take 30 days.  No problem to me that's why I came in over a month before I needed that money.",
      "rating": 5,
      "date": "1st October 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Easy transfers",
      "text": "It was easy to transfer Isas and the service was excellent. Cash withdrawal was in my bank account the next day and the new isa information quickly followed.",
      "rating": 5,
      "date": "1st October 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Personal Service",
      "text": "I like the personal service given in your Market Harborough branch. The staff are always cheerful, friendly and efficient. They answer any questions I may have.  I do not want to deal with my account on line. \n\nPersonal service is invaluable.",
      "rating": 5,
      "date": "1st October 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Poor interest rate for long term…",
      "text": "Poor interest rate for long term accounts , why keep reducing it when the Bank of England isn’t reducing their rates",
      "rating": 3,
      "date": "1st October 2025",
      "product": "General",
      "sentiment": "neutral",
      "source": "trustpilot"
    },
    {
      "title": "Friendly branch open on Saturdays (and week days)",
      "text": "I'm a new customer, opened my account in branch today. I am fed up with branches being closed with other banks.\nStaff were friendly, helpful, knowledgeable, and efficient",
      "rating": 5,
      "date": "1st October 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Excellent and simple to register.",
      "text": "Excellent and simple to register.",
      "rating": 5,
      "date": "1st October 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Happy investorfound all your staff at the Market…",
      "text": "I found all your staff at the Market Harborough office to be very helpful, patient  efficient and professional. This is the second time I have trusted my money with your building society. Thank you.",
      "rating": 5,
      "date": "1st October 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Opening a savings account",
      "text": "Andy made the whole process very straightforward. He spent time to answer my assorted questions and explained the process really well. He was both friendly and professional. He is an asset to the company.",
      "rating": 5,
      "date": "1st October 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Helpful counter assistant who qui key…",
      "text": "Helpful counter assistant who qui key dealt with a very small transfer of just £20 between accounts in a friendly way.",
      "rating": 5,
      "date": "28th September 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Good management",
      "text": "Toby the manager is very good at his job easy to talk too and gets to know his customers.    Bill",
      "rating": 5,
      "date": "27th September 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Bravo - 2nd to none ... As a Lasting Power of Attorney for my…",
      "text": "As a Lasting Power of Attorney for my mother I have a wealth of experience dealing with Building Societies and Banks. At a time of huge family strain, the Market Harborough Building Society has delivered outstanding responsiveness, understanding and empathy in dealing with my requests. I would like to congratulate them on their performance. Phone calls are a delight and always efficient. Rachael and Emma are always so helpful.",
      "rating": 5,
      "date": "25th September 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "friendly atmosphere",
      "text": "There is a very friendly atmosphere as soon as you walk into the Branch. The staff were very polite and helpful both to me and other customers. My first time in the Branch and very impressed. Lorraine served me and explained everything I needed to know to open my account.",
      "rating": 5,
      "date": "19th September 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Visited the branch in Market Harborough…",
      "text": "Visited the branch in Market Harborough today , I was served immediately by two lovely ladies \nClaire Reedman&Jen Zemlin , what great service, even though they should have been closed . \nWe even had a laugh , chatting, if only customer service was like that everywhere !!⭐️⭐️⭐️⭐️⭐️",
      "rating": 5,
      "date": "17th September 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Closing my account made easy.…",
      "text": "The friendliness and efficiency of the staff (Amelia and unknown agent) which made closing my account so easy.  If the Society ever open a branch in Lincoln I will immediately open another account. I've only closed this one because Lincoln is not near enough to Market Harborough.",
      "rating": 5,
      "date": "8th September 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Extremely helpful",
      "text": "Extremely helpful, from initial phone call (swiftly answered) to appointment with Charlie to sort out my uncle's accounts. Very impressed, thinking about opening account with them",
      "rating": 5,
      "date": "8th September 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "I wanted to open a Kickstarter savings…",
      "text": "I wanted to open a Kickstarter savings account for each of my children so I enquired at the Kettering branch. Lorraine and the team were so helpful with everything and my children were entertained with some drawing and colouring. Brilliant service!",
      "rating": 5,
      "date": "8th September 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Information on savings accounts",
      "text": "Very helpful in everything I asked",
      "rating": 5,
      "date": "6th September 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Excellent service, with friendly and efficient manner",
      "text": "I recently visited your Harborough branch to get some cash from a little used account \nThe staff member was very friendly, helpful and efficient\nShe brought all of my details up to date without hesitation and fuss",
      "rating": 5,
      "date": "5th September 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "The staff were very friendly and…",
      "text": "The staff were very friendly and helpful.",
      "rating": 5,
      "date": "3rd September 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Overall Service Provision",
      "text": "Because you have restricted opening hours at the branch, many people need your service first thing on a Monday after the weekend.  With discussions of bond offers taking place with tellers (rather than at appointments in a private space) waiting time for simple transactions (e.g. paying money in/cash out) takes a long time).  I also do NOT like money being counted out loud when it is handed over, so others can hear how much you are receiving.  It is clumsy business practice and lacks confidentiality.",
      "rating": 4,
      "date": "3rd September 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "My wife recently passed away and I went…",
      "text": "My wife recently passed away and I went to the Kettering branch to change the account, the cashier who dealt with me was really kind and understanding she spent the time to explain and asked if I was ok, I just wish I made a note of her name.",
      "rating": 5,
      "date": "3rd September 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Mhbs",
      "text": "Happy with service provided",
      "rating": 5,
      "date": "3rd September 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Very helpful one to one customer…",
      "text": "Very helpful one to one customer experience",
      "rating": 5,
      "date": "3rd September 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Friendly yet professional",
      "text": "I am always greeted in a friendly yet professional manner.\nInformation is given in an easy to understand way.",
      "rating": 5,
      "date": "3rd September 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Helpful staff who do what you ask",
      "text": "Helpful staff who do what you ask",
      "rating": 5,
      "date": "3rd September 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Just a helpful service that made me…",
      "text": "Just a helpful service that made me feel valued and staff clearly wanted to support any financial decision I was making",
      "rating": 5,
      "date": "3rd September 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Easy to set up account",
      "text": "Very easy to set up an account.  I could't get my bank to verify the receiving bank details, however t he suggestion on the website to initially send just £1 was a good one, which I did.  This went through successfully so I was then able to send the balance of my investment without worries.",
      "rating": 5,
      "date": "3rd September 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "The lady who served me was most helpful…",
      "text": "The lady who served me was most helpful and knew exactly how to proceed with an Inheritance Isa.\nThank you.",
      "rating": 5,
      "date": "2nd September 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "OPENING HOURS",
      "text": "Branch needs to extend opening hours to enable customers who work and customers with caring  commitments to visit branch. NatWest’s Kettering branch completely closes 25 October. More hours could attract new customers! Thank you. Graham Hefford.",
      "rating": 5,
      "date": "2nd September 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "The staff at the Desborough branch are…",
      "text": "The staff at the Desborough branch are always very approachable and extremely helpful. \nThey’re always on hand to sort out any problems you may have. \nLinda and Richard Male",
      "rating": 5,
      "date": "28th August 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "A good experience",
      "text": "Good interest rates and when I phoned with a couple of queries the lady I spoke to was extremely helpful.  How a building society should be - good customer service.",
      "rating": 5,
      "date": "26th August 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "This is one company you call and you…",
      "text": "This is one company you call and you always get to speak to a human … always helpful polite and kind!",
      "rating": 5,
      "date": "20th August 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Went to Kettering branch this morning…",
      "text": "Went to Kettering branch this morning and was dealt with by Lorraine , really looked after us well very professional and friendly",
      "rating": 5,
      "date": "19th August 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Hannah was friendly",
      "text": "Hannah was friendly, helpful and efficient in assisting my elderly parents consolidate several accounts held by them into two new accounts and maximising the return on their investment. She explained things simply and clearly.",
      "rating": 4,
      "date": "19th August 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Delightful and very helpful staff",
      "text": "Delightful and very helpful staff.  Opening a new account was simplicity itself.",
      "rating": 5,
      "date": "19th August 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Tim smith",
      "text": "Hi \nI went into the Market Harborough building society to use the one bank for all my change great bit of kit they have and free to use for anyone and very friendly staff thank you for your help",
      "rating": 5,
      "date": "13th August 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Set up a new savings account recently…",
      "text": "Set up a new savings account recently with Claire Reedman\nShe was fantastic the fact I went in 10 mins before closing time was no bother and no question was a stupid question\nMade me feel at home from start to finish and was super professional throughout \nThank you",
      "rating": 5,
      "date": "12th August 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Kettering Branch and Elvira",
      "text": "I was seen by Elvira at your Kettering Branch today.I enquired about a fixed rate Bond, and she guided me through the process with great patience and confidence. It was a very pleasant experience to deal with her, and I would recommend your Society to everyone!Thank You.",
      "rating": 5,
      "date": "11th August 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Good Service though disappointing communication",
      "text": "Overall, the experience was a positive one, and I would have given it a 5 rating, except that, to my surprise and disappointment, my interest payments stopped before the date I expected them to stop. \n`it seemed I didn't understand that I was investing in a specific bond that had already been released for two months prior to my interest in it, and that it said so on the promotion. But in that case, why was my investment for 2 years accepted if it wasn't going to run for two years, but only 22 months? \n\nI have investments elsewhere which guided my actions, running for exactly the time I required. I didn't realise this was a specific product I had taken. \n\nPersonally, once I had selected the time span, I would have done with seeing some kind of alert that told me that it would only run for 22 months, which then allowed me the option to change it. \n\nOn top of that, the agent who was explaining today what happened to me kept telling me, often and condescendingly, that I should read everything carefully before I sign it! I was primarily focused on the time frame and the amount of interest at the time, and did not expect to be investing in anything that did not conform to the TWO years I selected.\n\nI think all that is a pity because i did enjoy your service. I thought it was very professional, payments prompt, and well worth doing. It is just a shame that it did not end as I expected because, for me, it was silly to be allowed to invest in a product for 2 years when it didn't have two years left on it. \n\nWhat if there was only a year left on the bond? Would I still be able to invest in it for two years, while actually getting no interest for a year? \n\nI hope what I am saying is making sense, but this is not what I expected from a high street investment organisation, for Market Harborough to be getting the benefit of my money at the moment until October without me having any interest at all. \nThat just doesn't seem right.",
      "rating": 3,
      "date": "8th August 2025",
      "product": "General",
      "sentiment": "neutral",
      "source": "trustpilot"
    },
    {
      "title": "Very quick and efficient (and amusing) resolution.",
      "text": "I managed to make a mess of the online system through my own carelessness. The phone support was great and we resolved the issue. It did require a letter to posted out but as it was time critical I went into branch. Matter resolved through to completion in a very efficient manner...and much humour. Very happy with all dealings.",
      "rating": 5,
      "date": "5th August 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Interest payment dates",
      "text": "I wanted to change the date that I received interest payments to mid-month which would stop the confusion I had as to whether or not I'd received interest payments.",
      "rating": 3,
      "date": "4th August 2025",
      "product": "General",
      "sentiment": "neutral",
      "source": "trustpilot"
    },
    {
      "title": "I failed the security process despite…",
      "text": "I failed the security process despite typing in the correct code 3 times. I was then asked questions like who is your hero and 2 other randoms, I failed this too. Phoned you and you don’t open weekends. There was no option to reset my passcode. Whilst I understand the need for stringent security processes yours is overly so.",
      "rating": 1,
      "date": "4th August 2025",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    },
    {
      "title": "Friendly and efficient building soceity",
      "text": "The staff were friendly and efficient, and nothing seemed to faze them.  A friendly",
      "rating": 5,
      "date": "3rd August 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Everything was very simple to complete, however",
      "text": "Everything was very simple to complete, however the only think that I am unhappy with is that I have never received written confirmation in the post. Something which all my other financial companies do.",
      "rating": 4,
      "date": "3rd August 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "All staff are friendly and helpful",
      "text": "All staff are friendly and helpful",
      "rating": 5,
      "date": "3rd August 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Very helpful and competent support department",
      "text": "The lady i spoke to about my account maturity was very helpful and answered my concerns.  I have now received the first interest payment to my bank account,  so I know that it was all set up as I wanted.",
      "rating": 5,
      "date": "3rd August 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "In the days of multiple bank closures…",
      "text": "In the days of multiple bank closures it is great to have somewhere to actually carry out deposits etc.",
      "rating": 5,
      "date": "3rd August 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Very helpful",
      "text": "Very helpful \nAnd made it easy to open account",
      "rating": 5,
      "date": "2nd January 2026",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Great Service",
      "text": "They staff at the Desborough branch are fantastic, always service with a smile.",
      "rating": 5,
      "date": "17th December 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Great service",
      "text": "Lady who dealt with us was very good and helpful. Knowledgeable and patient.",
      "rating": 5,
      "date": "1st December 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Excellent customer service",
      "text": "Excellent customer service",
      "rating": 5,
      "date": "1st December 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Laura at the Kettering branch",
      "text": "Laura at the Kettering branch . Knowledgeable and pleasant.",
      "rating": 5,
      "date": "28th November 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Great Service",
      "text": "New to Market Harborough and not a fan of faceless on line banking. Walked into branch with no appointment and was able to see Jenni straight away.\nShe talked me through my requirements and set up the necessary there and then just as it should be.\nPersonal banking the way it used to be many thanks Jenni and MHBS",
      "rating": 5,
      "date": "21st November 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Helpful",
      "text": "Lorraine was very helpful and thorough with my mums complicated questions. We had tried to use the online service but it wouldn’t let us. Lorraine went through everything step by step until we were satisfied.",
      "rating": 5,
      "date": "7th November 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Really helpful staff member",
      "text": "Really helpful staff member",
      "rating": 5,
      "date": "10th October 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Excellent service",
      "text": "I went into the Market Harborough branch to deposit money in my regular saver, the service was first class as always.\nAfter I had completed the transaction I was made aware of a new offering enabling me to open another account,given that the interest rate was very competitive I jumped at the opportunity. \nI was served by Claire Reedman who was very knowledgeable and processed my application in a friendly and professional manner.",
      "rating": 5,
      "date": "1st October 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Exceptional Service and got straight…",
      "text": "Exceptional Service and got straight through on the phone to a real person.",
      "rating": 5,
      "date": "1st October 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "New Account",
      "text": "Rachel was helpful, professional and friendly when dealing with my queries. Everything was fully explained and the whole process was straightforward.",
      "rating": 5,
      "date": "1st October 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Excellent service",
      "text": "Excellent service by telephone and branch staff. Jay (in branch) was welcoming, attentive and very knowledgeable. Will definitely recommend MHBS. Thank you.",
      "rating": 5,
      "date": "24th September 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Very helpful",
      "text": "Very helpful, friendly counter staff helped me open an ISA after my bond had matured with part of the funds",
      "rating": 5,
      "date": "4th September 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Excellent service",
      "text": "Prompt, friendly service. Aways staff available to talk to and help.",
      "rating": 5,
      "date": "3rd September 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Thanks for great service at Market Harborough Branch",
      "text": "I visited the branch in Market Harborough and was served by a really kind, friendly and welcoming lady. She was highly competent and I was able to open the savings account I wanted with ease.   Many thanks for a positive experience.",
      "rating": 5,
      "date": "29th August 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Market Harborough Building Society are…",
      "text": "Market Harborough Building Society are brilliant.  Everyone is so friendly and helpful, nothing is too much trouble and you always feel like a valued, important customer.  Many varied accounts to choose from too.",
      "rating": 5,
      "date": "14th August 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Excellent",
      "text": "Excellent - no fuss.  Much better than some of the other banks.",
      "rating": 5,
      "date": "14th August 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Excellent customer service",
      "text": "Thank you Chrissie at the Kibworth branch of the MHBS for your excellent customer service.\nYou were knowledgeable, professional and very patient when explaining the various products and options available to me. Thank you again.",
      "rating": 5,
      "date": "5th August 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Excellent Service",
      "text": "Wow, this is how banking used to be ( and should still be ) !\nExcellent assistance from Hannah who helped us with all our queries in a professional and friendly manner.\nMade the visit very easy, thank you for your great valued assistance .\nStrongly recommend",
      "rating": 5,
      "date": "5th August 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Excellent service",
      "text": "Excellent service. Advised me on higher interest rate options without any pressure, and dealt with my application in a quick and informative manner.",
      "rating": 5,
      "date": "4th August 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Staff",
      "text": "Extremely friendly, helpful and professional staff.",
      "rating": 5,
      "date": "3rd August 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    }
  ],
  "trustpilotUrl": "https://uk.trustpilot.com/review/www.mhbs.co.uk"
}