{
  "society": "Marsden Building Society",
  "slug": "marsden-building-society",
  "smpUrl": "https://smartmoneypeople.com/marsden-building-society-reviews/products",
  "totalReviewsOnSMP": 4785,
  "avgRating": 4.62,
  "scrapedAt": "2026-02-06T15:52:47.455994+00:00",
  "reviews": [
    {
      "title": "In branch service review",
      "text": "Friendly, helpful and well informed staff.",
      "rating": 5,
      "date": "19th September 2025",
      "product": "Insurance",
      "sentiment": "positive"
    },
    {
      "title": "Good customer relations.",
      "text": "Good customer relations. Understanding needs and meeting them..",
      "rating": 5,
      "date": "28th February 2025",
      "product": "Insurance",
      "sentiment": "positive"
    },
    {
      "title": "Marsden Building Society Branch Review",
      "text": "Always really helpful and everything explained really well.",
      "rating": 5,
      "date": "31st January 2024",
      "product": "Insurance",
      "sentiment": "positive"
    },
    {
      "title": "Everything about our experience has been excellent a...",
      "text": "Everything about our experience has been excellent and straightforward and cannot fault it in any way.",
      "rating": 5,
      "date": "3rd February 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Smooth personable and prompt service",
      "text": "The experience was smooth from beginning to end and helped us move to our final home and took account of our financial circumstances. Personal service excellent and we always got through to someone to help, and they promptly acted upon our requests. Would highly recommend.",
      "rating": 5,
      "date": "2nd February 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "My mortgage was done through an advisor.",
      "text": "My mortgage was done through an advisor. It was all very straightforward and direct communications with MBS very good. I’m not sure how competitive they are but went with my advisors recommendation. When repaying, they were helpful and again the transaction was straightforward",
      "rating": 5,
      "date": "2nd February 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "A good experience, but could have been better.",
      "text": "Somewhat long drawn out, but a simple enough process with everything explained clearly. Time scale went on too long and could have done with being as little shorter.",
      "rating": 5,
      "date": "29th January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Prompt and efficient service.",
      "text": "Prompt and efficient service. Thank you",
      "rating": 5,
      "date": "16th January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "This was a terrible application process.",
      "text": "This was a terrible application process. So many inaccuracies (lies even), errors on info provided by The Marden, over 4.5 months process and abysmal communication.",
      "rating": 2,
      "date": "5th January 2026",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "Very positive but took a long time to process.",
      "text": "Very positive but took a long time to process.",
      "rating": 4,
      "date": "23rd December 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Clear information, quick to respond.",
      "text": "Clear information, quick to respond. A genuine pleasure to deal with.",
      "rating": 5,
      "date": "26th November 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Marsden Building Society Superb Service",
      "text": "Dealing with everyone at the Marsden Building Society has been a dream! We've switched product with them and everything was so simple and hassle free. Well done to everyone involved",
      "rating": 5,
      "date": "17th November 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Interest Only Mortgage for a Retired Couple",
      "text": "We required a relatively small mortgage a) due to buying a new home - down sizing and b) we are both retired. Mansfield was approached by my Financial Adviser who obtained a mortgage offer in principle. once all the necessary documents requested were supplied Mansfield proceeded to evaluate our application further. Although this aspect did seem to take time to be verified we were eventually formally offered the mortgage we were seeking. As a retired couple we were able to secure an Interest Only Mortgage over 20 years. We are also able to make annual 5% over payments annually. We are now just waiting for our property to be completed by the builder before we activate our relatively small martgage, thanks to Marsden Building Society",
      "rating": 5,
      "date": "11th November 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Single point of contact and easy communication.",
      "text": "Single point of contact and easy communication.",
      "rating": 5,
      "date": "5th November 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very approachable staff members.",
      "text": "Very approachable staff members.",
      "rating": 5,
      "date": "4th November 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Competitive but slow",
      "text": "The rates offered were very competitive but the process of applying was very slow. They constantly asked for more information and documentation rather than requesting everything upfront.",
      "rating": 3,
      "date": "2nd October 2025",
      "product": "Mortgages",
      "sentiment": "mixed"
    },
    {
      "title": "Very supportive and efficient process",
      "text": "The adviser was excellent. Attentive and clear, patient and supportive. Totally reliable regarding call times. Although the process was quite exhaustive, it all went smoothly as she was so good.",
      "rating": 5,
      "date": "30th June 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Pressured into more disadvantageous deal",
      "text": "Up till now i have felt fairly treated but with this process i have felt pressurized into accepting an expensive deal because the alternative was to face a doubling of my monthly repayments .But my premier concern is that in a world of falling rates mine has gone up by a £100 plus a month. I am forced into a new fixed rate with penalties if i wish to repay early despite not having been given much time to look at alternatives this has forced me to abandon equity release because of the swingeing penalties involved with repayment for another 2 years.",
      "rating": 3,
      "date": "13th June 2025",
      "product": "Mortgages",
      "sentiment": "mixed"
    },
    {
      "title": "Excellent customer service",
      "text": "Excellent customer service from all departments we dealt with. Very efficent and prompt in handling queries and responding clearly and effectively . We have no hesitation in recommending Marsden and its producs,but most of all its customer service.",
      "rating": 5,
      "date": "14th May 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Review of service re mortgage offer",
      "text": "I waited a long time to receive my mortgage offer and emails were not replied to. I feel that this part of customer service could be improved upon",
      "rating": 3,
      "date": "9th May 2025",
      "product": "Mortgages",
      "sentiment": "mixed"
    },
    {
      "title": "We arranged a mortgage with the Marsden when we were...",
      "text": "We arranged a mortgage with the Marsden when we were based overseas and they were the only mortgage company we found that would lend to us. The mortgage setup and renewal was easy and stress free, and whenever we had to contact them we found their customer service to be excellent: they were invariably polite, informative and helpful.",
      "rating": 5,
      "date": "1st May 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Overall, very good indeed.",
      "text": "Overall, very good indeed. There were some early issues with duplication of communication, but this settled. Due to some difficult family circumstances and delays in selling other properties, I was not able to complete my end of term mortgage payments on time. Whilst not delighted of course, the Marsden did bear with me for an unexpectedly lengthy period, I paid off my mortgage and all was well in the end. As someone who is never normally in debt, I sincerely appreciate their forbearance.",
      "rating": 4,
      "date": "23rd April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Please simplify the document sharing process",
      "text": "For previous mortgages we used a financial adviser who sorted all our financial documents and ID checks within 3 hours for each mortgage. The process with Marsden has involved 4 different bodies (L&C, LMS, Gorvins and Marsden) who have asked us for almost the same information and ID checks. We would expect Marsden to simplify this process by sharing customer documents with all supporting organisations. We have spent at least 2-3 weeks in real time gathering and forwarding thie necessary details to each of these.",
      "rating": 3,
      "date": "21st March 2025",
      "product": "Mortgages",
      "sentiment": "mixed"
    },
    {
      "title": "Ran smoothly from start to finish!",
      "text": "Ran smoothly from start to finish!",
      "rating": 5,
      "date": "4th February 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Mortgage for Expats",
      "text": "In 2020 Marsden were one of the few UK lenders willing to offer mortgages to Expats, who were looking to re-purchase a home in the UK (which became a necessity post Brexit). Rates were competitive and lending criteria was sensible.",
      "rating": 5,
      "date": "3rd February 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Good products and helpful, responsive staff.",
      "text": "Very good products and helpful, responsive staff have made all the difference in choosing our mortgage with the Marsden BS.",
      "rating": 4,
      "date": "3rd February 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "We had difficulty getting a mortgage five years ago...",
      "text": "We had difficulty getting a mortgage five years ago when I was 75 years old, but the Marsden came to our rescue. Their customer service has been speedy, helpful and flexible when needed.",
      "rating": 5,
      "date": "30th January 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Have a fixed interest rate mortgage which is very co...",
      "text": "Have a fixed interest rate mortgage which is very competitive. Giving regular updates and notifications",
      "rating": 5,
      "date": "29th January 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "The Marsden team give you good options.",
      "text": "The Marsden are very good at giving one to one personal customer service. Their staff remember your name and circumstances. The product offered to us was perfect for our situation and was at a good interest rate too!",
      "rating": 5,
      "date": "28th January 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Just the mortgage I needed.",
      "text": "Just the mortgage I needed. I'm retired and needed an interest only mortgage which very few mortgage providers offer,",
      "rating": 5,
      "date": "28th January 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Amazingly personal experience from start to finish o...",
      "text": "Amazingly personal experience from start to finish of applying for and then renewing mortgage products. Extremely rare in this age of automation. I spoke to and corresponded with individuals at every step who made things easy and accessible. made me feel like I was being personally supported.",
      "rating": 5,
      "date": "28th January 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Brilliant.",
      "text": "Brilliant. As an overseas customer these guys have been brilliant in sorting new mortgage products.",
      "rating": 5,
      "date": "27th January 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Mortgage application was agreed quickly.",
      "text": "Mortgage application was agreed quickly. Since taking out the mortgage 3 years ago I can always get through quickly to the right person and he /she has always been able to help me.",
      "rating": 5,
      "date": "27th January 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Fantastic mortgage provider and amazing team.",
      "text": "Fantastic mortgage provider and amazing team.",
      "rating": 5,
      "date": "27th January 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Knowledgeable and supportive people who provide outs...",
      "text": "Knowledgeable and supportive people who provide outstanding products that meet my needs",
      "rating": 5,
      "date": "27th January 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "The underwriting team is very fast and responsive, a...",
      "text": "The underwriting team is very fast and responsive, always providing clarity on exactly what is required to progress to offer stage",
      "rating": 5,
      "date": "27th January 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent overall!",
      "text": "They provide an excellent service for retired couples who need a small mortgage. Thank you Marsden!",
      "rating": 5,
      "date": "27th January 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Expat buy to let mortgages",
      "text": "Arranging an expat buy to let mortgage and then remortgaging after the initial fixed period was made easier by the team at Marsden, would highly recommend them. They have been responsive to emails ( as the time difference was 8 hours for much of the year) and proactive when needed.",
      "rating": 5,
      "date": "27th January 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Extremely helpful",
      "text": "Extremely helpful and continues to be informative and easy to understand.",
      "rating": 5,
      "date": "27th January 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "4.% discount with Marsden!",
      "text": "We’ve had two mortgages with Marsden for many years. Their customer service guided us through re-mortgaging 3 times each time lending us at the best possible rate. Currently we’re on fixed rates, with 4% discount, of only 5..19%! Say no more.",
      "rating": 5,
      "date": "27th January 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Borrowed money for car purchase and received cheques...",
      "text": "Borrowed money for car purchase and received cheques within days.Proffesional service throughout .",
      "rating": 5,
      "date": "27th January 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Marsden are the best!",
      "text": "I live in France and they have been super helping me with my buys to lets in the UK! So efficient!",
      "rating": 5,
      "date": "27th January 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Professional Honest Service Great Support",
      "text": "Professional honest service with great support from the outset. Really easy to deal with just make sure you have all you papers in order and you will fly through.",
      "rating": 5,
      "date": "27th January 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Marsden has been a great expat BTL lender overall.",
      "text": "Marsden has been a great expat BTL lender overall. Excellent customer service with prompt and comprehensive responses. The only upgrade that is urgently needed is online access to mortgage accounts.",
      "rating": 5,
      "date": "7th January 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Building confidence",
      "text": "Polite very professionals and easy to work with . Consistency inspire confidence.",
      "rating": 5,
      "date": "5th November 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "No worries",
      "text": "No worries all sorted in fare time.",
      "rating": 4,
      "date": "30th October 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Marsden mortgage experience: Stress free",
      "text": "Marsden are professional and made the mortgage process stress free. Knew where we were every step of the way. An excellent experience.",
      "rating": 5,
      "date": "22nd September 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Daniel Morley the underwriter has been first class.",
      "text": "Daniel Morley the underwriter has been first class. flexible, excellent communication, and ability to move quickly for this urgent case.",
      "rating": 5,
      "date": "2nd September 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "My experience dealing with Marsden was absolutely ou...",
      "text": "My experience dealing with Marsden was absolutely outstanding and super efficient.",
      "rating": 5,
      "date": "8th August 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great staff",
      "text": "Sahdiya our mortgage advisor was so helpful and kept us informed as we moved through the process. We were passed on to Emily and again we were dealt with politeness etc.",
      "rating": 5,
      "date": "30th May 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Until now I hadn't even heard of Marsden BS.",
      "text": "Until now I hadn't even heard of Marsden BS. My Financial Advisor had previously used Marsden and suggested we look at their products. Our situation is quite unique as we are both in our 60's and needed an interest only re-mortgage. All the team at Marsden have been so polite, professional and very prompt with all correspondence.",
      "rating": 5,
      "date": "17th May 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Overall satisfactory but communication was poor / li...",
      "text": "Overall satisfactory but communication was poor / limited, the adviser portal is very limited and kept timing out which is frustrating",
      "rating": 4,
      "date": "16th April 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent prompt communications, very professional b...",
      "text": "Excellent prompt communications, very professional but friendly and helpful",
      "rating": 5,
      "date": "8th April 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Marsden Building Society",
      "text": "Friendly and professional Branch staff.",
      "rating": 5,
      "date": "14th March 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great customer support, easy to understand where we...",
      "text": "Great customer support, easy to understand where we are and plan for the future. The staff are always very friendly and welcoming in our lovely local branch (and nice to actually have a physical branch to attend!)",
      "rating": 5,
      "date": "14th March 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Brilliant customer service",
      "text": "Excellent customer service and it was refreshing being able to speak to knowledgeable, helpful staff promptly over the telephone. They were very courteous and put you at ease about queries and concerns.",
      "rating": 5,
      "date": "1st March 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "I started my mortgage with Marsden back in 2017 and...",
      "text": "I started my mortgage with Marsden back in 2017 and have had good experience since then. Switching and correspondence were always very easy.",
      "rating": 5,
      "date": "29th February 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "The existing Mortgage rate switch is fast & efficient.",
      "text": "The existing Mortgage rate switch is fast & efficient. Any calls to the Marsden are always answered quickly and with clear and friendly advice.",
      "rating": 5,
      "date": "21st February 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great customer service",
      "text": "My aunt had a mortgage with Marsden and sadly following a diagnosis with early onset dementia she had to move into a care home. I was able to manage her account through a dedicated support person and registering the power of attorney and managing the redemption following the sale was made so simple. I am so grateful to Wendy for her support at a really difficult time and praise their customer service.",
      "rating": 5,
      "date": "13th February 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent service",
      "text": "Very quick and efficient and keep you informed every step of the way.",
      "rating": 5,
      "date": "5th December 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Mortgage application for over 65yrs old",
      "text": "Exceptional service, kind and very thorough. There is a life for people over 65. I can't thank Marsden Building Society and every one who was involved",
      "rating": 5,
      "date": "30th November 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Final stages of taking a holiday let mortgage with Marsden BS - most frustrating and laborious re-mortgage ever!",
      "text": "Started the (should have been) straight forward re-mortgage four months ago. It's a very ordinary terraced house in a decent area worth £400k borrowing £165k so not a particularly high-risk proposition. Honestly the number of questions and emails has taken literally days of my time to sort out. Just as you think it's over they start all over again with pointless questions that really do not affect their risk profile one bit. It's almost like they don't want to lend. If it wasn't for the fact that my current deal is almost up and I'd have to start the process again elsewhere, I would have have cancelled the application a few weeks ago. I just hope we can get it over the line in the next few days. But in all honesty - never again with Marsdens. I would recommend people seriously think twice before using Marsdens for a holiday let.",
      "rating": 1,
      "date": "21st November 2023",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "Review by mortgage customer",
      "text": "I recently remortgaged from another lender to Marsden. The process was straightforward and quick. I would like to particularly express my thanks to Sahdiya Ahmed and Kathy Tansey for their support and professionalism during the process. I would definitely recommend Marsden to friends and family. Thank you!",
      "rating": 5,
      "date": "7th October 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Honestly not a good experience at all",
      "text": "If not for the lack of options, I most probably wouldn't have put up with this. I can only assume that this is your selling tactic? To take so long to give a mortgage offer to the point where sale is about to fall through so that we have no choice but to accept the offer if we want to proceed with the sale? Also, you're so uncontactable, you say feel free to contact us, but there's never any number you can call to get someone on the phone to really answer my questions - instead be stuck in queue on a general hotline to then be told \"we'll have someone get back to you\" or \"call you back\" with no avail (the least they could do while we've been waiting monthS for the offer). Then now that I HAVE the offer, you would have thought it would be a simple sign, scan and email process? NO, please use adobe sign... sure, lets see the instructions... is signing by mouse on computer sufficient? or do I also need the digital signature? doesn't say. I've just submitted it, lets hope it doesn't take another month for them to tell me apologies but you should only use one method, please sign again and then for me to submit another signed copy and wait for another month for it to process. As if life wasn't hard enough as it is, this whole process was an additional needless anxiety that could potentially lose me additional thousands if my property offer falls through. thanks.",
      "rating": 1,
      "date": "28th September 2023",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "Profession Fast Service Despite the Distance and Being Out of Country",
      "text": "This is a very professional company who were able to help me navigate a mortgage application despite working abroad. They were very very quick at replying to all emails and very helpful at every step and thoroughly deserve the 10 of 10. Kirsty who dealt with my application is an asset to the company, she responded within hours to my emails and requests for advice on the process and what documents to send. Very happy with the service and company i would highly recommend.",
      "rating": 5,
      "date": "23rd August 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "It took a long time with repeated questioning",
      "text": "Although everything has turned out OK it has been a rather frustrating process to date",
      "rating": 4,
      "date": "8th August 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very professional",
      "text": "I am very happy with the way handled my application and I am very pleased",
      "rating": 5,
      "date": "2nd August 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "People and service",
      "text": "Over the whole process of gaining a mortgage I was supported by people who listened to what I needed to do. They kept me informed and aware of the next steps. Emily showed a lot of understanding of what I and they had to do in order to secure an offer........working with the Head of Lending they clearly had the experience, understanding and empathy to deal with our mortgage. Thanks",
      "rating": 5,
      "date": "27th July 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Just great service",
      "text": "Not rocket science-just great service-usable systems-friendly staff-5*",
      "rating": 5,
      "date": "24th July 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Professional and straightforward",
      "text": "Everything was clear and I'm happy with the product and services. Recommendations would depend on what my friends/family are looking for.",
      "rating": 5,
      "date": "9th June 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Slow response and harsh and unclear requirements to borrower.",
      "text": "I do not expect the such long application time as I was told that the application may take around 8 weeks only. I was told to do the extra inspection for the chimney and roof but I couldn't be told to find the appointed legal inspector. It made me take a very long time to settle the issue. As a oversea buyer, I expected to have more explanation from lender to avoid the late approval time. I had to take the risk of pulling out the offer by vendor due to the long application time. My application was issued in Nov 2022, it's not yet completed until May 2023. Frankly, it's not a good experience to a first time buyer.",
      "rating": 3,
      "date": "19th May 2023",
      "product": "Mortgages",
      "sentiment": "mixed"
    },
    {
      "title": "Retirement mortgage",
      "text": "Marsden building society have been very helpful and patient with us. They talked us through every step. Made the process easy, we are not good with computers but we did this, with their help. Very friendly and helpful staff ,I would recommend them.",
      "rating": 5,
      "date": "19th May 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Mortgage application",
      "text": "To date our mortgage application has approved promptly with all associated documentation and legal work being explained and undertaken accurately clearly and concisely. What is there not to like!",
      "rating": 5,
      "date": "11th April 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "To date everything has been done efficiently and with little fuss. Great customer service.",
      "text": "Although we used a mortgage broker in this instance we found the process to be pretty straightforward and any paperwork / documentation requested by Marsden was acted upon promptly and efficiently. Everything seems to be well organised and and efficient.",
      "rating": 5,
      "date": "3rd April 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Our Re-Mortgage",
      "text": "From the time we spoke to our excellent Mortgage Adviser to the new mortgage being offered, the experience has been very satisfactory in all respects. The Marsden offer meets our needs and gives us peace of mind for the future. The transaction was handled very professionally, and we felt that there was personal care and attention given at each stage.",
      "rating": 5,
      "date": "27th March 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Straightforward and efficient",
      "text": "Faultless convenient process to arrange new mortgage. Helpful staff, timely reply to emails.",
      "rating": 5,
      "date": "16th March 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Absolute Superstars",
      "text": "They gave by far the best rates and considered my case individually. Highly recommended.",
      "rating": 5,
      "date": "9th March 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent service throughout",
      "text": "From first starting a mortgage process a few years ago up to moving house porting and increasing that mortgage we have been totally impressed. We have dealt with individuals by phone or email who we almost feel we know! They have been regular contact points, quick to respond at any point, friendly and helpful and we cannot fault ant of them. The flexibility, support and helpfulness from all at The Marsden has been very much appreciated and we have no hesitation whatsoever in recommending them.",
      "rating": 5,
      "date": "24th February 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Mortgage Offer",
      "text": "A very prompt, efficient and professional service from start to finish. Thoroughly recommend their services.",
      "rating": 5,
      "date": "22nd November 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Marsden delays resulted in my having to pay more for my mortgage",
      "text": "My mortgage came up for renenwal recently and I tried to get a comparison of the options available for 2 weeks without success. Marsden did not respond to my emails and it was made more difficult because i was overseas. By the time they returned my message the variable rate option i wanted to take was no longer available so I ended up paying more for my mortgage, and they would no take responsibility for this.",
      "rating": 2,
      "date": "2nd November 2022",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "Nice people to do business with",
      "text": "The Marsden are extremely transparent in their business dealings. Their communication is excellent and very easy to understand. If only other companies played by the same rules !",
      "rating": 5,
      "date": "14th October 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Avoid like the plague",
      "text": "Made me an offer, which I accepted 3 months ago then when they transferred me to my new mortgage they increased the rate without communicating it to me.",
      "rating": 1,
      "date": "3rd October 2022",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "Very Helpful and easy to communicate with",
      "text": "Good experience, Dan was very helpful and quick to respond Thankyou",
      "rating": 5,
      "date": "23rd September 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great communication",
      "text": "From our first communication with The Marsden Building society we have been kept fully informed regarding our mortgage application's progress at each stage. Very helpful at all times and we would recommend them to anyone looking for a mortgage .",
      "rating": 5,
      "date": "21st September 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Efficient service",
      "text": "Very good. Questions answered promptly. Polite",
      "rating": 5,
      "date": "30th August 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent Service",
      "text": "My interaction with Marsden staff has been very professional and expedient. Great experience thus far",
      "rating": 5,
      "date": "15th June 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great Building Society to deal with",
      "text": "It's been a great experience, as simple as I suppose it could be to apply for a mortgage but what's more important is that we've received a great offer from them.",
      "rating": 5,
      "date": "20th May 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Ultra Satisfied",
      "text": "A very straightforward application experience with no \"left field' demands for additional information/paperwork and a speedy process after the survey undertaken.",
      "rating": 5,
      "date": "11th May 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very fast pace and competitive price.",
      "text": "Marsden make the process of obtaining a mortgage easy. Given the circumstances of being an expat, I thought the process would be difficult. Marsden made the process easy by providing clear instructions and having a great understanding of my circumstances living and working abroad. I highly recommend Marsden building society",
      "rating": 5,
      "date": "5th May 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent, excellent, excellent!",
      "text": "This building society is brilliant. The staff are always very polite and very helpful, no matter how trivial your request. I cannot fault them in any respect. So well done!",
      "rating": 5,
      "date": "1st April 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Kirsty Webster/Reggio case",
      "text": "the whole process was eay and straight forward well done Marsden Building Society and thank you Kirsty",
      "rating": 5,
      "date": "24th March 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Professional service throughout",
      "text": "Excellent service received from both fluent with a brilliant app and the Marsden very professional throughout. Thank you.",
      "rating": 5,
      "date": "18th March 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Fantastic",
      "text": "We have renewed our mortgage on several occasions with The Marsden. On each occasion their product offering has been the cheapest - we always shop around. The whole process is really straight forward and simple. Added to this their levels of customer service are fantastic. They are one of the best companies it has been our pleasure to deal with. Can’t recommend enough.",
      "rating": 5,
      "date": "9th March 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent",
      "text": "very efficient and professional",
      "rating": 5,
      "date": "1st March 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Offers produced but poor back office organisation",
      "text": "Whilst we received the offer eventually, Marsden's internal communication is such that we would receive updates that weren't correct. No single underwriter deals with a case so we repeatedly received the same request despite answering the same questions repeatedly. the requirement for wet signatures is extremely outdated and I believe Marsden are the only BS to need this nowadays. It is poor security and leads to delays as it did on this case. We find that whilst Marsden do eventually produce an offer, and are therefore reliable. Every application takes such an unpredictable pat once submitted that it's extremely hard to keep the client properly informed of progress.",
      "rating": 2,
      "date": "18th February 2022",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "Professional and Efficient",
      "text": "Excellent, professional and timely service from all at Marsden Building Society.",
      "rating": 5,
      "date": "18th January 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent processing speed of mortgage application",
      "text": "Excellent speed of processing/allocation of Conveyancing Team .. all staff members have been courteous/helpful with nothing being too much trouble for them .. as much as possible completed electronically (which is great for full time worker) I will recommend Marsden Group in the future to family/friends/anyone in need of mortgage .. thank you Marsden Group",
      "rating": 5,
      "date": "10th January 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Ex-Pat",
      "text": "We were having trouble finding a mortgage due to the fact one of us now works out of the country a lot and is classed as ex-pat. Marsden asked a lot of questions and needed a lot of paperwork but they were able to give us a mortgage. It just shows that when a lender actually looks at a risk and thinks pragmatically about it, then can sweep up more business! They were great. And we are thankful they do look at non standard risks.",
      "rating": 5,
      "date": "25th October 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "ADMINISTRATIVE EFFICIENCY",
      "text": "The product is competitive. The clerical systems are clear. Any staff I dealt obviously knew what they were talking about. Thanks",
      "rating": 5,
      "date": "24th September 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Mmmmmm",
      "text": "`Porting' a mortgage is not what it seems and no-one explained what was involved. It is not a simple matter, it is applying for a new mortgage even if it is the same as the old one, and even if the old one is with the Marsden. It is a long and complicated process. It may be the pandemic or just the process itself but it is frustrating. It would be more than helpful if it was explained to customers before the process starts what was going to be needed, then all the figures and paperwork would already be at hand and would cut down on time and phone calls. People in the business are familiar with `porting' but customers are not and more explanations and time for questions are needed. Also the way in which monetary calculations are done by the building society needs to be gone through thoroughly so that the customer understands how the society have reached the figures they present to the customer. More openness please!",
      "rating": 3,
      "date": "15th September 2021",
      "product": "Mortgages",
      "sentiment": "mixed"
    },
    {
      "title": "Excellent servive speedily delivered",
      "text": "The period from application to offer was very swift and the requests for information were very clear. The whole process was much less painful than expected.",
      "rating": 5,
      "date": "27th August 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Mortgage review",
      "text": "Personal attention when making a phone call. Being a mortgage advisor service is key and i happen to have my own mortgage in retirement",
      "rating": 5,
      "date": "30th April 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Overseas Borrower Rates",
      "text": "Glad the Marsden in a BS that will extend a mortgage to ex-pats, but I find it hard to see how the Society can justify the interest rates it charges us. Why oh why are they so much higher than for domestic customers.",
      "rating": 4,
      "date": "27th April 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Job well done",
      "text": "I'm a \"mature\" borrower. The online processes adopted due to Covid constraints were easy to follow. The offer to extend my mortgage was attractive and made me feel valued. Well done Marsden and Thank You!",
      "rating": 5,
      "date": "21st April 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Helpful and responsive",
      "text": "I have dealt with the Marsden a couple of time on the phone and they were very friendly, reassuring and helpful - thank you!",
      "rating": 5,
      "date": "19th April 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "good to deal with",
      "text": "always found the staff friendly and helpful and the mortgage products good",
      "rating": 4,
      "date": "14th April 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Full marks Marsden!",
      "text": "Staff at Marsden have always been very efficient, helpful & courteous in each dealing I’ve had with them over many years.",
      "rating": 5,
      "date": "11th April 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Small is always better",
      "text": "Marsden is one of the few Building Societies which provide mortgages for senior citizens who wish to movehomes in later life. I am very happy with the service I have received from the Society which, because it is relatively small, can provide a more personal service to its customers.",
      "rating": 5,
      "date": "1st April 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Wonderful service following COVID",
      "text": "To be contacted and given a new product has been fabulous, taken the `\"financial pressure\" off after the most difficult year.",
      "rating": 5,
      "date": "31st March 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "SO PLEASED TO HAVE BEEN INTRODUCED",
      "text": "My wife and i were introduced through a mortgage advisor (Berkley Vittoria) and have been impressed with them and yourselves at every step of switching our mortgage. This has eased our immediate financial future and also shown us that we are now in safe hands with excellent communication at every stage even with our most basic queries. Thank you for being there at this interesting time and thank you for the service we have received.",
      "rating": 5,
      "date": "29th March 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "New mortgage",
      "text": "Arranged a new mortgage very competently in trying circumstances.",
      "rating": 4,
      "date": "27th March 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Mr. Robert J. Powell mortgage holder",
      "text": "I have always had a pleasant experience dealing with Marsden Building Society. The service provided by the mortgage team and responses to queries has been consistently professional and of a high standard.",
      "rating": 4,
      "date": "19th March 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Fair and friendly",
      "text": "Received the best rate on our mortgage, and then again when we remortgaged. Very helpful and easy to deal with during the pandemic",
      "rating": 5,
      "date": "18th March 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    }
  ]
}