{
  "society": "Melton Building Society",
  "slug": "melton-mowbray-building-society",
  "smpUrl": "https://smartmoneypeople.com/melton-mowbray-building-society-reviews/products",
  "totalReviewsOnSMP": 2742,
  "avgRating": 4.66,
  "scrapedAt": "2026-02-06T15:54:46.378686+00:00",
  "reviews": [
    {
      "title": "Amazing service",
      "text": "They were all so helpful and friendly",
      "rating": 5,
      "date": "21st March 2022",
      "product": "Financial Planning",
      "sentiment": "positive"
    },
    {
      "title": "In branch service review",
      "text": "I like how quickly you answer the phone and resolve our issue, I am new to the Society so haven't had a huge amount of involvement.",
      "rating": 5,
      "date": "12th March 2024",
      "product": "Insurance",
      "sentiment": "positive"
    },
    {
      "title": "Highly recommended",
      "text": "Outstanding service. Our case wasn't straightforward and Laura was thorough and extremely helpful throughout the process. In a world where good customer service is becoming increasingly rare, it has been a please and a relief to deal with an organisation that genuinely cares about the customer experience. I would give them 10 stars if I could!",
      "rating": 5,
      "date": "25th January 2026",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Angela was fantastic and helped me a lot.",
      "text": "Angela was fantastic and helped me a lot. She kept me informed with all information and talked me through everything.",
      "rating": 5,
      "date": "22nd January 2026",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Uncaring and unhelpful Building Society",
      "text": "I have my Mortgage with Melton Building Society. Recently my Wife has been diagnosed with early Dementia, she has lost her job and now left the family home and stopped contributing to Mortgage. I have informed Melton of everything along the way and have recently had to reach out to them for help. They acknowledged my situation and said they would get back to me with a resolution quickly as they knew how worried I was about it. A week and a half later they said they couldn’t help and referred me to a Government backed scheme. I tried to contact them 6 times last week and got cut off every time. I left messages and nobody returned them. I feel scared, isolated and depressed. Lots of reviews criticising customer services and unanswered call’s. I will try as hard as I can to maintain mortgage on my own as long as I can, then who knows",
      "rating": 1,
      "date": "26th November 2025",
      "product": "Independent Mortgage Advice",
      "sentiment": "negative"
    },
    {
      "title": "We’ve had an excellent experience with Melton Mowbray.",
      "text": "We’ve had an excellent experience with Melton Mowbray. The service was brilliant from start to finish — smooth, effective communication and a really supportive team who understood every part of our self-build journey. They met all of our needs and made the whole process feel clear and manageable. If you’re considering a self-build mortgage, we highly recommend choosing Melton. Their expertise and customer care truly stand out",
      "rating": 5,
      "date": "24th November 2025",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Service was 5* start to finish.",
      "text": "Laura exceeded our expectations and went above and beyond to help us search for a mortgage. We originally hired a mortgage broker from a well known Wealth Management company, we weren't satisfied with mortgage rates and what they had offered so decided to pull the offer and go to Laura at Melton Building Society. She understood our urgency as the buyers had accpeted our offer and we were ready to instruct solicitors. She found exactly what we needed not only was it a quick turn around, her communication and updates really helped put us at ease (she even did this in her free time & during her annual leave) it felt like such a stressful time before going to Laura, as with previous delays we were in fear of loosing the home we were so desperate for. She managed turn a negative experience into a positive outcome. We can't thank you enough.",
      "rating": 5,
      "date": "11th November 2025",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Angela Jones fabulous remortgage adviser.",
      "text": "Angela Jones was my remortgage adviser. She was excellent. Great knowledge of the mortgage market; very professional and efficient and a very good communicator. The Melton Building Society software for making the mortgage application was user friendly and easy to use.",
      "rating": 5,
      "date": "7th November 2025",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Angela Review",
      "text": "Ángela was extremely helpful during this entire time. She was extremely professional and thorough with her work and provided me with the best offers.",
      "rating": 5,
      "date": "30th October 2025",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Fantastic service!",
      "text": "We had used a highly regarded wealth management company to search for a Buy to let mortgage to release equity against the property to fund a gifted deposit fir my daughter. She in turn requied a first time buyer mortgage with her partner. We were dissatisfied with the wealth management companies proposals from aspects of interest rates and loan values thzt didn't meet the value of a property my daughter hzd agreed to purchase.I appraached Laura Burrows with our challenges. In two stages Laura found exactly what we were looking for, an increased sum for both ourselves and my daughter and partner at a muchimproved % rate such that we met all criteria and were able to appoint solicitors to proceed with the purchase. We were in danger of losing the property due to delays with the previous wealth management company.. We can't speak highly enough of Laura, her communication, tenacity and hard work (sometimes out of hours or when on annual leave) were without doubt the reason the purchase was enabled. Laura removed all the stress, We can't thank her enough.",
      "rating": 5,
      "date": "27th October 2025",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "MMS review",
      "text": "Our broker at MMS supported us through 2 different mortgage applications. Despite some unusual circumstances they were able to sort the product we wanted. I would like to thank them for pursuing the lender / complaining when we ran into issues regarding our application & solicitors. This commitment to complain enabled us to get the desired product and use our current solicitors.",
      "rating": 4,
      "date": "19th October 2025",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "..Highly recommend",
      "text": "I was very pleased with customer service and received mortgage offer I needed.",
      "rating": 5,
      "date": "7th September 2025",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Laura really put the work in to help us when we had...",
      "text": "Laura really put the work in to help us when we had a very complex case.",
      "rating": 5,
      "date": "20th August 2025",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Angela Jones the mortgage adviser",
      "text": "Angela Jones the mortgage adviser did a very good job for us, handled the whole process of arranging the mortgage and the in branch service was good",
      "rating": 5,
      "date": "12th August 2025",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Angela was very helpful",
      "text": "Angela was very helpful and explained the process in full. She sent me emails and communications on time.",
      "rating": 5,
      "date": "6th August 2025",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Great mortgage provider from the start.",
      "text": "Great mortgage provider from the start. My experience recently has been handled thoroughly.",
      "rating": 5,
      "date": "4th August 2025",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Knowledgeable, helpful, kind",
      "text": "Angela Jones was extremely knowledgeable, helpful and kind throughout the whole process. Our situation was complex from the beginning (PhD stipend) and there were also a few hurdles along the way but Angela was really helpful and patient throughout the whole process. She was always contactable and had time to answer questions. We always felt she was pushing our application forward and saved us a lot of time and stress and gave us access to offers we wouldn’t have been able to get on our own. We would recommend anyone to work with Angela who is looking for a mortgage.",
      "rating": 5,
      "date": "18th July 2025",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Laura has been brilliant for me",
      "text": "Laura has been brilliant for me, really helpful with looking after my needs and requirements and found a very good deal for me, very happy with the whole process",
      "rating": 5,
      "date": "4th June 2025",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Angela Jones 5*!",
      "text": "Angela Jones 5*!!! I'm a first time buyer so I needed some hand holding, Angela was absolutely fantastic. We had issues with our solicitors and estate agent but Angela was our knight in shining armour. She couldn't have done any more for us, would recommend Angela and I'd definitely use her expertise again!",
      "rating": 5,
      "date": "8th May 2025",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Angels Jones provided us with a five star service!",
      "text": "Angela Jones provided us with a five star service. Every step through our self build loan application was explained well and the process was made as simple as possible. Thank you Angela :-)",
      "rating": 5,
      "date": "6th May 2025",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Great service",
      "text": "Very professional and helpful Angela is a credit to your team",
      "rating": 5,
      "date": "25th April 2025",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Extremely helpful and informative.",
      "text": "I spoke with Angela Jones and she made the whole process very simple and straightforward. It’s taken a huge weight off my shoulders knowing that someone knowledgeable is dealing with my needs. Worth every penny as far as I’m concerned.",
      "rating": 5,
      "date": "22nd March 2025",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Amazing!",
      "text": "Angela is the kindest and most professional lady I have spoken to whilst dealing with my mortgage application, she took her time in explaining everything even if I said I understood she went into extra detail to make sure I was fully aware of all the details. I am a first time buyer so this was exactly what I needed.",
      "rating": 5,
      "date": "19th March 2025",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Good customer service, easily contactable,",
      "text": "Good customer service, easily contactable,",
      "rating": 5,
      "date": "28th January 2025",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Generally good experience, responsive, and knowledga...",
      "text": "Generally good experience, responsive, and knowledgable throughout.",
      "rating": 5,
      "date": "24th January 2025",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Thanks Angela",
      "text": "Sorted the mortgage I wanted quickly!",
      "rating": 5,
      "date": "23rd January 2025",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Excellent service!",
      "text": "We had the pleasure of working with Angela, and as first-time homebuyers, we initially thought the mortgage process would be overwhelming. However, Angela made everything incredibly straightforward. She took the time to explain each step in detail, ensuring we fully understood every aspect of the process. Her communication was exceptional—whether through email or phone, she responded promptly and kept us updated every step of the way. Thanks to Angela’s professionalism and dedication, what we thought would be a daunting experience turned out to be seamless and stress-free. We’re so grateful for her support!",
      "rating": 5,
      "date": "8th January 2025",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Very helpful and efficient ,would highly recommend t...",
      "text": "Very helpful and efficient ,would highly recommend to anyone ! Got a offer excepted so quickly we are thrilled",
      "rating": 5,
      "date": "13th December 2024",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Amazing Mortgage Broker",
      "text": "Angela Jones our Mortgage adviser was amazing, she made the process simple and efficient",
      "rating": 5,
      "date": "28th November 2024",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Very impressed with The Melton & Angela in particu...",
      "text": "Very impressed with The Melton and Angela in particular. We had a complicated mortgage application, after trying 6x other advisers we found Angela who was the only person who could resolve our needs. I would fully recommend Angela.",
      "rating": 5,
      "date": "25th November 2024",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Generally good",
      "text": "Generally good, more guidance on expectations for the initial discussion would have been useful as I was not initially aware of all the information and documents I needed to have available which lead to delays and some frustration",
      "rating": 4,
      "date": "31st October 2024",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "I have found working with Angela Jones extremely easy.",
      "text": "I have found working with Angela Jones extremely easy. She has been very approachable and professional throughout the process and answered all my questions and requests without delay. Great knowledge of the industry and requirements.",
      "rating": 5,
      "date": "28th October 2024",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Laura Burrows was fantastic in getting the right mor...",
      "text": "Laura Burrows was fantastic in getting the right mortgage product for us despite numerous other lenders unable to do so, even my own bank couldn’t help. I have been with my Bank for 37yrs however Laura provided much better service and information. Thank you Laura.",
      "rating": 5,
      "date": "21st October 2024",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Laura Burrows is excellent!",
      "text": "Laura Burrows is excellent! She’s helped us navigate 2 mortgage applications (self-build then standard) and has been such a support. Nothing was too much trouble and when we hit a few bumps in the road she was there to expertly guide us. Thank you so much!",
      "rating": 5,
      "date": "10th October 2024",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Angela Green has gone above and beyond to support me...",
      "text": "Angela Green has gone above and beyond to support me with securing a mortgage and insurances. She is efficient, knowledgeable and professional as well as being personable. Most importantly I felt confident with the service.",
      "rating": 5,
      "date": "30th September 2024",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Thank you Laura",
      "text": "Laura was efficient, knowledgeable, we received our mortgage offer quickly and we are really pleased with the outcome. Thank you Laura.",
      "rating": 5,
      "date": "4th September 2024",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Excellent advice from start to finish.",
      "text": "Excellent advice from start to finish. Explained well and very efficient.",
      "rating": 5,
      "date": "3rd September 2024",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "5 star Re mortgage by Melton Mortgage Solutions",
      "text": "I recently had the pleasure of working with Angela Jones and Melton Mortgage Solutions on my re mortgage application, and I couldn't be more satisfied with the experience. From the very beginning, their team was incredibly helpful and knowledgeable. They took the time to understand my unique financial situation and guided me through the process with ease. The application itself was straightforward and efficient, and any questions I had were answered promptly and comprehensively. The communication throughout the process was excellent, and I always felt informed and in control. When it came to securing the mortgage, Angela Jones went above and beyond to find me the best possible deal. Their rates were competitive, and they were able to negotiate favorable terms on my behalf. Overall, I highly recommend Angela Jones and Melton Mortgage Solutions to anyone looking for a reliable and professional mortgage lender. Their commitment to customer service and their expertise in the field make them a top choice.",
      "rating": 5,
      "date": "3rd September 2024",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Friendly, knowledgeable and versatile financial advi...",
      "text": "Friendly, knowledgeable and versatile financial advisor who worked hard to provide us with the best service we could receive.",
      "rating": 5,
      "date": "2nd September 2024",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Extremely helpful - Brilliant Service",
      "text": "Laura was very helpful and couldn't do enough for us. She was always there when we needed her to help and answer all of our questions. It made finding a mortgage a lot easier. I would highly recommend.",
      "rating": 5,
      "date": "29th August 2024",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Excellent support & advice",
      "text": "The support we received and the advice given were excellent. We felt supported throughout. Everything was explained carefully and in simple terms.",
      "rating": 5,
      "date": "28th August 2024",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Excellent support from Laura",
      "text": "Excellent experience from Laura, she was through and efficient. Always available and always wanted the best deal for me. Explained everything really well and alleviated some of my concerns due to previous IVA but she understood and got me a cracking deal saving me £££ can’t fault it, well worth the money and will def be coming back again",
      "rating": 5,
      "date": "27th August 2024",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "I would highly recommend this company",
      "text": "My remortgage adviser who is Angela was very polite, professional and always at hand for any questions, help and advice. If it was possible I would award her six stars.",
      "rating": 5,
      "date": "21st August 2024",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Angela Jones Mortage Process Review 5*",
      "text": "Had an excellent process with Angela Jones from Melton Portage Solutions. I am a first time buyer and she explained through all the different terms, and showed me different offers available with multiple factors and offered excellent advice as to which would benefit me in the long term. Kept me updated via phone and email- would highly recommend!",
      "rating": 5,
      "date": "19th August 2024",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Can't fault the service provided",
      "text": "I can't fault the service provided to me while applying for my first mortgage. From start to finish I was handled by the same advisor which helped me have an easy point of contact for any questions I had. At each stage I was well informed on what I needed to do and what would be happening next and felt that any decision that I needed to make I was properly advised as to what was best for me and my situation. I felt fully in control of any decisions and wasn't pressured into anything that I didn't need. Any questions I had were well explained and anything that they were unsure on they would look into and get back to me. They were able to source the most suitable mortgage as well as help me find a solicitor and set me up with income protection that was built around what benefits I already had to keep my monthly costs down but keeping me fully protected should anything happen. Big thank you to Laura for the all the work she did.",
      "rating": 5,
      "date": "11th July 2024",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Angela Jones",
      "text": "Angela Jones was diligent, considerate, hard working and clearly an expert.",
      "rating": 5,
      "date": "2nd July 2024",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Excellent service and support.",
      "text": "Angela, our broker has kept in touch, she explained and supported us in our mortgage application at every stage. We would have been lost without her. She has been excellent.",
      "rating": 5,
      "date": "1st July 2024",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Angela was fantastic during my mortgage application,...",
      "text": "Angela was fantastic during my mortgage application, taking the time to explain in detail all the query's I had. Each stage of the application was completed in a very timely manner, and I was informed regularly with updates throughout. I would recommend this friendly service to all looking for the best mortgage deals for your circumstances.",
      "rating": 5,
      "date": "20th June 2024",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Stellar Service from Melton Mortgage Solutions",
      "text": "My experience with Melton Mortgage Solutions, particularly with Laura, was exceptional. Laura's expertise and communication skills made the entire process smooth and stress-free. She kept me informed at every stage and addressed all my concerns promptly. I highly recommend Melton Mortgage Solutions, especially if you want personalized service and a hassle-free experience.",
      "rating": 5,
      "date": "13th June 2024",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "As a first time buyer",
      "text": "As a first time buyer I thought it would be hard to understand the process. My Broker Angela Jones was a great help and would recommend her to anyone.",
      "rating": 5,
      "date": "9th May 2024",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Adviser review",
      "text": "My advisor has always been available to get in touch with and has been very helpful in getting things done. Including being honest and letting me know my property would need more saving.",
      "rating": 5,
      "date": "23rd April 2024",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Knowledgeable adviser.",
      "text": "Knowledgeable adviser. really pleasant experience. Went above and beyond. Made contact when promised. Highly recommended",
      "rating": 5,
      "date": "15th April 2024",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Paul and Rosemary review",
      "text": "We found Angela Jones very helpful and very good advice we had excellent communication with Angela with a excellent speedy outcome",
      "rating": 5,
      "date": "9th April 2024",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Porting our mortgage to a new property",
      "text": "Wanting to port our mortgage to a new property, Angie made it the least stressful experience we have ever had dealing with an advisor. She was polite, kind, and clear with her explanations. We felt listened to and at no point did she make us feel we were asking stupid questions, or that our goals weren’t achievable.",
      "rating": 5,
      "date": "6th April 2024",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Very Good Service - Family Buy To Let Mortgage..",
      "text": "We were looking for a buy to let mortgage for our daughter [making it a regulated buy to let]. As a bit of a non-standard product and not that easy to find with high street lenders we found Angela @ Melton Mortgage Solutions who was very thorough in looking over our requirements as well as finding us a suitable product and dealing with a few of the more complex parts of the application. From a personal perspective consider the fees we paid in doing this to be excellent value for money all round, had we tried to do this ourselves imagine it would have taken far longer, carried the risks of losing the house we had found and all the associated stress and such which goes with it. Highly recommended to anyone, but especially where the circumstances do not fit mainstream criteria.",
      "rating": 5,
      "date": "17th March 2024",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Mortgage broker provided outstanding service!",
      "text": "Mortgage broker provided outstanding service! Melton Mowbray have been okay but Angela Jones has been an amazing mortgage broker- 10/10 for her.",
      "rating": 5,
      "date": "15th March 2024",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Angela Jones Mortgage adviser was so helpful and kno...",
      "text": "Angela Jones Mortgage adviser was so helpful and knowledgeable and really understood our complex application.",
      "rating": 5,
      "date": "13th March 2024",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Angela Jones - a human whirlwind!",
      "text": "Angela Jones looked after me. She's like a whirlwind, bish bash bosh! She got to the bottom of my needs in no time, talked me through a number of options, took it through to valuation in two days, the offer came in the following week so I'm well and truly sorted. Thanks Angela!",
      "rating": 5,
      "date": "7th March 2024",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Laura Burrows was brilliant.",
      "text": "Laura Burrows was brilliant. She was professional, friendly and honest.",
      "rating": 5,
      "date": "6th March 2024",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Brilliant service",
      "text": "Laura provided an excellent service. She was diligent, communicated clearly and provided me with solutions when there were issues. She was incredibly helpful and well informed. I would highly recommend using MBS services.",
      "rating": 5,
      "date": "29th February 2024",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Great customer service!",
      "text": "My mortgage broker with the Melton was outstanding. She was polite, professional and efficient throughout the process. I would definitely use her services again!",
      "rating": 5,
      "date": "29th February 2024",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Fantastic service.",
      "text": "Fantastic service. Thank you for going the extra mile. Impartial advice and always there to help when I needed a hand with documentation etc. I would definitely use Angela again.",
      "rating": 5,
      "date": "26th February 2024",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "re Angela Jones",
      "text": "Angela Jones was extremely helpful and gave all the information I needed with no pressure at all. Excellent.",
      "rating": 5,
      "date": "22nd February 2024",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "A rip off!",
      "text": "My interest only mortgage I discover was ridiculously expensive compared to others. However Angela Jones was extremely helpful in the process of re mortgaging",
      "rating": 5,
      "date": "21st February 2024",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Unbelievably fast!",
      "text": "I have applied for many mortgage loans in the past, but this went to offer unbelievably fast. All sorted before my solicitor got back from a week's holiday! Very impressed!",
      "rating": 5,
      "date": "21st February 2024",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Amazing service from start to finish",
      "text": "Amazing service from start to finish from Angela and a great mortgage deal secured",
      "rating": 5,
      "date": "20th February 2024",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "The best.",
      "text": "Professional. Experience. Friendly. Experienced",
      "rating": 5,
      "date": "15th February 2024",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Brilliant Service",
      "text": "Laura couldn't have been more helpful. Super quick and thorough. I'm really greatful for the service.",
      "rating": 5,
      "date": "5th February 2024",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Laura Burrows - absolutely fantastic",
      "text": "Laura Burrows was absolutely fantastic from the moment I began the mortgage process. Kept me informed at every step and helped with any enquiries promptly. Excellent service and I couldn’t thank her enough",
      "rating": 5,
      "date": "5th February 2024",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Excellent service and advice from Laura at MAB.",
      "text": "Excellent service and advice from Laura at MAB managing to get my mortgage offer in record time. I wouldn't hesitate to use them again or to recommend them. I hope that this will be later this year or early next year. Thanks very much!",
      "rating": 5,
      "date": "26th January 2024",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Always available to answer any queries I had as a fi...",
      "text": "Always available to answer any queries I had as a first time buyer",
      "rating": 5,
      "date": "9th January 2024",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Well done",
      "text": "I have recently set up an account with Melton Mowbray building Society in Bourne,this account is to enable my annuity payments to be collected the people I have dealt with at the branch are extremely helpful and over the next few months I intend to look at other products they have.It is extremely nice in this day and age to deal with companies who have such a personal service",
      "rating": 5,
      "date": "18th December 2023",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Above and beyond",
      "text": "Having had the pleasure of working with Laura to review my mortgage at the end of last year it was a no brainer to utilise her expertise again when it came to myself and my partner buying a property together. Due to unforeseen circumstances, we have sought advice for 2 properties over the last 6 months and have been consistently blown away by Laura's conscientious nature, patience and timely management of our case. During a time when we have been unnerved by the professionalism of other parties, Laura has been unwaveringly reliable and efficient. From the point of the fact find Laura went above and beyond to find a deal that best suited our circumstances and regularly kept us up to date over the phone or via email - respecting our working hours and tailoring her schedule accordingly. Likewise, Laura's ability to educate and advice us on the buying/selling process where appropriate was incredibly reassuring and has enabled us to stay calm during what could have been a turbulent process. Unquestionably, Laura is an incredible asset to the Melton Mortgage Solutions team and we will be recommending her expertise to anybody that will listen! Thank-you so much for all of your hard work and support. We will certainly be in contact in the future should be ever require further mortgage advice.",
      "rating": 5,
      "date": "25th October 2023",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "A Proactive & professional mortgage adviser",
      "text": "Professional, proactive and communicative. Would definitely recommend.",
      "rating": 5,
      "date": "24th October 2023",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Quick and efficient",
      "text": "Laura was highly professional and went about her work in a very friendly manner.",
      "rating": 5,
      "date": "4th October 2023",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Angela provided a very thorough and professional service in dealing with our mortgage application.",
      "text": "Angela was very good in explaining everything clearly and although the process of re-mortgaging is understandably and necessarily detailed and pedantic at times, the process was managed with a good level of common sense to mitigate that aspect as much as possible. We have no hesitation in recommending Angela as a mortgage broker to friends and family. Her level of experience was welcome and refreshing in dealing with some of the issues we had to face.",
      "rating": 4,
      "date": "3rd October 2023",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Very helpful advice",
      "text": "Angela steered us through the process of switching suppliers and helped us to find the best deal for us. She was always quick to answer emails with our queries and gave practical and helpful responses.",
      "rating": 5,
      "date": "16th August 2023",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Perfect Experience!",
      "text": "Laura has been fantastic from start to finish with our mortgage, communication was perfect and the whole experience was seamless. Thanks Laura!",
      "rating": 5,
      "date": "26th July 2023",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Easy and hassle free. Perfect for first time buyers.",
      "text": "Laura was exceptional in every aspect when dealing with my case. Replied quickly and informatively while not overcomplicating anything. Seemed to take time for me and it felt like I was her only client which I know wasn't the case. Thank you",
      "rating": 5,
      "date": "19th July 2023",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "informative and quick to respond",
      "text": "our adviser angela has made the mortgage process less daunting and has been with us every step of the way. she has been dedicated and will respond to any queries we had at any time. she has made this a personable and friendly experience and has also explained everything that is required clearly and concisely.i would highly recommend her to friends and family in future.",
      "rating": 5,
      "date": "13th July 2023",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Very responsive; comprehensive advice",
      "text": "We dealt with Laura B when putting our mortgage in place, and this was our first experience dealing with obtaining a mortgage. Laura was super responsive and was readily available to speak to over the phone - where she was able to provide regular updates and answer any specific questions. We found this to be a really pleasant experience, and any hiccups along the way were met with a sympathetic ear and a pragmatic solution.",
      "rating": 5,
      "date": "12th July 2023",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Excellent service and speedy response",
      "text": "Angela was excellent for me. She worked quickly to sort out my mortgage and quickly responded to any queries I had. I’d definitely recommend her to anyone that asked",
      "rating": 5,
      "date": "12th July 2023",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "impatient broker",
      "text": "The broker wasn't even interested in speaking to me after i said i was also chatting to other brokers. In this current financial climate, how does it not make sense to chat to multiple people when rates are north of 6% and product fees of 4K. Is it too much to expect empathy?",
      "rating": 2,
      "date": "11th July 2023",
      "product": "Independent Mortgage Advice",
      "sentiment": "negative"
    },
    {
      "title": "So helpful",
      "text": "I thought buying a house would be extremely stressful however Laura made everything so simple for us! Communication has been brilliant and I would recommend this service to everyone.",
      "rating": 5,
      "date": "10th July 2023",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Absolutely fantastic, I would recommend to anyone",
      "text": "I couldn’t recommend enough. We had an offer in less than a week and it was all down to Angela’s help and expertise!",
      "rating": 5,
      "date": "13th June 2023",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Hassle free mortgage expertise",
      "text": "Angela demonstrated her expertise in finding me the best mortgage deal from day one. A fast, effective service, exploring the options and willing to explain the more complex elements in a non complicated way. For people like myself, who do not want to trawl through the thousands of deals available, I would recommend this service. For a comparatively small charge made on the final formal application, I feel confident I have selected the best deal for me, tailored to my personal needs.",
      "rating": 4,
      "date": "1st June 2023",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Outstanding service",
      "text": "Angela has been amazing with keeping us informed and explaining the process to us. This is the second time we have used her and will be returning again when our mortage is up for renewal",
      "rating": 5,
      "date": "24th May 2023",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Best mortgage service we have ever had",
      "text": "Angela, has helped us massively with our mortgage and home insurance ect. She’s been great with keeping us up to date with the solicitors, and has made everything so much easier to understand- thank you for helping us secure our mortgage! We would highly recommend.",
      "rating": 5,
      "date": "17th May 2023",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Informative",
      "text": "Angela was a new broker who was referred to us by our current lender. She was informative, responded quickly to any emails/queries. She was accessible and always available to take our calls and explain anything that was not clear. She made the remortgage process so seamless.",
      "rating": 5,
      "date": "16th May 2023",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Great thanks",
      "text": "Laura Burrows has provided excellent service. Has been conscientious and kind and kept working at it despite some difficulties. Thank you",
      "rating": 5,
      "date": "10th May 2023",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Exceptional service prompt accurate and super helpful",
      "text": "I did leave my re- mortgage until the very last moment. Angela came back to me promptly with great options and jumped onto this straight away, no nonsense, super efficiently and always on hand. She managed the whole process to perfection and came across very committed and performed above expectations.",
      "rating": 5,
      "date": "9th May 2023",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Happy Bunny's",
      "text": "Starting at our age the thought of getting a mortgage was daunting. But with Laura's help and professionalism the whole process was made easy and hassle free. We would highly recommend her services to anyone.",
      "rating": 5,
      "date": "5th May 2023",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Really helpful and responsive",
      "text": "Laura helped me through the process and was patient with all my queries.",
      "rating": 5,
      "date": "19th April 2023",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Fab Service",
      "text": "Laura has been so helpful and answered all of our questions. Couldn't recommend enough!",
      "rating": 5,
      "date": "17th April 2023",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Mr & Mrs Berti",
      "text": "Angela was great finding a very specific mortgage that we needed and was always keeping us up to date on the process.",
      "rating": 5,
      "date": "4th April 2023",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Positive review",
      "text": "I had a really positive experience with Laura, she worked with me for a long time to get the right mortgage for me. She was really helpful and supportive throughout.",
      "rating": 5,
      "date": "28th March 2023",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Fantastic support",
      "text": "Laura has been brilliant helping us, She had found us an brilliant deal, Helped an kept us up to date step by step, Nothing was to much, massive Thankyou for helping us",
      "rating": 5,
      "date": "1st March 2023",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Excellent Customer Experience, with knowledgeable Colleagues who can support through process",
      "text": "Moving house and seeking a mortgage at what is a more challenging time to obtain best rate. Gemma was able to search and provide best deal for us. Supported through the process as documents were required etc. provide expertise and comfort throughout process. Would recommend.",
      "rating": 5,
      "date": "8th February 2023",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Personal experience and sought to ensure the best decision.",
      "text": "Felt v much that Gemma invested a great deal of time in 'us' and maintained a 'weather-eye', incl gaining an understanding of what is important to us financially/ mortgage-wise owing to our family set-up and working circumstances.",
      "rating": 5,
      "date": "5th February 2023",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Thank you Laura!",
      "text": "Laura has been excellent from the start, we hit a few stumbling blocks along the way to getting an offer. Laura was always informative, helpful and professional. We can’t recommend her enough, thank you so much for staying positive and helping us see this through.",
      "rating": 5,
      "date": "25th January 2023",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Helpful and well-informed",
      "text": "Gemma was very helpful throughout the entire process. As a first time buyer i found the experience daunting, but she helped break down each stage and made the steps to purchase more manageable and easier to understand.",
      "rating": 5,
      "date": "8th January 2023",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Amazing !",
      "text": "I was recommended Angela as mortgage advisor by my friend, and now I know why! First class service!",
      "rating": 5,
      "date": "6th December 2022",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Fabulous service from start to finish!",
      "text": "We have had the most amazing service from Angela with helping us traverse the challenges of gaining our mortgage. She has been so helpful and informative so couldn't recommend her more!",
      "rating": 5,
      "date": "28th November 2022",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Patience and wise advice",
      "text": "We first contacted Angela around 18 months ago when we put our house up for sale and were looking for a mortgage for our next home. Things didn’t quite go to plan and we ended up selling our house and renting because we could not find the property that we wanted. Angela has stuck with us during that time and has provided us with mortgages in principle to help us with our search. She has shown great patience and offered wise words of advice as the mortgage landscape changed dramatically over the last couple of months. I would have no hesitation in recommending her to anyone looking for a mortgage particularly in the current challenging times.",
      "rating": 5,
      "date": "16th November 2022",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Professional informative and efficient",
      "text": "I was very happy with the service provided",
      "rating": 5,
      "date": "14th November 2022",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Excellent service - would recommend!",
      "text": "Laura was great - really helpful throughout the whole process and went above and beyond when contacting lenders and solicitors for updates. Always around for queries and the offer of out of work hours chats was really useful for us. Would definitely recommend using Laura!",
      "rating": 5,
      "date": "10th November 2022",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Fantastic, always willing to help.",
      "text": "Angela was fantastic, from the word go! Always willing to go the extra mile and help down to every last detail. I can't appreciate the help through the whole process.",
      "rating": 5,
      "date": "3rd November 2022",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Very helpful and knowledgeable",
      "text": "Angela went over and above to help me find the right mortgage product. She answered any questions I had and didn't mind repeating or explaining things. I am really grateful for all her hard work. Thanks Angela!",
      "rating": 4,
      "date": "8th October 2022",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Self-build Mortgage",
      "text": "Gemma, provided a fantastic service at all stage of our mortgage application and most importantly provided regular updates.",
      "rating": 5,
      "date": "23rd September 2022",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Great communication start to finsh",
      "text": "Gemma was brilliant from the start to finsh and answered every question I had to ask thank you Gemma Chris",
      "rating": 5,
      "date": "30th August 2022",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Professional and reliable service",
      "text": "Angela kept us up to date with progress at all stages of the remortgage process and was swift with all responses.",
      "rating": 5,
      "date": "23rd August 2022",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Remortgage",
      "text": "Was refused direct by the bank I have been with for 30+ years…MAB secured a mortgage a few weeks later with the same bank..!",
      "rating": 4,
      "date": "19th August 2022",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Purchasing new property",
      "text": "I have used Melton Mowbray Building Society for my previous mortgage and I have not been disappointed, for my second time round. I was given very sound advice from Angela who has guided me through step by step and always had my interest at heart. She also went the extra mile to help me secure the mortgage rate at very short notice when rates had been announced to go up, with only four hours to secure the mortgage. Thank you again. Cliff",
      "rating": 5,
      "date": "10th August 2022",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Laura Burrows - what a star!",
      "text": "We recently decided to move home, however we were still tied in with our current provider. We decided to get in contact with MAB to see if we could secure any better deals and we were placed with Laura. I could not be happier with the service she provided, she not only found us an amazing deal, she took the time to listen to our wants and needs and provided her recommendation taking this into account. Everything was clearly explained and nothing was too much trouble, she kept in regular contact and even helped chase our solicitors along when everything stood still for a bit too long. 5*’s, 10/10, I will recommend her to anyone and everyone who just wants an easy mortgage journey.",
      "rating": 5,
      "date": "23rd June 2022",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "A 5 Star Service",
      "text": "After trying a number of different avenues to find the right mortgage we were directed to the Mortgage Advice Bureau. If only we knew about Mortgage Advice Bureau first we might have had our mortgage in place sooner & undoubtedly saved some money. Angela guided us through the comprehensive application process every step of the way. We are pleased with the fantastic service we have received, and happy to say we have been accepted for a mortgage. Thank you",
      "rating": 5,
      "date": "20th June 2022",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Professional, friendly and quick advice!",
      "text": "Gemma was fantastic from start to finish. As a first time buyer, Her expertise was invaluable delivered in a friendly and approachable manner. Thoroughly recommend!",
      "rating": 5,
      "date": "17th June 2022",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Highly professional and personable",
      "text": "A wonderful experience dealing with Gemma Davies. Gemma is both professional and highly personable, communication has been swift and her advice was easily digestible. Our mortgage offer came through faster than expected, thank you, Gemma!",
      "rating": 5,
      "date": "8th June 2022",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Informative, helpful and friendly!",
      "text": "Gemma was very helpful and factual in all of our dealings with her. Always provided friendly and professional advice and dealt with our queries promptly. Would use her services again in the future.",
      "rating": 5,
      "date": "26th May 2022",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Perfect!",
      "text": "Excellent service from Angela! Made the process simple, easy and efficient. Couldn't recommend her enough. Nothing could have been better!",
      "rating": 5,
      "date": "23rd May 2022",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Couldn't have asked for more!",
      "text": "Angela at MAB has been absolutely fantastic from start to finish through this process. She always explains everything thoroughly and follows up constantly to ensure everything remains on track. If I ever look to buy another house, she will be the first person I call.",
      "rating": 5,
      "date": "18th May 2022",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Mortgage Advice Review",
      "text": "I would Highly recommend Angela as a mortgage advisor. I am a first time buyer and she has been great at explaining things to me and very quick at replying.",
      "rating": 5,
      "date": "18th May 2022",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Mortgage for a new build",
      "text": "Gemma was very clear with her steps for acquiring the best mortgage for our circumstances and was easily accessible to help us when we had any issues.",
      "rating": 5,
      "date": "11th May 2022",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Shared Ownership Mortgage Offer Process",
      "text": "Gemma Davies assisted me with gaining my mortgage offer for a shared ownership property - she provided super service from start to finish, kept me up-to-date, and chased the mortgage provider on my behalf. Great service :)",
      "rating": 5,
      "date": "9th May 2022",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Laura was great",
      "text": "Laura was so great to work with, kept us informed all along and answered my emails quickly which is really reassuring",
      "rating": 5,
      "date": "4th May 2022",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Choose Angela!",
      "text": "100% recommend Angela, she has been on top form throughout the whole process. Quick responses and quick problem solving. No issues at all. Thanks so much",
      "rating": 5,
      "date": "14th April 2022",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Thank God for Gemma",
      "text": "Without Gemma, I would have been unable to navigate my mortgage. It took nearly six months to complete my mortgage owing to poor service from the solicitor but Gemma did everything within her power to push for resolution. Gemma was only an email away (even when she was on annual leave) and went above and beyond to help me to source and execute a mortgage. I would have been so lost without her patience and guidance. I feel that Gemma and I have been on a real journey together to sort this mortgage out and I would have been in dire straits without her. She is a true asset.",
      "rating": 5,
      "date": "8th April 2022",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Thoroughly professional",
      "text": "We were impressed with the speed and efficiency step by step throughout the mortgage application process. We would definately recommend the services of Gemma at MAB to anyone thinking of obtaining a mortgage.",
      "rating": 5,
      "date": "5th April 2022",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Great Service",
      "text": "From start to finish Laura has been on hand to help with queries from all aspects whether it was to talk about planning permission or speak with the solicitors. Laura was very professional, thorough & definitely feel that we got the best advice & mortgage to suit our needs. Thankyou.",
      "rating": 5,
      "date": "1st April 2022",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Professional , knowledgeable and Human",
      "text": "Gemma clearly understands the market place and was able to get me the right product for me very quickly. She has been available for any questions and i really cant recommend her highly enough.",
      "rating": 5,
      "date": "15th March 2022",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Re mortgage",
      "text": "Angela has been amazing from day 1, very helpful & friendly. She was very informative and made this process stress free for us both. Any issues we knew we could pick up the phone or email and she would reply promptly. Shes a credit to the company",
      "rating": 5,
      "date": "10th March 2022",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Responsive and flexible",
      "text": "Gemma responded to our request very quickly, provided us with our options and guided us through the process. The overall service was fast, efficient and pain free. Thanks Gemma.",
      "rating": 5,
      "date": "23rd February 2022",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Brilliant service - Money well spent.",
      "text": "I was a little unsure about using a mortgage adviser, as I wondered if I could do our remortgage myself. I'm so glad I used this service. Angela was brilliant, it was so incredibly reassuring to know she was handling this and had found me a great deal. She was so efficient, responded really quickly to any questions I had and was friendly and easy to discuss things with. It would have been very stressful to do this myself - Angela made the whole process much simpler. Money well spent.",
      "rating": 5,
      "date": "14th February 2022",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Extemely helpful",
      "text": "I was skeptical about using an advisor over doing things myself, but Laura suggested options to me that I wouldn't have had before which fit my circumstances very well. She also saved me more money than I paid by disputing costs with the solicitor the bank chose for me. Overall I would definitely recommend!",
      "rating": 5,
      "date": "4th February 2022",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Fantastic customer experience!",
      "text": "Laura is an exceptional mortgage adviser who provides an outstandingly high level of customer service, and went the extra mile to ensure that I received the best advice possible. Laura expertly guided me, as a first time landlord through the intricacies of buy to let mortgages, to make sure that I ended up with a mortgage that suited my needs. \"A most excellent adventure\"",
      "rating": 5,
      "date": "3rd February 2022",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Fantastic",
      "text": "Laura was brilliant from the start of the process right to the very end and helped more than I expected her to with helping to chase progress etc.",
      "rating": 5,
      "date": "1st February 2022",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Angie is Amazing",
      "text": "I recently reached out to look at purchasing the other half of my house as shared ownership. Melton got me in touch with Angie who was amazing. She went through everything in detail and explained my options. She was more than happy to wait as had to wait for independent valuation but once that was sorted she double checked everything taking into account disposable income and I'm now moving forward with my application. Angie also recommended insurance quotes and a review of my Will all of which was greatly received. I'd recommend everyone speak to Angie as she really understands and makes great recommendations. Thank you.",
      "rating": 5,
      "date": "30th December 2021",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Gemma was polite, efficient and a pleasure to work with!",
      "text": "Gemma was excellent throughout the entire process of applying for a mortgage. Despite her extremely busy calendar, she was always able to squeeze me in and work around my schedule too. She was incredibly prompt in her responses, and was able to offer genuine advice to find which solution suited me best. Cannot recommend Gemma and her services enough!",
      "rating": 5,
      "date": "3rd December 2021",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Professional, supportive and helpful",
      "text": "Our adviser Gemma was incredibly professional and helpful. She steered us through a relatively complicated application, and throughout the process was easy to deal with, friendly and quick to respond to any queries. Gemma found a product that met our needs and aspirations, and guided us through the whole process. In short an excellent professional and responsive service!",
      "rating": 5,
      "date": "30th November 2021",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Solid, honest and pragmatic advice",
      "text": "Gemma was tasked with trying to find a mortgage for a custom/self-build project which significantly limited the market choice and added to the complexity of application. Gemma navigated the market with expertise and only returned providers that would genuinely engage and had products that would suit our needs. Gemma then handled the application process with patience and efficiency, eventually getting us the right offer. I would openly recommend her services.",
      "rating": 5,
      "date": "30th November 2021",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Very helpful and excellent communication",
      "text": "My house purchase was a very drawn out process. Gemma was excellent from my initial mortgage advice to the completion. Couldn’t fault any of the service, would definitely recommend.",
      "rating": 5,
      "date": "21st November 2021",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Mortgage",
      "text": "Gemma, Has worked incredibly hard to get me a mortgage so that I can staircase to get the rest of the house. Gemma, has worked hard to get a mortgage that lots of companies would not do. Forever grateful - thank you Gemma.",
      "rating": 5,
      "date": "8th November 2021",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Helpful advice",
      "text": "Angela was very professional in her attitude and advice.",
      "rating": 4,
      "date": "8th November 2021",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Excellent Service",
      "text": "Angela helped secure a mortgage in spite of a complicated application context",
      "rating": 5,
      "date": "22nd October 2021",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Very helpful, prompt, efficient service that produced the best mortgage.",
      "text": "Great and efficient service. I will use again for my next purchase and mortgage.",
      "rating": 5,
      "date": "8th October 2021",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Very helpful",
      "text": "Angela has been in constant communication throughout, clearly knows her stuff and has been fantastic.",
      "rating": 5,
      "date": "22nd September 2021",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "Helpful, meticulous, patient",
      "text": "Our MAB adviser (Angela) has been excellent - thorough, patient, and extremely helpful throughout. She's been very responsive to what we needed, and to our preferences through the whole process. In general, she has made something that had seemed quite daunting into something ultimately quite easy for us . Of course, it's still complex, and with many steps, but she has helped each step to be fairly straightforward, and we've just gradually worked our way through them. Many thanks!",
      "rating": 5,
      "date": "17th September 2021",
      "product": "Independent Mortgage Advice",
      "sentiment": "positive"
    },
    {
      "title": "In 5 years of having a mortgage with The Melton have...",
      "text": "In 5 years of having a mortgage with The Melton have never been able to call heir customer service line and actually speak to someone directly. You have to leave your contact details and they call you back hours or evens days later. There is no online facility for checking details of your mortgage and if you need any information you have to call to request. It is generally an archaic level of service.",
      "rating": 2,
      "date": "6th December 2024",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "Very helpful and informative staff - offered the bes...",
      "text": "Very helpful and informative staff - offered the best mortgage suitable for me",
      "rating": 5,
      "date": "24th September 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "DIRE CUSTOMER SERVICE - DIRE SAVINGS & MORTGAGE RATES",
      "text": "Bank Rate reduced by 0.25% but mortgage rate remains at 5.69% DESPITE a drop of Savings Interest rate of 0.5% to 3.5% DO NOT TAKE OUT A MORTGAGE OR INVEST SAVINGS WITH THIS UNPRINCIPLED BUILDING SOCIETY",
      "rating": 1,
      "date": "12th August 2024",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "Just straight forward.",
      "text": "Just straight forward, they deal with queries at once or call you back when they say they will if more complicated",
      "rating": 5,
      "date": "6th August 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent and prompt communication and always very h...",
      "text": "Excellent and prompt communication and always very helpful at replying to questions giving clear feedback. Thank you very much with your advice and what can be a daunting time when renewing your mortgage",
      "rating": 5,
      "date": "31st May 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Angie Evans was excellent in her clear presentation...",
      "text": "Angie Evans was excellent in her clear presentation of our needs porting our existing mortgage. She helped us through every step and made the whole process painless. Excellent service.",
      "rating": 5,
      "date": "7th April 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Wholeheartedly recommend",
      "text": "I've been with the Melton for about 7/8 years now and I wouldn't want to go anywhere else. So helpful, so flexible, and you get to speak to real people, not just computerised voices. Angie Evans in particular is exceptional, and has always been polite, helpful, friendly and knowledgeable. Would recommend to anyone.",
      "rating": 5,
      "date": "3rd April 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "MELTON WAS A GREAT BUILDING SOCIETY.... BUT NO MORE!!!!",
      "text": "I have been a Melton mortgagee for 24 years and despite that the offering now I am due to remortgage is VERY POOR> While they claim to provide better terms for existing customers, this is not the case! With their withdrawal of the OFFSET FACILITY and increased costs of early repayments in addition to interest rates which are HIGH despite rates generally going down, they are NOT competitive. I have had good service/support/mortgage rates for 24 years but recent changes to their 'Business Model' has removed the benefits of dealing with them! VERY DISAPPOINTING AND QUITE SAD!!!!",
      "rating": 1,
      "date": "27th March 2024",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "Great customer service",
      "text": "They were the only company who would give me a BTL mortgage given my circumstances and since doing business with them everything has been exactly as expected.",
      "rating": 5,
      "date": "25th February 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very happy with the service provided",
      "text": "Very happy with the service provided",
      "rating": 5,
      "date": "23rd February 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Melton building society have been a pleasure to deal...",
      "text": "Melton building society have been a pleasure to deal with. Very helpful, understanding, and knowledgeable.. Always easy to speak to if I have any questions that need to be answered.",
      "rating": 5,
      "date": "16th February 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellence all round service in all areas.",
      "text": "Excellence all round service in all areas.",
      "rating": 5,
      "date": "16th February 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Brilliant",
      "text": "Brilliant gave me a mortgage with foster care money as well as salary",
      "rating": 5,
      "date": "24th January 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Always professional always responsive to phone calls...",
      "text": "Always professional always responsive to phone calls Just a refreshingly good service",
      "rating": 5,
      "date": "22nd January 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "AVOID - terrible unhelpful service.",
      "text": "The most appalling customer service on my mortgage. Claim to allow you to pay in arrears, but this is NOT the case. you have to pay in advance. caused me terrible cashflow problems. the person i spoke with was incredibly unhelpful, refused to listen, passive aggressive, just kept saying the same things. A huge mistake which i am very much regretting. AVOID",
      "rating": 1,
      "date": "8th December 2023",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "Remortgaging",
      "text": "Friendly Helpful and Clear service. Thanks to all at Melton.",
      "rating": 4,
      "date": "28th November 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Billie and Daniel are very helpful",
      "text": "Both Billie P and Dan N have been very helpful when it comes to understanding possible avenues to explore. Thank you both!",
      "rating": 5,
      "date": "23rd November 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "MORTGAGE - EXCELLENT SERVICE",
      "text": "I have had a mortgage for the past 15 years with The Melton and always found the service offered to be excellent. It is so refreshing to be able to pick up the phone and speak to somebody promptly who understands the products and offers good advice. During the mortgage term I was able to take advantage of fixed terms deals and also use the Offset Savings Account facility to reduce the balance owing in a shorter time frame than originally planned. I would definitely recommend The Melton to anyone seeking a mortgage or indeed any other financial services... totally first class !",
      "rating": 5,
      "date": "22nd November 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Offer niche service",
      "text": "I originally went with Melton mowbray as they offer a family buy to let option which I struggled to find elsewhere. Have been very happy with the service provided and they recently helped me switch to a normal buy to let and were very helpful.",
      "rating": 5,
      "date": "16th November 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Always helpful.",
      "text": "I had to remortgage when I started to rent out a property to a family member, the Melton are one of the few companies who offer such a product. From the start the staff have been helpful and efficient, with emails and phonecalls answered promptly.",
      "rating": 5,
      "date": "15th November 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Melton Building Society Branch Review",
      "text": "The process for porting the mortgage was painful.",
      "rating": 3,
      "date": "8th November 2023",
      "product": "Mortgages",
      "sentiment": "mixed"
    },
    {
      "title": "Trustworthy",
      "text": "I particularly valued the time your mortgage adviser spent discussing with me the choice of mortgage products that would best suit my circumstances.",
      "rating": 5,
      "date": "2nd November 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great service. (Lisa Poyzer).",
      "text": "My wife and I required extra money to finish our self build and Lisa has been our contact to facilitate this. She has been very clear, friendly and professional and made the experience quite easy. Thanks Lisa",
      "rating": 5,
      "date": "28th October 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Exceptional service in every way possible",
      "text": "In over 20 years of borrowing in the mortgage market this is by far the highest level of service we have received by some margin. Extremely helpful, punctual and exceptional on all fronts",
      "rating": 5,
      "date": "18th October 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Highly recommend",
      "text": "The staff were very respectful and helpful.I was very impressed with the level of service and quality of the product I received. I would highly recommend them to anyone.",
      "rating": 4,
      "date": "13th October 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Outstanding Service from Charles.",
      "text": "Today, me & my girlfriend spoke to Charles Lewis on the mortgage team at Melton Mowbray. We went into the call concerned & confused by previous info we were given regarding our 1st & subsequent mortgage payments. We were told that potentially we MAY have to pay £1900 within the space of 3 days!! After just 15 mins on the call with Charles, our minds were clear of what was happening thanks to Charles patience & him taking the time out to discuss the ins & outs of what was going to happen. We can’t thank Charles enough for his clear & concise info, having just moved into a new home a little over a week ago, the info we got reduced our stress levels no end. Thank you Charles Lewis.",
      "rating": 5,
      "date": "9th October 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellence in customer service!",
      "text": "The Melton building society could not do enough to save me money on my recent mortgage!",
      "rating": 5,
      "date": "5th October 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Hiran was exceptionally helpful",
      "text": "Have dealt with MMBS for a few years now and they are friendly and efficient. I would recommend their services to all and particularly Hiran Kara who was exceptionally helpful.",
      "rating": 5,
      "date": "3rd October 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Customer Service",
      "text": "Phoned up to ensure everything was sorted and asking a few questions about my new mortgage Daniel N was super polite, helpful and ran through details of the questions I asked. From a service perspective Daniel is a true asset to Melton. The only reason I haven’t provided full stars on this review is that I am unable to see online my mortgage and must all be done via post. Most lenders provide an app and enable you to see all this information at the touch of a button, something I understand melton don’t currently provide with mortgages. If this is something that can be done, I would be over the moon with this service and recommend melton to everyone. Regardless the customer service and speed of getting through was great, I’d just love to see an app/statements online!",
      "rating": 5,
      "date": "14th September 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very helpful and responsive",
      "text": "Angie Evans has been very helpful with processing our mortgage application. She has been very responsive when I have emailed her or called to answer my queries. We have been kept informed of where we are in the process and have every faith that this will proceed quickly with Angie involved. I would recommend her to family and friends.",
      "rating": 4,
      "date": "12th September 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Thank you to Mr Daniel Newing at your Melton Head Office",
      "text": "Mr Newing has gone above and beyond the call of duty to help me receive the latest information about my Capital Payment for my Mortgage with the building Society and the new revised lower monthly payments on my Mortgage as of 1st August 2023. The issue has been a lack of post from the Grantham and Nottingham area, and Mr Newing sent the full details by post on a to be signed for delivery. In fact most of the post I have been waiting for since the end of June 2023 arrived this morning with the letter I had to sign for. Apparently major problems at the Nottingham Postal Hub according to the new Post Lady on the Langfrod Gardens Grantham Route. Putting my mind at rest is worth its weight in gold, once again thank you Daniel. Kind Regards Simon L. Tall.",
      "rating": 5,
      "date": "31st July 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent service and understanding of our needs",
      "text": "Angie has been extremely helpful with our further borrowing request. She was indepth, took our personal circumstances into consideration, and clear and concise with all of the information that we required. Would definitely recommend",
      "rating": 5,
      "date": "19th July 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent customer service",
      "text": "I spoke with Daniel to confirm instructions for a previous mortgage deeds transfer to solicitors. He was so helpful as fellas very informative. A real credit to MMS",
      "rating": 5,
      "date": "17th July 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Outstanding Service",
      "text": "The have been absolutely outstanding! We are using a self build mortgage product, and you can guess with the cost of living increases our budget has gone up. We needed a further advance to complete the build. They have been quick to respond and deal with our request and support us to get the build finished.",
      "rating": 5,
      "date": "10th July 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Responsive, Professional, Informed Advice",
      "text": "Really can’t rate the mortgage team highly enough. They are quick to respond to queries, and provide detailed guidance at each step of the process. A mortgage application is of course a very big deal for the us as applicants and their approach helped us feel supported and listened to rather than “just another application” for them to process. This is where smaller providers stand head and shoulders about the bigger banks and lenders. Thank you Melton Mowbray team - we really appreciate you!",
      "rating": 5,
      "date": "4th July 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Communication and Accessibility",
      "text": "It is refreshing as well as helpful to be able to pick up a phone and speak to courteous, well informed staff. I have found communication with The Melton to be outstanding. Where necessary matters are clarified by email and in all cases matters are dealt with promptly. My experience is notable and the organisation has been very impressive.",
      "rating": 5,
      "date": "10th June 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent",
      "text": "I would like to Thank Angie with the process of porting my mortgage, She has been such a big help with my needs, i would give her 10 out of 10, shes polite conscious, informative, thorough, and very calming. overall excellent",
      "rating": 5,
      "date": "10th May 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Mortgage renewal",
      "text": "Lisa was very helpful from start to finished and answered all questions that were raised. She was very efficient and quick to deal with the enquiry I had an was all completed within a few hours",
      "rating": 5,
      "date": "4th May 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Honest, helpful and pleasant",
      "text": "The advisor I spoke to at the Melton was very helpful and pleasant. She was clear and honest in the information she gave me and guided me through the decisions I needed to make. I felt she had a good grasp of my circumstances and what I needed in terms of mortgage requirements for the future. Telephone conversations and emails were followed up promptly with a summary of our discussions and the necessary documents. I felt confident in the information and advice I was given. A positive and personal experience.",
      "rating": 4,
      "date": "24th April 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent Servicing Team",
      "text": "The communication from the servicing team throughout the term of my mortgage with melton building society was excellent, always thorough and clear. I was able to speak directly with members of the servicing team when needed and they always did everything they could to answer my questions and assist me. I would not hesitate to take a financial product from Melton Building Society again.",
      "rating": 5,
      "date": "29th March 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Not great",
      "text": "Was given bad advice for my mortgage and when I complained the advisor was rude",
      "rating": 1,
      "date": "28th February 2023",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "Self build",
      "text": "Wonderful to have friendly, knowledgeable and helpful customer support who are easily accessible.",
      "rating": 5,
      "date": "23rd February 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent help, with swift responses.",
      "text": "Angie Evans was extremely helpful with arranging a new mortgage product as our current one is coming to end end.",
      "rating": 5,
      "date": "15th February 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "New mortgage",
      "text": "Quick response. Happy friendly highly recommend and will use again going forward.",
      "rating": 5,
      "date": "10th February 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very helpful and responsive communication",
      "text": "Lisa Poyzer was really very helpful. I appreciated her swift and succinct resolution of my issue.",
      "rating": 5,
      "date": "1st February 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Fantastic customer service",
      "text": "Lisa P was extremely helpful, informative and responsive. Outstanding customer service and a credit to Melton Building Society!",
      "rating": 5,
      "date": "21st January 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Charles Lewis",
      "text": "In the early part of dealing with the Melton, i found communication difficult, as soon i was dealing directly with Charles a different story. A total breath of fresh air and a credit to the Melton.",
      "rating": 5,
      "date": "17th January 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Additional Borrowing Application",
      "text": "Our mortgage was coming to an end but we decided to borrow again against our main home to help buy a second home nearer to our family. Our first port of call was the Melton and they have been very helpful and supportive. Particular thanks to Angie Evans for going through the process so thoroughly and helpfully with us.",
      "rating": 5,
      "date": "5th January 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "New property mortgage",
      "text": "Great help from Angie, lots of time spent and helpful as always",
      "rating": 5,
      "date": "19th December 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Would not recommend",
      "text": "Are these 4 and 5 star reviews bought and fake as I do not recognise the service they rave on about? Completions team is impossible to get hold of, callback requests are ignored and emails are not answered. It's been really hard work and stressful having a self build mortgage with Melton - reconsider if you are thinking about using them!",
      "rating": 1,
      "date": "21st November 2022",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "Great experience !",
      "text": "I've had a mortgage with the Melton Building Society for about 4 years and my experience with dealing with the mortgage team is always brilliant. Quick responses to any queries and always being kept informed of the progress of any application is so refreshing in an industry that is notorious for long timescales. Highly recommended !. Special thanks to Caitlin for all her help :)",
      "rating": 5,
      "date": "14th November 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "easy no fuss attitude",
      "text": "From first introduction to Lisa we have been kept up to date on the progress of the application in a very prompt manner. There have been areas that my wife and i didn't fully understand and this was explained very professionally by Lisa, Doing a self build has been quite a journey for us all and it was nice to feel that we have done a great job and now hopfully we can complete to the standard we wanted. I hope the rest of the team is like Lisa and if they are we would highly recommend the Melton. thank you Lisa",
      "rating": 4,
      "date": "11th November 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent Services from MBS Lending Adviser Team",
      "text": "Angie who is on the MBS Mortgage Lending team was very proffesional and excellent with dealing with me. We conducted the mortgage interview on time and in a timely manner. She explained everything very thoroughly and discussed all my options available and guided me in the right direction. Thank you Angie",
      "rating": 5,
      "date": "27th October 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very helpful and answered all my questions.",
      "text": "Thank you Billy Dexter you have been superb. I made a call regarding my mortgage you answered all my questions and did everything very efficiently and kept me updated throughout. I would highly recommend MBS to friends and family. Once again thank you Billy for your great customer service.",
      "rating": 5,
      "date": "21st October 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Five star service!",
      "text": "We were really impressed with Melton Building Society primarily because of the level of service we received from Billy Dexter. He was super quick in responding when we got in touch and very patient in letting us know which options were available. Would highly recommend.",
      "rating": 5,
      "date": "17th October 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Magical mortgage",
      "text": "I asked if a mortgage advisor could call me back. He called back the same day. He had all My information to hand and within an hour I had a new product illustration in my in-box … excellent service !",
      "rating": 5,
      "date": "11th October 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Easy process",
      "text": "This was a straightforward and easy process. With almost immediate responses very fast.",
      "rating": 5,
      "date": "7th October 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great communication",
      "text": "Billy Dexter was great communicating with us - responding in a timely fashion and giving us clear and concise information. Melton have done a great job in general.",
      "rating": 5,
      "date": "28th September 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Thank you",
      "text": "Thank you Lauren Stevenson for your help and assistance today.",
      "rating": 5,
      "date": "28th September 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Lisa P Always Goes The Extra Mine",
      "text": "We started our mortgage journey all the way back in May. After being looked after by Lisa, we were looking forward to an easy and trouble free end. However, the seller and our solicitors were so useless that I've had to spend the last 5 months chasing them to get this over the line. Lisa was always on hand to provide assurance that our mortgage wasn't going anywhere and to offer alternatives when I tentatively thought about calling the some thing off. Melton, and specifically Lisa, have been outstanding and I would highly recommend you get in touch as her service is flawless.",
      "rating": 5,
      "date": "27th September 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Customer focussed service",
      "text": "I would like to thank Lauren Stevenson who helped me sort out some queries regarding my mortgage. She was. Very professional, totally customer focussed and was prepared to deal with my questions promptly. She is a real asset to the team!!",
      "rating": 4,
      "date": "26th September 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Billy and Caitlin have been really helpful and offering a good customer/broker experience with good outcomes.",
      "text": "Brilliant prompt service & TCF. a good to use local Society :-) will continue to recommend to my clients. Lance Baker A&L Independent Mortgages",
      "rating": 5,
      "date": "20th September 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Proactive and punctual service",
      "text": "Positive - thorough exploration of options, swift feedback on referrals, prompt despatch of application document, super response time on queries Even better if... easier to get in touch for initial engagement (a number of hoops to jump through)",
      "rating": 5,
      "date": "19th September 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent service",
      "text": "I've been with the Melton Mowbray Building Society for over 20 years and I've always received excellent service. When I want to speak to someone they know my history and always give me great advice and consideration. Occasionally I've seen a slightly better product on the market in terms of interest rates, but I stay with the Melton Mowbray because of the personal level of service and the kindness that the staff have shown me whenever I've contacted them.",
      "rating": 5,
      "date": "8th September 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Extremely poor application and completion process",
      "text": "Terrible communications, needless delays due to requiring certain printed documents. Impossible to speak to someone on on completion day and no idea when property is due to complete. Worst mortgage company / bank I have ever dealt with.",
      "rating": 1,
      "date": "8th September 2022",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "Product Transfer",
      "text": "Caitlin was excellent & explained what we needed to do every step of the way to carry out the product transfer for our client.",
      "rating": 5,
      "date": "31st August 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very easy to deal with and quick to respond",
      "text": "Dealt with Billy Dexter in the mortgage renewal team. He was great - very quick to respond and answer questions clearly.",
      "rating": 5,
      "date": "26th August 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Professional confidential service",
      "text": "Kind professional service all the time I cooperation with them 7 years always perfect service",
      "rating": 5,
      "date": "23rd August 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Billy Dexter",
      "text": "Billy was really helpful and made the whole process really clear. Billy was courteous and quick to come back.",
      "rating": 5,
      "date": "18th August 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "excellent service",
      "text": "really helpful. great to deal with a business which understands its customers. a real personal element to the service. particular thanks to Billy",
      "rating": 4,
      "date": "16th August 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Completely unprofessional: do not use this company!",
      "text": "Impossible to contact. When you do they are very unhelpful. No relationship manager or direct lines for brokers or solicitors, everyone just calls the same number which clearly just leads to chaos. We are supposed to be moving tomorrow and they are not answering the phone to confirm that the funds will be released. And this is not the first issue we have had. Just getting the mortgage offer took ages with delays on our chain. I cannot say this enough, please for the good of your stress levels, do NOT use this company!",
      "rating": 1,
      "date": "11th August 2022",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "Ridiculously slow to process mortgage applications",
      "text": "2 months+ I waited for a decision on my mortgage application! The most agonising, frustrating wait I've ever endured... and for something as important as this. Everything fell through and I was left with no other options. Oh, and I got stung for ~£439 in fees and still trying to find out if this will be refunded, but I can't get through to talk to anyone...! Avoid at all costs, I know things are 'difficult' right now but the 2 months wait seriously affected my mental well-being... disgraceful.",
      "rating": 1,
      "date": "10th August 2022",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "Brilliant, fast service",
      "text": "Melton Building Society offer wonderful UK-based customer service that is streets ahead of the awful overseas-based, call bouncing, on-hold nightmare that is usual for British lenders. The agent we spoke to today (Billy Dexter) understood exactly what we needed and was polite and very efficient in sending and acknowledging documents sent. Thank you Melton!",
      "rating": 5,
      "date": "4th August 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Always fast efficient human service",
      "text": "Been with the Melton for several years. Always answer the phone with a human, quick straight forward response, and as importantly competitive products.",
      "rating": 5,
      "date": "2nd August 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Easy and helpful",
      "text": "Billy was really helpful and friendly over the phone and we got my re-mortgage sorted out quickly",
      "rating": 5,
      "date": "1st August 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Re-mortgage",
      "text": "I have been with Melton for 2 years having mortgage . I was worried that my re-mortgage will be very difficult and complicated. I spoke with very helpful, competent and polite consultant Billy who helped me with everything, including paperwork and keeping everything on time. I want to say big thank you for his help.",
      "rating": 5,
      "date": "30th July 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Brilliant!",
      "text": "Angie was really helpful and explained everything very clearly, very happy that I’m able to port my mortgage!",
      "rating": 5,
      "date": "27th July 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "GREAT SERVICE",
      "text": "MMBS provide friendly, efficient service which has not changed in the years I have been with them. Information is clear, easy to understand. Any query is dealt with promptly.",
      "rating": 5,
      "date": "25th July 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Prompt service",
      "text": "Thank you Billy for your assistance and prompt replies",
      "rating": 5,
      "date": "21st July 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "People good, process could be better",
      "text": "Billy very prompt and helpful with a product transfer for my client. PT instructions need clarifying on website though, as not very clear at all. The two forms required for a straight PT could be combined into one, or it should be clearly stated on the website process that you need both. Plus, wet signatures are not always easy for clients, Adobe etc should be an option. However, not a huge hassle and happy overall with the service, considering the meltdown many lenders are currently in.",
      "rating": 5,
      "date": "21st July 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Offer request",
      "text": "We needed a copy of the Mortgage Offer for a client's PT and Billy Dexter CeMAP Diploma, CeRER was very helpful, keeping me updated when there were delays and got the offer to me via email. Great service, thank you.",
      "rating": 5,
      "date": "21st July 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Hassle Free Product Switch",
      "text": "Billy Dexter made it so easy to switch that I didn't have to contact my mortgage adviser. Well done.",
      "rating": 5,
      "date": "20th July 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Always easy, pleasant and quick.",
      "text": "We have been with Melton for a number of years now and we always have good correspondence, and it is so straight forward when it comes to renewals or any queries we might have.",
      "rating": 5,
      "date": "19th July 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent service and a stress-free experience",
      "text": "Caitlin and Billy were both very helpful, talked us through our re-mortgage options and had the paperwork emailed over to us the same day. Great service.",
      "rating": 5,
      "date": "19th July 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Product transfer",
      "text": "Dealt with Billy who was prompt and very helpful",
      "rating": 4,
      "date": "12th July 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Friendly,Professional and understanding",
      "text": "So, I don’t normally do reviews but on this occasion its a no brainer….my partner and i have consulted with Melton (Angie) on them assisting us in financing our new build…were taken back on the level of service and total explanation of their products required…and further to this it was all undertaken in a friendly and open way…with complete respect to ourselves as customers….Melton in our opinion you go to top of list in overall experience.",
      "rating": 5,
      "date": "6th July 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Mortgage Intermediary - Product switch",
      "text": "Spoke to Billy on this matter and he was helpful and efficient. If only all lenders were like this. Well done",
      "rating": 5,
      "date": "5th July 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Terrible Service",
      "text": "Never call you back, take forever to look at paperwork. Expect you to jump through hoops for a mortgage, not a great experience at all :(",
      "rating": 1,
      "date": "30th June 2022",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "The service is shocking and the issues never seem to end. I would never recommend this lender and would tell other potential customers to avoid them",
      "text": "Problem after problem with my custom build mortgage and despite now completing on the purchase of the land, the issues continue. I can never get hold of the mortgage team, it's caused nothing but stress, inconvenience and extra cost. It's had a massive impact on my well being and my finances and I wish I had never used them as a lender.",
      "rating": 1,
      "date": "30th June 2022",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "Personal service from human beings",
      "text": "I’ve had mortgages with MMBS for over 20 years and have always appreciated their combination of personal customer service and non-profit ethos. The latest interaction has been a re-mortgage as one discounted deal ended and I switched to a fixed rate. We accomplished this in less than 48 hours and no fuss. Special shout-out to Billy in the Mortgage Retentions Team who helped make the process smooth, easy and - dare I say it? - even enjoyable. :)",
      "rating": 5,
      "date": "28th June 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "First Class Angie Evans @ Melton Building Society.",
      "text": "As an existing mortgage customer with the Melton, the Melton was our first point of call to discuss our revised mortgage needs embarking on a self build project. Angie Evans handled our case and was very professional, helpful and understanding of our requirements. Angie found the perfect solution to our needs and carried it through effortlessly, very much appreciated.",
      "rating": 5,
      "date": "23rd June 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Best mortgage providers",
      "text": "We’re had a great experience choosing our mortgage as first time buyers with Melton. Billy recently helped us switch to a new and better product, very professional and friendly. Overall really happy with the team and the service provided. Highly recommended.",
      "rating": 5,
      "date": "21st June 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Mortgage process",
      "text": "Angie Evans did a great job in listening, asking the right questions and putting me on the right mortgage to suit my requirements. Couldn't recommend highly enough",
      "rating": 5,
      "date": "21st June 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Efficient and knowledgeable customer service representative",
      "text": "Called to find out further details regarding overpayments. The call was answered quickly by Lauren who was able to answer all of my questions. Friendly and professional, it was a pleasure to her.",
      "rating": 5,
      "date": "19th May 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great service from a friendly & professional person",
      "text": "I wanted to add my partner on to my Mortgage, and thought this was going to be a long complicated process (partly why I had put it off before). We dealt with Caitlin Clater who was very friendly and professional throughout. Caitlin took the time to walk us through the process step by step, has always been very quick at responding to my questions (some very silly I'm sure!) and made it a pleasure to sort this out. A great credit to Melton Building Society, with great knowledge and experience. Thank you",
      "rating": 5,
      "date": "19th May 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Mortgage advice and payment administration",
      "text": "Spoken to Angie and Claire - both very helpful and efficient - recommended",
      "rating": 5,
      "date": "17th May 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Be prepared to waste your time on the phone",
      "text": "Very frustrating trying to deal with them: sent a secure message because that’s the channel I prefer because I’m busy during the day at work, yet the my insist on calling me back to discuss by phone! Left a voicemail which then meant I need to ring them and sit in a queue, when they could have just responded to my message so I could read at my convenience. Mentioned this to the advisor on the phone and she was quite defensive and couldn’t see the problem. Very old fashioned and not very customer friendly.",
      "rating": 2,
      "date": "2nd September 2025",
      "product": "Savings",
      "sentiment": "negative"
    },
    {
      "title": "I TRIED TO SEND AN EMAIL, BUT COULDN'T",
      "text": "I TRIED TO SEND AN EMAIL, BUT COULDN'T",
      "rating": 1,
      "date": "28th August 2025",
      "product": "Savings",
      "sentiment": "negative"
    },
    {
      "title": "Website apparently not functioning",
      "text": "I received a letter \"Action Required\" about the maturity of a savings account and told to log on to online savings. Have been trying all morning. It does not seem to be functioning.",
      "rating": 1,
      "date": "13th July 2025",
      "product": "Savings",
      "sentiment": "negative"
    },
    {
      "title": "Great Building Society",
      "text": "First visit to this branch to open an account and was very impressed. I was served by Charlie who was really welcoming, very efficient and had great product knowledge. Highly recommend this building society and branch to others.",
      "rating": 5,
      "date": "14th April 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Competitive rates but archaic application process",
      "text": "Opening a new savings account as a new customer felt like a return to the 1980s. Application was via post including a cheque. I received account details via post, but had to phone to request an online sign-in password. Line was busy, so they called me back several hours later. Customer support staff member was nice and helpful, but the whole process was dated and inconvenient in a modern digital world.",
      "rating": 3,
      "date": "3rd April 2025",
      "product": "Savings",
      "sentiment": "mixed"
    },
    {
      "title": "I wanted to visit the branch but when I got there it...",
      "text": "I wanted to visit the branch but when I got there it was closed for staff training. It is a 20 mile round trip to the nearest and there is no help to get on line. Not good enough! When I have been in before they have said I had to book an appointment.",
      "rating": 1,
      "date": "3rd April 2025",
      "product": "Savings",
      "sentiment": "negative"
    },
    {
      "title": "It takes 2",
      "text": "Have opened 2 accounts with The Melton, really easy to deal with and for my generation, a passbook is a must, fantastic, pleasant, experience",
      "rating": 5,
      "date": "27th March 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Friendly and efficient service.",
      "text": "Friendly and efficient service. Treated with respect and courtesy, kept informed about the process.",
      "rating": 5,
      "date": "26th March 2025",
      "product": "Savings",
      "sentiment": "positive"
    }
  ]
}