{
  "society": "Nationwide Building Society",
  "slug": "nationwide",
  "smpUrl": "https://smartmoneypeople.com/nationwide-reviews/products",
  "totalReviewsOnSMP": 2753,
  "avgRating": 4.11,
  "scrapedAt": "2026-02-06T15:58:03.194410+00:00",
  "reviews": [
    {
      "title": "Fallen hard from grace",
      "text": "I thought Nationwide were good until I ran into a problem in which Nationwide blocked a card of mine for NO reason. Since then I have struggled to get any sense out of the bank group. I can phone and phone, I get the same answer. While they understand the fault it directly due to one of their staff they just do not realize what kind of predicament they have put me. Unable to withdrawal money, unable to get back home as I cannot pay for flights with cash, unable to get any cash. Nationwide gave fallen into the same clutches as the really poor - bad - banking groups - a place or set that is far from satisfactory and stinks of sewerage.",
      "rating": 1,
      "date": "2nd December 2025",
      "product": "Business Banking",
      "sentiment": "negative"
    },
    {
      "title": "Nationwide is secure and care a lot about its custom...",
      "text": "Nationwide is secure and care a lot about its customers and I received £50 from them for being with them for so long and the was some time were I used to get £10 each month.",
      "rating": 5,
      "date": "11th April 2025",
      "product": "Business Banking",
      "sentiment": "positive"
    },
    {
      "title": "Personal financial support on a daily basses.",
      "text": "Personal financial support on a daily basses. Most excellent.",
      "rating": 5,
      "date": "7th September 2024",
      "product": "Business Banking",
      "sentiment": "positive"
    },
    {
      "title": "1 star is too much for this bank",
      "text": "1 star is too much for this bank. They attempted you with 5% interests to get the money from your savings then they - use very junior people to manage your account who does not have any common senses - the complaint team is even worse, full of junior people with robotic answers. - zero digitalisation, you can’t even access your money once you opened your account Go else where as there are plenty of banks who have a basic customer service.",
      "rating": 1,
      "date": "24th June 2024",
      "product": "Business Banking",
      "sentiment": "negative"
    },
    {
      "title": "Opening acc for kids, got rudeness and incompetence....",
      "text": "Incompetence rudeness infornt of my children when opening a savings account then we get all accounts closed Tried to open savings accounts for my two children. Was treated rudely by branch staff after being advised what documents to take in. Turns out that Nationwide dont know their own ID policies! Anyhow hours later and several painful conversations and chats later I still could not open an account and made a complaint. The complaints team rather than resolving gave conflicting advice and the I didnt hear from them for weeks. I called and asked for some one to call back (unfortunatley..) The lady that called kept saying you sai d this and our staff said that etc etc etc and did not accept any wrong doing rudeness or missinformation given. They clearly just rang up to tell me to go away, but saved it until the end of a 1/2 hour conversation... \"we have deiced to close your accounts...\" What a bunch of ill informed couldnt care less fools. Rather than my children having a positive experience at the branch whilst the open their highly anticipated accounts, I have to somehow explain that mum and dad have been throw out of the bank because they wanted a savings account. What nasty hateful incompetent organisation Nationwide is.. maybe it is better that we are going to another bank. What nasty people.... 0/10",
      "rating": 1,
      "date": "25th March 2024",
      "product": "Business Banking",
      "sentiment": "negative"
    },
    {
      "title": "A nightmare and couldn't transfer my own money, they are tyrant dictators",
      "text": "I had to wait about an hour in queue in an agency to transfer my money and they advised me to use the online banking. I was given a machine to work with my bank card, and told that I could easily make a transfer that way. I accessed the online account and then made the transfer using the card machine device, no problems.",
      "rating": 1,
      "date": "12th November 2023",
      "product": "Business Banking",
      "sentiment": "negative"
    },
    {
      "title": "Saving money",
      "text": "Good products, to help save money, with Internet banking.",
      "rating": 4,
      "date": "1st June 2023",
      "product": "Business Banking",
      "sentiment": "positive"
    },
    {
      "title": "awful customer service",
      "text": "Absolutely awful customer service. Notified Nationwide not to allow a payment to leave my account on numerous occasions with plenty of notice. Nationwide's team failed to stop said payment from leaving my account. Once I finally received contact from them (after days of being promised a call back that never came and given phone numbers that would take me through authentication and then cut off) I was told there was nothing they were willing to do to retrieve or reimburse the money for me that again, I had clearly instructed was not to leave my account. Will be moving away from this company as soon as I can if not resolved promptly, and advising others too as well. nbs7789493",
      "rating": 1,
      "date": "16th April 2023",
      "product": "Business Banking",
      "sentiment": "negative"
    },
    {
      "title": "Good bank",
      "text": "Easy app to use and helpful staff",
      "rating": 5,
      "date": "9th February 2023",
      "product": "Business Banking",
      "sentiment": "positive"
    },
    {
      "title": "No customer Service",
      "text": "I went in to branch to open two cash isa's for my girls I was told what to bring as I'd. which I brought then I was told it was incorrect id I had taken my passport and utility bill and my daughters birth certificates and national insurance certificates letters the service was rubbish and there was no customer service at all I will never enter this branch again and would not recommend it to anyone",
      "rating": 1,
      "date": "6th February 2023",
      "product": "Business Banking",
      "sentiment": "negative"
    },
    {
      "title": "Amazing bank",
      "text": "I have banked with nationwide for years and never had any problems.",
      "rating": 5,
      "date": "19th January 2022",
      "product": "Business Banking",
      "sentiment": "positive"
    },
    {
      "title": "Bad communication",
      "text": "When you ring to make enquiries they always tell you someone will call back but you find recieve the call",
      "rating": 2,
      "date": "16th April 2021",
      "product": "Business Banking",
      "sentiment": "negative"
    },
    {
      "title": "Great All rounder",
      "text": "I have banked with them for 4 years after moving from HSBC. Service has always been great.",
      "rating": 4,
      "date": "9th February 2020",
      "product": "Business Banking",
      "sentiment": "positive"
    },
    {
      "title": "Specialist Support Team are a complete joke",
      "text": "Steer clear of these power happy idiots. Placed restrictions on my Mums bank account after a 2 minute conversation with my Mum who is deaf and then deemed her unfit to look after her own finances. Have went for POA so I can sort it out for her. They’re condescending and quite frankly rude with the IQ of a Hamster",
      "rating": 1,
      "date": "30th January 2020",
      "product": "Business Banking",
      "sentiment": "negative"
    },
    {
      "title": "Building society",
      "text": "Nationwide is my one and only banking account I will use I have been with others and well frankly have never been as helpful or trustworthy as nationwide I have now held my account with nationwide for 19years along with my family members and even my own son has an account with them I'd not recommend any other bank/building society.",
      "rating": 5,
      "date": "29th January 2020",
      "product": "Business Banking",
      "sentiment": "positive"
    },
    {
      "title": "Fantastic service",
      "text": "Personal friendly service from instore staff and good range of products",
      "rating": 5,
      "date": "17th December 2019",
      "product": "Business Banking",
      "sentiment": "positive"
    },
    {
      "title": "Nationwide is a reasonable bank",
      "text": "Joined a number of years ago, never had any real problems, except I am unable to change my mobile number online. This creates a problem for me as I'm disabled and leave my home infrequently, even when you phone they tell you it has to be done in branch which is annoying. The only other gripe I have is when my sister tried to pay in £15 she owed me, she was told she couldn't without my card because we could be committing offence of Money Laundering.....ridiculous £15k I understand £15 I don't,.",
      "rating": 4,
      "date": "23rd November 2019",
      "product": "Business Banking",
      "sentiment": "positive"
    },
    {
      "title": "Great fab good",
      "text": "Nationwide are great for small businesses. Great interest rates.",
      "rating": 5,
      "date": "22nd November 2019",
      "product": "Business Banking",
      "sentiment": "positive"
    },
    {
      "title": "An amazing bank company",
      "text": "Staff were incredibly kind, they helped me withdraw money out of my account",
      "rating": 5,
      "date": "27th July 2019",
      "product": "Business Banking",
      "sentiment": "positive"
    },
    {
      "title": "Reliable & Trustworthy",
      "text": "I have had accounts with Nationwide since I was a child, and have never had any problems. Always very friendly and happy to help alongside offering great accounts.",
      "rating": 5,
      "date": "13th January 2019",
      "product": "Business Banking",
      "sentiment": "positive"
    },
    {
      "title": "Quick, easy and in complete confidence",
      "text": "Any queries that I needed help with were seen to and resolved as quickly as humanly possible, an actual great customer service experience that I hadn't seen in many places beforehand.",
      "rating": 5,
      "date": "23rd December 2018",
      "product": "Business Banking",
      "sentiment": "positive"
    },
    {
      "title": "Transparent and truly professional",
      "text": "Never had an issue with Nationwide. Serious, professional and transparent support all the time. Friendly and efficient staff. Easy manageable accounts, online and by app.",
      "rating": 5,
      "date": "21st December 2018",
      "product": "Business Banking",
      "sentiment": "positive"
    },
    {
      "title": "Excellent customer service",
      "text": "I transferred my current account to Nationwide and their service is always excellent. I now enjoy going into my branch.",
      "rating": 5,
      "date": "15th November 2017",
      "product": "Business Banking",
      "sentiment": "positive"
    },
    {
      "title": "Always professional, efficient and proactive.",
      "text": "When looking to start up a business I found the staff in Nationwide extremely helpful and positive about explaining my options and encouraging me to have faith in my ability to start up a business. I'm so impressed and happy, things are going great, and it all began with them.",
      "rating": 5,
      "date": "9th November 2017",
      "product": "Business Banking",
      "sentiment": "positive"
    },
    {
      "title": "Amazing",
      "text": "Amazing bank couldn't be with anyoelne better great customer service",
      "rating": 5,
      "date": "25th May 2017",
      "product": "Business Banking",
      "sentiment": "positive"
    },
    {
      "title": "Seldom any issues",
      "text": "They are genuinely on the customers side -= no shareholders to thank for that. There are hardly any negative issues and for the very, very rare ones they have been resolved quickly and professionally to my complete satisfaction. They exceed expectations in almost every way.",
      "rating": 5,
      "date": "9th February 2017",
      "product": "Business Banking",
      "sentiment": "positive"
    },
    {
      "title": "car insurance",
      "text": "great insurance products at great prices",
      "rating": 5,
      "date": "28th February 2023",
      "product": "Car Insurance",
      "sentiment": "positive"
    },
    {
      "title": "Shady SHADY",
      "text": "JUST be warned that you will have a SIGNIFICANT monthly payment increase (talking over $100 USD) that they will not tell you will occur BEFOREHAND, if you have to move cities half way in your term. Also they request proof of mileage, but \"misplace\" the proof a few times so that you have to send proof of your mileage again (I literally sent it three times). This means in the meantime your mileage goes up so they UNILATERALLY, again without TELLING YOU, increase your monthly fees. But when you ask how much of the change is due to mileage versus the move, they \"CANNOT\" determine how much of the premium increase is due to what change. It's clear shady dishonest conduct. Sick of companies being dishonest, aren't you? Just be straightforward.",
      "rating": 2,
      "date": "21st September 2021",
      "product": "Car Insurance",
      "sentiment": "negative"
    },
    {
      "title": "Affordable and comprehensive",
      "text": "Friendly, knowledgeable staff and an excellent deal. I would highly recommend this company. Very honest any upfront with their prices and what is included.",
      "rating": 4,
      "date": "23rd November 2019",
      "product": "Car Insurance",
      "sentiment": "positive"
    },
    {
      "title": "being with them over 10yrs , they know what they are doing",
      "text": "being with them over 10yrs , they know what they are doing",
      "rating": 5,
      "date": "21st July 2019",
      "product": "Car Insurance",
      "sentiment": "positive"
    },
    {
      "title": "great all around",
      "text": "great all around, great customer service",
      "rating": 5,
      "date": "17th July 2018",
      "product": "Car Insurance",
      "sentiment": "positive"
    },
    {
      "title": "A brand you can trust",
      "text": "Great customer experience from a brand you can trust. Didn't have to claim on my insurance but had the piece of mind that if I did have to I was backed by Nationwide.",
      "rating": 4,
      "date": "2nd June 2018",
      "product": "Car Insurance",
      "sentiment": "positive"
    },
    {
      "title": "Ram Kumar",
      "text": "Nice post thanks for your blog it is very interesting and very nice thanks admin for the post How To Get My Girlfriend Back",
      "rating": 4,
      "date": "6th October 2017",
      "product": "Car Insurance",
      "sentiment": "positive"
    },
    {
      "title": "Bunch of crooks",
      "text": "They take advantage of pensioners and the vulnerable. They put you on hold constantly to see if they can get you to roll over and play dead for them, they want your money but not the job of being your insurance company. If I ever head the name nationwide again I'm going to have to see a doctor for ptsd.",
      "rating": 1,
      "date": "4th October 2017",
      "product": "Car Insurance",
      "sentiment": "negative"
    },
    {
      "title": "Very cheap for young drivers",
      "text": "The cheapest most comprehensive cover for a new driver aged 18-21 that we could find",
      "rating": 4,
      "date": "25th September 2017",
      "product": "Car Insurance",
      "sentiment": "positive"
    },
    {
      "title": "Fantastic",
      "text": "Great product and great service. Able to set up in minutes.",
      "rating": 5,
      "date": "11th July 2017",
      "product": "Car Insurance",
      "sentiment": "positive"
    },
    {
      "title": "very friendly",
      "text": "very friendly and cheap price, 5 star",
      "rating": 5,
      "date": "6th July 2017",
      "product": "Car Insurance",
      "sentiment": "positive"
    },
    {
      "title": "Good service",
      "text": "Bought my car insurance online, not had any issues and happy with the service so far.",
      "rating": 4,
      "date": "14th November 2016",
      "product": "Car Insurance",
      "sentiment": "positive"
    },
    {
      "title": "Very good service and price",
      "text": "Friendly staff, good price and easy to use service.",
      "rating": 4,
      "date": "20th June 2016",
      "product": "Car Insurance",
      "sentiment": "positive"
    },
    {
      "title": "An excellent insurance company",
      "text": "I've been with Nationwide Auto Insurance for about 2 years. Their rates have always been reasonable for the coverage I needed, though not always the lowest. Their customer service is excellent, though I have had to wait a little longer than expected to reach them through the phone. I appreciate that their representatives don't push extended coverage on me, as that is something that has bothered me about previous providers. I just want quick answers to my questions, and they've always been great in that regard. Despite the price and some other issues, when it comes down to it, the main thing I care about it is how an insurance company deals with claims. In that regard, they've never let me down. I was involved in a major accident within a year, and was supported well throughout, with prompt assistance to my claim. I would definitely recommend them to anyone who's looking for a reliable insurance provider.",
      "rating": 4,
      "date": "13th April 2015",
      "product": "Car Insurance",
      "sentiment": "positive"
    },
    {
      "title": "Not the best certainly Not the worst. Best recommendation is to shop via your LOCAL INDEPENDENT agent not those that are limited to just 1 company.",
      "text": "If you're not happy then your best solution is to find an INDEPENDENT LOCAL insurance professional who can offer you the best choice and leave the guess work out of the equation for you. THIS is why they are PROFESSIONAL. You wouldn't be your own doctor or lawyer so why do you think you can trust yourself for insurance shopping with JUST one company that is limited to its own products? Go to your local insurance broker/agent because he/she/they can provide you a valuable time-saving service. Insurance is after all a SERVICE more than a PRODUCT.",
      "rating": 1,
      "date": "13th April 2015",
      "product": "Car Insurance",
      "sentiment": "negative"
    },
    {
      "title": "Sold via Nationwide, but ready an LV product...",
      "text": "I have a lot of different services from Nationwide...will write reviews for all of them now, but must say i am a little disappointed with the car insurance offering. I bought the car insurance from NATIONWIDE, but it seems like they just did this for a quick buck. LV haven't been great for me. I want to see NATIONWIDE car insurance",
      "rating": 2,
      "date": "28th October 2014",
      "product": "Car Insurance",
      "sentiment": "negative"
    },
    {
      "title": "Fantastic overall package",
      "text": "I have a current account with Nationwide so looked into the cost of insurance with them. I haven't looked back. The key thing for me is the no claims bonus and discount if you already have an account with Nationwide. Don't think I'll go elsewhere",
      "rating": 5,
      "date": "15th October 2014",
      "product": "Car Insurance",
      "sentiment": "positive"
    },
    {
      "title": "Trying to get answers online is almost impossible an...",
      "text": "Trying to get answers online is almost impossible and very stressful, I was eventually given a refund from a company I used with no help from nationwide, it showed on my online account for a day then dissappeared showing I still owed all the full original payment, when I eventually got hold of someone from nationwide after a lengthy wait they told me that I did get the refund and stated the refund which was £100 short, when I questioned it, again after a lengthy wait I was told sorry typing error! There should be a way of seeing refunds until clear all the time online, not just for a day! I'm looking at sourcing another credit card company, I have zero trust or confidence in nationwide now.",
      "rating": 1,
      "date": "2nd February 2026",
      "product": "Credit Card",
      "sentiment": "negative"
    },
    {
      "title": "Nationwide it self is fine.",
      "text": "Nationwide it self is fine. The only issue with their credit card is, there are no perks, like points, rewards, deals or discounts. Use your credit card, pay your bill on time and then story ends.",
      "rating": 4,
      "date": "28th January 2026",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "Excellent all-round service from Nationwide.",
      "text": "Excellent all-round service from Nationwide.",
      "rating": 5,
      "date": "22nd January 2026",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "Easy and very efficient service",
      "text": "Easy process, quick reply, very efficient service",
      "rating": 5,
      "date": "22nd January 2026",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "Great company, excellent customer service and always...",
      "text": "Great company, excellent customer service and always very reasonable. The definition of customer-focused",
      "rating": 5,
      "date": "22nd January 2026",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "For the customers!",
      "text": "I’ve always found them to be easy to contact and willing to advise and help with any issue. I like their app, smooth and intuitive.",
      "rating": 5,
      "date": "22nd January 2026",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "RAHAL saved the day",
      "text": "On the weekend 17/18/19/October I tried to apply for an online Nationwide credit card. But filled in the form unknowingly incorrectly and was refused the card first time ever. Tried the local branch 20/10/25 they gave me a telephone number that no longer existed. I tried for an hour to get through on another number. Rang the branch back they put me through (eventually) to a human a great guy named RAHAL who steered me through the whole process showed me where I went wrong and basically got me my Nationwide credit card So answering the review the electronic phone service was dire absolute pants until RAHAL the cavalry arrived and saved the day",
      "rating": 4,
      "date": "20th October 2025",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "Easy to use and understand, especially as a first cr...",
      "text": "Easy to use and understand, especially as a first credit card. I like how it is all able to be accessed online, and you can transfer money between accounts easily and see your balance. I would recommend.",
      "rating": 5,
      "date": "5th September 2025",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "Fast and easy service",
      "text": "Easy application process and a fast around service.",
      "rating": 5,
      "date": "15th July 2025",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "Easy to manage.",
      "text": "The Nationwide credit cards are extremely easy to manage. On the Nationwide app, you can view your statements (and past statements) all in one place. It's easy to pay off your balance; simply transfer from one account to the credit account. It's really simple and takes the stress out.",
      "rating": 5,
      "date": "13th June 2025",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "Low foreign currency charges",
      "text": "I use the Nationwide credit card for non GBP purchases when holidaying in the EU, always careful to avoid the trap of a card reader conversion to GBP, which is inevitably more expensive than Nationwide's rate.",
      "rating": 4,
      "date": "12th June 2025",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "Nationwide have consistently excellent customer serv...",
      "text": "Nationwide have consistently excellent customer service, the credit card gets good rates abroad and meets all my day to day needs",
      "rating": 5,
      "date": "12th June 2025",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "Cannot fault Nationwide great never had any problem...",
      "text": "Cannot fault Nationwide great never had any problem with them very good credit card couldn’t, wish for any better",
      "rating": 5,
      "date": "1st June 2025",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "nationwide is family",
      "text": "nationwide has always been about the people and they prove that with how they run their bank operations. no other bank other than nationwide has ever sent me a £50 thank you from their bank for the successful acquisition of virgin money, also nationwide listens to its consumers, when we complained about having to always use our card readers to transfer and how inconvenient it could be at times they updated the app to allow us to use our face id’s and fingerprints to verify it’s us rather than always using the card so now we can easily transfer and go.",
      "rating": 5,
      "date": "11th April 2025",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "Great value features with that card",
      "text": "Great value features with that card",
      "rating": 5,
      "date": "11th April 2025",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "Always been easy to deal with never had any problems.",
      "text": "Always been easy to deal with never had any problems. I got a £50 bonus for staying with them.",
      "rating": 5,
      "date": "3rd April 2025",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "Easy to ask questions",
      "text": "Easy to ask questions and access app",
      "rating": 5,
      "date": "2nd April 2025",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "I chose to have a credit card with Nationwide as the...",
      "text": "I chose to have a credit card with Nationwide as the benefits were second to none. The process to apply for the credit card was quick and easy and staff were helpful when I had questions. The information on the website made me feel confident to apply for this credit card.",
      "rating": 5,
      "date": "2nd April 2025",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "Travelling in Europe",
      "text": "I use my Nationwide credit card when travelling in Europe as there is no charge for using it to buy goods or services, unlike with the other credit card I use. It also means the cost of what I bought abroad is separated from my normal expenditure.",
      "rating": 5,
      "date": "2nd April 2025",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "Fabulous service and brilliant bank!",
      "text": "Very efficient service with good helpful advice. I was dealt with quickly and everything explained to me in full. This was so easy to apply for and very straightforward. Very professional.",
      "rating": 5,
      "date": "2nd April 2025",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "No transaction fees for spending in the EU",
      "text": "No transaction fees for spending in the EU",
      "rating": 5,
      "date": "6th March 2025",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "It’s super easy to see how much you owe on their onl...",
      "text": "It’s super easy to see how much you owe on their online banking app. It’s simple to see when your statement will be available too, and see an overview of all your accounts in one place. It’s also easy to transfer from current account to credit card.",
      "rating": 5,
      "date": "6th March 2025",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "easy to apply, good for travelling abroad as no fees",
      "text": "easy to apply, good for travelling abroad as no fees",
      "rating": 5,
      "date": "26th February 2025",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "Good service.",
      "text": "Good service. I wish thet did not charge for foreign currancy transactions",
      "rating": 4,
      "date": "26th February 2025",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "The app is not very good, constantly crashes or free...",
      "text": "The app is not very good, constantly crashes or freezes. No benefits to having this credit card, but easy to pay if you have a Nationwide bank account.",
      "rating": 3,
      "date": "26th February 2025",
      "product": "Credit Card",
      "sentiment": "mixed"
    },
    {
      "title": "Zero fees abroad",
      "text": "Good credit card to have as it has zero fees when used abroad.",
      "rating": 5,
      "date": "26th February 2025",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "First credit card i’ve ever had",
      "text": "First credit card i’ve ever had, and the product offered to me is great, not had to pay any interest yet. Able to set myself an amount limit",
      "rating": 5,
      "date": "5th February 2025",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "Don't believe their hype",
      "text": "I have a credit limit of £5000 on a credit card. Never use it all, always only about £1200. So this month paid an amount (that was the full amount) of £850.00. Evidently the cheque took a while to get there. No, even though there was still £4,2000 credit available, these idiots at Nationwide not only took a late payment of £10 (no objection) but still with £4,200 credit available, they declined a payment of £8.20. Now you need to be totally devoid of common sense to do that. What is wrong with Nationwide? I am a long term customer. Never been overdrawn, never any trouble, yet the treat me with total disrespect. Nationwide do no deserve decent, good customers. A bank to give a miss. A nd whilst these pen-pushers were telling me they hadn't received the cheque in payment, this morning I spoke to my other bank (Halifax) and they say that the cheque had been cleared. So Nationwide were either lying or incompetent. take your selection. A company that is all talk and just not interested in true customer service.",
      "rating": 1,
      "date": "29th January 2025",
      "product": "Credit Card",
      "sentiment": "negative"
    },
    {
      "title": "Poor support system for credit card customers.",
      "text": "I expected alerts from Nationwide to inform me when payments to my members credit card account. None came, unlike my other credit card accounts. It was my first credit card with Nationwide and did not realise you were expected to 'self-manage' my account, as I was later informed by their representative after Nationwide had lodged an adverse credit report against me because a payment was missed. I had historically cleared my account each month but that did not count with Nationwide. They are the only company who think it's hard work to have a supportive communication system in place for their credit card members.",
      "rating": 1,
      "date": "18th December 2024",
      "product": "Credit Card",
      "sentiment": "negative"
    },
    {
      "title": "Made a valid claim but was declined.",
      "text": "Made a valid claim but was declined. They never contacted me. I had to chase this up. Credit guarantee system was not backed up.",
      "rating": 1,
      "date": "13th November 2024",
      "product": "Credit Card",
      "sentiment": "negative"
    },
    {
      "title": "Awful experience and customer service",
      "text": "I have used Nationwide for years having a premium current account (with the £13/month fee), savings accounts and credit card. I have recently had cause to request a chargeback for a transaction on my credit card however Nationwide have refused to do the chargeback even though the money was taken against the contract I had with the company. I raised a complaint with Nationwide and their response was that they weren't going to request the chargeback and they won't compensate for the error made by the other company. I have now closed all of my accounts with Nationwide and will never use any of their products again.",
      "rating": 1,
      "date": "8th October 2024",
      "product": "Credit Card",
      "sentiment": "negative"
    },
    {
      "title": "No benefits to having it, no rewards, no cashback.",
      "text": "No benefits to having it, no rewards, no cashback.",
      "rating": 4,
      "date": "25th August 2024",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "Good for using on holiday",
      "text": "Good for using on holiday. Excellent exchange rates and charges.",
      "rating": 5,
      "date": "18th June 2024",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "Credit card with s fair interest rate never gave me...",
      "text": "Credit card with s fair interest rate never gave me problem using abroad.",
      "rating": 5,
      "date": "12th June 2024",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "0% purchase credit card",
      "text": "I have a 0% card, I was preapproved for a higher amount initially but then on hard check was offered lower which happens but was slightly frustrating.",
      "rating": 5,
      "date": "4th June 2024",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "Never had a problem first class Service",
      "text": "Never had a problem first class Service",
      "rating": 5,
      "date": "24th May 2024",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "The member credit card is great.",
      "text": "The member credit card is great. Interest free for 15 months which makes it stand out from the rest. It also allows you to use worldwide which is great for me whilst travelling.",
      "rating": 5,
      "date": "15th April 2024",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "Nationwide is an amazing bank.",
      "text": "Nationwide is an amazing bank. Simple to use and they listen to you",
      "rating": 5,
      "date": "12th April 2024",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "easy to use credit card",
      "text": "I use the credit card regularly and like that it pays off the higher interest amounts first. I also feel this lets me manage credit card debt in a better manner. Their interest charges are clear and concise as to how they’re calculated too and not overcharged like others.",
      "rating": 5,
      "date": "7th April 2024",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "Lack of transparency no support for customers",
      "text": "Lack of transparency no support for customers",
      "rating": 2,
      "date": "14th March 2024",
      "product": "Credit Card",
      "sentiment": "negative"
    },
    {
      "title": "They pretend to be a mutual run by its members.",
      "text": "They pretend to be a mutual run by its members. Truth is, they’re just another bank.",
      "rating": 3,
      "date": "12th March 2024",
      "product": "Credit Card",
      "sentiment": "mixed"
    },
    {
      "title": "No prior warning",
      "text": "Nationwide cut my credit limit by 85% without any prior warning or discussion of any kind whatsoever! I have never gone over my limit or not paid on time.",
      "rating": 1,
      "date": "28th December 2023",
      "product": "Credit Card",
      "sentiment": "negative"
    },
    {
      "title": "Horrible company",
      "text": "I raised a section 75 claim on the nationwide building Society website for a terrible experience that we had as a family renting a villa in Cyprus for a British tour operator (who have now gone bust) after several weeks I had a phone call asking me if we left the property and book up somewhere else. I explained that for the first six days, the tour operator said they were going to move us, eventually saying they couldn’t. There was serious health and safety issues as well as the place was filthy. The gentleman stated on the phone from nationwide credit card because we never left the property Visa would not reimburse us. I did try to explain and ask them to look at the multiple emails we have sent pictures and et cetera he came back with the same answer Case closed down to Visa we should’ve left the property I explained that we didn’t have an option as it was several thousand pounds to book into somewhere (else peak season August ) and we did looking to this and flights. However, they were all too expensive. I was on the money-saving website and posted my experience with the credit card company nationwide. Several people posted back saying that if it was a Visa it was a chargeback After several posts, it become apparent that Nation Wide had gone down the chargeback route not the section 75 I contacted NationWide I had to ask the question several times and they eventually answered it was a chargeback. I have raised a complaint, and apparently they automatically go down the chargeback route regardless if you filled in a section 75. I was not informed of this on the phone and genuinely thought I was being declined on the section 75. You are not told that they are closing the case as S75 . The complaints advisor stated that would be financial advice. What a load of crap. I pointed out that the S75 has nothing to do with Visa and it’s down to the credit card company to decide to pay you or not and charge back would’ve only covered £1000 not the full amount which the S75 would cover. NationWide, are not informing people of this They are automatically going down the charge back route. The only way you would find out is the above or you’ve got part of your money back, according to the complaints advisor, you would then have to re-raise S75 yet you have filled S75 at the beginning the whole thing defaults against the customer, and you are not informed of this. Classic case of having to know the answers before you can ask the question. I am shocked how NationWide are treating their customers. I believe they are in clear breach of the code of conduct and will be taking the complaint to the ombudsman. be warned. We eventually got a full refund from the tour operator, nothing to do with NationWide I will be closing all my accounts and savings with them as soon as the complaint is dealt with",
      "rating": 1,
      "date": "10th November 2023",
      "product": "Credit Card",
      "sentiment": "negative"
    },
    {
      "title": "Easy to use",
      "text": "Tesco points add up wherever you spend and the triple spend is really worth it.",
      "rating": 5,
      "date": "16th October 2023",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "Terrible terrible terrible customer service",
      "text": "The people are nice enough. They are utterly stuck inside a \"process driven organisation\" where the processes are deeply flawed and hurt their customers. No contact methods (that work) are available to help customers with problems. Awful bank",
      "rating": 1,
      "date": "7th September 2023",
      "product": "Credit Card",
      "sentiment": "negative"
    },
    {
      "title": "Useful Bank Account,",
      "text": "Very good bank. Always answered any concerns quickly and efficiently.",
      "rating": 5,
      "date": "5th September 2023",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "Amazing customer service",
      "text": "over 10 years of banking and the customer service has being so amazing over the years.",
      "rating": 5,
      "date": "2nd September 2023",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "Everything OK",
      "text": "Every thing went well from start to finish no problems encountered at all.",
      "rating": 5,
      "date": "29th August 2023",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "Really poor service, really poor company",
      "text": "Had a double charge at tesco for the same purchase - they didn't care. Called tesco who said they couldn't do anything about it... 6 weeks later and 3 letters later I'm down £90 and leaving this useless bank.",
      "rating": 1,
      "date": "4th July 2023",
      "product": "Credit Card",
      "sentiment": "negative"
    },
    {
      "title": "Good basic credit card",
      "text": "Nationwide credit card allows fee free spending abroad. An ongoing cash back option would make this card more attractive",
      "rating": 4,
      "date": "7th June 2023",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "Avoid!",
      "text": "1 star is more than what they should get but I can't do zero. 7 people I've spoken to today. Three times \"cut off\" and one time I failed security reading direct from my bank statement the answers!!! Shocking serice. I'm now trying to pay my balance and cancel my card and I can't even do that. All this started from multiple payments on my account I didn't ask for. Any other credit card company would have stoppd these straight away as they're still pending. But not nationwide. A million hoops for customers to jump through despite the answers being correct still no help, yet nothing for the companies who scam us! Don't bother using them terrible company",
      "rating": 1,
      "date": "6th June 2023",
      "product": "Credit Card",
      "sentiment": "negative"
    },
    {
      "title": "Good company",
      "text": "I recommend it nationwide bank because there’s high security",
      "rating": 5,
      "date": "2nd June 2023",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "Easy to manage credit card",
      "text": "I like the fact that Nationwide ask you to opt in when they offer to raise your credit limit. It's easy to view transactions on the app and website and easy to download monthly statements. Shame it's not cashback any more but other than that, can't complain. I also like the fact Nationwide is owned by its members and has co-operative values.",
      "rating": 4,
      "date": "31st May 2023",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "Nationwide is simple and elegant",
      "text": "Nationwide is simple and elegant",
      "rating": 5,
      "date": "6th April 2023",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "Treats people struggling with debt appallingly",
      "text": "Back in 2014 I had serious problems with debt and had the misfortune to owe Nationwide Credit Card money. I took advice from CCCS and made token payments. The advisors were the most unpleasant people I’ve ever dealt with. One said that my credit card debt was a priority debt!! They were all sarcastic and did not care about my situation. Eventually I entered an IVA and they refused to ever agree with the offer of repayment. Luckily they were not the majority creditor so they had to go along with the offer. Eventually I was able to clear the IVA early but my experience with Nationwide was so awful I would advise anyone to steer clear, they made my life more difficult than necessary at a terrible time.",
      "rating": 1,
      "date": "5th April 2023",
      "product": "Credit Card",
      "sentiment": "negative"
    },
    {
      "title": "Credit card",
      "text": "Easy to use in app and manage repayments.",
      "rating": 5,
      "date": "5th April 2023",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "Straightforward credit card",
      "text": "A basic credit card with a monthly email prompting me to download and check my statements. Very easy to use. Sadly, cashback was removed a while ago, but I like the fact Nationwide is owned by its members and operates with ethics in mind so I can live without the perk.",
      "rating": 4,
      "date": "5th April 2023",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "Poor service on credit cards",
      "text": "credits card sometimes dont scan on TFL services and its a recurring issue which isn't dealt with. It can be frustrating if im on-the-go and rushing for a bus and it doesn't work",
      "rating": 2,
      "date": "3rd April 2023",
      "product": "Credit Card",
      "sentiment": "negative"
    },
    {
      "title": "A human instead of a credit score.",
      "text": "I got my credit card with a high credit limit despite a fairly poor credit score and I was able to balance transfer a more expensive card and I now pay a really good APR and hope to end my debt much sooner as a result. So nice to be treated like a human being instead of a credit score.",
      "rating": 5,
      "date": "3rd April 2023",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "Takes too long",
      "text": "When you have an issue with a purchase that goes wrong and you think you are covered because it cost more than £100 think again you might be drawing your pension by the time it's resolved one way or the other!",
      "rating": 4,
      "date": "28th March 2023",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "Awful bank",
      "text": "Nationwide reduced my credit limit without notifying me then advised me they will do nothing about it.",
      "rating": 1,
      "date": "23rd February 2023",
      "product": "Credit Card",
      "sentiment": "negative"
    },
    {
      "title": "best bank",
      "text": "always helpful, always cheerful, always there when needed",
      "rating": 5,
      "date": "11th February 2023",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "Useful credit card I had for years",
      "text": "I’ve used this for years. It’s got several weeks to pay. An added bonus is there aren’t overseas transaction fees.",
      "rating": 4,
      "date": "8th February 2023",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "Fab for spending abroad",
      "text": "Great card perfect for spending abroad with no fees.",
      "rating": 5,
      "date": "1st February 2023",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "Customer Friendly",
      "text": "Thank you , I had my best experience with this bank",
      "rating": 5,
      "date": "29th January 2023",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "Excellent service",
      "text": "Brilliant product tdjDvzjxffnzgnxfjxfhtjz",
      "rating": 5,
      "date": "14th January 2023",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "Excellent company",
      "text": "A wonderful company with very helpful staff",
      "rating": 5,
      "date": "11th January 2023",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "Been with this society for almost 30 yrs. There is still none better.",
      "text": "Whilst Overdrafts are regulated and have to be charged at ridiculous rates, (42%) Nationwide offers a very broad range of competitive products, is fair, transparent and their staff are absolutely spectacular. If I had to pick a favourite branch, it would be the one at Southside Shopping Centre. This was not ideal, during the pandemic, but this branch is easily accessible, especially for disabled customers, is up-to-date with technology. (ATM Deposits of cash appear instantly on your account, for example) and the staff outstanding. At busier times, mainly lunch, it can be a little frustrating, as queues tend to form, but most other times, you can be in and out in under 10 mins. Also, very convenient for retailers who use the Shopping Centre, as they can get their deposits banked without even leaving the centre. I have to admit, Nationwide are slow to realise their potential in this area.",
      "rating": 5,
      "date": "12th June 2022",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "Horrendous!!",
      "text": "My fiancé and I are purchasing a house in America. He needs to transfer funds to the States in order to do this. Because of that, Nationwide started a fraud investigation which we had no problem with. What we do have a problem with is that they started it without any of the legal documents. We actually provided them of our own accord. This “investigation” has been going on and on causing us to missed our actual closing date. Not only do you never get to talk to the same person twice, but everyday you get a different story. One person will call and say, ok you’re good to go. Next day you get someone else and the nightmare begins again. Apparently it does not matter if you’ve submitted the legal paperwork or not. They will still freeze your account and prevent you from using your own funds to secure a residence.",
      "rating": 1,
      "date": "2nd June 2022",
      "product": "Credit Card",
      "sentiment": "negative"
    },
    {
      "title": "Avoid !!!!!!",
      "text": "Really poor customer service from this place. Treated poorly in branch by a rude member of staff who was very arrogant. Raised this with their customer service Tanya Pisani who offered a boris special “lessons will be learned” - absolutely disgusting customer service. Avoid and bank elsewhere !!!",
      "rating": 1,
      "date": "24th May 2022",
      "product": "Credit Card",
      "sentiment": "negative"
    },
    {
      "title": "Unprofessional CSR and managers",
      "text": "Shady, shady employees.... I am sure Nationwide Bank is a great bank but it is run by unprofessionals and uneducated people that probably never graduated high school. This is managed by people in New York or New Jersey who are uneducated and use the word \"Axe\" when using the word \"Ask!\" You can't reason with people that are uneducated that are also unprofessional. Nationwide Credit Card tried to side with the merchant even when I provided all the information they requested. I continued the dispute for over a year and I eventually won my dispute. In the end, this was pointless. They sent me a letter telling me credit will be returned to my credit card but Nationwide never gave me credit. I left countless messages for several managers and no one called me back. Then they reported to Experian that I did not pay my credit card that ruined my credit score.",
      "rating": 1,
      "date": "24th May 2022",
      "product": "Credit Card",
      "sentiment": "negative"
    },
    {
      "title": "Great if going abroad",
      "text": "Excellent exchange rates if using abroad.",
      "rating": 5,
      "date": "4th April 2022",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "Perfect",
      "text": "Good interest rate, good app, good service! Perfect!",
      "rating": 5,
      "date": "11th March 2022",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "Going extra mile",
      "text": "Real people to deal with and they genuinely help",
      "rating": 5,
      "date": "11th February 2022",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "Had no issues",
      "text": "We have had no issues with this card or company",
      "rating": 5,
      "date": "8th February 2022",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "Great customer service.",
      "text": "U.K. based call centres, who are quick to answer the phone and assist with any problems.",
      "rating": 5,
      "date": "13th January 2022",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "Great company",
      "text": "Nationwide never let you down. Been with them years. They value loyalty which is appreciated",
      "rating": 5,
      "date": "28th March 2021",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "Good expirencevti deal with transactions",
      "text": "Best ever, well presented company who deal with finances so far. Excellent presentation to quality service",
      "rating": 5,
      "date": "13th March 2021",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "A simple credit card",
      "text": "An easy to manage, no frills, credit card- does the job!",
      "rating": 5,
      "date": "8th February 2021",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "Thieves and liars!",
      "text": "Nationwide credit card are the worst company I have ever dealt with. They have charged me over £170 for a balance transfer that they NEVER made for me and after 1.5 years of going back and forth with a million different departments they still refuse to give me a refund. I have made several complaints to them, but none of my complaints have been given a FINAL RESPONSE! When I spoke to the financial ombudsman, they advised me that NATIONWIDE ARE LEGALLY OBLIGED TO SEND ME A FINAL RESPONSE LETTER. Yet they refuse. Every time I call them they tell me that the case has been closed without even providing me with a final response letter. What a joke of a building society! I wish I never left Santander! I do not recommend Nationwide to anyone! ESPECIALLY NATIONWIDE CREDIT CARD. CROOKS!",
      "rating": 1,
      "date": "7th December 2020",
      "product": "Credit Card",
      "sentiment": "negative"
    },
    {
      "title": "pathetic procedure",
      "text": "I have been a customer for over 20 years and I never missed a payment, However I receive a letter saying I have missed a payment for £ 5.50 and have incurred a late charge . I ring them and they then refund the late charge , and while I am on the phone, I actually pay £ 674.00 that isn't even due for another 10 days. They then notify Experian that I have defaulted and missed a payment ( WAIT FOR IT ),,, for £ 674.00 !! which is now on my credit file. How much is that all back to front !! I have explained to Experian and they fully understand that Nationwide have made an error , but having spoken to Nationwide on 3 occasions now, they are not prepared are able to even speak to Experian and explain what happened. Ironically the £ 5.50 bill was payed also on time, I will be cancelling the card and all other products I have with them. As far as my credit file is concerned , it will just sit there for no fault of my own , and is due to the Nationwide's incompetence and poor customer support. NOT HAPPY",
      "rating": 1,
      "date": "21st July 2020",
      "product": "Credit Card",
      "sentiment": "negative"
    },
    {
      "title": "Good credit card when abroad.",
      "text": "Pin problems abroad meant lots of stress but the helpline was easy to access and good advice meant the problem was sorted quickly.",
      "rating": 4,
      "date": "12th July 2020",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "Best customer service I've experienced in a long time",
      "text": "Incredibly efficient fraud prevention service when my card was skimmed, and a new card was with me in under 72 hours. Always fantastic customer service and great communication whenever I've needed to contact the team!",
      "rating": 5,
      "date": "1st June 2020",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "Disgraceful customer care",
      "text": "Disgraceful customer service and banking facility. If anyone still banks with these crooks I recommend you switch if you ever want to get any descent customer service and aid in times of need. Having fallen a victim to Coronavirus was worried about making loan repayments for the upcoming month as I was in self-isolation and on unpaid leave from work. Have always kept up with my loan payments and never missed anything for the past 3 years. Dont let the false advertisements on their website fool you, they try to come across as they are very helpful and that they will assist their customers during \"challenging times\", having called their \"Triage\" team and waited over 1 hour on hold, I pleaded with the rep to offer some help to overcome the situation am in, wether that will be 1 month payment holiday on the loan or an increase in overdraft / credit card limit to tie me over just for 1 month and the outcome was, they only offered to change the repayment date on the loan and move it back by upto 14 days like that is going to help!, they do this all year round , nothing new and certainley no additional help during this pandemic. These stingy crooks did not even consider freezing credit card or overdraft fees just for 1 month till i return to work. Lastly in the same week, i accidently transfered some money from my current account to my credit card (online via internet banking), I was meant to transfer it to my savings account but as you know its very easy to select the wrong account to transfer money to in the drop down menu. After realising my mistake, I found there is no option to transfer money back from your credit card to your current account. I gave customer support a call and got through to a guy called \"Sachin\" (sounded like a right chav) whom immediatly said \"you been passed to me in the collections department, your balance is xx and you need to pay xx\"... I thought what the hell is this guy on? No one passed me through, I called in and my query is not related to balance, I have already paid the monthly amount due on my card thanks!!, I then told him the reason for my call to which he replied to transfer money back from credit card to current account would take 5 days to process..... and as i questioned why so long, he replied, you made the mistake what do you want us to about it? As you can see, the customer service is shocking, rude, incompetent staff even at the highest level, you can not even get through to a manager or to the complaints team, instead they take your number and you'd be lucky to ever recieve a call back from the complaints department. This is the 21st century folks.....and Nationwide expects you to wait 5 days to get funds transfered from your nationwide current account to your nationwide credit card back, come on people, open your eyes. just check what other banks offer and you will be suprised at the level of care and service compared to Nationwide which is a sinking ship! By the way, I also had a loan with YB and Post office and having spoke to their financial care team, they both provided a month payment holiday to assist me during the crisis which has meant reduced income. I am ever grateful to these banks and the difference between customer care and support is night and day compared to the crooked Nationwide. I will ensure on my return to work that I change bank details with my employer to YB with the outlook of closing my bank account with Nationscum.",
      "rating": 1,
      "date": "23rd March 2020",
      "product": "Credit Card",
      "sentiment": "negative"
    },
    {
      "title": "Great for FX",
      "text": "Great card for travelling abroad. Excellent FX conversion rates",
      "rating": 5,
      "date": "27th January 2020",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "Happy with the service",
      "text": "Helpful knowledgeable staff, will suggest products to suit you. Been with them for quite a few years & no intention to move.",
      "rating": 5,
      "date": "2nd January 2020",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "Excellent Card",
      "text": "friendly telephone staff, good rates, very good on security and fraud.",
      "rating": 5,
      "date": "21st November 2019",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "Worst Bank EVER - DO NOT BANK WITH THIS BUNCH OF CROOKS",
      "text": "After getting behind with some payments due to financial problems, Nationwide informed me that they intend to ILLEGALLY change the unsecured credit card debt into a SECURED debt which they were going to secure against my house. This is utterly irresponsible and illegal !!!",
      "rating": 1,
      "date": "10th November 2019",
      "product": "Credit Card",
      "sentiment": "negative"
    },
    {
      "title": "Best experience overall compared with all other banks!",
      "text": "Best experience overall than all other banks I have used in the past!",
      "rating": 4,
      "date": "7th November 2019",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "Good and Bad Nationwide",
      "text": "Good customer service but annoyingly will only text main cardholder if a query- will not take or use an alternative mobile number",
      "rating": 4,
      "date": "6th November 2019",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "cashback",
      "text": "good cashback rates for none american express eligible people.",
      "rating": 5,
      "date": "30th July 2019",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "Caution",
      "text": "Before giving me a credit card Nationwide gave me a long talk on the best way to handle money and then quizzed me on all the information. They were very thorough and seemed to really care for my needs.",
      "rating": 5,
      "date": "22nd June 2019",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "So easy",
      "text": "Easy to take out, usually a good opening offer available and there for you in an emergency. I had my card stop working on holiday and their advice was great.",
      "rating": 5,
      "date": "9th June 2019",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "Nice people to deal with.",
      "text": "Easy to use everywhere and very customer friendly.",
      "rating": 5,
      "date": "9th June 2019",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "Manage your credit balance",
      "text": "They're careful when increasing or decreasing credit limit. Not a reckless company.",
      "rating": 4,
      "date": "9th June 2019",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "Doesn't quite make my grade",
      "text": "It was good as a cashback card for a while.Then they cut the amount,not worth the hassle now.",
      "rating": 3,
      "date": "1st June 2019",
      "product": "Credit Card",
      "sentiment": "mixed"
    },
    {
      "title": "Credit Card with Cashback",
      "text": "I don't use my credit card all the time, but it's very handy for holidays. I love the cash back you get just for using it and making repayments is super easy using the Nationwide online banking system. Staff are genuinely friendly no matter which branch you go to in my 40 years worth of experience with them. As an aside, many years ago I had a cheque book stolen and £600 taken from my account. I was quickly reimbursed and was treated with total respect which made the harrowing experience a lot more bearable.",
      "rating": 5,
      "date": "16th April 2019",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "Beware overpaying your credit card",
      "text": "I accidentally paid my credit card bill twice. On realising my mistake I asked Nationeide to return the overpayment to my bank. They refused to do that and instead said they could either issue a cheque, pay into my current account with Nationwide (I don’t have one) or tecredit by direct debit if I had paid by direct debit(O hadn’t). I cannot hope nferstand why Nationwide could not credi the money by the same method it had been paid, or BACCS. The Finacial Ombudsman has found in Nationeide’s favour, surprise surprise! So be very careful how you pay your credit card bill and don’t not overpay it.",
      "rating": 2,
      "date": "15th April 2019",
      "product": "Credit Card",
      "sentiment": "negative"
    },
    {
      "title": "Nationwide top-notch!",
      "text": "I recently took out a credit card with nationwide and set up a savings account for my daughter. Great service and honestly nothing was too much effort for them. Smoothly opened both and I would highly recommend them.",
      "rating": 5,
      "date": "8th February 2019",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "Very friendly & helpful",
      "text": "I was recently the victim of credit card fraud and couldn't fault how professional and helpful Nationwide was in informing me and dealing with it. Never had an issue with them. Cashiers in the branch are always very friendly, too.",
      "rating": 5,
      "date": "12th January 2019",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "Nationwide not delivering",
      "text": "Recently switched to Nationwide, well last October, still haven't received £100 for being recommended by a friend and neither has the friend. Otherwise the account is functioning ok.",
      "rating": 3,
      "date": "11th January 2019",
      "product": "Credit Card",
      "sentiment": "mixed"
    },
    {
      "title": "Nationwide",
      "text": "I have been a customer of Nationwide for almost 30 years and still they make good offers. I have had banking products and credit cards from other companies but the customer service is never as good as Nationwide",
      "rating": 5,
      "date": "11th January 2019",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "Brilliant",
      "text": "Never have complaints about any aspect of their service or systems",
      "rating": 5,
      "date": "10th January 2019",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "great company. excellent service",
      "text": "Experience with Nationwide has been excellent. they're very friendly, and helpful. I bank with Nationwide and have a credit card with them too and it's both convenient and easy to pay my bill and accrue rewards.",
      "rating": 5,
      "date": "5th January 2019",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "Best bank",
      "text": "the best bank you can easily withdraw money from times where I really like ,and I even recommended to my buddies",
      "rating": 5,
      "date": "20th December 2018",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "Great",
      "text": "I highly recommend Nationwide Credit Card as they are professional and helpful when you have a problem.",
      "rating": 5,
      "date": "17th December 2018",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "Good customer care",
      "text": "very understanding to the needs of customers",
      "rating": 4,
      "date": "9th December 2018",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "Decent credit card company",
      "text": "Good customer service. They’re helpful and have incentive like cash back.",
      "rating": 4,
      "date": "2nd December 2018",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "International travel",
      "text": "No commission on transaction made abroad. It is useful as we like to shop in France",
      "rating": 5,
      "date": "10th November 2018",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "brilliant",
      "text": "excellent customer service and no problems with setting it up",
      "rating": 5,
      "date": "8th November 2018",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "Select Credit Card",
      "text": "A great Credit Card with no non-Sterling transaction fees.",
      "rating": 4,
      "date": "6th November 2018",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "Select Visa Card",
      "text": "The lack of non-Sterling transaction fees saves me a significant amount every year on my overseas spends.",
      "rating": 4,
      "date": "6th November 2018",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "great",
      "text": "no charges in europe so one of the best",
      "rating": 5,
      "date": "6th November 2018",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "DONT BECOME THEIR CLIENT",
      "text": "I made a wrong international transaction on 18th of April 2018 for 882 pounds. 6 months later the money are stuck in their intermediary bank HSBC and they cant be bothered to give me back my money blaming the intermediary bank and the intended receiving bank for not getting back to them. is 2018 and NWBS doesnt have the means to track money, thats what they are keep saying thru internet banking. i am not the only one people., DO NOT USE NATIONWIDE BUILDING SOCIETY SERVICES",
      "rating": 1,
      "date": "2nd October 2018",
      "product": "Credit Card",
      "sentiment": "negative"
    },
    {
      "title": "Useful for overseas travel",
      "text": "For those who travel overseas often the Nationwide Credit Card is a good way to save money, by building up a commision free allowance when using your credit card abroad",
      "rating": 4,
      "date": "19th September 2018",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "Really helpful when things go wrong",
      "text": "Four figure purchase went wrong in New Zealand when a company claimed it could no longer trade. The Nationwide team got onto the case very quickly and managed to backcharge the company's account. They recovered 100% of the loss including currency exchange rate move.",
      "rating": 5,
      "date": "9th June 2018",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "Great credit card very easy to use and understand",
      "text": "A great credit card, its easy to use and understand no nasty surprises and the best part cashback on all purchases silly to not to consider this card before applying",
      "rating": 5,
      "date": "8th June 2018",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "great cashback",
      "text": "great cashback and easy to manage on app",
      "rating": 5,
      "date": "13th April 2018",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "quick to reply",
      "text": "Had a few problems with credit card.E mailed via bank website they were quick to respond and sort it...",
      "rating": 4,
      "date": "10th February 2018",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "Excellent",
      "text": "Nationwide are always so helpful I would recommend them to my family and friends",
      "rating": 5,
      "date": "9th February 2018",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "Rewards are easy to earn",
      "text": "Nationwide reward card gives me cash back on my spending without any effort.",
      "rating": 5,
      "date": "8th February 2018",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "Easy card to use",
      "text": "I use this card when abroad as the exchange rates are good",
      "rating": 5,
      "date": "19th January 2018",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "Easy",
      "text": "Easy to open my credit card with cash back on every purchase.",
      "rating": 4,
      "date": "19th January 2018",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "Brilliant Credit Card - Helped me out",
      "text": "Nationwide has really helped me. As an 18 year old with no credit history, Nationwide was the only high street reputable lender that was offering me a credit card after carrying out Elegibility checkers. Good customer services over telephone and in branch. Credit card offered with good credit limit for an 18 year old. Online quotation given gives the customer to confidence to apply before a credit search is done. Shame about the recent cashback reduction but it’s a sign of the times and not Nationwide’s fault.",
      "rating": 5,
      "date": "17th January 2018",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "Always great customer service.",
      "text": "I've always found the customer service at Nationwide to be absolutely brilliant. And the products are always very reasonable.",
      "rating": 4,
      "date": "5th December 2017",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": ".5% cashback on everything!",
      "text": "Great card, very attractive rates for spending abroad and .5% cashback on everything you purchase!",
      "rating": 5,
      "date": "2nd December 2017",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "Pain-free balance transfer",
      "text": "Opened up credit card in order to do a balance transfer. All went smoothly and was helped every step of the way. Website can be a bit unintuitive at times and persistent requests for passwords and memorable data can be a pain,",
      "rating": 4,
      "date": "22nd November 2017",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "Brilliant Card",
      "text": "Easy to use card, part of mobile app so can keep track of spending / payments and interest being paid. Low interest rates",
      "rating": 5,
      "date": "13th November 2017",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "NW credit card",
      "text": "does the job - never any problems",
      "rating": 4,
      "date": "9th November 2017",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "Always deal with issues promptly",
      "text": "Nationwide have always dealt efficiently with any fraudulent transactions using lost/stolen credit cards. Frontline and telephone staff helpful and knowledgeable. I have been a customer with them for a great number of years and never persuaded to change for some “more lucrative deal” due to their excellent service",
      "rating": 5,
      "date": "8th November 2017",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "Great Card great company",
      "text": "No issues during my first year using the card, great intro rates and 0% and online banking is a breeze",
      "rating": 5,
      "date": "6th November 2017",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "does the job",
      "text": "no problems using them.. efficient service",
      "rating": 4,
      "date": "6th November 2017",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "Great Card",
      "text": "We use our credit card to pay for most things and then pay off the balance in full at the end of the month, this means there is no extra to pay back but we get cash back which over the course of the year ends up being around £75. It is a great card to use abroad as well.",
      "rating": 5,
      "date": "6th November 2017",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "Home & Abroad",
      "text": "Used anywhere with no additional charges.",
      "rating": 5,
      "date": "9th August 2017",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "Good",
      "text": "It's a good product, but the customer service at times could be better.",
      "rating": 3,
      "date": "30th June 2017",
      "product": "Credit Card",
      "sentiment": "mixed"
    },
    {
      "title": "Quick to solve any issues and quickly onto fraudulent activity",
      "text": "My experience of having a nationwide credit card is that they are quick to solve any issues and quickly onto fraudulent activity, sending out new cards speedily.",
      "rating": 5,
      "date": "11th June 2017",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "Excellent Credit Card",
      "text": "As an existing Nationwide customer the application process was very easy. The cards arrived within a few days and included an interest free period and a fee free balance transfer. I even received a bonus for taking the card out.",
      "rating": 5,
      "date": "11th June 2017",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "Credit card Customer Service",
      "text": "Much more helpful than any other company I have dealt with",
      "rating": 4,
      "date": "10th June 2017",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "Great card",
      "text": "This was the best long term deal I could get for balance transfer and a only 17.9%.",
      "rating": 5,
      "date": "30th May 2017",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "Reliable Company",
      "text": "I like Nationwide because they are local with long opening hours and very helpful and knowledgeable.",
      "rating": 5,
      "date": "1st May 2017",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "a good, basic service",
      "text": "nationwide gives good customer service, but, as with the credit card industry in general, things could be simplified and clarified",
      "rating": 4,
      "date": "21st April 2017",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "Terrible",
      "text": "Terrible overly risk adverse product that rejects online purchases for little or no reason. Leaving you without out your purchase, then makes you jump through hoops to fix their error! Very poor",
      "rating": 1,
      "date": "21st April 2017",
      "product": "Credit Card",
      "sentiment": "negative"
    },
    {
      "title": "Honest company",
      "text": "One of the few honest and ethical financial companies left.",
      "rating": 5,
      "date": "14th April 2017",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "Awful",
      "text": "Increase in credit card without doing affordability checks. Does not care about putting people in debt",
      "rating": 1,
      "date": "10th April 2017",
      "product": "Credit Card",
      "sentiment": "negative"
    },
    {
      "title": "Always there for you",
      "text": "I have been a customer with Nationwide for some time the products I have purchased are Mortgage, Health Insurance, Loan & Credit Card they have always met all my needs and exceeded my expectations many times",
      "rating": 5,
      "date": "8th April 2017",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "Helpful and reliable",
      "text": "Staff have always been helpful, whether we have gone to them with queries, problems or about changing our accounts. Extra effort is made to retain customers and reward long standing customers",
      "rating": 5,
      "date": "5th April 2017",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "excellent",
      "text": "excellent cashback and customer service.",
      "rating": 5,
      "date": "4th April 2017",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "Very good interest rates",
      "text": "Very good rates of interest and sensible with the credit limit",
      "rating": 4,
      "date": "4th April 2017",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "Good to use abroad",
      "text": "Low fees when you use this card abroad. Easy to manage obline.",
      "rating": 4,
      "date": "4th April 2017",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "Good Service",
      "text": "Amazing friendly helpful staff in the call centres. Always willing to go the extra mile to help you.",
      "rating": 5,
      "date": "12th February 2017",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "Superb customer service",
      "text": "I often have to travel to France and, because I have had my card for some years, I get free spending abroad in euros. Most cards would charge an exchange rate fee but not my Nationwide credit card - superb!",
      "rating": 5,
      "date": "12th February 2017",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "Very quickly provided me with a substantial credit limit increase to cover purchase of season ticket.",
      "text": "The card comes with various perks, but the one I like most is that I get charge free foreign currency (up to ten per cent of what I spend on the card.)",
      "rating": 5,
      "date": "7th February 2017",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "Select credit card",
      "text": "Fantastic product. cashback on all my purchases & free purchases abroad",
      "rating": 5,
      "date": "6th February 2017",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "Hassle Free, low fees and does everything you would want a credit card to do",
      "text": "Very easy to apply and get a credit card with Nationwide. It came through quickly and the process of transferring a balance was quick and simple.",
      "rating": 4,
      "date": "3rd February 2017",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "Very good",
      "text": "No problems with this credit card.",
      "rating": 5,
      "date": "27th January 2017",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "No issues",
      "text": "Yeah not bad. I would come again.",
      "rating": 3,
      "date": "24th January 2017",
      "product": "Credit Card",
      "sentiment": "mixed"
    },
    {
      "title": "Reliable and Rewarding",
      "text": "Just to say I highly recommend my Nationwide Select Credit card as the associated staff are very competent and helpful in an emergency (such as when an unauthorised company tries to take recurring payments from said credit card account as happened to me recently), and they're always available via a free phone number.",
      "rating": 4,
      "date": "31st December 2016",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "Great 0% credit cards",
      "text": "Taken out two credit cards (wife & I), no interest on purchases for 12 months, keeping money I've spent on cards on Nationwide account (earning 5%). Easy way to make money!!!",
      "rating": 5,
      "date": "24th December 2016",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "Online scammed but computer said no",
      "text": "Out group account was broken into and fraudulent transactions were made but nationwide caught every single one before it hit our account, then informed us and deactivated our cards and gave us new ones. Cant sing their praises enough",
      "rating": 5,
      "date": "18th December 2016",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "Good for what it is",
      "text": "We use the nationwide card and doesn't seem too steep though I only really have for emergencies",
      "rating": 4,
      "date": "16th December 2016",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "Good, but...",
      "text": "They're good for pretty much anyting, but don't believe they are 'different' from any of the banks!",
      "rating": 4,
      "date": "15th December 2016",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "One of best cards if going abroad",
      "text": "One of best cards if going abroad - low transaction fees.",
      "rating": 5,
      "date": "29th November 2016",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "Just OK",
      "text": "I have a Nationwide Visa credit card that I only use for emergencies. I would say it is just OK, nothing more.",
      "rating": 3,
      "date": "29th November 2016",
      "product": "Credit Card",
      "sentiment": "mixed"
    },
    {
      "title": "Excellent service from start to finish",
      "text": "Signed up for a Nationwide 0% on purchases and transfer credit card for a large purchase. Application form was straight-forward and acceptance was instant. Received card the next day and the number for the card three days later. Very happy with the product and the great rate offered after the 0% introductory rate expired.",
      "rating": 5,
      "date": "14th November 2016",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "Great offer & customer service",
      "text": "Great service through-out the length of my 0% interest period. My most recent offer has come to an end & the majority of my documentation has been encouraging me to clear my balance or leave to avoid interest charges; quite refreshing for a bank to do this. My previous experience is that this is hidden in the small print.",
      "rating": 5,
      "date": "11th November 2016",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "Excellent bank that responds quickly to the customer's needs",
      "text": "Nationwide has very friendly staff that are ready to answer your queries and help you in anyway. They also gave me access to 5% AER for the first 12 months with them. I am very satisfied with their services",
      "rating": 5,
      "date": "14th October 2016",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "Excellent and friendly service",
      "text": "I had a querry about unexpected expenses showing up on my credit card, staff were very friendly and helpful in explaining the expenses in question, i was impressed.",
      "rating": 5,
      "date": "14th October 2016",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "Disappointed with select credit card which is meant to be convenient for use abroad",
      "text": "As a consultant with international clients, I was looking for a card with decent rates when abroad and convenient to use when I travel between countries without returning to the UK first. Nationwide select credit card was recommended (online and by friends & family i.e. F&F) because it's rates were good but most importantly, once I informed Nationwide of my travels, F&F assured me that it was highly unlikely I would have to call them over and over again each time I needed to pay something. It was for this reason, I chose this card. But alas, it has been a nightmare. Every time I use my card online whilst I'm abroad (for instance to sort out flights, hotels, food, but credit on local SIM cards, etc), 'verify by VISA' declines and asks me to call a uk number which is extortionate with roaming costs and the long waits for Nationwide customer services to pick up. I'm reverting to my older credit cards now because repeating the same thing to customer service agents who assure me they have taken notes on the account that I'm abroad but go through the same decline/'fraud alert' process each time I try to use the card is a nightmare. When I tell Nationwide my frustration and ask why this keeps getting declined, there is no reason apart from 'routine/random' security checks. I appreciate efforts made to protect customers' security but I'm disappointed that in an effort to maintain security my experience with this card has been expensive (roaming charges), onerous and different from my F&F. I could not in good conscience recommend this card to anyone after what I have been through... Perhaps if one does not have a \"typical\" name, they are put on the \"extra security checks\" list for no other reason than that?",
      "rating": 2,
      "date": "1st October 2016",
      "product": "Credit Card",
      "sentiment": "negative"
    },
    {
      "title": "Excellent service and non-pushy staff",
      "text": "In every communication with Nationwide they have been excellent. They are polite and don't try and up sell unless you mention something you need. excellent",
      "rating": 5,
      "date": "30th August 2016",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "Good rewards",
      "text": "Good rewards for switching and cashback on everyday spending",
      "rating": 4,
      "date": "29th June 2016",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "Great credit card!",
      "text": "Been using this credit card for years with no trouble. I get 1% cash back, and it's also good for use abroad!",
      "rating": 5,
      "date": "26th June 2016",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "very safe",
      "text": "Always put a block on a really expensive on line purchase until i contact them, to some people this would be annoying, but i like the secure feeling.",
      "rating": 4,
      "date": "22nd June 2016",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "great to use abroad no charges in the EU",
      "text": "Use this in the EU and there are no charges like other credit cards. In the UK you get money discounts/ offers, at selected retailers, which change once in a while, online at my rewards with Nationwide.",
      "rating": 5,
      "date": "8th May 2016",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "Credit card accepted everywhere",
      "text": "We have had the Nationwide Select Credit card for a number of years ad never experienced any problems using online or instore. The interest charged for this card is a reasonable 15.9% if you have a Nationwide current account, as we have. Also, the interest rate can be avoided completely if you pay the outstanding amount in full, as we do. Cashback is 0.5% when spending on this card, and there are more attractive rates of cashback offered by other banks and building societies. However, I like to have a credit card with my main building society, and the Select credit card is easy to use, with a credit limit suitable for our needs. The card also gives access to various rewards offered by Nationwide, as there rarely seems anything we need. For a simple and easy to use credit card, I would recommend the Select.",
      "rating": 4,
      "date": "6th May 2016",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "Earn credit to use abroad",
      "text": "I've always received a great service from Nationwide credit card. I like that you can build up a reserve of credit which you can use abroad for free exchanges. So you are charged any exchange fees.",
      "rating": 5,
      "date": "6th May 2016",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "Nice rewards",
      "text": "Good experience and rewards, I cannot complain",
      "rating": 5,
      "date": "24th April 2016",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "no understanding when we ran into financial problems due to illness",
      "text": "no support when we needed understanding",
      "rating": 2,
      "date": "23rd April 2016",
      "product": "Credit Card",
      "sentiment": "negative"
    },
    {
      "title": "Nationwide Visa Credit Card accepted everywhere",
      "text": "I would recommend Nationwide Visa credit card. When spending on the credit card, I always pay the balance before it is due. That way there is never any interest charged. If you decide to wait until the payment is due, interest rates are 17.9%, which is quite competitive compared to other banks and building societies. We have a Nationwide flex current account, and payments into the credit card can easily be done through the online banking system. We have a reasonable credit limit, more than enough for our needs, and have never had any problems using the card.",
      "rating": 4,
      "date": "21st April 2016",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "CREDIT CARD",
      "text": "No fees or interest to pay on balance transfers or purchases - all interest free for a year.",
      "rating": 5,
      "date": "21st April 2016",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "Great for cashback",
      "text": "Nationwide's select credit card is a great option as you get cash back every time you use it. If you have a current account with them as well it is perfect for using abroad as there are no fees which makes a big difference to holiday expenses. Their customer service is good too - when I had a problem with my card recently they were very helpful and understanding and resolved my problem fairly and easily.",
      "rating": 5,
      "date": "21st April 2016",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "Best cash back credit card",
      "text": "I have been using nationwide credit for few years now and I can say this is the best cash back credit card on market. It gives some incentive if you are new customer and then 0.50% whixh sounds like little but it adds a lot in a year. I have received £100 last year. The customer service is superb.",
      "rating": 5,
      "date": "28th March 2016",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "GOOD",
      "text": "Applied for a credit card and found it quick and easy and got a good repayment rate. Only slight hold up was that I had to visit branch with ID but once this was done the card arrived quickly",
      "rating": 5,
      "date": "28th March 2016",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "the credit you need and can afford no more no less",
      "text": "I never wanted a credit card (still don't) but I find I need one for travel these days. nationwide gave me what I wanted with out pushing me to take additional credit. Perfect",
      "rating": 5,
      "date": "19th February 2016",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "Good cashback",
      "text": "Use this card for all my purchases and each year get a nice surprise of cash back just before Christmas. Recommend as a result.",
      "rating": 4,
      "date": "24th December 2015",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "Spending with Cashback!",
      "text": "Great credit card which gives cashback on spending. No interest to pay when you pay the balance each month. Easily transfer payment through Nationwide's excellent online banking system. Recommended.",
      "rating": 5,
      "date": "21st November 2015",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "Excellent Service",
      "text": "I recently applied for a credit card with Nationwide as I wanted to improve my credit rating. I went into my local branch and was able to speak to someone straight away and apply for the card. The rates and terms were all explained well and he also helped me to set up paying off my outstanding balance at the end of the month so I would not have to pay any interest. I was very happy with the service provided and after having the card for several months now have had no problems.",
      "rating": 5,
      "date": "28th August 2015",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "Targeting the vulnerable.",
      "text": "I will never forgove Nationwide for calling me into branc the day I turned 18 and giving me a £2000 overdraft and £3000 credit card. Irresponsible lending at its worst! 5 years later and I'm still paying it all off!",
      "rating": 1,
      "date": "26th August 2015",
      "product": "Credit Card",
      "sentiment": "negative"
    },
    {
      "title": ".5% cash back, never any problems, good currency rate abroad",
      "text": "I have the \"select\" half percent cash back card, buying on this card, as long as you pay it in full every month, gives a nice little boost at the end of the year. There are never any problems with card payments e.g. late, doubled, missing or declined in error. They have a really good euro rate when you use the card to buy in Europe. They have a good, easy-to-use website and the staff are always helpful.",
      "rating": 5,
      "date": "27th April 2015",
      "product": "Credit Card",
      "sentiment": "positive"
    },
    {
      "title": "A good all rounder",
      "text": "A good all round card that has a sensible limit, some benefits and a reasonable rate. Not spectacular, but nice and stable.",
      "rating": 3,
      "date": "20th October 2014",
      "product": "Credit Card",
      "sentiment": "mixed"
    },
    {
      "title": "always very helpful - easy to speak to someone in br...",
      "text": "always very helpful - easy to speak to someone in branch or on the phone",
      "rating": 4,
      "date": "26th February 2025",
      "product": "E Bond",
      "sentiment": "positive"
    },
    {
      "title": "Great rates",
      "text": "Easy to use app and good communication.",
      "rating": 5,
      "date": "10th March 2023",
      "product": "E Bond",
      "sentiment": "positive"
    },
    {
      "title": "Easy to use online banking",
      "text": "Nationwide provides a secure, easy to use and informative online banking website. I can access easily, find out about upcoming current account payments.",
      "rating": 4,
      "date": "13th August 2022",
      "product": "E Bond",
      "sentiment": "positive"
    },
    {
      "title": "Nationwide great to work with",
      "text": "Opened an EBond online, very simple to do with no problems. Would certainly use again if rates improved.",
      "rating": 4,
      "date": "2nd April 2022",
      "product": "E Bond",
      "sentiment": "positive"
    },
    {
      "title": "ace",
      "text": "brilliant customer service. would recommend.",
      "rating": 5,
      "date": "8th August 2019",
      "product": "E Bond",
      "sentiment": "positive"
    },
    {
      "title": "Super-Friendly Customer Service",
      "text": "I have been a Nationwide customer for many years. Although I do most of my banking online, on the recent occasions when I have visited my local branch, the staff have been genuinely friendly and very efficient.",
      "rating": 5,
      "date": "16th April 2019",
      "product": "E Bond",
      "sentiment": "positive"
    },
    {
      "title": "Account information is easy to read and understand",
      "text": "Nationwide account setup information is very clearly presented and easy to use.",
      "rating": 5,
      "date": "23rd January 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Nationwide customer for more years than I can remember.",
      "text": "I’ve been a Nationwide customer for more years than I can remember and they have always provided competitive products and options for customers. Their fixed rate 18 month bond was too good to miss. They’re customer loyalty payments in recent years have also been a welcome bonus. I have other banking and savings accounts but Nationwide is my main account.",
      "rating": 5,
      "date": "23rd January 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Customer service is diabolical.",
      "text": "Customer service is diabolical. No Customer relationship whatsoever",
      "rating": 2,
      "date": "23rd January 2026",
      "product": "Savings",
      "sentiment": "negative"
    },
    {
      "title": "FEELING VALUED",
      "text": "Nationwide really looks after its members and makes them feel valued - offers preferential rates for savings accounts and Bonds",
      "rating": 5,
      "date": "23rd January 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Always good rates, easy to use internet",
      "text": "Always good rates, easy to use internet",
      "rating": 5,
      "date": "22nd January 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Great rates to members.",
      "text": "Great rates to members. Fixed rate gave leading market interest rate. The £100 reward to members, twice for a joint account is most welcome",
      "rating": 5,
      "date": "30th June 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Nationwide's latest bond.",
      "text": "Nationwide's customer bond has a good interest rate, Their online banking is easy to navigate.",
      "rating": 5,
      "date": "13th June 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Superb service allround.",
      "text": "Great rates, easy to set up the product and clear and concise communication.",
      "rating": 5,
      "date": "13th June 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Great bank.",
      "text": "Great bank. Brilliant saving bonds. And very generous bank . Giving £50 - £100 to customers. Fantastic",
      "rating": 5,
      "date": "12th June 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Opened member 5% bond recently online.",
      "text": "Opened member 5% bond recently online.",
      "rating": 5,
      "date": "12th June 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Best Interest rate I can find amongst main stream banks",
      "text": "Best Interest rate I can find amongst main stream banks",
      "rating": 4,
      "date": "26th February 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "I've banked with Nationwide for many years and have...",
      "text": "I've banked with Nationwide for many years and have different accounts with them, savings, current, isa and fixed bond I frequently consider other options but always steer myself back to these guys partly through confidence in their products but their rates are excellent",
      "rating": 5,
      "date": "26th February 2025",
      "product": "Savings",
      "sentiment": "positive"
    }
  ]
}