{
  "society": "Newbury Building Society",
  "slug": "newbury-building-society",
  "smpUrl": "https://smartmoneypeople.com/newbury-building-society-reviews/products",
  "totalReviewsOnSMP": 10019,
  "avgRating": 4.78,
  "scrapedAt": "2026-02-06T15:59:36.407697+00:00",
  "reviews": [
    {
      "title": "Excellent",
      "text": "I have been so satisfied by the customer service experience at every contact I’ve had since my mortgage commenced in 2018. They always make an effort to get you the best deal they can offer. They’re great at explaining the available options that would give me the best deal. No pressure, just information. Just 10/10 all around",
      "rating": 5,
      "date": "30th January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "I found NBS very proactive and helpful.",
      "text": "I found NBS very proactive and helpful.",
      "rating": 5,
      "date": "30th January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Always answer the phone and polite, efficient service.",
      "text": "Always answer the phone and polite, efficient service. Recently added to my mortgage and a simple and effective process in a timely manner",
      "rating": 5,
      "date": "30th January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Mortgage Reviews",
      "text": "I have been a mortgage customer for Newbury for a number of years now and I always have a fabulous experience with my adviser Angela Bradshaw, she is friendly professional and always explains everything in great detail. Thank You Angela",
      "rating": 5,
      "date": "29th January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Newbury have helped me with a mortgage as a first ti...",
      "text": "Newbury have helped me with a mortgage as a first time buyer, their staff are friendly and knowledgeable. Recently I have also remortgaged through them to reduce my interest as rates have gone down, the process was very quick and staff supported well throughout.",
      "rating": 5,
      "date": "28th January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Eve was extremely helpful and patient with me",
      "text": "Eve was extremely helpful and patient with me",
      "rating": 5,
      "date": "28th January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Good mortgage experience",
      "text": "Very easy mortgage experience, good customer service and communication",
      "rating": 5,
      "date": "28th January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Mortgage renewal.",
      "text": "Mortgage renewal was simple clear and helpful. Advisor LISTENED and explained options available. Answered questions clearly and followed up on promised actions. Delighted with our mortgage choice.",
      "rating": 5,
      "date": "28th January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Interest only and fixed rate mortgage.",
      "text": "Great product that suited are very specific needs. Arranged without any problems and very quickly. Excellent rates. Really good customer service.",
      "rating": 5,
      "date": "17th January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Overall pleased returning customer",
      "text": "Always very helpful, friendly and informative without using banking jargon which makes decisions so much easier to make and process. I have been with NBS for a number of years and will continue to.",
      "rating": 5,
      "date": "16th January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "New mortgage application dealt with very quickly wit...",
      "text": "New mortgage application dealt with very quickly with minimum fuss. Straight forward communication and easy to deal with",
      "rating": 5,
      "date": "16th January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "helpful and informative",
      "text": "Our advisor was helpful and informative and ensured we understood our options.",
      "rating": 5,
      "date": "6th January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Newbury Building Society Unhelpful",
      "text": "We have had a mortgage with Newbury for years and have never missed a payment so when it came to renewing the mortgage for another 2 years they became very unhelpful as my husband was 70 years old and although we proved that we could afford it the repayment of £1300.00 they would not budge. So we decided that we would put one of the two assets we had on the market and pay off the mortgage instead. This took a bit longer than expected and all through this time Newbury kept on badgering our Mortgage Advisor as to when we would be paying off the mortgage and how much longer. So as you can see my husband and I were extremely annoyed by this constant badgering as our hands were tied at this particular time. Glad to see that we have now got rid of the mortgage and thankfully will have nothing more to do with Newbury Building Society, their customer service is not good and were very unhelpful during this whole process. Just to say we made six/seven payments of the mortgage during this time so who said we could not afford it!!",
      "rating": 1,
      "date": "4th January 2026",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "I found Newbury BS easy to deal with and professional.",
      "text": "I found Newbury BS easy to deal with and professional. During the period of the mortgage we had no problems at all.",
      "rating": 5,
      "date": "2nd January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "In safe hands",
      "text": "Ive had my shared ownership mortgage with Newbury Building society for over 10yrs. I feel they have always given me the best value & always had my best interests at heart. When I first took a mortgage on the advisors were very good at explaining how mortgages would stand for me in the current financial situation to ensure I was not going to financially suffer. Allowing me to make an informed choice confidently",
      "rating": 5,
      "date": "2nd January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "A great service",
      "text": "The people I spoke to about my mortgage at Newbury Building Society were helpful and very polite. They followed up my queries quickly and made me feel like a valued customer.",
      "rating": 5,
      "date": "30th December 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Arrranging a great mortgage in quick time made easy.",
      "text": "Moving house in England is a stressful and unnecessarily complex process. We are downsizing and as we had found the perfect new home for us, we did not want to lose it. As the sale of our house was put back by a link in the chain messing up, we had to go forward with the purchase. This meant using our savings plus raising a mortgage. At our age the search for an interest only fixed cost mortgage with a short term and no early payback charges after the fixed 3 years was over was always going to be difficult. Newbury was a real find for us, they have made the process worry free and as simple as possible. The mortgage offered was excellent value and met all our rather unique requirements. Great company to do business with, we thoroughly recommend them.",
      "rating": 5,
      "date": "20th December 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "I placed a shared ownership case with Newbury recent...",
      "text": "I placed a shared ownership case with Newbury recently and was very pleased with the service, from my initial enquiry with Will Humphries on the BDM help desk to submitting the case and the underwriter, Jill Bennett being very attentive. Any messages and documents that I sent were acted upon swiftly and the offer was issued within the expected timescale.",
      "rating": 5,
      "date": "19th December 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Good communications",
      "text": "Applying for a mortgage and seeing it through to completion has many stages involving many different agents, everything done by Newbury BS was done in a timely manner accomanied by emails explaining what was happening, what was next etc.",
      "rating": 5,
      "date": "12th December 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Simple Product Switch",
      "text": "Expat BTL mortgage was coming to an end, booked an appointment with the mortgage advisors through the website and got the call back the next day. Staff members were very polite, shared what is available and how much I’d save and the product switch was all very easy. Didn’t take much time and no hassle at all. Got the email the next day with the document to sign, again easily done and was processed very quickly. No complaints.",
      "rating": 5,
      "date": "12th December 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "GREAT SERVICE",
      "text": "As a smaller building society you do expect a slower service but wow very impressed . communication easy, application process easy. Definitely will use again",
      "rating": 5,
      "date": "8th December 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Everything went smoothly and without any problems",
      "text": "Everything went smoothly and without problems from the first contact to the transfer of the mortgage",
      "rating": 5,
      "date": "2nd December 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very friendly, efficient and helpful throughout the...",
      "text": "Very friendly, efficient and helpful throughout the whole of our application.",
      "rating": 5,
      "date": "29th November 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Mortgage",
      "text": "Excellent service all round good experience",
      "rating": 5,
      "date": "28th November 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Good communication and guidance throughout the process.",
      "text": "Good communication and guidance throughout the process.",
      "rating": 5,
      "date": "28th November 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Once again, Newbury use common sense when providing...",
      "text": "Once again, Newbury use common sense when providing solutions to older clients, enabling them to use equity in their homes to help their families achieve their goals. Every member of staff from BDMs, whose knowledge and experience ensures all aspects of the case fits before submission, to processing team who are always happy to take a call and the Underwriters who you can speak to, makes the journey easy. People dealing with people gives the client a good result.",
      "rating": 5,
      "date": "25th November 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "We have used Newbury Building Society for many years",
      "text": "I have used Newbury building society for many years. I took out my mortgage with them because at the time it was a really good deal at 0.2% above base rate, guaranteed for the duration. Never regretted it and it was paid off recently. Apart from this my wife and I have several investments each with the Newbury and have always found them very helpful with a good range of savings accounts.",
      "rating": 5,
      "date": "21st November 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Superfast professional responses!",
      "text": "Superfast professional responses!",
      "rating": 5,
      "date": "16th November 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Our financial adviser recommended Newbury building s...",
      "text": "Our financial adviser recommended Newbury building society as the best one to suit our requirements. Response was excellent and prompt.",
      "rating": 5,
      "date": "15th November 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "First class old fashioned customer service.",
      "text": "First class old fashioned customer service. Call the number get through to reception ask for the department you need and a human answers the phone, usually very quickly. Their mortgage advisors are amazing giving honest realistic advice and everything is done quickly. I can honestly say not only are they the best lender I have ever dealt with but they are the best company out of any I have dealt with for many years. I would 100% recommend them. Their mortgage products are also very competitive so its a win/win for customers!",
      "rating": 5,
      "date": "7th November 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "The whole process was straightforward.",
      "text": "The whole process was straightforward. Staff were easily accessible and were knowledgeable and friendly.",
      "rating": 5,
      "date": "7th November 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Overpayment",
      "text": "They were easy to get hold of & explained everything I needed",
      "rating": 5,
      "date": "5th November 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Mortgage Product Transfer",
      "text": "Clare was very thorough and made the process easy to understand. I felt pleased with all of the options offered and the questions given to help me make the right choice for myself. I liked that she also emailed me some information on product transfers before our phone call so I could do some research in preparation.",
      "rating": 5,
      "date": "28th October 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "*AVOID* Undervalued new build / cost £12k to leave them",
      "text": "Newbury provided a self-build product and during the build and undervalued the build and refused to provide next tranche of cash so I had to take a personal loan to keep it going. Every single estate agent, builder and local person knows that the land alone was worth more than the value they placed on the build, but thier surveyor was way off. Even worse than this, on completion they again undervalued so I didnt have the required LTV. I had 4 independant valuations at £300k more than thier valuation. They shouldnt offer self-build mortgages if they cannot work with clients. Avoid - their in-house surveyor ruins everything with his stupid valuations and I has to pay £12k to get out of the product and find a decent lender - now have all the funds at 75% LTV because they use an independant surveyor report and the valuation is correct. AVOID AT ALL COSTS",
      "rating": 1,
      "date": "24th October 2025",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "I recently dealt with Newbury; very impressed",
      "text": "I recently dealt with Newbury, first for a mortgage application, and then for an additional amount of of borrowing. On both occasions I found the people, processes and response times to be excellent, and better than anything I have encountered elsewhere. In particular Lucy A, Kayleigh T, and Chloe S went above and beyond to make things as easy as possible and to answer any questions I had. Would highly recommend to anyone.",
      "rating": 5,
      "date": "22nd October 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Good rates, excellent communication, prompt response...",
      "text": "Good rates, excellent communication, prompt responses and service",
      "rating": 5,
      "date": "17th October 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "A smooth process and helpful advisors.",
      "text": "Angela was very helpful and friendly, explained everything really well and helped me get the product I needed that worked for.",
      "rating": 5,
      "date": "2nd October 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "In branch service review",
      "text": "I am always completely impressed with their professionalism and customer service.",
      "rating": 5,
      "date": "30th September 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent in every respect:, very professional and w...",
      "text": "Excellent in every respect:, very professional and whenever I phoned, clear answers given readily to any question I had. Easy to make down payments and to close the account on its anniversary.",
      "rating": 5,
      "date": "19th September 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very helpful throughout the process of sorting out m...",
      "text": "Very helpful throughout the process of sorting out my mortgage",
      "rating": 5,
      "date": "16th September 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very impressive service.",
      "text": "I received a very impressive service when my existing mortgage product was transferred to a new product. The switch was dealt with professionally and efficiently and I was very happy with the new products to choose from.",
      "rating": 5,
      "date": "12th September 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very efficient and professional.",
      "text": "My application was dealt with swiftly and professionally.",
      "rating": 5,
      "date": "22nd August 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Transferring a mortgage from another provider could...",
      "text": "Transferring a mortgage from another provider could not have been easier. The service was efficient and courteous and timely. The new rate is fantastic. .",
      "rating": 5,
      "date": "19th August 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Easy process to switch deals.",
      "text": "Easy process to switch deals when my previous one ended. Impressed that NBS initiated the contact. Competitive rate for an interest only mortgage.",
      "rating": 5,
      "date": "18th August 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Brilliant service",
      "text": "We wanted to explore whether we should take out a small mortgage or not and were dealt with by Angela Burton. She has deep product knowledge and worked hard to establish the best way forward for us, making all of the pros and cons of any action absolutely clear.",
      "rating": 5,
      "date": "15th August 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Our dealings with the Society have been excellent.",
      "text": "Our dealings with the Society have been excellent. We have just had a mortgage review with Angela Bradshaw. She was extremely professional and clearly explained the options available. Could not have wished for better.",
      "rating": 5,
      "date": "13th August 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Best Rate for my Client & Excellent Service..",
      "text": "Newbury had the best rate i was looking for for my clients needs. I understood from my first contact that my client, was outside of Newbury's standard lending criteria but as it was such a 'good' case he spoke with the underwrites and I went on to get an accepted DIP. The case has now gone to ffer",
      "rating": 5,
      "date": "13th August 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Top-up loan for home improvment.",
      "text": "I enquired about a top-up loan for home improvement. I quickly had a phone interview and everything was dealt with really quickly. It was all made very simple with everything handled online and by e-mail. All-in-all a very straightforward procedure with helpful people.",
      "rating": 5,
      "date": "12th August 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "A very Positive Experience from a Returning Customer",
      "text": "Helpful and Friendly communication. Professional service offering a good range of competitve products - As you would expect from a Building Society that is run for its members.",
      "rating": 5,
      "date": "7th August 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Newbury have been great!",
      "text": "Newbury have been great - we went with them for our first ever mortgage & they have made things really easy for us.",
      "rating": 5,
      "date": "5th August 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Telephone Appointment for Mortgage Product Swap",
      "text": "My telephone appointment with Angela Burton was really good. She provided me with all the information required, answered any questions I had and made a recommendation suitable for my needs. Thank you!",
      "rating": 5,
      "date": "23rd July 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Good service friendly staff",
      "text": "All Good great to be able to talk with a underwriter when required",
      "rating": 5,
      "date": "23rd July 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Highly recommended company",
      "text": "First time buyers therefor our first time going through the mortgage application, Newbury were very helpful and no question was a silly one, smooth process throughout, great mortgage rate offered to us, would highly recommend them has a mortgage supplier! After all the stress of moving we had a treat box sent to us with some touching essentials such as tea, coffee, biscuits, chocolate and lots of savings vouchers which will come in handy when buying for our new home, really impressed with the service we have received and completely stress free which was an added bonus, thank you Newbury!",
      "rating": 5,
      "date": "17th July 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Kate Rockall provided full details on all re-mortgag...",
      "text": "Kate Rockall provided full details on all re-mortgage options at NBS, each of which were fully explained. Kate was very thorough and professional and ensured I understood each stage of the discussion. The option I chose meets all my requirements. I am delighted to be re-mortgaging with NBS.",
      "rating": 5,
      "date": "12th July 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "very efficient, helpful and informative",
      "text": "very efficient, helpful and informative",
      "rating": 5,
      "date": "4th July 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very efficient service and value for money",
      "text": "Very efficient service and value for money",
      "rating": 5,
      "date": "4th July 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great Web Chat facility and good access to underwriter",
      "text": "Direct access to the underwriter and also a very quick and efficient web chat facility.",
      "rating": 5,
      "date": "1st July 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Highly understanding and helpful building society.",
      "text": "Highly understanding and helpful building society. We needed to change our current mortgage provider to help son buy his first home. Our previous provided was unwilling and unhelpful to be able to do this - Newbury were a real pleasure to engage with and we've stayed with them. They are competitive in the market place and certainly make you feel a valued customer (and prospective customer at the time of our re-mortgage). A definite recommend for others!",
      "rating": 5,
      "date": "30th June 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very insightful and helpful",
      "text": "Very insightful and helpful in providing multiple options to choose the best option for my mortgage",
      "rating": 5,
      "date": "19th June 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Exceptional Service from NBS",
      "text": "All advise and help given to us was thoroughly explained and any questions answered in a very prompt and professional manner . An all round first class service , which has resulted in us receiving a perfect mortgage offer for us going forward in the next 3 years .",
      "rating": 5,
      "date": "13th June 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent support tailored to my Mortgage needs",
      "text": "I initially had my mortgage with NBS and was so impressed with their service that I returned to them for my next one. Each time, I received excellent, personalized support tailored to my needs. Mortgage team consistently delivered outstanding service, making the whole process smooth and stress-free.",
      "rating": 5,
      "date": "13th June 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Absolutely superb.",
      "text": "Absolutely superb. My experience was faultless throughout. The staff were professional, personable and extremely helpful.",
      "rating": 5,
      "date": "31st May 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Mortgage lenders with a quality service",
      "text": "We have had mortgages with Newbury for many years now. They were recommended by our financial advisor as we were in an unusual situation, with a property rented out for a period and one of us working abroad. We have been delighted with the quality of the service: helpful advice from staff who are competent and friendly. Face to face meetings over videoconference, with follow-up emails and letters in a timely manner. Probably not the cheapest on the market, but we believe you get what you pay for, and Newbury have never disappointed us.",
      "rating": 5,
      "date": "30th May 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "flexible approach to unusual cores",
      "text": "flexible approach to unusual cores",
      "rating": 5,
      "date": "19th May 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very easy and friendly experience.",
      "text": "Very easy and friendly experience. Hassle free and fast.",
      "rating": 5,
      "date": "18th May 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Cash Flow",
      "text": "We wanted more cash flow but our money is tied up in the house. So we asked to borrow a certain amount. Everything, was settled within a few weeks. The mortgage advisor and the mortgage underwriter were excellent.",
      "rating": 5,
      "date": "16th May 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "I have used the Newbury BS for many years.",
      "text": "I have used the Newbury BS for many years. They are a lender that has a common sense approach coupled with the ability to access the underwriter. Both of these help the client, to a smooth outcome. To talk to a person also builds relationships and cements a good working partnership.",
      "rating": 5,
      "date": "16th May 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very helpful and efficient advice.",
      "text": "Very helpful and efficient advice. Ran through options for moving to a fixed term.",
      "rating": 5,
      "date": "16th May 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "A customer for 15 years",
      "text": "I’ve moved house three times and continued to use the Newbury Building Society. The super helpful and friendly team have always been very efficient, easy to get hold of and you feel like a person and not a number. The mortgage products are good value for money and the always pass on even small rate reductions.",
      "rating": 5,
      "date": "9th May 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Easy to follow, no issues, prompt service.",
      "text": "Easy to follow, no issues, prompt service. Everything was outstanding",
      "rating": 5,
      "date": "30th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very easy to work with and quick responses to questions",
      "text": "Very easy to work with and quick responses to questions",
      "rating": 5,
      "date": "28th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Been great , cant rate them enough",
      "text": "Been great , cant rate them enough",
      "rating": 5,
      "date": "28th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "No formal receipt when I redeemed my mortgage.",
      "text": "Having paid a large amount of money by bank transfer from my Bank Branch, to redeem my mortgage I received no receipt or email to confirm that the money had actually been received, or had reached my account. After a week or more I rang to be told yes it had been received but did not receive anything in writing for a further 2 weeks. Quite worrying as I had paid a lot of money and then had no confirmation officially. Otherwise my experience whilst I had a mortgage with the NBS was excellent.",
      "rating": 3,
      "date": "25th April 2025",
      "product": "Mortgages",
      "sentiment": "mixed"
    },
    {
      "title": "Thank you, Eve",
      "text": "Eve McDowell was very personable and professional throughout, very helpful and made me feel listened to",
      "rating": 4,
      "date": "23rd April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent Service",
      "text": "So nice to still have a building society/bank with a branch that you can still visit. Excellent service this week from Jessica this week in the Abingdon shop.",
      "rating": 5,
      "date": "12th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "My broker recommended the Newbury Building Society.",
      "text": "I was recommended to consider a Newbury Building Society mortgage by my broker. They had a very competitive mortgage offer which matched the type of deal that best suited my criteria. All of the paperwork was turned around promptly, as was their communication with me and my broker. This mortgage could not have been easier to complete.",
      "rating": 5,
      "date": "11th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "A very swift and professional service",
      "text": "A very swift and professional service to change to a new product was our current deal was ending. The telephone consultation was efficient and clear; all done in 30 mins and the revised offer arrived by email within 10 minutes.",
      "rating": 5,
      "date": "24th March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Remortgage For Seniors",
      "text": "All the staff were are exceptionally helpful and friendly with a speedy response. Newbury appear to offer the best rates especially to senior citizens All the staff were are exceptionally helpful. A Unique Experience -Flexibility - Rates - Term",
      "rating": 5,
      "date": "23rd March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Everyone my partner and i liaised with at NBS were p...",
      "text": "Everyone my partner and i liaised with at NBS were professional, friendly and prompt. I would highly recommend to anyone seeking a mortgage. Thank you for helping us obtain our home!!",
      "rating": 5,
      "date": "15th March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Easy mortgage change",
      "text": "Very helpful staff and easy to understand their processes. Changing my mortgage was very straightforward. Possibly not the most competitive rates, but suited our situation.",
      "rating": 5,
      "date": "14th March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Newbury Building Society excellent customer service.",
      "text": "Angela Bradshaw, the mortgage representative, Explained the process in a clear and concise manner. She was friendly yet professional. The information she provided helped us make an informed decision regarding our refinance. I would recommend them for there excellent customer service and their products.",
      "rating": 5,
      "date": "7th March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent service and facility",
      "text": "Both on setting up the mortgage - and then on its ceasing I was able to speak with people at the Society, all of whom were very helpful in guiding me through the procedures etc.",
      "rating": 5,
      "date": "7th March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very good service, all the staff very helpful",
      "text": "Very good service, all the staff very helpful",
      "rating": 5,
      "date": "1st March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Happy mortgage broker",
      "text": "I have used Newbury for my clients on several occasions they have always been excellent",
      "rating": 5,
      "date": "21st February 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "All good",
      "text": "All good really helpful building society",
      "rating": 5,
      "date": "21st February 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "On on completion day there were problems...",
      "text": "On completion day, additional documents were needed from our conveyancer although we received a welcome email the day before telling us everything was ready. Completion was delayed by 1.5 hours and it was a very stressful time. The sellers up the chain were threatening to charge us interest. Newbury need to make sure that everything is in place for the loan before completion day. This has knocked our confidence",
      "rating": 2,
      "date": "14th February 2025",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "Great mortgage journey with the team",
      "text": "From start to finish on the mortgage journey the team were very responsive and it was lovely to speak with the team on any questions we had.",
      "rating": 5,
      "date": "14th February 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Completion delay",
      "text": "Good up to completion. New compliance officer demanded additional paperwork delaying the completion. Very stressful and should not have happened.",
      "rating": 4,
      "date": "14th February 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great service",
      "text": "From start to end of process all staff were excellent with high customer service skills Thanks",
      "rating": 5,
      "date": "7th February 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Common sense approach to lending.",
      "text": "Common sense approach to lending. Helped me place a tricky case for a client, prompt review of all documents and issuing of the offer. Great service and excellenet outcome for the client. Really helpful BDM.",
      "rating": 5,
      "date": "6th February 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great customer service!",
      "text": "Great customer service! Excellent rate for first time buyers, look forward to remortgaging in the future",
      "rating": 4,
      "date": "28th January 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Remortgaging to Newbury was a Great Choice",
      "text": "We were remortgaging to Newbury from another lender via a broker, but the interactions we had with Newbury BS staff was excellent throughout the process. We were always kept up to date with things and Newbury did things quickly, providing clear information all along the way.",
      "rating": 5,
      "date": "27th January 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Remortgage",
      "text": "I received my telephone appointment with Angela Burton from your Newbury branch and she was extremely helpful and explained all products clearly. She even managed to find a better rate of interest after the appointment and called me back to inform me.",
      "rating": 5,
      "date": "24th January 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "We needed an advance to finish our renovation projec...",
      "text": "We needed an advance to finish our renovation project given unforeseen building issues.",
      "rating": 5,
      "date": "23rd January 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Staff at the building society responded quickly.",
      "text": "Staff at the building society responded quickly and helpfully throughout the entire process. We were working within strict time constraints on the purchase of a property and staff kept us fully informed of progress at all stages which took the pressure off from what can be a stressful experience when it is not something you do every day.",
      "rating": 5,
      "date": "17th January 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "10/10 Experience",
      "text": "As a broker who has not used you much, i found the system a little difficult at first, but the service & the team, REALLY went the extra mile to help me and my client get the case approved - Very impressed",
      "rating": 5,
      "date": "14th January 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Really helpful and informative.",
      "text": "Kayleigh was really helpful and informative, made me feel like a valued customer and wanted to do what was best for my situation.",
      "rating": 5,
      "date": "14th January 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "First time buyers",
      "text": "As first time buyers purchasing a shared ownership home the process felt quite daunting. Thankfully the team made everything easy! The paperwork was straightforward and didn’t feel jargon-y. We had swift responses via email and phone for any of our queries.",
      "rating": 5,
      "date": "13th January 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "opening a new savings a/c ..",
      "text": "We wanted to open a new savings a/c which proved to be simple and dealt with efficiently and with a smile on a cold winters day. You may wish to consider additional work stations as queues were building - just a thought.",
      "rating": 5,
      "date": "11th January 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "When I notified you of my intention to repay my mort...",
      "text": "When I notified you of my intention to repay my mortgage in full the response was very slow",
      "rating": 2,
      "date": "10th January 2025",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "Fantastic help and support from real people who were...",
      "text": "Fantastic help and support from real people who were knowledgeable, friendly and helpful. They were easily accessible and resolved my questions and helped me redeem my mortgage somewsily.",
      "rating": 5,
      "date": "10th January 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Quick and easy to remortgage again with the Newbury.",
      "text": "Quick and easy process to remortgage again with the Newbury. Very helpful staff and a very competitive discounted 3 year rate. Once again many thanks to the NBS team.",
      "rating": 5,
      "date": "3rd January 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Friendly, helpful and professional service.",
      "text": "My mortgage advisor Lauren Dearlive was both helpful and knowledgeable. She helped guide me to understand the current mortgage options that were available for me, she also passed me onto her colleague, Simon Dawson - Allen who was as equally helpful and efficient with explaining further options of help and support.",
      "rating": 5,
      "date": "3rd January 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Remortgage with Newbury BS",
      "text": "I applied to remortgage with Newbury BS through a broker. The process was straightforward and thorough as I would expect. There was a delay due to one department not informing the underwriter that all the information requested had been submitted by me. However once informed the underwriter responded within 24 hours. I received a message from Newbury BS stating that if I wanted to complete the transaction earlier than planned this would be possible which was a great help. No solicitors required so no additional costs. Excellent service despite the short delay of one week.",
      "rating": 5,
      "date": "30th December 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Remortgaging to Newbury",
      "text": "It really helped that there was a branch in Winchester to print off the forms and to hand them in.",
      "rating": 5,
      "date": "22nd December 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Newbury mortgage offer and follow-up administration.",
      "text": "All went well through our broker. Happy with the new terms. very helpful on e-mails.",
      "rating": 4,
      "date": "21st December 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Newbury Building Society Mortgage for Pensioners",
      "text": "We welcomed the fact that the Newbury Building Society was willing to offer a mortgage to pensioners. The staff and the Underwriting team always responded quickly to clarifications about the documentation.",
      "rating": 5,
      "date": "20th December 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great retirement mortgage",
      "text": "My mortgage broker recommended the NBS as their product ideally suited my circumstances being over 70 years old. I was pleasantly surprised by the speed and efficiency of the whole process.",
      "rating": 5,
      "date": "20th December 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "renewing a mortgage",
      "text": "I was renewing a mortgage which had come to the end of its discounted period. Communication was excellent, options available clearly explained, time given to consider, and paperwork dispatched promptly once the decision was made.",
      "rating": 5,
      "date": "20th December 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very helpful staff, always very polite",
      "text": "Very helpful staff, always very polite",
      "rating": 5,
      "date": "20th December 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great service from start to finish",
      "text": "I recently used Newbury Building Society for the first time, and I wanted to share my positive experience. The staff were both friendly and highly efficient, making the process smooth and hassle-free. I was particularly impressed with the Free Legals system you use. It stands out as exceptional compared to other lenders I have worked with. If only more lenders adopted such a system!",
      "rating": 5,
      "date": "18th December 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great customer service and proactive in communications.",
      "text": "Great customer service and proactive in communications. We have been happy customers of them for many years now,",
      "rating": 5,
      "date": "10th December 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Good attentive staff.",
      "text": "Good attentive staff. No issues.",
      "rating": 5,
      "date": "6th December 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Made buying my first house relatively easy!",
      "text": "All the people I dealt with sorting out my 1st ever mortgage were very helpful especially Lauren who I dealt with the most. Very quick at replying to messages and one of the easiest companies I've dealt with in a while to get through to on the phone. Good mortgage rate too.",
      "rating": 5,
      "date": "6th December 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "We were difficult!",
      "text": "We were difficult customers in the eyes of a bank, so it was refreshing to find a company who were willing to listen and treat our case on an individual basis. We had returned to the UK having lived in Europe for 24 years and were nearing pension. They approved our mortgage and were are very happy.",
      "rating": 5,
      "date": "6th December 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very clear and informative advice",
      "text": "Very clear and informative advice",
      "rating": 5,
      "date": "6th December 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "I didn’t have any issues at all.",
      "text": "I didn’t have any issues at all. When I needed to call it was dealt with promptly. The welcome hamper was a nice surprise.",
      "rating": 5,
      "date": "30th November 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Easy product switch.",
      "text": "Dealt with Lauren Rowe re: product switch. She was very professional, followed up on all agreed actions, superb experience overall.",
      "rating": 5,
      "date": "29th November 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Transparent and efficient service",
      "text": "The mortgage application process was transparent and efficient..",
      "rating": 5,
      "date": "25th November 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Helpfully advice",
      "text": "Was offered a better deal and the pros and cons were explained. It was great to talk to someone who new what they were talking about",
      "rating": 5,
      "date": "22nd November 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Kaylie Tingle - Mortgage Advisor",
      "text": "Met over the telephone with Kaylie Tingle who ran through everything with us asking lots of security questions and questions relevant to our mortgage needs. She gave clear advice and guidance and explained how the Building Society could help us and continue working with us when our current product expired. Professional service. Felt reassured after the call.",
      "rating": 5,
      "date": "21st November 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent remortgage appointment with Luke Pummell",
      "text": "I had a remortgage appointment. Beforehand I was a little confused as to what the change would do and if it would impact negatively but I was reassured brilliantly by Luke Pummell. He was very clear, concise and make it clear in my head what my remortgage rate would be and the what the changes would mean for me. He gave excellent and informative advice and put me at ease. He was also very friendly and we had a good chat about the rugby happening that same day. He emailed me all the information and I am very satisfied with the service. Excellent all round!",
      "rating": 5,
      "date": "19th November 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Arranging for a new mortgage",
      "text": "Application via our agent and then the arrival of the new mortgage went reasonably well and smoothly, and did not take long.",
      "rating": 5,
      "date": "18th November 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "We remortgaged with you and all was done easily and...",
      "text": "We remortgaged with you and all was done easily and quickly",
      "rating": 5,
      "date": "14th November 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Applying for a mortgage in later life.",
      "text": "Helpful, informative and supportive. Initial telephone contact and telephone appointment to apply for mortgage clear, concise with a choice of options. Office staff at Wokingham helpful with forwarding paperwork. Altogether a painless process.",
      "rating": 5,
      "date": "12th November 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very helpful staff.",
      "text": "Very helpful staff. Great communication. Able to speak to people easily. Assisted throughout the process. Provided us with a product that works for us.",
      "rating": 5,
      "date": "8th November 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Professional/Efficient/Retired friendly",
      "text": "Whilst it has taken many interactions and a long time, Newbury staff have all been very efficient and professional and NBS are one if the few lenders willing to lend to retired people",
      "rating": 5,
      "date": "8th November 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Newbury Building Society offered a mortgage product...",
      "text": "Newbury Building Society offered a mortgage product that met my particular needs at a competitive rate. All communications I received were clear and all actions were carried out as expected.",
      "rating": 5,
      "date": "1st November 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great experience can’t fault the team!",
      "text": "Great experience can’t fault the team!",
      "rating": 5,
      "date": "1st November 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Porting our Mortgage to new property.",
      "text": "We ported our mortgage to our new property as part of the purchase. The whole process was handled really well from the assessment through to the actual implementation.",
      "rating": 5,
      "date": "27th October 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "A great product for us,",
      "text": "One of the most competitive BTL mortgages have seen recently.",
      "rating": 5,
      "date": "26th October 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Courteous, helpful, accommodating, personal, quick a...",
      "text": "Courteous, helpful, accommodating, personal, quick and efficient - everything that customer service should be. Excellent - many thank!",
      "rating": 5,
      "date": "25th October 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "A happy (older) customer!",
      "text": "As an older borrower, with a guaranteed pension(s) income, Newbury BS provided a service to me that other lenders did not, so thank you and well done for seeing the gap in this market. The remortgage was arranged through a broker and once all documents requested had been provided to you, it was a seamless process.",
      "rating": 5,
      "date": "18th October 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "A lender who isn't ageist towards a 74 year old!",
      "text": "How comforting to know there is a lender, the Newbury BS, that isn't ageist, like Barclays. Everything was handled speedily and very efficiently by Sezanne and her team. I would recommend the Newbury BS to anyone. We were with Barclays for many, many years and during that time never missed a payment or took a payment holiday. We reduced our mortgage, it's term ended in July 2024, from £523,000 to £141,000 and our house is valued by the Newbury BS at £950,000 but still Barclays wouldn't let us pass their affordability and offer us a mortgage. My wife and I have pensions plus a business and rental property, our credit record is in the top 10%. We just want to live 5 more years in our beautiful family home in the country, where our two boys grew up and our grandchildren visit and love the animals, the space, peace and quiet etc. In 5 years I will be nearly 80 years old and my wife 71. We have lived here for 37 years and have many friends in the village. In 5 years we will naturally want to down size, so where is the risk? Barclays also sent a threatening letter stating they could force sell our home and present us with all legal bills, if we don't pay off the outstanding £141,000 very soon. They are charging us interest at their SVR of 8.5%! They say they will lend up to 80 years of age. Our experience has proved Barclays state a non ageist age limit but make sure very, very few applicants pass their affordability, thus in our view, being ageist in reality. Barclays state that as they are a responsible lender, they won't lend to us, what a cheek, meaning that anyone that does lend to us, is an irresponsible lender! The Newbury BS, after checking our affordability, have provided us with a mortgage that includes a 14 year term and a 5 year fixed interest rate. From today, I can work at regaining my health, which has taken a big hit, brought about by Barclays.",
      "rating": 5,
      "date": "17th October 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great that Newbury could do my new mortgage and buy...",
      "text": "Great that Newbury could do my new mortgage and buy to let on exciting property so all under one provider.",
      "rating": 5,
      "date": "15th October 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Good Building Society - shame about the lawyer",
      "text": "We have just completed a remortgage with the Newbury BS and we’re impressed by the prompt and efficient way the transaction was dealt with. However, there’s a but and it’s a big one - the standard of service we received from the solicitor we had to use (because they were the closest firm to us who are on the Newbury BS panel) was extremely poor. So much so, that it made extremely stressful and unpleasant what should have been a straightforward transaction. We came very close to pulling out of the entire deal, as we were made to feel dishonest by the “lawyer” we were allocated by Kingsley Bond Solicitors. When I learned that we would be required to pay for the Newbury BS’s legal costs as well as our own, and that the same lawyer would be representing both parties, I was surprised and concerned. This arrangement seemed ethically questionable, to say the least. In practice, it was worse. At no time did I feel that our “lawyer”, Tea Shonia, was acting for my wife and myself. I have worked and negotiated with lawyers throughout my career and I can honestly say that my dealings with Ms Shonia were amongst the least satisfactory of any in my forty years experience. That’s a shame because, as I said earlier in this questionnaire, our direct dealings with the Newbury BS, and those through our excellent broker, Chris McKee at One77 Mortgages, were refreshingly straightforward. We managed to complete the transaction in the end, and are pleased to have done so, but feel that this result was achieved in spite of, rather than with the help of, Kingsley Bond Solicitors. The above is why I have given the answer “Neutral” to the value for money question in this questionnaire. Under the circumstances, I feel that I am being extremely generous. Thank you.",
      "rating": 5,
      "date": "12th October 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Mortgage switching was easy.",
      "text": "Mortgage switching was easy. Mortgage Adviser of Newbury Building Society Ms. Katherine helped me to switching a new product.",
      "rating": 5,
      "date": "12th October 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "No problem and very competitive.",
      "text": "No problem and very competitive.",
      "rating": 5,
      "date": "11th October 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Fantastic",
      "text": "All staff were so helpful from start to finish Really straightforward process Great product knowledge",
      "rating": 5,
      "date": "11th October 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Helpful, expedient service from all parties involved.",
      "text": "Helpful, expedient service from all parties involved.",
      "rating": 5,
      "date": "11th October 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Two weeks for a product switch",
      "text": "A simple product switch as existing borrowers of more than 12 years was stressful and time consuming yet it should have been neither. Very low loan-to-value, exceptional loan-to-income yet we were required to jump through hoops.",
      "rating": 3,
      "date": "2nd October 2024",
      "product": "Mortgages",
      "sentiment": "mixed"
    },
    {
      "title": "Switching the mortgage into a new product",
      "text": "The whole process of switching our five year fixed rate mortgage into new mortgage was efficient and straightforward. Couple of days after phone consultation with Newbury Mortgage Adviser we received an Product Transfer Offer. The NBS Product Transfer Completion document was issued on exact day when previous mortgage ended. There was absolutely no hassle and/or hurdles during the whole process.",
      "rating": 5,
      "date": "28th September 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "A good Experience",
      "text": "The operative was very helpful and gave me all the information that I needed.",
      "rating": 5,
      "date": "27th September 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Ive always enjoyed the most amazing customer servic...",
      "text": "Ive always enjoyed the most amazing customer service and support from Newbury Building Society. They are able to treat customers as individulals and offer tailored solutions.",
      "rating": 5,
      "date": "26th September 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Friendly, helpful and knowledgable",
      "text": "Staff are friendly and helpful whenever i go there. Good knowledge of their products.",
      "rating": 5,
      "date": "25th September 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Pleasure to do business with",
      "text": "Eve was a delight to work with from. Beginning to end. Always responsive and very informative.",
      "rating": 5,
      "date": "24th September 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "The customer service Was helpful clear and friendly.",
      "text": "The customer service Was helpful clear and friendly. And the appointment was arranged promptly. They were trying to get the best deal for me. No worries or concerns",
      "rating": 5,
      "date": "23rd September 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "After my fix term ended for my mortgage the team and...",
      "text": "After my fix term ended for my mortgage the team and management at product switch helped me get the best outcome for my new fixed term.",
      "rating": 5,
      "date": "20th September 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Good communication",
      "text": "Was good communication they worked really well with my mortgage advisor so direct contact was minimal. Provided all documents in a timely manner with great explanations as I was a first time buyer",
      "rating": 5,
      "date": "20th September 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "The process seemed to take a longer time than expect...",
      "text": "The process seemed to take a longer time than expected to complete.",
      "rating": 3,
      "date": "19th September 2024",
      "product": "Mortgages",
      "sentiment": "mixed"
    },
    {
      "title": "Newbury Building Society unbeatable mortgage rates",
      "text": "We come back to The Newbury Building Society everytime our mortgage product needs to be renewed. Each renewal we research other providers but NBS always comes up with the best rates, their customer service is great and we feel reassured that our mortgage is safe with this organisation.",
      "rating": 5,
      "date": "19th September 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "I made an overpayment on 22nd August .",
      "text": "I made an overpayment on 22nd August . I received a written letter in the post on 7th September , (dated 2nd September ) with details of my balance and new monthly payment which I : 1) disputed the calculation and 2) queried the first payment of the reduced amount",
      "rating": 1,
      "date": "7th September 2024",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "Excellent service as usual..",
      "text": "Renewing existing mortgage product,superb service as usual from Kate Rockall with a good outcome.Rapid admin and actions.My only complaint is your ridiculous secure message service,I have over the years only twice managed to access the message,this time took me 40 minutes they are so secure as to be totally useless-please make them useable!",
      "rating": 4,
      "date": "7th September 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very easy process from start to finish.",
      "text": "Very easy process from start to finish. Best rate in the market for a 5 year fixed. Completed on time with no queries at all and all correspondence replied to very promptly. Would highly recommend based on the experience with our remortgage to Newbury",
      "rating": 5,
      "date": "6th September 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Mortgage product transfer",
      "text": "Very easy to transfer to a new product at the end of my existing rate.",
      "rating": 5,
      "date": "6th September 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Newbury have always been so helpful, patient, profes...",
      "text": "Newbury have always been so helpful, patient, professional and a pleasure to deal with - they never let us down.",
      "rating": 5,
      "date": "6th September 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very efficient communication",
      "text": "All the members we spoke to communicated very efficiently. The mortgage offer was also the best by far.",
      "rating": 5,
      "date": "31st August 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very easy and helpful service, when we needed extra...",
      "text": "Very easy and helpful service, when we needed extra loan quickly sorted. Also pleasant and caring response re our anxiety",
      "rating": 5,
      "date": "31st August 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "excellent for later life mortgages I used to work in...",
      "text": "excellent for later life mortgages I used to work in financial services and there is limited scope in this area.People need later life mortgages due to divorces and other circumstances.",
      "rating": 5,
      "date": "25th August 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Glad to be getting away!",
      "text": "I had a Buy to let mortgage with the Society which was originally at a good rate; the Truss madness resulted in this increasing by almost 300% I appreciate that this was not the Society‘s fault but there was no help at all when I started the selling process (with the tenants moved out) and I had to weather months of £1100 per month expenditure. The icing on the cake was £3500 of early repayment charges. I am simply glad to be getting away from NBS!",
      "rating": 1,
      "date": "24th August 2024",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "Retirement interest only mortgage",
      "text": "Easy to set up a phone interview and answered all my questions. Only issue I had was at application stage, as I wanted a retirement mortgage I had to book twice. Saying that all staff were polite and helpful.",
      "rating": 5,
      "date": "24th August 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent service, efficient and friendly throughout",
      "text": "Excellent service, efficient and friendly throughout",
      "rating": 5,
      "date": "24th August 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Mortgage Application Review",
      "text": "Completed a joint mortgage - sole propietor Mortgage - thank you Newbury for making this happen",
      "rating": 5,
      "date": "23rd August 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Luke Pummell",
      "text": "I dealt with Luke Pummell and he was excellent. Rapid responses. Clear information. Actually felt like he cared about the process and getting it right. Transmittal were clear. Requirements from me for information likewise. Mistakes were ironed out quickly.",
      "rating": 5,
      "date": "20th August 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "..Six star service",
      "text": "I have been with the Newbury for many years and they have consistently displayed amazing customer service, excellent advice, patience and kindness. Nothing has ever been too much trouble and when many other societies would not help, the Newbury did and excelled. When the computer in other institutions 'said no', the Newbury's said 'yes' !",
      "rating": 5,
      "date": "20th August 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Amazing support and service",
      "text": "From start to finish we had full support from NBS. Everyone we spoke to provided us with assistance and they even sounded like they cared.",
      "rating": 5,
      "date": "12th August 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "You came up with a decent rate and we have enjoyed b...",
      "text": "You came up with a decent rate and we have enjoyed being with you so decided to stay - we were disappointed that you charged a set-up fee though, that seemed a little unnecessary when we are already Members.",
      "rating": 5,
      "date": "9th August 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Newbury are always helpful and want the best for the...",
      "text": "Newbury are always helpful and want the best for their customers. I've been a customer for over 5 years and have had a great experience throughout.",
      "rating": 5,
      "date": "9th August 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "From start to finish we had excellent personal servi...",
      "text": "From start to finish we had excellent personal service with options and guidance and the transaction went incredibly smoothly.",
      "rating": 5,
      "date": "7th August 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "All went smoothly.",
      "text": "All went smoothly. No problems. Nothing else to say.",
      "rating": 4,
      "date": "3rd August 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent Mortgage Lender",
      "text": "Newbury's customer service was excellent throughout the process of getting our shared ownership property. Very quick response times. They even sent us a welcome pack which is an extremely nice touch!",
      "rating": 5,
      "date": "3rd August 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Just good old fashion customer service, helpful, goo...",
      "text": "Just good old fashion customer service, helpful, good communications, clear support and straight forward. And someone always answers the phone which is rare today.",
      "rating": 5,
      "date": "3rd August 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent customer service, really quick and easy ex...",
      "text": "Excellent customer service, really quick and easy experience, took a lot of stress out of mortgage renewal!",
      "rating": 5,
      "date": "2nd August 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Sezanne was excellent!",
      "text": "Sezanne was excellent in ensuring that all went smoothly! Her patience and support was greatly appreciated!",
      "rating": 5,
      "date": "2nd August 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent service throughout",
      "text": "We requested a meeting to discuss renewing our fixed term mortgage and this was arranged with Angela Bradshaw. We wanted to repay a lump sum off before we renewed and Angela advised when we could do this without penalty and also arranged a 2nd video call to advise us on the new offer and what this would mean in relation to new payments. Angela explained everything very clearly and ensured we understood what was involved. Transfer to new product was seamless and went through when expected. A very good service that we were delighted with from start to finish.",
      "rating": 5,
      "date": "2nd August 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "They was very quick and got everything sorted in a g...",
      "text": "They was very quick and got everything sorted in a good amount of time, they made everything super easy",
      "rating": 4,
      "date": "2nd August 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Fantastic team!",
      "text": "The team at Newbury Building Society have been incredibly efficient and helpful at every step from my perspective. As a first time buyer I expected this process to be daunting and take a long time but the attention to detail and care I have been provided has left me with little worries beyond determining how to furnish my new home. Thank you very much for making this painless and incredibly clear to understand each stage.",
      "rating": 5,
      "date": "30th July 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "This is my first mortgage.",
      "text": "This is my first mortgage. Newbury made it very easy and communicated well with me during the process.",
      "rating": 5,
      "date": "29th July 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Easy process from start to finish.",
      "text": "Easy process from start to finish. Excellent service and communication. Thank you for making everything so easy!",
      "rating": 5,
      "date": "28th July 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Friendly, helpful, on time.",
      "text": "Friendly, helpful, on time. Good paperwork, Terri consultant in Gary Webster.",
      "rating": 5,
      "date": "26th July 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very quick and efficient remortgage.",
      "text": "Very quick and efficient remortgage. Good contact throughout",
      "rating": 5,
      "date": "21st July 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Despite endless delays with the conveyancer.",
      "text": "Despite endless delays with the conveyancer Matthew was patient and was tolerant of the problems we were having progessing the re-mortgage.",
      "rating": 5,
      "date": "19th July 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "The mortgage traditional, no snags, professionalism",
      "text": "The mortgage was arranged the old-fashioned way (chat with Wokingham manager) and has been managed with similar, no snags, old-fashioned professionalism.",
      "rating": 5,
      "date": "19th July 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Inconsistent advice on paying off mortgage",
      "text": "We’ve had great customer service on the whole however trying to pay off the mortgage was horrendous and took 5 phone calls (hours on the phone) and two trips into branch. Trying to make an online payment was no good because the bank account details were not recognised by my bank. In the end I was told to go in branch to do it. I was told I didn’t need to take anything but found I needed my cheque book. Had to return after the bank holiday weekend. Was advised that I shouldn’t pay for the extra days’ interest but despite providing a covering letter, I received a letter telling me I had extra to pay! I was very excited tt be paying our mortgage off but in the end I was just exasperated!",
      "rating": 1,
      "date": "12th July 2024",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "I had a good experience applying for my mortgage.",
      "text": "I had a good experience applying for my mortgage. Staff are good and helpful.",
      "rating": 5,
      "date": "12th July 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Top of the customer tree",
      "text": "excellent telephone customer service which is lacking in some companies but still very important to many people. Excellent product knowledge delivered in avery easy to understand manner",
      "rating": 5,
      "date": "12th July 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Super efficient and friendly Newbury b s.",
      "text": "We were very impressed with the friendly help we had as we are not tec friendly",
      "rating": 5,
      "date": "5th July 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "a bit perturbed",
      "text": "the only thing i will complain about is, we have moved to France, and because of this you took us of our fixed rate, and you told us that you could no longer support us with a mortgage, so we went else where which is fine we understand that Brexit has caused a lot of nonsense for a lot of people and businesses' however I was a bit perturbed when we saw that you had charged us to leave our mortgage. we realise that this is standard procedure but under the circumstances it just felt like a bit of a kick in the teeth!!",
      "rating": 5,
      "date": "2nd July 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Fantastic customer service and mortgage advisor.",
      "text": "Their customer service and mortgage advisor were fast, replied quickly, did what they said they'd do and got things sorted without any fuss whatsoever.",
      "rating": 5,
      "date": "29th June 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Mortgage product switch w/ Lauren Dearlove",
      "text": "A call I had been putting off for a while as I thought it would be a long drawn out process. Lauren was excellent, good telephony manner and soft skills throughout the call. Very efficient in what she was doing and got me the outcome I was looking for in about 20 mins which was the biggest surprise for me. I should have called much earlier but that’s my lesson learnt.",
      "rating": 5,
      "date": "28th June 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent in every respect!.",
      "text": "We have been with Newbury for 10 years - excellent all-round service. We would not go anywhere else.",
      "rating": 5,
      "date": "24th June 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Your company is beyond outdated.",
      "text": "Your company is beyond outdated. How is it that from 2019-2024 we were never able to check our motgage balance online? Dealing with your company was like dealing with a company in the 1950s. You are so hopelessly outdated that, while we might have considered refinancing our house with another mortgage, we decided to pay it off so we wouldn't have to deal with you anymore. And then when we finally did pay off the mortgage, it took NBS more than 2 weeks to confirm the payoff. Ridiculous. Hopelessly out of step. Terrible service.",
      "rating": 1,
      "date": "21st June 2024",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "Buy-to-Let",
      "text": "Glad I could perform a switch , I knew what I wanted and could call and get the documentation process initiated.",
      "rating": 5,
      "date": "20th June 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Made very simple and felt like we were being really...",
      "text": "Made very simple and felt like we were being really well looked after :)",
      "rating": 5,
      "date": "14th June 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Mortgage review",
      "text": "Our mortgage review was handled so patiently, knowledgeably and professionally. Our advisor was easy to talk to and we ended the call on a 'high'! Thank you, Newbury Building Society.",
      "rating": 5,
      "date": "11th June 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great to pay off my mortgage.",
      "text": "Great to pay off my mortgage. They provided all the information I needed to pay off",
      "rating": 5,
      "date": "11th June 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Easy of access, quick response from Staff, and fab c...",
      "text": "Easy of access, quick response from Staff, and fab communication!",
      "rating": 5,
      "date": "7th June 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "New mortgage, fast approval, good communication thro...",
      "text": "New mortgage, fast approval, good communication throughout.",
      "rating": 5,
      "date": "7th June 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "New mortgage.",
      "text": "New mortgage. Very good underwriting process. Very efficient, good mortgage product.",
      "rating": 5,
      "date": "4th June 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Timely and secure",
      "text": "All of our communication with Newbury has been timely and secure",
      "rating": 5,
      "date": "1st June 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "very helpful, friendly, knowledgable people.",
      "text": "very helpful, friendly, knowledgable people. my advisor was great and looked at all possible options for my remortgage, I felt like she was on my side and really put the effort in to make it as smooth a process as possible",
      "rating": 5,
      "date": "31st May 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Couldn't ask for anything more",
      "text": "Couldn't fault it at all. Everyone is friendly, professional and efficient.",
      "rating": 5,
      "date": "31st May 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Wasted my time. Beware.",
      "text": "My second review for these people. After an initial experience of a friendly and helpful service, it all went down hill rapidly. Firstly if you want to remortgage within the next three months this probably isn't for you because of their lead times. But more importantly be prepared to spend hours sourcing reams of documents for them only to be told that you're not eligible for reasons that they could easily have asked you about at the start. Wasted my time. Couldn't explain their illogical decision making processes and with appalling redress. AVOID.",
      "rating": 1,
      "date": "29th May 2024",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "Staff good to deal with",
      "text": "Easy to set up. Have had several contacts with staff regarding over payments etc and all have been excellent and pleasant to deal with. Early repayment information provided when requested and easily paid balance when the time came.",
      "rating": 5,
      "date": "27th May 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "I would have preferred direct contact.",
      "text": "I would have preferred direct contact. Also my letters/forms never reached you despite sending them recorded delivery. Royal Mail delivered them but they got lost in your offices",
      "rating": 4,
      "date": "24th May 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent customer service.",
      "text": "Excellent customer service. Prompt and efficient.",
      "rating": 5,
      "date": "24th May 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Arranged a bridging loan quite quickly and without i...",
      "text": "Arranged a bridging loan quite quickly and without involving a broker (or broker's fee!)",
      "rating": 4,
      "date": "21st May 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "All very efficient and easily dealt with.",
      "text": "All very efficient and easily dealt with. I had expected a better rate on the mortgage as I have been with you for many years and there is so little remaining to pay but that will just serve as an incentive to pay off the balance even faster.",
      "rating": 4,
      "date": "21st May 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Renew mortgage conditions",
      "text": "It was a great & excellent experience dealing with a Mortgage Adviser from Newbury Building Society. Help myself on order to decided better rate in order to save interest on our mortgage.",
      "rating": 5,
      "date": "20th May 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "The underwriters understood the ability of people ag...",
      "text": "The underwriters understood the ability of people age 70 who are still in business to afford and fulfil their repayment liability . in simple terms common sense in granting a mortgage for upto the age of 89.",
      "rating": 5,
      "date": "20th May 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Eve was fantastic!",
      "text": "Eve was fantastic! I really appreciated how she listened to my request and offered me the best option for me. She was patient and friendly and really explained the technical terms to me. I normally dread these sorts of things but I came away feeling confident and with a smile on my face.",
      "rating": 5,
      "date": "19th May 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great communicators, clear and concise",
      "text": "I was very impressed with the frequency and clarity of communication of the various people involved in the steps along the way. Also, the flexibility of staff in arranging the in-person discussions to accommodate my schedule.",
      "rating": 5,
      "date": "17th May 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "was able to redeem mortgage early- all very smooth a...",
      "text": "was able to redeem mortgage early- all very smooth and efficient",
      "rating": 5,
      "date": "17th May 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Eve McDowell",
      "text": "I would like to call out Eve McDowell who provided me with what I can only describe as the best banking experience I have ever had. And I work in a bank so I know what it is like! She is polite, professional, responsive and courteous and should be recognised at the highest level of your institution. Because of Eve, the Newbury has me for life. Rgds, Ben Taylor",
      "rating": 5,
      "date": "16th May 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Professional and customer-focused",
      "text": "Newbury provided us a professional and customer-focused service for the mortgage we had with them. It was easy to speak with them and their information has always been clear and helpful.",
      "rating": 5,
      "date": "15th May 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Friendly, approachable, clear and concise.",
      "text": "Friendly, approachable, clear and concise. They explained everything succinctly and didn't try to upsell me anything. A breath of fresh air vs the mortgage monoliths.",
      "rating": 5,
      "date": "14th May 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Fantastic service",
      "text": "Angela was so understanding and helpful when in can to renewing our mortgage. We have a great deal and will be wanting to stay with Newbury for many more years to come.",
      "rating": 5,
      "date": "8th May 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent communication .",
      "text": "Excellent communication . Good choice, lots of options all explained in detail.Thank you",
      "rating": 5,
      "date": "8th May 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "The process was efficient but not the fastest",
      "text": "The process was efficient but not the fastest",
      "rating": 4,
      "date": "7th May 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Strightforward..",
      "text": "From commencing the application, using Metro finance, to completion the whole process was strightforward and made easy by the professionalism shown by Newbury BS",
      "rating": 5,
      "date": "4th May 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Renewing Mortgage",
      "text": "Easy process from start to finish, with knowledgeable & friendly staff.",
      "rating": 5,
      "date": "2nd May 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very efficient and easy to deal with - All the staff...",
      "text": "Very efficient and easy to deal with - All the staff I spoke with were pleasant and helpful.",
      "rating": 5,
      "date": "26th April 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "The Newbury put things right - I'm impressed.",
      "text": "I had a very bad experience with the Newbury. They were very keen to resolve my issues fairly. They listened and agreed the areas where they had adversely affected the time it took to agree my mortgage and therefore the interest I had to pay the existing mortgage company. They refunded the extra I paid as well as some extra to say sorry. They decided to review a couple of policies that caused the problems. I like a company who listen to their customers and are willing to properly put things right.",
      "rating": 5,
      "date": "23rd April 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "We used a broker so not a lot of direct experience w...",
      "text": "We used a broker so not a lot of direct experience with Newbury but we were able to get a mortgage with my partner working as a contractor which wasn't open to us with other banks, so from that perspective Newbury were fantastic",
      "rating": 5,
      "date": "22nd April 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Worst remortgage I’ve ever experienced",
      "text": "I’ve remortgaged to new lenders around 30 times. I’ve never had such a bad experience. If I hadn’t been liable for such high interest rates on my existing mortgage, I would have gone elsewhere. I feel like I’ve been treated with suspicion and lack of care, you need to take a walk through your customer experience in the shoes of someone in my position and learn how to make it more customer centric!",
      "rating": 1,
      "date": "20th April 2024",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "no contribution towards legal fees",
      "text": "no contribution towards legal fees",
      "rating": 5,
      "date": "15th April 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "I already had a mortgage with Newbury and then remor...",
      "text": "I already had a mortgage with Newbury and then remortgaged again with Newbury after my fixed term ended. Easy service and completed well.",
      "rating": 5,
      "date": "12th April 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Personal service despite a slight hitch!",
      "text": "Most of our dealings with Newbury Building Society about our remortgage were dealt with by our broker. We did have direct contact with one of Newbury's underwriters, Sezanne Brear. She was extremely helpful. However, earlier in the process there was an unfortunate hold up when, it appears, the valuer appointed by Newbury to check our house took nearly two weeks to return his report. As a consequence, our completion date was delayed, adding to our costs.",
      "rating": 5,
      "date": "10th April 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Move from expiring fix to new product",
      "text": "I had useful discussions in reviewing the way ahead from the expiry of my fix. I felt that NBS had by best interests at heart and carefully explained the pros and cons of moving onto a discounted variable rate for 3 years",
      "rating": 5,
      "date": "8th April 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "All staff extremely well trained courteous and effic...",
      "text": "All staff extremely well trained courteous and efficient. Unheard of these days.",
      "rating": 5,
      "date": "8th April 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Further advance heaven",
      "text": "Had a further advance money arrived in my account on the day I suggested exactly what the doctor ordered",
      "rating": 5,
      "date": "5th April 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Seamless!",
      "text": "Seamless! The whole process was extremely simple, communication was timely. Cannot say anything more.",
      "rating": 5,
      "date": "5th April 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Mortgage renewed efficiently.",
      "text": "Mortgage renewed efficiently. Staff could not have been more helpful",
      "rating": 5,
      "date": "5th April 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "The service given by my mortgage adviser was excelle...",
      "text": "The service given by my mortgage adviser was excellent, I felt I was listened to and not pressured into anything. The advice was invaluable and nothing seemed to much trouble. I would certainly recommend Newbury to family and friends.",
      "rating": 5,
      "date": "5th April 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very helpful mortgage advisor",
      "text": "Very helpful mortgage advisor. She explained everything in detail and gave various options.",
      "rating": 5,
      "date": "5th April 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great personal service!",
      "text": "I have just redeemed my mortgage early. That was straightforward (as one would expect with the Newbury). What really sets them apart is the personal customer service. You speak with helpful humans! They're flexible to meet your requirements. Thank you!",
      "rating": 5,
      "date": "4th April 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Mortgage advice",
      "text": "I spoke with Clare Taylor, who was very helpful and responded to my enquiry without delay. She was friendly, but very professional in her dealings with my enquiry. Clare gave good advice and dealt with my mortgage enquiry efficiently. The follow up letter laying out our discussions was received within twenty four hours",
      "rating": 5,
      "date": "28th March 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Security and Trust - Newbury Building Society",
      "text": "NBS design its products, services, and processes with the customer’s needs and preferences in mind. NBS strive to create a seamless experience with timely and effective customer support.",
      "rating": 5,
      "date": "20th March 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Clear, professional advice.",
      "text": "Clear, professional advice. I had two appointments to discuss my options as my contract and current mortgage term were coming up. Both advisors were very helpful, made sure I understood everything and listened carefully to what I had to say.",
      "rating": 5,
      "date": "15th March 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Long-term customer who values Newbury's service",
      "text": "We made multiple changes to our existing mortgage in the run-up to transferring to a new product with Newbury - and all of our changes were readily accommodated and acted on by Newbury professionally and quickly. Additionally it did not even cross our mind to switch to another provider such has been our positive experience of Newbury and its excellent customer service since we took out our mortgage in 2013.",
      "rating": 5,
      "date": "11th March 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Really Helpful",
      "text": "Really helpful adviser answering all my questions regarding their products.",
      "rating": 5,
      "date": "11th March 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Professional, friendly and efficient.",
      "text": "NBS were pro active in informing us that our current deal was due to expire and invited us to contact them. It was easy to book a telephone appointment online and also easy to view all the possible deals online before the call. The best deal was discussed and agreed over the phone and the follow up paperwork was fast and efficient. Very impressed.",
      "rating": 5,
      "date": "9th March 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "I came in to change my account",
      "text": "I came in to change my account and was seen by Deborah who was very helpful couldn’t have asked for more",
      "rating": 5,
      "date": "8th March 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "A very straight forward and simple process.",
      "text": "A very straight forward and simple process. The communication was clear and kept us up to date through out the process of applying for our mortgage and a nice welcome gift on arrival.",
      "rating": 5,
      "date": "3rd March 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Most helpful mortgage provider I've come across",
      "text": "Answered call really quickly,listened to me and did everything they could to help even though it wasn't them that had caused a delay.Liaised with solicitors and myself above and beyond to get mortgage through asap.Most helpful company so far and I've used many different mortgage providers",
      "rating": 5,
      "date": "2nd March 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent service time to explain all options",
      "text": "Excellent service, prepared to take the time and explain all options available with real term figures to enable you to make the best choice for yourselves and your current/future financial situation",
      "rating": 5,
      "date": "2nd March 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Personal Experience",
      "text": "I’ve had direct contact with Newbury Building Society that has been excellent throughout the entire process. Efficient, and always a quick response. Very impressive.",
      "rating": 5,
      "date": "1st March 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Everything done in a timely reasonable way with clea...",
      "text": "Everything done in a timely reasonable way with clear emails as required",
      "rating": 5,
      "date": "28th February 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Lauren Dearlove was amazing.",
      "text": "Lauren Dearlove was amazing. She was so helpful.",
      "rating": 5,
      "date": "26th February 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "I was very impressed that Newbury were able to conta...",
      "text": "I was very impressed that Newbury were able to contact me on Saturday, which was really helpful for somebody who lived in Japan.",
      "rating": 5,
      "date": "24th February 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    }
  ]
}