{
  "society": "Newcastle Building Society",
  "slug": "newcastle-building-society",
  "smpUrl": "https://smartmoneypeople.com/newcastle-building-society-reviews/products",
  "totalReviewsOnSMP": 28,
  "avgRating": 3.82,
  "scrapedAt": "2026-02-06T16:00:09.723092+00:00",
  "reviews": [
    {
      "title": "Had a mortgage prodcuct transfer, I was offered bett...",
      "text": "Had a mortgage prodcuct transfer, I was offered better rates with Newcastle as my current provider, that any other provider could offer",
      "rating": 5,
      "date": "3rd March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Easy and simple",
      "text": "No issues, went through a third party but will probably go to NCBS direct next time as so easy.",
      "rating": 5,
      "date": "1st March 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Good rate and quick product transfer",
      "text": "I stayed with Newcastle Building Society after 2 years into my mortgage. They offered very good rate and the process was really simple to switch.",
      "rating": 5,
      "date": "12th January 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Wasting people's time",
      "text": "After offering us £20,000 more than we wanted on a mortgage principal certificate we decided to go with them both of us have good jobs and an excellent credit rating without a reason decided to decline the mortgage why offer a mortgage in principle if you take it away there slogan is to look after the people of the North East what a load of rubbish",
      "rating": 1,
      "date": "2nd June 2021",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "Great rates and service",
      "text": "Everything has been simple and efficient with our mortgage application. The service has been brilliant and the rate is very competitive. I don't ever want to move my mortgage.",
      "rating": 5,
      "date": "6th August 2020",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Mortgage application",
      "text": "Newcastle Building Society provided exactly what we needed in a mortgage for our new home. Communication was prompt and efficient, everything completed on schedule and we received a lovely welcome pack once we moved in! Great service!",
      "rating": 5,
      "date": "6th February 2018",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Good service and competitive rates",
      "text": "I have to confess I didn't look too hard for a mortgage. I was happy with the rate I found for the newcastle building society and the service has always been great...so quite happy.",
      "rating": 5,
      "date": "18th November 2015",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very easy to use and good interest",
      "text": "Simple, straightforward and no issues.",
      "rating": 5,
      "date": "28th February 2023",
      "product": "Lifetime Isa",
      "sentiment": "positive"
    },
    {
      "title": "Easy to open and great account",
      "text": "The online journey was simple and the account will help save for a house deposit",
      "rating": 5,
      "date": "15th January 2022",
      "product": "Lifetime Isa",
      "sentiment": "positive"
    },
    {
      "title": "Wish I Had Not Switched",
      "text": "I chose to switch my LISA from a stocks and shares to cash and as Newcastle had the best interest rate at the time I switched to them. I now massively regret not reading the reviews. It took 2 months to transfer the money between the accounts and this meant I nearly missed the deadline for receiving my bonus. I also never received details for online banking and had to go through a painful process of letters and calls to get access. I am now in the process of drawing the money out for the purchase of my home and hope that I have a smoother experience then when I put it in. If doing again I would avoid Newcastle at the expense of the extra 0.2% interest I would earn.",
      "rating": 1,
      "date": "17th October 2019",
      "product": "Lifetime Isa",
      "sentiment": "negative"
    },
    {
      "title": "Incompetent",
      "text": "Applied online and told to either fund account before it was open or wait till postal confirmation saying it’s open. No confirmation received months after so thanking my lucky stars I did not send my money into a black hole!! Off to find a company that can actually open an account...",
      "rating": 1,
      "date": "4th July 2019",
      "product": "Lifetime Isa",
      "sentiment": "negative"
    },
    {
      "title": "Poor customer and extremely slow service",
      "text": "I applied for mortgage with Newcastle. The mortgage was agreed in principle and valuation was done on 2 April 2019 and I am still waiting for my mortgage offer. What a disgrace. I am sorry I applied and thoroughly disgusted with the pace. I am ashamed to be associated with Newcastle.",
      "rating": 1,
      "date": "28th May 2019",
      "product": "Lifetime Isa",
      "sentiment": "negative"
    },
    {
      "title": "Long-term saving",
      "text": "Easy to open, great customer service and my idea of a really great offer.",
      "rating": 5,
      "date": "13th January 2019",
      "product": "Lifetime Isa",
      "sentiment": "positive"
    },
    {
      "title": "Great telephone service",
      "text": "I was locked out of my online account (apparently because it had become inactive...I hadn't logged in for a while). But calling them up this morning proved to be very easy. No wait time and very friendly service!",
      "rating": 4,
      "date": "3rd January 2017",
      "product": "Newcastle Big Home Saver",
      "sentiment": "positive"
    },
    {
      "title": "This was a great product...",
      "text": "Logged in the other night to find that this account is no more. Instead of a good interest rate product, I've been moved to a sub <1% savings account. Not great. Looking for somewhere else to move my money too now!",
      "rating": 2,
      "date": "21st March 2016",
      "product": "Newcastle Big Home Saver",
      "sentiment": "negative"
    },
    {
      "title": "Great face to face customer service",
      "text": "I was informed that Newcastle Building Society would no longer be accepting standing orders, so I tried to set-up a different instruction. Unfortunately something went wrong and a subsequent payment I made to them was rejected. However, when I went into the Linthorpe Road branch, J Roberts was very helpful and dealt with my query quickly...still not sure why the payment was rejected though!",
      "rating": 4,
      "date": "29th December 2014",
      "product": "Newcastle Big Home Saver",
      "sentiment": "positive"
    },
    {
      "title": "Good interest rate and friendly telephone staff",
      "text": "I opened an account with them because the rate they were offering was one of the best around. Forgot my password a few times, and locked my account...but staff on the phone were really helpful! Recommended",
      "rating": 4,
      "date": "2nd October 2014",
      "product": "Newcastle Big Home Saver",
      "sentiment": "positive"
    },
    {
      "title": "No compassion or understanding for members",
      "text": "I have a lot of money in a 5 year bond taken out when interest rates were very low. I politely asked if I could renegotiate the interest rate by a couple of percentage points but was told no. Whilst I understand that I had a contract I would have liked them to demonstrate some compassion, especially in view of how much their CEO and others are earning.",
      "rating": 2,
      "date": "26th February 2024",
      "product": "Newcastle Fixed Rate Options Bond",
      "sentiment": "negative"
    },
    {
      "title": "Great customer service",
      "text": "The staff in my local branch are always so friendly!",
      "rating": 5,
      "date": "31st January 2017",
      "product": "Newcastle Fixed Rate Options Bond",
      "sentiment": "positive"
    },
    {
      "title": "5 out of 5 stars...from me",
      "text": "Ray Sisterson 49 reviews GB Rated 5 out of 5 stars 2nd to none I have been helped today i can not tell you how far this person went to see me right today 100 % Fantastic could not ask for any better so thank you Laura Moorhead 5* from me Date of experience: 15 April 2025",
      "rating": 5,
      "date": "15th April 2025",
      "product": "Newcastle Fixed Rate Options Isa",
      "sentiment": "positive"
    },
    {
      "title": "Avoid at all costs",
      "text": "Accused my wife of money laundering when she tried to transfer an ISA to them. Other companies do online checks within seconds but these idiots are incapable of that. Customer Services can only repeat 'Computer says no'. Absolutely useless company.i",
      "rating": 1,
      "date": "26th July 2019",
      "product": "Newcastle Fixed Rate Options Isa",
      "sentiment": "negative"
    },
    {
      "title": "No longer a market leader",
      "text": "I joined the Newcastle BS when their \"Big Home Saver\" regular savings account was a market leader, paying about 3% . Over the last few years the rate has gradually declined to the point where I abandoned the society to pursue better rates elsewhere. Service with Newcastle was always good in my experience, although the online banking service was a little clunky. Overall a B+ (could do better!)",
      "rating": 3,
      "date": "22nd June 2016",
      "product": "Newcastle Fixed Rate Options Isa",
      "sentiment": "mixed"
    },
    {
      "title": "Nice idea but rates still low",
      "text": "I think that this account is a clever thing for the Newcastle Building Society to do - in that it gives a little back to charity. However, for every £1000 in this account, the charity gets just £1 per year and the customer £10. At a 1.1% rate this is low, but top marks on the intention.",
      "rating": 4,
      "date": "29th July 2015",
      "product": "Newcastle Fixed Rate Options Isa",
      "sentiment": "positive"
    },
    {
      "title": "TOONARMY",
      "text": "Do a great job for our local hero and legend wot sir Bobby Robson",
      "rating": 5,
      "date": "6th May 2025",
      "product": "Sir Bobbyrobson Foundation Isa",
      "sentiment": "positive"
    },
    {
      "title": "An amazing service provided!",
      "text": "Newcastle Building Society provides some of the best service I have ever regularly received on the high street. Their attention to communication is excellent. Service isn't limited to requests, they always go the extra mile to find out whether more help is required and assuring my products are suitable and long term financial well being considered.",
      "rating": 5,
      "date": "20th December 2018",
      "product": "Sir Bobbyrobson Foundation Isa",
      "sentiment": "positive"
    },
    {
      "title": "The Best",
      "text": "put 10,000 in 3% for 5 years brilliant",
      "rating": 5,
      "date": "23rd November 2018",
      "product": "Sir Bobbyrobson Foundation Isa",
      "sentiment": "positive"
    },
    {
      "title": "Frriendly, Efficient Service",
      "text": "Local offices with friendly staff who get to know you and your financial needs. Good old fashioned service from a modern, forward thinking financial institution which still has customers interests at the heart of it.",
      "rating": 5,
      "date": "10th January 2019",
      "product": "Sir Bobbyrobson Foundation Saver",
      "sentiment": "positive"
    },
    {
      "title": "Helped and well guided throughout",
      "text": "My review is about the personal touch the newcastle provided when I was securing a mortgage. Would have no difficulty to recommend to a friend or family member.",
      "rating": 4,
      "date": "23rd September 2015",
      "product": "Mortgages",
      "sentiment": "positive"
    }
  ]
}