{
  "society": "Norwich & Peterborough Building Society",
  "slug": "norwich-and-peterborough-building-society",
  "smpUrl": "https://smartmoneypeople.com/norwich-and-peterborough-building-society-reviews/products",
  "totalReviewsOnSMP": 10,
  "avgRating": 3.3,
  "scrapedAt": "2026-02-06T16:00:19.984450+00:00",
  "reviews": [
    {
      "title": "used to be good",
      "text": "since they withdrew bank accounts and closed most of the branches they have changed as a company. Service is definitely poor now .",
      "rating": 1,
      "date": "13th March 2018",
      "product": "Current Account",
      "sentiment": "negative"
    },
    {
      "title": "Tried to change terms and conditions, very unhelpful",
      "text": "2 accounts, 1 always a good balance, would not let me change terms for 2nd account, very disappointed.",
      "rating": 1,
      "date": "30th May 2017",
      "product": "Current Account",
      "sentiment": "negative"
    },
    {
      "title": "no foreign bank charges",
      "text": "One of the few banks that don't charge for withdrawing cash abroad",
      "rating": 4,
      "date": "11th February 2017",
      "product": "Current Account",
      "sentiment": "positive"
    },
    {
      "title": "Shocking",
      "text": "From refusing to provide telephone advice about a suitable account I could transfer a large sum of into; it was impossible to visit a branch as I had moved to London, and have poor computer/internet skills so couldn't open an internet account, this mattered not a jot. Either visit a branch or open an internet account. Very limiting. And now they have accused me of providing a fraudulent document - it certainly isn't, and they are ignoring the assurance of a solicitor on the matter. Essentially, they are accusing me of being a criminal. Because of this they have prevented me from taking up a work offer in Spain. And last but not least, most of the branch staff are helpful and polite but I had the misfortune of dealing with one very rude member of staff a couple of years ago. My advice is to take your money elsewhere",
      "rating": 1,
      "date": "5th November 2016",
      "product": "Current Account",
      "sentiment": "negative"
    },
    {
      "title": "ATMs abroad",
      "text": "Great for getting commission-free money out of ATMs abroad",
      "rating": 5,
      "date": "28th June 2016",
      "product": "Current Account",
      "sentiment": "positive"
    },
    {
      "title": "Poor IT Systems and Customer Service",
      "text": "After a month since opening an account, when I was trying to logon online, I seem to have mis typed my password. Without any warning my account got locked after 3 attempts. When I called the customer service they asked me for a telephone password to unlock my online account. I didn't know what it was and the customer service person didn't give any other alternate option to unlock it through the phone. She advised that I need to set a password for telephone banking through post first and then call them back to reset the online account. This seem to be lengthy and frustrating and something unheard of.",
      "rating": 1,
      "date": "26th May 2016",
      "product": "Current Account",
      "sentiment": "negative"
    },
    {
      "title": "Excellent customer service and polite staff",
      "text": "My experience of norwhich and peterborough has been delightful one. Opening account was easy and straightforward. The staff are helpful and waiting times are reasonable. I was diagnosed with a mental illness. Due to my illness I had occurred overdraft charges, with the bank. I informed of this with supporting evidence. The bank was very sympathetic and refunded the charges. I delighted to say I am still a loyal customer of theirs.",
      "rating": 5,
      "date": "21st January 2016",
      "product": "Current Account",
      "sentiment": "positive"
    },
    {
      "title": "Easy to access and great service",
      "text": "I have had only positive experiences with N&P and their current accounts. Their online banking is fantastic as well as the staff being incredibly polite via phone and inside the bank. Brilliant service",
      "rating": 5,
      "date": "27th November 2015",
      "product": "Current Account",
      "sentiment": "positive"
    },
    {
      "title": "Regular Saver account",
      "text": "I have a family regular saver that means i have to put £250 into my account every month. Although the interest rate isnt any better than anywhere else you get a bonus every year for not touching the money which means a tidy amount every year",
      "rating": 5,
      "date": "1st March 2017",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "in control of my savings.",
      "text": "I am very happy with the service I receive. I love being able to deposit and withdraw as and when. The staff in my local branch are all very friendly and chatty which is always nice.",
      "rating": 5,
      "date": "14th August 2015",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Free Cash Withdrawals While Abroad",
      "text": "I have this account purely because they don't charge a premium when withdrawing money from cash machines abroad. You have to make five transactions a month to keep the account free, but I simply have a standing order every week, and another every month, to pay in a small amount.",
      "rating": 4,
      "date": "28th July 2016",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    }
  ],
  "trustpilotUrl": "https://uk.trustpilot.com/review/nandp.co.uk"
}