{
  "society": "Penrith Building Society",
  "slug": "penrith-building-society",
  "smpUrl": "https://smartmoneypeople.com/penrith-building-society-reviews/products",
  "totalReviewsOnSMP": 5,
  "avgRating": 4.2,
  "scrapedAt": "2026-02-06T16:02:11.731275+00:00",
  "reviews": [
    {
      "title": "Most painful process ever!!!",
      "text": "Waited until the deal was signed, sealed and safely chained to the gates of Mordor before daring to write this brutally honest review. If you don’t want to read the details… just AVOID THEM LIKE THE BLOODY PLAGUE. I bought my first house 20 years ago. Several properties and numerous mortgages later—owner occupier, buy-to-let, you name it—and I can say with ABSOLUTE CONFIDENCE that I have never experienced a process so agonisingly slow, pedantic and painful in all my living days. Never. Ever. Again. We’ve just re-mortgaged the same house we bought in 2007—probably the 3rd or 4th time we’ve done it, because, like most people, we prefer not to pay through the nose. We’re both in full time employment with flawless credit ratings and enough savings to make a bank manager swoon. And yet… as God is my witness… it would be easier to launder money through a Guatemalan drug cartel while juggling flaming chainsaws than it is to work with this lot. The volume of information they request is beyond farcical. They’ll ask for it repeatedly, reject it for sport, and seem to take genuine pleasure in finding new and creative ways to make your paperwork “not quite acceptable.” I swear they have a dedicated department called ‘Computer Says No’ staffed by retired Dementors. They are so backward, so technologically allergic, they still rely on wet signatures. Wet signatures! In 2025! Which is marvellously convenient when the named parties don’t even live in the same postcode, let alone the same continent. Even our saintly mortgage advisor—who has the patience of a Buddhist monk on diazepam, and has guided us for more than a decade—has vowed never to use them again. Read into that what you will. The sheer hassle, wasted hours, emotional energy and printer ink we’ve spent trying to secure this mortgage has been nothing short of traumatic. We were this close to telling them to sod off and starting again elsewhere… but that would’ve been the financial equivalent of setting fire to our own eyebrows. In conclusion: Can I recommend them? No. Would I wish them on an enemy? Only a strong one. Should you avoid them? Yes—like you’d avoid an open manhole in the dark. Getting a mortgage is stressful enough. This lot turn it into a hostage situation and call it “due diligence.” You will not forget the experience. But only because you’ll be telling the story in therapy for years.",
      "rating": 1,
      "date": "16th December 2025",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "Excellent service from a small building society.",
      "text": "Easy access savings , children’s savings , regular savings and term accounts with good interest rates.",
      "rating": 5,
      "date": "22nd April 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Always helpful staff",
      "text": "Staff give the impression of knowing/remembering me so I feel a valued customer. I feel they are committed to me and in response I am committed to them. They are always polite, friendly, efficient and helpful. The building society has, in a very difficult market, tried to ensure savers get a fair deal. I may be wrong but think that their Board don't get such huge salaries+bonuses as some building societies so that members get more of the benefit.",
      "rating": 5,
      "date": "7th April 2021",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Did what I asked exactly",
      "text": "Matured regular saver, split the proceeds three ways including opening a new account, handled perfectly. Responses through secure message fast. No need now to visit the branch for existing customers who doesn't live there, unlike previous maturities, which is welcome, as it risked alienating existing customers in the past",
      "rating": 5,
      "date": "17th December 2019",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Good service",
      "text": "I recommend the Penrith Building Society for their savings accounts. Of course, you have to be selective as not all accounts have a good interest rate: in the recent past I've had their Christmas Savers and Regular Saver 300 accounts. It seems like a traditional building society in that the service is good but there is also online access and a secure messaging system where I've always received a friendly and helpful reply within about 24 hours.",
      "rating": 5,
      "date": "24th December 2015",
      "product": "Savings",
      "sentiment": "positive"
    }
  ]
}