{
  "society": "Principality Building Society",
  "slug": "principality-building-society",
  "smpUrl": "https://smartmoneypeople.com/principality-building-society-reviews/products",
  "totalReviewsOnSMP": 52,
  "avgRating": 4.44,
  "scrapedAt": "2026-02-06T16:02:42.379052+00:00",
  "reviews": [
    {
      "title": "Excellent online Cash ISA with 12 month bonus",
      "text": "I have held a cash ISA with Principality for several years but noticed a new online ISA account with a bonus rate for 12 months. Upon request, they transferred my existing ISA to the new account with a minimum of fuss.",
      "rating": 5,
      "date": "26th February 2024",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Good high street rate",
      "text": "Quick efficient service close to my home",
      "rating": 4,
      "date": "18th August 2023",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Good savings account",
      "text": "Competitive rates and customer service is satisfactory",
      "rating": 4,
      "date": "2nd June 2023",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Good Product",
      "text": "Excellent service, polite, organised and professional staff. Great product, easy to set up and easy to understand. Thank you",
      "rating": 5,
      "date": "22nd November 2019",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Excellent Service",
      "text": "Excellent product and the staff at our local branch are knowledgeable about it. Easy to set up and use xx",
      "rating": 5,
      "date": "18th December 2018",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Excellent",
      "text": "Excellent service. The staff at our local branch are welcoming, professional and organised. They are also very knowledgeable about the wide range of products that the branch can offer. Thank you",
      "rating": 5,
      "date": "9th November 2018",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "5 Year ISA On-Line Application Doesn't Work",
      "text": "Processing an on-line 5 year ISA application gives error code 4530 and won't let you complete. Like a twot it tried it twice on an iPad and once on a windows laptop, same error code so a good waste of half an hour",
      "rating": 1,
      "date": "4th March 2018",
      "product": "Savings",
      "sentiment": "negative"
    },
    {
      "title": "Ethical",
      "text": "Ethical, easy to use, local, always friendly and helpful",
      "rating": 5,
      "date": "6th November 2017",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Excellent., local customer service, always very helpful and friendly",
      "text": "I have had a principality building society acccount for many years and have always found them to be very personable and helpful towards any questions I may have. I am served as quickly as possible and they are happy to have a quick chat, which helps build rapport. They are professional In their approach. Also, the are a local company and I am proud to support a company that has its ethics and goals aligned with its customers.",
      "rating": 5,
      "date": "2nd February 2017",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Pacesetter.",
      "text": "Very little 'phone-waiting time, then ... a miracle! Contact is made with a most friendly, polite and helpful 'humanoid', capable of providing a solution, without having to refer to anyone else. - A template for the vast majority of similar institutions to follow!",
      "rating": 5,
      "date": "24th January 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Their regular savers are market leading.",
      "text": "Their regular savers are market leading. The maturity process is best in market. They even transmit matured funds on none working days. They offer using some of funds to start off a new policy that day so you lose no days of investing.",
      "rating": 5,
      "date": "22nd January 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Principality is 'simply the best'!",
      "text": "My husband Tom and I have been customers of the Principality Building Society for 3 years. The website provides clear information and is easy to navigate. The highlight of the service is the ability to speak to an experienced member of staff directly on the phone. Telephone calls are answered quickly and professionally. Unlike some other financial institutions which direct you to an automated chat line or keep passing you from one department to another, this does not happen with the Principality Building Society. We have 12 month regular savers accounts. When the savers mature, we start new ones but do not need to set up a new account and new standing orders. We continue with what we have previously set up. It is a simple user friendly system which limits unnecessary work on our behalf. Nothing seems too much trouble on the phone. Principality Building Society set the gold standard in excellent customer relations and interpersonal skills and should serve as a role model to certain other financial institutions.",
      "rating": 5,
      "date": "22nd January 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Good service and high interest rate account",
      "text": "Good account with a very good interest rate,website is a bit slow to work with and it appears whatever you say you will be contacted by phone to confirm instructions before the maturity date. Building soc. has regular good interest rates and consistently features in best account literature. . .",
      "rating": 5,
      "date": "13th June 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "6 Month Regular Saver",
      "text": "6 Month Regular Saver: Amazing rates, no issues whatsoever. Excellent customer support!",
      "rating": 5,
      "date": "27th February 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Large withdrawal swiftly dealt with.",
      "text": "Needed to withdraw large some of money, this was swiftly paid into my bank account unlike some other building societies that are painfully slow with large withdrawals.",
      "rating": 5,
      "date": "26th February 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Unfair to disabled people",
      "text": "I started to invest with the Principality when we were planning our move to Wales. I saved steadily and by the time we moved had a good sum in my investment accounts. I had both passbook and online accounts and found that initially, the staff were friendly and helpful. However, when I had a stroke, it became difficult for me to manage my online accounts. My speech and mobility were poor and I realised that my various savings were not in the best accounts for me. The Principality were poor at communicating my options to me. When I went into the branch, I asked for help and explained that I had had a stroke. Whilst they were quite willing to update my husband's passbook without any form of ID, they bizarrely required ID from me before they would discuss my accounts. They wanted a bank statemnt, which I had not brought with me. When I told them that my Halifax statements were online on my phone and I could send a copy to their printer, the staffer pretended that she could not understand what I was saying. I felt humiliated and went home. I then went back a couple of weeks later and went into the branch with my passbooks and asked for them to be updated. The three staffers just talked to each other about their families, their slimming club and so on. They did not speak to me directly, One of them referred to me as \"this customer\". So I decided to close my accounts on the spot, which I did. I took the cheques across the road to the Nationwide and bought bonds and such like with them. When I got home I contacted the Principality to complain. They said that they could not see the problem. Eventually, they sent me a little food hamper of stuff that I could not eat because I am a vegan. They sent me an email saying that as far as they were concerned, the matter was closed.",
      "rating": 2,
      "date": "31st May 2023",
      "product": "Savings",
      "sentiment": "negative"
    },
    {
      "title": "Good savings rate",
      "text": "A good savings rate on regular deposits",
      "rating": 5,
      "date": "13th March 2021",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Good but no app available in 2021!?!",
      "text": "A bit behind the times but then again it's a building society. Rates are usually pretty tempting and customer services.ok.",
      "rating": 3,
      "date": "11th March 2021",
      "product": "Savings",
      "sentiment": "mixed"
    },
    {
      "title": "Easy to access account",
      "text": "Easy account to access online. Online banking easy to set up. The process of moving money in and out of the account is simple but there is ample security.",
      "rating": 5,
      "date": "24th January 2020",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Consistently competitive interest rates",
      "text": "Principality offer consistently competitive interest rates. Opening and operating an account is easy and helpful support is provided when required.",
      "rating": 5,
      "date": "23rd January 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Their savings account offer a very good interest rat...",
      "text": "Their savings account offer a very good interest rates and their customer service is excellent",
      "rating": 5,
      "date": "22nd January 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Alternative products with great rates",
      "text": "Principality's products are available to the whole of the UK, I started with a regular saver that had a high rate, and since then they've had 6 month and Christmas savers; both products not found with many other banks. The website is well designed and easy to navigate, and the few times I've needed to call; they were friendly and helpful. The only downsides is they still don't have an app despite the home page showing a webpage on a phone that could be confused for an app. Also their bank.green score could better, as they use Barclays in the background which is the worst for ethical-environmental concerns. These two issues stop it being a 5 star building society.",
      "rating": 4,
      "date": "3rd November 2024",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Good service",
      "text": "Good service and offers competitive interest",
      "rating": 5,
      "date": "30th March 2023",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Great product",
      "text": "Easy to set up, website is easy to navigate around. The staff in our local prestatyn branch are polite, friendly, organised and professional. They are also very knowledgeable. Well worth a look",
      "rating": 5,
      "date": "4th February 2023",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "T & Cs on website not current.",
      "text": "I wished to close my 2 year ficed rate bond after 1 year but was told I couldnt despite current website information stating with loss of 180 days interest I could. https://www.principality.co.uk/savings-accounts/fixed-term-savings-and-bonds/fixed-term-bond-account-terms",
      "rating": 1,
      "date": "7th July 2021",
      "product": "Savings",
      "sentiment": "negative"
    },
    {
      "title": "Nice Security",
      "text": "Switch banks/Building Societies quite a bit, and I think this is the first time that I ever have had to confirm my address to set up a saver, maybe it was because I havent banked with them before but even so, I appreciate it.",
      "rating": 5,
      "date": "10th March 2021",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "A nice wee saver",
      "text": "Good product for receiving a decent interest rate in exchange for regular savings which they can hold for a fixed period of time. Easy to set up online. Staff on the phone friendly and helpful to deal with.",
      "rating": 5,
      "date": "9th February 2020",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Customer Service above all",
      "text": "Principality is a company that can always be relied on to help with their knowledgeable contact centre and helpful admin team alongside good rates.",
      "rating": 5,
      "date": "25th January 2020",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Good interest rates & easy application.",
      "text": "Straightforward application process and online access. Good rate of interest from a no-nonsense building society.",
      "rating": 5,
      "date": "5th November 2019",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Third party doing paperwork",
      "text": "Did not receive bond maturing letter or statements the money was in a very poor rate account lost 1 years interest !",
      "rating": 2,
      "date": "1st October 2017",
      "product": "Savings",
      "sentiment": "negative"
    },
    {
      "title": "Good communication.",
      "text": "Communication is regular and informative. Customer service is very efficient.",
      "rating": 5,
      "date": "24th March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Easy to deal with online or via the phone.",
      "text": "Easy to deal with online or via the phone.",
      "rating": 5,
      "date": "22nd March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Trustworthy and Professional!",
      "text": "Great customer service, great products and great communication!",
      "rating": 5,
      "date": "28th February 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very Good Customer Service",
      "text": "Can’t rave about their customer service enough. Have always been able to have a transparent conversation regarding our options. Only thing is they’re more expensive than a lot of other mortgages not the most competitive on rates",
      "rating": 4,
      "date": "16th April 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great Rates",
      "text": "Just remortgaged here with a five year fix - fantastic rate and using involegal made the process quick and easy",
      "rating": 5,
      "date": "6th February 2020",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Refused Mortgage",
      "text": "We had an issue over seven and a half years ago and our Mortgage Broker said Principality were a good lender and should have no problems. We passed our AIP no problems and were up front with our issue from many years ago and even showed the issue was resolved. Our credit score was good otherwise we would not have passed. We met all their lending criteria and they decided to turn us down. They would not even give a reason to the Broker why. What's the point in having a lending criteria and then move the goalposts? Really disappointed with them. We all make mistakes in the past and we addressed ours and have been clean for many years... just seems some lenders hold on to the past even though it was many years ago. Hi just an update guys. I spoke to the Broker who spoke to a manager directly at Principality and after looking in to it, she agreed we did meet the criteria but was not able to overturn the decision. They have now amended their criteria so it doesn't happen again. Absolutely shocking from Principality. Just to let you know I was able to get a Mortgage with another high street lender with a fantastic rate who didn't judge us on our past from seven years ago.",
      "rating": 1,
      "date": "3rd December 2017",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "Friendly staff",
      "text": "You can't get better customer service than the staff at principality. The mortgage advisor is very helpful and offered good unbiased opinions to help us make our decision regarding or mortgage",
      "rating": 5,
      "date": "17th May 2017",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Perfect",
      "text": "All i could ask for in a mortgage. Great rate, easy to view account, great customer service",
      "rating": 5,
      "date": "13th January 2017",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great Service",
      "text": "Great service, knowledgeable and professional staff at the Prestatyn branch, thank you",
      "rating": 5,
      "date": "12th July 2019",
      "product": "Insurance",
      "sentiment": "positive"
    },
    {
      "title": "excellent service I received from the Branch",
      "text": "I wanted to put away a small amount of money each month for 6 months and this account offered very good interest rates. What made the experience even better was the excellent service I received from the Branch",
      "rating": 5,
      "date": "23rd January 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Friendly",
      "text": "Good savings options and always greeted with a smile. Also local branches not far away.",
      "rating": 4,
      "date": "23rd July 2023",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Efficient, simple to use with no fuss",
      "text": "I have been a customer of the Principality for a few years now with a Cash Isa and Instant Saver accounts and have found them to be very easy to contact and knowledgeable. Our nearest branch is open from Monday - Saturday, so it is fairly easy to call in. The staff are friendly and easy to talk to about any banking issues that I may have. I have never had a bad experience with them and recommend anyone to give them a chance. The staff at the Principality are efficient and they explain exactly what their banking products do and how they work in plain, simple language without all the jargon for a quick sale. The Principality does everything that you'd want a building society to do.",
      "rating": 5,
      "date": "9th April 2017",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Great Saving Account",
      "text": "This is a great saving account with a better rate of interest and easy to set up. The staff in our local branch are very knowledgeable, friendly and organized. Highly recommended.",
      "rating": 5,
      "date": "6th January 2022",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Promise Saver",
      "text": "Great Promise Saver with a good rate of interest. Easy to open and understand. Staff are organised, knowledgeable and friendly. Thank you",
      "rating": 5,
      "date": "23rd November 2018",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "I recommend the Promise Saver Account",
      "text": "I found opening the Promise Saver account very easy in the branch. They were able to deal with me without an appointment. The rate of interest was good at 1.00% compared to other banking institutions offering the same type of saver account. I recommended this account to my Mum and son and they opened accounts also. Well worth a look.",
      "rating": 5,
      "date": "15th November 2016",
      "product": "Savings",
      "sentiment": "positive"
    }
  ]
}