{
  "society": "Progressive Building Society",
  "slug": "progressive-building-society",
  "smpUrl": "https://smartmoneypeople.com/progressive-building-society-reviews/products",
  "totalReviewsOnSMP": 5,
  "avgRating": 4.8,
  "scrapedAt": "2026-02-06T16:03:15.319030+00:00",
  "reviews": [
    {
      "title": "foolproof",
      "text": "great savings isa helps generate better income than basic savings rate currently on offer and is tax free as well",
      "rating": 5,
      "date": "2nd October 2021",
      "product": "Clockwork Regular Saver",
      "sentiment": "positive"
    },
    {
      "title": "Provide good service for technophobes and sensitive...",
      "text": "Provide good service for technophobes and sensitive to needs of seniors",
      "rating": 4,
      "date": "23rd January 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Mortgage review",
      "text": "Couldn’t be happier with how it went, Progressive been great from 1st correspondence to moving into new house",
      "rating": 5,
      "date": "27th May 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Local, accessible building society",
      "text": "Straightforward local provider for mortgage and Savings. Easy to deal with",
      "rating": 5,
      "date": "11th December 2019",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "very customer friendly everytime i go.",
      "text": "This is a awesome company that does its best to provide me with every service i need. I never have to worry about them answering my calls or getting back to me for any reason. i would recommend this company to any and every one of my friends and family. I will continue to use this service for many many years.",
      "rating": 5,
      "date": "13th April 2015",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Nice to talk to!",
      "text": "Very helpful & patient when phoned with a technical problem.",
      "rating": 5,
      "date": "2nd February 2026",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Excellent response",
      "text": "Excellent response.  Timely , efficient and friendly.  Perfect.",
      "rating": 5,
      "date": "29th January 2026",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Wonderful Progressive building society",
      "text": "ONG Progressive building society are absolutely brilliant. I’ve got completely confused about my account and the gentleman at Progressive sorted it out perfectly for me  - 10 out of 10 for wonderful customer service ￼￼",
      "rating": 5,
      "date": "29th January 2026",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Problem resolved immediately",
      "text": "Problem resolved immediately, I appreciate getting a follow up call so quickly",
      "rating": 5,
      "date": "27th January 2026",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Excellent service from Katie",
      "text": "Spoke to Katie and she was so helpful and so knowledgeable about the details I was enquiring about.",
      "rating": 5,
      "date": "20th January 2026",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Five-Star Service from a Brilliant Mortgage Advisor",
      "text": "I had an excellent experience with my mortgage advisor (Louise Bleakley) at Progressive. She was friendly, professional, knowledgeable, and incredibly supportive throughout the entire process. Everything was explained clearly, all my questions were answered promptly, and I always felt confident I was getting the best advice for my situation. The whole experience was smooth and stress-free. I would highly recommend Progressive and particularly Louise to anyone looking for expert guidance.",
      "rating": 5,
      "date": "20th January 2026",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Log on woes resolved",
      "text": "Having difficulty with logging on to electronic banking and support staff member Dean resolved the problem very readily. The issue required a callback, which Dean took the trouble to do, and although the resolution was quite simple, Dean was helpful, patient and courteous, as were the telephone 'reception' staff. This has been the case with all my interactions with Progressive, and encourages customer loyalty. Much appreciated.",
      "rating": 5,
      "date": "20th January 2026",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Mortgage application",
      "text": "We recently took a new mortgage with the progressive, we spoke to Jane Steen (Coleraine branch) she was was nothing short of AMAZING she made every step of the way so simple and easy nothing was too much!! \nThank you so much Jane",
      "rating": 5,
      "date": "14th January 2026",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Online Account Access",
      "text": "Prompt service. Pleasant staff member.",
      "rating": 5,
      "date": "13th January 2026",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "I got to speak to a person in customer…",
      "text": "I got to speak to a person in customer support, my issue was solved quickly, so refreshing. Dean was super helpful.",
      "rating": 5,
      "date": "8th January 2026",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Progressive Ballymena Branch",
      "text": "Whilst visiting the Ballymena Branch we have experienced the highest level of customer service. All members of staff are warm and friendly, and always ensure our needs are met. \nThe branch manager ensured our mortgage process was a positive experience and supported us throughout. The service we received has encouraged us to recommend Progressive to other potential customers in the future.",
      "rating": 5,
      "date": "2nd January 2026",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Very helpful staff and came back to me…",
      "text": "Very helpful staff and came back to me when he said he would",
      "rating": 5,
      "date": "19th December 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "David Andrews was excellent and…",
      "text": "David Andrews was excellent and extremely professional and helpful. Got my mortgage switched to my new direct debit account within minutes and made the call seemless",
      "rating": 5,
      "date": "13th December 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "A human being answered the phone",
      "text": "I spoke to a person that I could understand and they answered within a few rings. I need say no more.",
      "rating": 5,
      "date": "10th December 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Welcome to the Rainy Day Account",
      "text": "I'm a new online savings customer with my first transfer payment in today (Rainy Day Acct).  What a good impression Katie (Online Savings) made on me of her Belfast Bldg Scty.  I didn't expect making numerous phone calls - each answered by a very cheerful, welcoming Katie who calmly, with her savings knowledge, answered all my queries, leaving me with no doubts. Thank you Katie, you're a 'front of house' credit and your managers should be proud.",
      "rating": 5,
      "date": "10th December 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Dan helped me set my account up",
      "text": "Dan helped me set my account up, he was very friendly and polite, so easy thanks dan and i look forward to saving with progressive",
      "rating": 5,
      "date": "9th December 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "1) Excellent customer service",
      "text": "1) I was very impressed with the speed of responding to my queries:\n2) Politeness and patient helpfulness from Dean, who was at the other end of the phone.\n3) All in all a positive experience for the excellent customer service.",
      "rating": 5,
      "date": "4th December 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "One of Progressive Online Savings…",
      "text": "Dean One of Progressive Online Savings team, was especially helpful in getting me set up.\nOn the downside, I found the automated application cumbersome and perhaps unnecessary. There's got to be a better way.",
      "rating": 5,
      "date": "4th December 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "easy setup",
      "text": "I noticed people were having problems opening savings accounts online with progressive but I thought I'd give it a go what with a 7% interest rate, glad to say it was straight forward and completed in about 10 minutes without any trouble.",
      "rating": 5,
      "date": "30th November 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Friendly competent staff.",
      "text": "Friendly competent staff.",
      "rating": 5,
      "date": "27th November 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "The assistant was able to sort my issue…",
      "text": "The assistant was able to sort my issue very quickly and efficiently",
      "rating": 5,
      "date": "24th November 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Online Savings Team",
      "text": "Dean of the Online Savings Team was patient and very helpful assisting me in setting up my account, spending time to thoroughly explain the process in detail, backing it up with email communication. Many thanks to him and Michelle in the team, well done.",
      "rating": 5,
      "date": "21st November 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Not very progressive",
      "text": "This doesn’t really seem progressive at all. \nI signed up for the 7% saver online and couldn’t complete my registration as the ID upload didn’t display. \nI thought mobile would be better as they are ‘progressive’… but somehow it was much worse. \n\nI’ve now had to send a picture of my passport and a selfie. This was requested via the support case or alternatively an email. There is no sign of a retention policy or encryption for these documents, which is a personal information concern. \n\nStill awaiting my account to be opened. So far, it’s been a pretty poor experience.",
      "rating": 2,
      "date": "20th November 2025",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    },
    {
      "title": "Great customer service.",
      "text": "Approached the progressive regarding self build mortgage.\nVery helpful from the off set and provided professional service from the start. Any questions were answered thoroughly and all relevant information provided. Staff always very friendly and approachable. A big thank you to Andrea and Wendy in the glengormley branch for all their help and easy journey securing our self build mortgage.",
      "rating": 5,
      "date": "18th November 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Clear guidance and a prompt solution to…",
      "text": "Clear guidance and a prompt solution to my query",
      "rating": 5,
      "date": "17th November 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Superb customer service",
      "text": "I was guided by their website to seek support from a Progressive Building Society representative. I phone the supplied number and spoke with Amy.\nI explained the situation and my need and Amy resolved the matter within a minute.  Amy explained that the adjustment she had made would take a short while to be reflected in their online portal so we then had a short and friendly chat about Belfast after which, I was able to log back in and complete my need.  Thanks Amy and thanks Progressive Building Society.",
      "rating": 5,
      "date": "7th November 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Excellent customer service",
      "text": "I raised a query on line and not long after I was phoned up. Dean sorted my problem quickly, efficiently and professionally.  Very impressed.",
      "rating": 5,
      "date": "31st October 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Issues resolved very quickly",
      "text": "I was having a few issues trying to open a new savings account and couldn't get past certain points.\nDean the customer service advisor initially talked me through the stages but when the issues continued he arranged for the set up to be completed remotely and kept me informed each step of the way. \nCannot fault the service and support I received from Dean. Made what could have been a very frustrating time very simple,  for me anyway.",
      "rating": 5,
      "date": "29th October 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "When logging in this comes up",
      "text": "When logging in this comes up: \"For security reasons, you have to connect Salesforce Authenticator to your account. The app sends a notification\" \nThis cost £19 a year. Seriously they wanted £19 for me to login.\n\nGOT A CALL FROM THEM TURNS OUT THAT WAS A CON. IT WAS WRONG AUTHENTICATOR APP",
      "rating": 5,
      "date": "16th October 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Excellent friendly service",
      "text": "Excellent friendly service from knowledgeable staff. Elaine from the Ballymena branch was very helpful and accommodating to sort out my requests.",
      "rating": 5,
      "date": "10th October 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Simply awful experience registering for…",
      "text": "Simply awful experience registering for the 7% saver account. The 'support' offered by the customer service person redefines what poor customer service can be like. I asked if he could speak a little louder - no was his reply. Three times he said he 'didn't know' when I asked why the browser simply hung processing my application. Then when we tried to register for my husband the system repeatedly said 'unknown error'... so calling again got the same unhelpful response \"I don't know\". Appalling really... I wouldn't recommend them on the basis of our experience today",
      "rating": 1,
      "date": "10th October 2025",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    },
    {
      "title": "Fabulous advisor",
      "text": "Our mortgage advisor Louise bleakley. She was personable, knowledgeable and a pleasure to deal with. She took the stress out of the entire process and kept us informed throughout. Superb and could not recommend her enough. Thank you so very much!",
      "rating": 5,
      "date": "3rd October 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Self build mortgage",
      "text": "Jane from the Coleraine branch was absolutely exceptional! a real joy to work with, she helped us with every step of the process and made the whole thing simple for us! Jane is so pleasant and professional and a great asset to your team !",
      "rating": 5,
      "date": "2nd October 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "A very helpful building society and…",
      "text": "A very helpful building society and nothing is ever a problem.\nNicole was a fantastic help with my query and a super fast reply and turnaround. \n110% - 5 stars from me.",
      "rating": 5,
      "date": "29th September 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Ballymena progressive branch- highly recommended",
      "text": "The staff in Ballymena branch were so helpful and pleasant. They were able to carry put my wishes re accounts with no hassle. The whole process was very quick and easy!",
      "rating": 5,
      "date": "27th September 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "New Customer - one hiccup - but otherwise good.",
      "text": "Experienced an error when trying to open a savings account. Logged this to Customer Support.\nReceived callback next day and error was sorted by Michele.\nApparently, their system didn't like me using a # in the Account Name.\nMany thanks Michele.",
      "rating": 4,
      "date": "26th September 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Highly recommend",
      "text": "Rachel was great in helping us get sorted. Easy to communicate with and answered any questions we might have had. Would highly recommend her to anyone looking for mortgage help.",
      "rating": 5,
      "date": "25th September 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Progressive Building Society Ballymena",
      "text": "We wish to thank Progressive, Ballymena branch for their expert financial advice to me over the past 25 years. They always took time to get to know our individual situation and tailor their advice accordingly.",
      "rating": 5,
      "date": "23rd September 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Great local building society",
      "text": "Sorting out daughter's finances before she leaves for Uni in GB. Ballymena branch staff are efficient, professional and discreet, everything a bank should be. Always putting the customer first. Great place to do business. Couldn't praise them enough for their helpful and considerate attitude to customers. Other high street banks could learn so much from them!",
      "rating": 5,
      "date": "5th September 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Outstanding support and service throughout our remortgage",
      "text": "I’ve just completed my remortgage with Progressive and could not be happier with the service.\n\nNicky has been absolutely outstanding throughout the whole process. She is professional, approachable, and consistently went above and beyond to keep things moving smoothly. This is the second time she has looked after us, and her excellent customer service was a big factor in choosing Progressive again.\n\nKerry also provided clear guidance on payment dates at an important stage, and her help was very much appreciated too.\n\nIt’s rare these days to find this level of personal, attentive service - Progressive should be very proud of the support their team delivers. Highly recommended.",
      "rating": 5,
      "date": "4th September 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "The professionalism,efficiency and…",
      "text": "The professionalism,efficiency and friendliness ot the staff in your Lisburn office.  First class.",
      "rating": 5,
      "date": "25th August 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "5 star service",
      "text": "Jane at the Progressive branch in Coleraine was fantastic from start to finish.",
      "rating": 5,
      "date": "21st August 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "10/10 would recommend",
      "text": "The customer advisor I had, Louise, was fantastic from start to finish, very professional but very personable at the same time. The progressive as a company worked with me very quickly and effectively to resolve the issue I was having. 10/10 would recommend",
      "rating": 5,
      "date": "20th August 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Absolutely useless website",
      "text": "Absolutely useless website. Can't contact them in any useful way as their opening hours are 9-5 M-F. I've been trying to transfer my savings for a week now and my money is still being held hostage by them. Not worth the hassle.",
      "rating": 2,
      "date": "15th August 2025",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    },
    {
      "title": "Great service",
      "text": "Called into the glengormley branch so lovely the staff Emma was really helpful and was training Zoe at the time got my business done very efficiently and quickly have recommended this office to my friends and family",
      "rating": 5,
      "date": "15th August 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "I’ve been a customer with The…",
      "text": "I’ve been a customer with The Progressive for many years after our self build. We recently completed an application for addition borrowing and Louise made the process so straight forward. Everything was taken care of. I honestly believe The Progressive has the best customer service out of all the banks or building societies I’ve ever used.",
      "rating": 5,
      "date": "12th August 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Helen Dobson was excellent but website poor",
      "text": "Helen Dobson was excellent, very helpful and friendly and assisted with an issue caused by their antiquated website",
      "rating": 5,
      "date": "7th August 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Excellent service in the Lisburn branch",
      "text": "Alison in the Lisburn branch has been so kind and helpful at a very difficult time (family bereavement), she made everything so straightforward, very much appreciated.",
      "rating": 5,
      "date": "6th August 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Best place in Lisburn",
      "text": "I have been a customer for many years and always welcomed with a friendly smile and helpful manner from all the Team , we need this level of service offered in more places in the City, keep up the great work. \nHELP MAKE LISBURN GREAT AGAIN ! 😀",
      "rating": 5,
      "date": "4th August 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Pamela Parkins",
      "text": "Pamela Parkins has managed my mortgage account for many years, including most recently during July 2025.\n\nPamela’s professionalism and service levels are outstanding, reflected, at all times , in her proactive and solutions focused approach, her knowledge of the mortgage products, strong communication skills, and overall helpfulness. Pamela is a real pleasure to deal with.",
      "rating": 5,
      "date": "24th July 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Louise was excellent",
      "text": "Louise was excellent. A really helpful and straightforward experience.",
      "rating": 5,
      "date": "23rd July 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "A very helpful clerk.i had a matured…",
      "text": "A very helpful clerk.i had a matured bond and Natalie in the Enniskillen branch was very pleasant and explained clearly all the options available to me.",
      "rating": 5,
      "date": "18th July 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "service agents Gareth ireeny and other…",
      "text": "service agents Gareth ireeny and other lady with glasses were lovely regarding my first ISA",
      "rating": 5,
      "date": "9th July 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "The girls in the glengormley branch are…",
      "text": "The girls in the glengormley branch are superb very knowledgeable in their job, it will be sad to see Andrew leave tomorrow but I wish him all the best in head office. Keep up the good work.",
      "rating": 5,
      "date": "30th June 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Mortgage Renewal",
      "text": "The friendly & professional staff are extremely helpful and quality of service that is given is what makes them stand out and keeps us returning every time.",
      "rating": 5,
      "date": "28th June 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "The Derry Branch Welcome",
      "text": "I've been dealing with Rachel and her staff at the Derry branch for several years. On each occasion I'm impressed by the welcoming environment, the staff who are extremely helpful and efficient regarding my account and not forgetting the welcoming smile which is so important also.",
      "rating": 5,
      "date": "9th June 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Hopelessly inefficient",
      "text": "This organisation may be great when dealing in person, but I have found it truly hopeless when trying to open an account from a distance. After 7 weeks they have still not contacted my current ISA provider to effect a transfer of funds, such that my current provider now says that to transfer will incur a substantial penalty because Progressive failed to contact them within 30 days of my ISA maturing. Emails have gone unanswered so I am definitely going to avoid this organisation in future.",
      "rating": 1,
      "date": "6th June 2025",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    },
    {
      "title": "Pleasant and Professional Portadown",
      "text": "i cannot speak too highly of the very pleasant ladies who work in the Portadown branch. I phone the local branch and have the pleasure of speaking immediately to one of these ladies for whom customer care is a priority. i always feel welcome in the branch - no problem seems too trivial and my business is always carried out in the most professional  and courteous way.",
      "rating": 5,
      "date": "29th May 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Excellent Service AS Usual",
      "text": "Nicola from Belfast branch was excellent. Thank you. Very thorough. Omagh branch are also superb to work with. I couldn't rate the Omagh branch staff high enough and it is due to them that I have such loyalty to Progressive. Keep up the great work.",
      "rating": 5,
      "date": "28th May 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "The Enniskillen branch is a credit to the organisation",
      "text": "Lorna and the rest of the Enniskillen team are just phenomenal! The level of customer service you receive in this branch is next to none. My account was opened by my parents when I was born and I have used them until today (31 years!). Everytime I went in they were always friendly and familiar. Sadly I have just closed my account as the interest rate has dropped too much compared to other savings accounts. I am genuinely sad to leave but will definitely be back if the interest rate increases.",
      "rating": 5,
      "date": "28th May 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Great Staff",
      "text": "We took out our mortgage 10 years ago this month and from start to finish the process has been great. Anyone we have worked with has been excellent. Our first contact was Melanie who retired 2 years ago then we had Jane both from the Coleraine branch. They both have been very helpful when we wanted to increase payments, overpay, take out a new deal or with any general queries. I can happily say with all their help we are now officially mortgage free. Thank You",
      "rating": 5,
      "date": "24th May 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Great to be able to walk into a…",
      "text": "Great to be able to walk into a building and talk to someone. Staff were very helpful and helped me fill in the necessary forms and provide me with all the necessary information",
      "rating": 4,
      "date": "23rd May 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Couldn’t ask for more",
      "text": "Couldn’t ask for more. Wendy the manager of the Ballymena branch and all her team were always helpful and put through our large mortgage in record time. She devoted many an afternoon entirely to us even during a busy time of year, staying late when necessary! We went to the Progressive upon recommendation from others, and we would definitely pass that recommendation on!",
      "rating": 5,
      "date": "8th May 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Online Fixed Rate Account",
      "text": "I opened an Online Fixed Rate Bond account today and was very impressed with how quick and straightforward the process was.  All in all the account was set up within minutes and I was able to transfer the funds over. Confirmation email was received promptly.",
      "rating": 5,
      "date": "6th May 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Opening ISA",
      "text": "Called into Newtownards branch today to enquire about transferring a Cash ISA from another provider. \nImmediately impressed by open layout of office that allowed face to face interaction that’s much missed these days. \nThe lady dealing with me was courteous and extremely helpful, knowledgeable about the subtleties of ISA allowances and made the process effortless. \nProbably the most productive ten minute interaction I’ve had with any financial institution.",
      "rating": 5,
      "date": "2nd May 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Helpful advice on Mortgage Product change",
      "text": "The term on my current mortgage was coming to an end so I had some decisions to make. I contacted Progressive BS and was put through to Jane in Coleraine Branch. From the outset Jane was very helpful, very approachable, friendly and knowledgeable about the products available to me. I pondered over my options and spoke several more times to Jane before making my decision. She was always professional, friendly and patient as I asked questions and presented her with different financial scenarios. Nothing was too much trouble, and I felt very confident talking things through with her. Jane is a credit to Progressive Mortgage Advisors! \nThanks for all your help Jane",
      "rating": 5,
      "date": "28th April 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "My visit to the branch",
      "text": "Today I called into the Bangor office and spoke to Rachel Henderson. I had internal transactions to carry out with three books. Rachel filled out forms regarding adding my children and including marking up books, made the whole process easy for me. I have been coming to the office for years and she has always been very helpful, professional and of a happy disposition. She is a credit to progressive Building society and is one of the reasons I have saved with the society since 2011. I might add the other staff are great too",
      "rating": 5,
      "date": "25th April 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Purchase of our first home",
      "text": "Elaine helped us purchasing our first home. Elaine made it an easy process for us with myself and my partner just having a new born. We can no recommend Elaine and progressive enough.",
      "rating": 5,
      "date": "22nd April 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Jane Steen / PBS (Coleraine)",
      "text": "Jane (Coleraine branch) showed excellent knowledge of both the products and the process.  She was diligent in fact finding and had the expertise to recommend the most suitable product.  She was also available, helpful and quick to respond with any enquiries.  The Society’s website and documents are clear and easy to use/understand and I felt well informed throughout the process.\nI’d recommend PBS (and Jane in particular) without hesitation.",
      "rating": 5,
      "date": "20th April 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Spoke with Katie by telephone today on…",
      "text": "Spoke with Katie by telephone today on a variety of savings and AGM issues, all of which were dealt with most professionally and with good humour. Katie is a tremendous ambassador for the Society. Thank you for your help today, much appreciated 😀👍",
      "rating": 5,
      "date": "17th April 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Very happy with the service received",
      "text": "We organised our mortgage through Julie in the Belfast branch and both happy with the service we have received. There were times when I needed to clarify some information  and I was able to pick up the phone to talk to Julie to ensure I was fully informed with the correct information. \nI was happy to learn that as I had a previous mortgage with progressive that I would be refunded my early repayment fee from my last mortgage as I was a repeat customer.",
      "rating": 5,
      "date": "15th April 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Efficient, Helpful, Polite & Understanding",
      "text": "I opened an account with The Progressive Building Society yesterday and was informed there was an issue with my authentication and someone would get in touch with me.\nI called up this morning and spoke to Pamela who informed me of why I my application did not pass security and immediately helped me with this so I could use the account.\nMy first experience with them and so far so good!",
      "rating": 5,
      "date": "7th April 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Initial lending appointment",
      "text": "Met with Denise for initial mortgage enquiry . \nReally well informed , all areas covered . Great service",
      "rating": 5,
      "date": "28th March 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "I went in to open an ISA",
      "text": "I went in to open an ISA. I tried to do this in my main bank. No success doing this Online in the branch for over an hour. Tried to do this at home, failed at the end. Same with another bank online. Getting very frustrated so rang Progressive and got through to Bangor branch and was advised that if I went into the Omagh branch I would be able to get an ISA set up. Success at last. A lovely lady was so helpful, I think her name was Diane. Done and dusted in less than half an hour. Excellent service.",
      "rating": 5,
      "date": "27th March 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "The website is extremely difficult to…",
      "text": "The website is extremely difficult to use. Any action i have tried to do (withdraw money, add a bank account, add a bank account) I've had to 'submit a query' and wait several days for a response. Would not recommend.",
      "rating": 1,
      "date": "27th March 2025",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    },
    {
      "title": "My views on my experience with Progressive",
      "text": "I was treated very politely and respectfully and made to feel at ease.\nEleanor was very helpful and answered all my questions and concerns.\nShe kept in contact with me until my account was operational and money transferred.\nShe is a great asset to your company",
      "rating": 5,
      "date": "25th March 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "I Gave Up...",
      "text": "I appreciate that Banks & 'Socities need to guard against fraud, but their registration process is complex and time consuming. If using a PC to apply you still have to use a phone to capture a QR code, which links to another site that asks you if you have a paypal account, if you reply \"No\" you have to fill in  banking details with an external organisation. (Not to mention the need to upload a selfie and drivers licence). I know for a fact that many reputable banks make this process relatively simple.",
      "rating": 1,
      "date": "25th March 2025",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    },
    {
      "title": "Our mortgage advisor Karmen was very…",
      "text": "Our mortgage advisor Karmen was very professional, supportive and diligent. \nWe found the progressive very responsive to question.",
      "rating": 5,
      "date": "24th March 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Julia was amazing to work with",
      "text": "Julia was amazing to work with. Super helpful throughout the process.",
      "rating": 5,
      "date": "24th March 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Denise- an asset to the Progressive team",
      "text": "Once again it was a pleasure to deal with Denise in the Potadown branch. Denise communicates effectively with us and ensures we are aware of all the products available to us. A true asset to the Progressive team.",
      "rating": 5,
      "date": "23rd March 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Porting to 160 Barnett's Road. amela Parkins has been looking after…",
      "text": "Pamela Parkins has been looking after us for many years and our latest exchange has been superb. Pamela's calm and expert approach is reassuring.",
      "rating": 5,
      "date": "21st March 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Simple set up and great rate",
      "text": "I opened up a Regular Online Rainy Day Saver account, very simple process opened and funded within 10 minutes, with online access and funding options.",
      "rating": 5,
      "date": "13th March 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Opened bond",
      "text": "Read about bond on internet. Dealt with very pleasant, helpful, friendly member of staff at counter.",
      "rating": 5,
      "date": "5th March 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Could not fault!",
      "text": "Amazing experience with Progressive I was able to do my online mortgage change with absolutely no hassle would highly recommend!",
      "rating": 5,
      "date": "15th February 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Security problems may arise.",
      "text": "I have one savings product with them. Registration was a bit of a mare as I used an email I don't like to use for finance. Getting it changed was not easy but the IT guy who dealt was outstandingly competent so full stars to him.\n\nThe website is designed to mask the fact they have quite a lot of products. Only after visiting it on a laptop did I realise the block images were sub menus. Login is not the quickest with the most clunky software of any fintech I've seen.\n\nNo idea why SALESFORCE (their software provider) are so successful as, if that is classed as good fintech in the US then heaven knows what bad stuff is like. I particularly do not like the lack of login security. You either have to receive a text, which is not secure & takes far too long to arrive (5+ minutes), or their Salesforce authenticator which doesn't employ biometrics!! Really poor show for security. \n\nProduct maturity was not smooth but I'll say again that the staff that helped were extremely good and knowledgeable. Software menus are not clear with withdraw the option you'd expect to pick but that led to a request system that did not work as no one phoned back. I should have picked view account & then close account sub menu. Still the money didn't arrive though and had to phone to get it to clear.\n\nI think the staff are just overwhelmed with clunky poor software & maybe also management processes that do not have the best in mind for their customers.",
      "rating": 3,
      "date": "8th February 2025",
      "product": "General",
      "sentiment": "neutral",
      "source": "trustpilot"
    },
    {
      "title": "Can not even begin to explain or…",
      "text": "Can not even begin to explain or describe how badly this company came for my mum and the house when my step dad died. They should be ashamed of themselves. Would not recommend to anyone.",
      "rating": 1,
      "date": "24th December 2024",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    },
    {
      "title": "Progressed beautifully!",
      "text": "First class experience opening an online regular saver, handled by MICHELLE CRAIG who went above and beyond in assisting me.\nN.B. There is an SMS verification available as opposed to the authenticator  app upon request.",
      "rating": 5,
      "date": "17th September 2024",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Tech shortcomings undermine some good products",
      "text": "I tried to open a savings account but was unable to submit phots of ID documents through their Onfido identity check process. It didn't accept the images that I was trying to submit via my smartphone and I got into an endless loop of a failure message followed by TRY AGAIN. I was stuck with an online account that I was unable to activate. I can't say much about their account management service. But I can say that I raised the Onfido issue with customer services and their online response was to put a note in my account stating that I had not submitted the relevant documents and they were still waiting for them. This building society needs to fix its technological failures before I will try any harder, I'd rather go elsewhere. I regret providing the personal information that they asked for, I don't feel that I can trust them to delete it.",
      "rating": 2,
      "date": "11th September 2024",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    },
    {
      "title": "The Regressive Building Society",
      "text": "They call themselves The Progressive Building Society but their procedures are out of the 19th Century rather than the 21st Century.\nMost building societies and banks - I would say over 90%- make electronic checks to confirm a depositor's identity, but Progressive seem to insist on certified copies of  utility statements.  Very customer unfriendly.\nI notice that they don't answer criticisms on this website - that's very indicative  of their attitude. The CEO of Progressive should be ashamed",
      "rating": 1,
      "date": "10th September 2024",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    },
    {
      "title": "Cant fault them",
      "text": "I have to say this is one of the easiest online accounts that I have ever opened. The document ID  and selfie ID worked first time unlike other banks. A completely  seamless experience  opened quickly.  Also any query to the bank is replied to the next day. Some banks it takes them 5 days.  The negative reports here are clearly written by Technophobes.  Well done Progressive one of  the better banks that I have used. And I do have a lot of Bank accounts",
      "rating": 5,
      "date": "23rd August 2024",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Failed Online Registration, no callback, guidance misinformation",
      "text": "For a computer Online Registration after verifying my details (SMS code also involved), uploading my photo ID and taking the 'Selfie' (mobile phone again) the process stalled - a never-ending 'Processing' caption.\n\nI phoned and spoke to Marie 12 Aug, their help team was unable to take my call (with hindsgight, no surprise there) - no arranged callback since (today 19 Aug).\n\nAlarm bells should have rang for me when reading the convoluted registration process, which is reflected with other recent reviews...\n\nAlso their guidance not stating that the Selfie MUST be done using their mobile phone process.\n\nProgressive, did you know that Selfies can also (for example) be taken on devices called 'cameras' ? !!!\n\nI doubt I will ever get the arranged callback.\n\nThe only reason I now care about this shambles is that Progressive seemingly have all my personal details, my Photo ID and a photo of me.\n\nI wish that I had never allowed myself to get anywhere near this Amateurish, Apathetic and Awful organisation.\n\nThe saving-grace is that they have none of my money.....",
      "rating": 1,
      "date": "19th August 2024",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    },
    {
      "title": "Tried to register for new savings…",
      "text": "Tried to register for new savings account. 4 times and error came up. I even had someone talking me through and it still had an error. I was told someone will call back but to be honest if it's going to be a problem like this I won't bother.",
      "rating": 1,
      "date": "14th August 2024",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    },
    {
      "title": "Worst Registration",
      "text": "Worst Registration\n\nTried to sign up for a one year bond, can't get past their second page.you never receive the 6 digit email verification code email. I've tried twice.\n\nFirst time I tried a couple of weeks back I managed to get to verification, only to be  told that the passport image I loaded up hadn't come through. So they sent a lik to some website that I signed up for to upload again.\n\nManaged to register on that and they the site won't load up to get any further. All in all rubbish, I hate online verification, they obviously don't want investment very badly.\n\nSo they just lost out on a whole junk of investment, I emailed them and called, waste of time. I can't be bothered with this. Stick to Issa.",
      "rating": 1,
      "date": "14th August 2024",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    },
    {
      "title": "Incompetent Online Login Process",
      "text": "Incompetent Online Login Process\n\nJust tried to login to the new \"digital\" Progressive only to find I can't! \n\nI do have an account but now you need SalesForce authenticator to login.\n\nHowever, there is nothing from Progressive to allow a link to be added to SalesForce authenticator - so you can't login because SalesForce authenticator has to authentic you but it can't authenticate you because it is not linked to Progressive and the loop continues!\n\nThere is a \"choose an alternative verification method\" option but it loops straight back to SalesForce authenticator and so the farce continues.\n\nI have seen some rubbish IT systems in my time but this one takes the crown. There must have been NO testing by the developer. Utterly incompetent! \n\nIn short, if The Progressive wants to use Salesforce Authenticator then how about providing the QR code to allow a Progressive account in the authenticator?\n\nIf The Progressive is going to offer an option to use an alternative authentication method, how about actually providing one?\n \nCompletely below standards and a pathetic attempt of a digital presence!",
      "rating": 1,
      "date": "13th June 2024",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    },
    {
      "title": "Automatic rolling cover of bonds",
      "text": "The building society rolled over my children’s bonds without my permission for a 5 year period at a very poor interest rate. It is refusing to give me the money back.",
      "rating": 1,
      "date": "3rd May 2024",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    },
    {
      "title": "Spoke to a mortgage advisor in the…",
      "text": "Spoke to a mortgage advisor in the Belfast branch as I saw they offered really good mortgage deals on a comparison site. I already have a mortgage advisor who has provided me with some great deals but saw the progressive had lower monthly payments so decided to see if I was eligible. As I went through all the financials I was told I wouldn't be eligible for a mortgage with them and proceeded to make a condescending remark that I would not be able to borrow the amount needed.",
      "rating": 2,
      "date": "22nd April 2022",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    },
    {
      "title": "I have recently had a self build…",
      "text": "I have recently had a self build mortgage with Progressive - the Ballymena branch - especially Lorna have been so helpful and made the process extremely easy",
      "rating": 5,
      "date": "1st July 2021",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Excellent Service",
      "text": "Had to contact support team spoke with Dean who was excellent very helpful and knowledgeable.   Could not be more pleased with his service",
      "rating": 5,
      "date": "21st November 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Self build mortgage application",
      "text": "Fantastic experience from start to finish of Mortgage application. Andrea from the Glengormley office was brilliant in guiding us through the process and making everything go as smoothly as possible.\nMany thanks\nChris",
      "rating": 5,
      "date": "9th July 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Excellent Customer Service",
      "text": "Great customer service, nothing is too much trouble and they explain all.  A pleasure to do business in your Enniskillen branch.",
      "rating": 5,
      "date": "1st July 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Friendly",
      "text": "Friendly, staff. No pressure to sell products. Good day out for me.",
      "rating": 4,
      "date": "23rd June 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Excellent service",
      "text": "The girls in the Enniskillen branch are so pleasant and excellent at their job. They take time to explain things, are patient and nothing is a bother. They put the 'personal' back into banking. I cannot recommend them highly enough, especially Emma.",
      "rating": 5,
      "date": "11th June 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Excellent",
      "text": "Excellent, friendly staff",
      "rating": 5,
      "date": "9th June 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Progressive Ballymena",
      "text": "Couldn’t recommend the Ballymena branch of Progressive Building Society highly enough! Wendy was so helpful, and talked us through all the options for a mortgage, gave advice and got everything processed really quickly for us.",
      "rating": 5,
      "date": "9th May 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Great service - mortgage",
      "text": "We received great service from The Progressive, in particular from Louise, with respect to our mortgage. We had several calls with her and everything was explained clearly and she was able to answer any queries we had.  We also had some follow up emails and she replied straight away.  This took a lot of stress out of selling our old house and buying our new house.  We can definitely recommend The Progressive for mortgages.",
      "rating": 5,
      "date": "15th April 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    },
    {
      "title": "Great service",
      "text": "Elaine at progressive made the process for a mortgage change seemless and very easy to do. Video calls were very helpful and informative and would recommend  to others.",
      "rating": 5,
      "date": "24th March 2025",
      "product": "General",
      "sentiment": "positive",
      "source": "trustpilot"
    }
  ],
  "trustpilotUrl": "https://uk.trustpilot.com/review/www.theprogressive.com"
}