{
  "society": "Saffron Building Society",
  "slug": "saffron-building-society",
  "smpUrl": "https://smartmoneypeople.com/saffron-building-society-reviews/products",
  "totalReviewsOnSMP": 6941,
  "avgRating": 4.96,
  "scrapedAt": "2026-02-06T16:04:44.403924+00:00",
  "reviews": [
    {
      "title": "It was what it was supposed to be",
      "text": "It was what it was supposed to be",
      "rating": 5,
      "date": "6th February 2026",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "The staff at Saffron BS have always been incredibly...",
      "text": "The staff at Saffron BS have always been incredibly helpful, particularly Lisa H. who goes above and beyond to ensure customers are happy and all their queries have been resolved. Excellent service, I will always recommend Saffron to family/friends.",
      "rating": 5,
      "date": "5th February 2026",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Efficient, personal customer service",
      "text": "Anne was able to help immediately with my enquiry regarding our mortgage arrangement. It's always nice to speak to somebody and have the right outcome without having to go through a lot of computer menus first.",
      "rating": 5,
      "date": "4th February 2026",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "password help",
      "text": "Lisa was most patient and polite throughout the call",
      "rating": 5,
      "date": "3rd February 2026",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Outstanding Staff Support",
      "text": "The staff were extremely helpful, calling me twice and never giving up until they had confirmed receipt of the payment. They were pleasant and professional throughout.",
      "rating": 5,
      "date": "31st January 2026",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Great customer service",
      "text": "Very good renewal of our mortgage experience, customer service were excellent with both product and process knowledge, it was so easy to do.",
      "rating": 5,
      "date": "30th January 2026",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Excellent and speedy response from Alannah Harris.",
      "text": "Excellent and speedy response from Alannah Harris.",
      "rating": 5,
      "date": "30th January 2026",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Excellent service",
      "text": "Leon was excellent from start to finish. He communicated really well and was always happy to explain my options in more detail when I needed it. He clearly explained the different products available so I could make an informed choice. He was easy to contact, responded quickly to emails, and sent all documents over promptly, making the whole process straightforward and efficient.",
      "rating": 5,
      "date": "29th January 2026",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "A very customer focussed and attentive service",
      "text": "A very customer focussed and attentive service",
      "rating": 5,
      "date": "29th January 2026",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "The mortgage discussion was thorough",
      "text": "The mortgage discussion was thorough, considered, and very useful in comparing what was on offer",
      "rating": 5,
      "date": "29th January 2026",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Was very good experience with saffron building society",
      "text": "Was very good experience with saffron building society",
      "rating": 5,
      "date": "29th January 2026",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "The mortgage advisor was very helpful and friendly.",
      "text": "The mortgage advisor was very helpful and friendly. Since I am not computer savvy she was understanding.",
      "rating": 5,
      "date": "28th January 2026",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "The advisor was very helpful with products which w...",
      "text": "The advisor was helping me with the products which was making it easier for me to understand.",
      "rating": 5,
      "date": "28th January 2026",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Very good service on specialist mortgage.",
      "text": "Very good service on specialist mortgage.",
      "rating": 5,
      "date": "28th January 2026",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Highly professional response.",
      "text": "Highly professional response and a 'how can we make this work' culture.",
      "rating": 5,
      "date": "28th January 2026",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Very smooth and straight forward process",
      "text": "The process was very smooth and straight forward.",
      "rating": 5,
      "date": "27th January 2026",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Mortgage was extremely smoothly.",
      "text": "Mortgage from start to finish went extremely smoothly. We were kept informed at every stage",
      "rating": 5,
      "date": "27th January 2026",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "difficult questions answered in a simple way",
      "text": "I asked the lady couple of difficult questions which she explained in a very simple which i could easily understand",
      "rating": 5,
      "date": "27th January 2026",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Impressive Service",
      "text": "As a customer \"of a certain age\" I thought that I may have problems in obtaining a mortgage at a reasonable rate. Saffron came up trumps and provided excellent service in every respect.",
      "rating": 5,
      "date": "27th January 2026",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Far, but close!",
      "text": "As a non-resident investor, I have not felt miles away from dealing with Saffron. Their customer service and continual desire to grow and improve in all they do is refreshing.",
      "rating": 5,
      "date": "27th January 2026",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "My last communication with Saffron related to my mat...",
      "text": "My last communication with Saffron related to my maturing cash Isa. My enquiry was handled professionally and the rollover rate very competitive.",
      "rating": 5,
      "date": "27th January 2026",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Friendly and efficient staff.",
      "text": "Friendly and efficient staff. They offered me a mortgage when I needed it most and when others were reluctant.",
      "rating": 5,
      "date": "27th January 2026",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Highly recommended.",
      "text": "I was able to obtain a mortgage at a later age than usual. Saffron have been completely supportive in every way. Any questions have been answered clearly - and patiently answered. Customer service is excellent and I appreciate the little extras, such as perks and competitions.",
      "rating": 5,
      "date": "27th January 2026",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Excellent Buy to Let BTL SPV mode mortgage Products",
      "text": "I recently completed a Buy‑to‑Let (BTL) mortgage application with Saffron Building Society for my SPV limited company, and overall, my experience has been very positive. Their products for SPV landlords are excellent, and I would rate the entire process 90% strong, with 10% room for improvement. What Saffron Does Exceptionally Well: Fantastic mortgage products for SPV Limited Companies – Saffron offers one of the better ranges of specialist BTL mortgage options tailored for SPVs. Transparent and timely communication on interest rates – I really appreciate the regular updates based on inflation changes and the Bank of England base rate. This level of clarity helps landlords plan ahead with confidence. Good processing timelines – Apart from seasonal delays, their processing speed is generally reliable and well‑managed. Professional approach to business – This is what I like about Saffron the most. Their structured, process‑oriented way of working gives reassurance throughout the mortgage journey. Areas Where Improvement is Needed While the experience has been positive, there were two noticeable gaps: 1. Digital Experience – App / Portal Access Saffron’s motgage portal app and online portal are not fully user‑friendly. Although security and privacy are important—and I fully respect that—speed, accuracy, and easy digital access are equally important for today’s digital world. I still cannot access my account properly via the Android app, which reduces convenience. Improving the digital experience would definitely elevate the overall service. 2. Application Progress When Staff Are on Leave My application was processed around early to mid‑December (Dec 3rd to 15th), close to the Christmas period. If the assigned staff member is on leave, the application does not move forward. Even when follow‑up is done, the review seems superficial until the main staff member returns. Once they return, the application is re‑reviewed and sometimes additional documents are requested, causing delays. In my case, this caused nearly a two‑week delay, which added pressure from the seller and risked jeopardizing the deal. Better continuity or handover processes would prevent this. Final Thoughts Despite these two improvement areas, I genuinely like the way Saffron Building Society operates. Their product quality, communication style, and understanding of SPV landlord needs make them a strong lender in this segment. With a more user‑friendly digital platform and better application continuity during staff absence, they would deliver an even more exceptional customer experience. Overall, a solid lender with excellent potential and great service, especially for SPV landlords.",
      "rating": 4,
      "date": "27th January 2026",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Best of the Best for Mortgages!",
      "text": "I had a mortgage with them on a non standard construction property . I was SO grateful it was possible and they were amazing even through that past ghastly period of interest rising to 16% thanks to the Government!",
      "rating": 5,
      "date": "27th January 2026",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Saffron Building Society is a good mortgage lender",
      "text": "Saffron Building Society is a good mortgage lender and also offer good rates for savers too. Customer service is helpful and a lot can now be sorted out on-line.",
      "rating": 5,
      "date": "27th January 2026",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Excellent customer service",
      "text": "Kim was very knowledgeable about the products and very helpful to me",
      "rating": 5,
      "date": "27th January 2026",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Staff are great good service - any issues I can call...",
      "text": "Staff are great good service - any issues I can call through the app no long waiting",
      "rating": 5,
      "date": "27th January 2026",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Human and helpful customer service",
      "text": "What I appreciate about the Saffron Building Society is that you can call a number and speak to a helpful and pleasant human being who can solve your problems. I have contacted the Building Society three times over the past two days with different requests, and the same wonderful lady, Lisa Howard has been able to help me with each different request, including help with my E banking account. Thank you again Lisa, and thank Saffron",
      "rating": 5,
      "date": "27th January 2026",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Very good communication quick response very helpful...",
      "text": "Very good communication quick response very helpful and kind",
      "rating": 5,
      "date": "26th January 2026",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Mortgage review",
      "text": "Very helpful informative and professional",
      "rating": 5,
      "date": "26th January 2026",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Mortgage advice",
      "text": "Pleasure speaking with Kim very professional and informative clear and understandable information. Kim is a credit to your organisation.",
      "rating": 5,
      "date": "26th January 2026",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Customer service was excellent.",
      "text": "Customer service was excellent. Kim willet was really helpful providing me the information I needed clearly for me to understand and was very polite, also managed to answer and clearly tell me something on a different subject with my mortgage for future which I was unsure about",
      "rating": 5,
      "date": "23rd January 2026",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Lisa is a real asset to you!",
      "text": "Spoke with Lisa Howard in your team. She is a breath of fresh air... great old fashioned service... a human that is helpful and efficient that cares!!",
      "rating": 5,
      "date": "21st January 2026",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Excellent response to my query, helpful and empathetic.",
      "text": "Excellent response to my query, with a very helpful and empathetic handling of my issue. The whole process was completed with the absolute minimum of fuss and in a highly professional way. The Saffron culture seems to be ‘how can we make this work for you’ - which is in stark contrast to what one often finds in the commercial banking world.",
      "rating": 5,
      "date": "19th January 2026",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "when asking questions .",
      "text": "when asking questions . rang me back with all the information i needed . with a very cheerful manor",
      "rating": 5,
      "date": "15th January 2026",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Fantastic service from Lisa as alway",
      "text": "Fantastic service from Lisa as alway",
      "rating": 5,
      "date": "14th January 2026",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Lisa Howard and Kim Willett are both Brilliant",
      "text": "I have recently dealt with both Lisa Howard and Kim WIllett. They were both truly wonderful and professional, Helpful and friendly. I can't praise either of them enough. 10/10",
      "rating": 5,
      "date": "14th January 2026",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Mortgage Product advice",
      "text": "Kim was friendly, knowledgeable and helpful. Gave me good clear advice and information",
      "rating": 5,
      "date": "13th January 2026",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Honest customer feedback",
      "text": "Hello to who it may concern I have never had an issue with any of the staff reference to asking some information . They've always called me back when they said they would and most of all I'd like to say they've obviously got patience with customers like me that doesn't really understand much about banking so they must have a high level of patience which really is great for someone like me, ha ha thank you again all the best Mr Madrid,",
      "rating": 5,
      "date": "12th January 2026",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "competitive rates with digital technology company",
      "text": "competitive rates with digital technology from application to swift completion is the main driver for customers. Saffron is getting there in the top contenders.",
      "rating": 5,
      "date": "9th January 2026",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Patient, efficient and empathetic adviser",
      "text": "I have had a problem accessing my account and have rung six times. On each occasion I have received useful help, but because there was a problem with my memorable word I was locked out of access. On the fifth and sixth occasions I received excellent help from Lisa, who went above and beyond to ensure that my access was restored, and who was almost as excited as I was when I finally got into my account!",
      "rating": 5,
      "date": "9th January 2026",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Kim answered all my queries regarding increased mort...",
      "text": "Kim answered all my queries regarding increased mortgage borrowing to renovate house, she was very helpful & friendly",
      "rating": 5,
      "date": "7th January 2026",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Helpful infos",
      "text": "Hi, it was a pleasure speaking with Mrs Kimberley. She has been very kind, helpful and accurate.",
      "rating": 5,
      "date": "6th January 2026",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Great company with personal service",
      "text": "Everyone I have spoken to at Saffron has been friendly and helpful. I’d especially like to highlight Lisa Howard for her exceptional customer service, helping me resolve issues before they become bigger problems. She has been great, very helpful and friendly - a credit to your company",
      "rating": 5,
      "date": "6th January 2026",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "The bank was helpful and professional in accommodati...",
      "text": "The bank was helpful and professional in accommodating a change to my mortgage date. The process was straightforward, and the support provided made everything easy and stress-free.",
      "rating": 5,
      "date": "2nd January 2026",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "A reminder about my 1 st mortgage payment",
      "text": "I got a reminder about my 1 st mortgage payment so I assumed that the DD had not been set up. Lisa explained the situation very clearly that it was only a reminder to ensure that the funds were available in my bank account",
      "rating": 5,
      "date": "29th December 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Very helpful and professional",
      "text": "Kim was very helpful in all senses giving me the products that were available to me.",
      "rating": 5,
      "date": "23rd December 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Got exactly the information I needed",
      "text": "Got exactly the information I needed",
      "rating": 5,
      "date": "23rd December 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "I recently applied for a mortgage extension on a BTL...",
      "text": "I recently applied for a mortgage extension on a BTL Expat mortgage. I had great advice and support from Leon, my mortgage advisor. With this type of mortgage the documentation required can be extensive an convoluted, however my experience was very positive. Thanks",
      "rating": 5,
      "date": "17th December 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Very helpful lady.",
      "text": "Very helpful lady. Easy service.",
      "rating": 5,
      "date": "11th December 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Mortgage renewal",
      "text": "My experience relates to a mortgage renewal for a BTL (expat). I found the service provided clear and prompt and without many of the hurdles that one often associates with having to provide foreign documentation.",
      "rating": 5,
      "date": "10th December 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Rosanna was very helpful and good to speak with",
      "text": "Rosanna was very helpful and good to speak with",
      "rating": 5,
      "date": "8th December 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "The person I spoke to was really good",
      "text": "The person I spoke to was really helpful, easy to understand and very clear, patient and polite, there's not more you could ask for",
      "rating": 5,
      "date": "8th December 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "I just had a call from Safron about my remortgage.",
      "text": "I just had a call from Safron about my remortgage. After going through the initial security checks, Rosanna was good and professional. She explained varionus product types, took her time to listen to my concerns and generally very calm and was comfortable with my enquiry.",
      "rating": 5,
      "date": "5th December 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Rosanna Nahome was excellent.",
      "text": "Rosanna Nahome was excellent. She provided comprehensive advice, and took the time to break it down and explain the options in an easy to understand way. She was very patient and approachable.",
      "rating": 5,
      "date": "5th December 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Very helpful and easy to understand.",
      "text": "Very helpful and easy to understand.",
      "rating": 5,
      "date": "4th December 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Lisa was fabulous and explained all the complicated...",
      "text": "Lisa was fabulous and explained all the complicated stuff so well",
      "rating": 5,
      "date": "1st December 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Thank you Lisa",
      "text": "I spoke with Lisa Howard about an issue I was having, she was on the case, gave me the answers I need instantly. A credit to the team. Thanks Lisa",
      "rating": 5,
      "date": "27th November 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Information request",
      "text": "I received all the information that I required to make an informed decision",
      "rating": 5,
      "date": "27th November 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Anne was super friendly and really helpful",
      "text": "Anne was super friendly and really helpful",
      "rating": 5,
      "date": "26th November 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "The customer service is always exceptional.",
      "text": "The customer service is always exceptional. Lovely people who go out of their way to support their customers.",
      "rating": 5,
      "date": "24th November 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Lisa was great and really helpful",
      "text": "Lisa was great and really helpful",
      "rating": 5,
      "date": "20th November 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Good Support",
      "text": "Answered quickly and gave me the result I required. Professional and Friendly.",
      "rating": 5,
      "date": "20th November 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Kim explained everything very clearly.",
      "text": "Kim explained everything very clearly.",
      "rating": 5,
      "date": "19th November 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Mortgage retention advice",
      "text": "My adviser, Kim, was clear and informative. She was unfailingly patient and willing, both to answer my questions and to repeat important points. She never rushed but remained consistently professional but always friendly.",
      "rating": 5,
      "date": "17th November 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "I have power of Attorney for my mom and i found all...",
      "text": "I have power of Attorney for my mom and i found all the staff i spoke to helpful and informative when sorting out her recent mortgage product switch",
      "rating": 5,
      "date": "14th November 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "A quicker response",
      "text": "A quicker response in answering the call than I remember - well done! The person I spoke to was very helpful.",
      "rating": 5,
      "date": "12th November 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Prompt service and accessible draw down on loan was...",
      "text": "Prompt service and accessible draw down on loan was relatively easy",
      "rating": 5,
      "date": "11th November 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Rapid and clear service when discussing new products",
      "text": "Rapid and clear service when discussing new products",
      "rating": 5,
      "date": "8th November 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Anne was truly amazing.",
      "text": "Anne was truly amazing. The customer service team were on an away day and I needed to check an amount had been transferred out for my deposit on a house. It was very urgent. She found out the necessary information in quick time.",
      "rating": 5,
      "date": "6th November 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Brilliant customer service",
      "text": "Brilliant customer service could do any more to help",
      "rating": 5,
      "date": "3rd November 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Self Build Challenges",
      "text": "We have faced some challenging times recently on our self build project, but the mortgage officer Lisa and Retentions advisor Kim have always offered words of support and encouragement, whilst dealing with or financial requirements in a totally professional manner. Communication has been great and when they say they will call back, they do, every time. Thank you very much",
      "rating": 5,
      "date": "31st October 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Extremely helpful, supportive and knowledgeable.",
      "text": "Leon was patient, knowledgable and extremely supportive of my application with Saffron. He talked me through every step of the application, answered all questions and was helpful the whole time. He’s an asset to the team, I feel genuinely far more knowledgable about mortgages/remortgages due to Leon’s wise words, patient manner and knowledge.",
      "rating": 5,
      "date": "30th October 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Good clear explaination of my options",
      "text": "Good clear explaination of my options",
      "rating": 5,
      "date": "30th October 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Good customer service.",
      "text": "Good customer service. Gave me all the information I needed efficiently. Kim was very friendly, informative and personable.",
      "rating": 5,
      "date": "29th October 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "I applied for Consent to Let my property.",
      "text": "I applied for Consent to Let my property. I had anticipated it to be a hard process, but I was so pleased with the quick, responsive, professional service I received from Saffron and especially my contact, Lisa.",
      "rating": 5,
      "date": "29th October 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Lisa was a breath of fresh air.",
      "text": "Lisa was a breath of fresh air. Courteous and professional and got the job done.",
      "rating": 5,
      "date": "28th October 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Extra helpful mortgage support",
      "text": "Lisa in mortgages was extra helpful and patiently guided me through my online registration. Really reassuring and knowledgeable.",
      "rating": 5,
      "date": "27th October 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Good Customer Service.",
      "text": "Good Customer Service. Well communicated.",
      "rating": 5,
      "date": "27th October 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Brilliant service",
      "text": "Brilliant service, very helpful and polite customer service.",
      "rating": 5,
      "date": "23rd October 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Brilliant advisor",
      "text": "Lisa was patient and helpful throughout the call and process",
      "rating": 5,
      "date": "22nd October 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "easy switch",
      "text": "The switch was very easy. The communication was clear.",
      "rating": 5,
      "date": "21st October 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "I spoke with Kim from retentions today, she was frie...",
      "text": "I spoke with Kim from retentions today, she was friendly professional and very helpful. I got my queries answered quickly and efficiently with ease. excellent customer service",
      "rating": 5,
      "date": "20th October 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Fast and friendly no unnecessary forms to fill out",
      "text": "Fast and friendly no unnecessary forms to fill out",
      "rating": 5,
      "date": "20th October 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Quick response Ann was kind and helpful.",
      "text": "Quick response Ann was kind and helpful. She went over and above to resolve my query",
      "rating": 5,
      "date": "17th October 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "great customer service .",
      "text": "great customer service ..nice speaking to a human who had all the information and was keen to help",
      "rating": 5,
      "date": "16th October 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Lisa Howard was very helpful",
      "text": "Lisa Howard was very knowledgeable and helpful and dealt with my enquiry quickly and professionally. She was cheerful and friendly as well.",
      "rating": 5,
      "date": "16th October 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "I dealt with both Lisa and Anne yesterday who were b...",
      "text": "I dealt with both Lisa and Anne yesterday who were both so personal, it was refreshing to not feel so anonymous. They were so friendly and helpful and offered help to alleviate my anxiety. Lisa and Anne both emailed me several times yesterday and were very helpful, professional and friendly. I really appreciated it.",
      "rating": 5,
      "date": "16th October 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Belief in older borrowers",
      "text": "As an elderly person in need of borrowing against my property your organisation was really helpful and supportive. There have be no hiccups and whenever I have phoned I have been treated properly and dealt with like a real person by a real person. Long may that continue!!",
      "rating": 5,
      "date": "13th October 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Very personalisef and friendly.",
      "text": "Very personalisef and friendly. Thank You Lisa!",
      "rating": 5,
      "date": "9th October 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "People focussed!",
      "text": "Saffron have a great manner of customer service- people focused and approachable, professional and knowledgeable, clear responses and instructions if required. I spoke with lisa Howard today- wonderful! Listened well, professional and knowledgeable friendly- with a wealth of knowledge that was delivered in a totally non-patronising way. Lisa showed humour and interest in me as a customer and human! Poor lady- her ears are probably bleeding!!! Inspired trust and want her to be my new best friend! Thanks Saffron (Lisa!) x",
      "rating": 5,
      "date": "9th October 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Very satisfied customer!",
      "text": "I have always found Saffron staff very helpful in explaining the best mortgage for me as an ex-pat landlord seeking a buy-to-let mortgage.",
      "rating": 5,
      "date": "8th October 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Kim was clear and very helpful, I understand now wha...",
      "text": "Kim was clear and very helpful, I understand now what my options are.",
      "rating": 5,
      "date": "8th October 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Kim was extremely helpful and clear",
      "text": "Kim was extremely helpful and clear",
      "rating": 5,
      "date": "7th October 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Exceptional customer service by Anne !!",
      "text": "Anne has been truly outstanding. She exemplifies the kind of associate whose warmth, genuine care for customers, and willingness to go the extra mile—sometimes quite literally—bring a human touch that no robot could replicate. Her dedication and personal approach make a lasting impact and elevate the customer experience.",
      "rating": 5,
      "date": "3rd October 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Swift and efficient service",
      "text": "Request dealt with very quickly and efficiently. Excellent service.",
      "rating": 5,
      "date": "3rd October 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Mortgage Retention",
      "text": "We ported our mortgage to a new property and had Leon to help us through the process. The move wasn't straightforward and we had to extend the deadline twice due to sales falling through. Leon helped us through what was an extremely stressful time.",
      "rating": 5,
      "date": "2nd October 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Amazing service",
      "text": "Really happy with the service I would recommend them to friends",
      "rating": 5,
      "date": "2nd October 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Very pleasant, user friendly, helpful, considerate.",
      "text": "Very pleasant, user friendly, helpful, considerate. clear.",
      "rating": 5,
      "date": "2nd October 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "customer service",
      "text": "Overall efficient customer service",
      "rating": 5,
      "date": "2nd October 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "The colleague from customer service I spoke with was...",
      "text": "The colleague from customer service I spoke with was very helpful in addressing my query. Lisa, in particular, delivered exceptional customer service and went above and beyond.",
      "rating": 5,
      "date": "2nd October 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Was it very pleasant customer service experience,",
      "text": "Was it very pleasant customer service experience,",
      "rating": 5,
      "date": "2nd October 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Excellent support re mortgage .",
      "text": "Excellent support today redeeming the mortgage. Happy with service and value through the mortgage period. Very good customer service.",
      "rating": 5,
      "date": "1st October 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Excellent support with remortgage opportunity",
      "text": "Excellent support with remortgage opportunity",
      "rating": 5,
      "date": "1st October 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Today Rosanna was extremely helpful and informative...",
      "text": "Today Rosanna was extremely helpful and informative regarding the process moving forward should we wish to apply for an extension to our self build draw down. This has helped us in choosing the best option should we require an additional sum of money to complete the build to our standards. However, the process itself seems rather drawn out and extensive for such a minimal amount considering the LTV% but i appreciate each BS has differing processes.",
      "rating": 5,
      "date": "30th September 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Wonderful customer service with very helpful informa...",
      "text": "Wonderful customer service with very helpful information.",
      "rating": 5,
      "date": "29th September 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "The customer service is 2nd to none.",
      "text": "The customer service is 2nd to none. Ann at the mortgage was amazing when we needed help the most. we would recommend Saffron for self build mortgages.",
      "rating": 5,
      "date": "26th September 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Well done Saffron!",
      "text": "I have never had a bad experience in contacting Saffron. I particularly value the fact that calls are always answered promptly and that I can immediately speak to a “real” person. My conversation today with Anne was helpful and informative. She was patient and honest in trying to answer questions that were sometimes quite complicated. Where there was something she was unsure about, she explained where I could access more specific information. Thank you.",
      "rating": 5,
      "date": "25th September 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Customer service is always great.",
      "text": "Customer service is always great. Was Quick to get through no holding and easy to navigate and very informative with all the correct info given",
      "rating": 5,
      "date": "24th September 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Today's Call with Kim was Excellent.",
      "text": "Today's Call with Kim was Excellent. I received all information I needed for the product switch.",
      "rating": 5,
      "date": "22nd September 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Happy Customer !",
      "text": "It was nice to speak to the same person that I had received correspondence from several months ago, especially as I had been happy with the information that she had previously given me and knew that she provided good customer service",
      "rating": 4,
      "date": "21st September 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Excellent costumer service",
      "text": "Kim was very friendly and she gave an advice taking into account all of my concern",
      "rating": 5,
      "date": "19th September 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Self Build Mortgage",
      "text": "The product I needed was very niche. It wasn’t easy to apply, but once we had been accepted the product and service have been excellent. It has been easy to drawdown. The customer service also feels very personal..",
      "rating": 5,
      "date": "18th September 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Excellent service from Kim Willett.",
      "text": "I spoke with Kim Willett. The service was excellent and she walked me through the process answering my questions and providing all of the advice and guidance required.",
      "rating": 5,
      "date": "18th September 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "I spoke to Anne Sleeper today who provide an excelle...",
      "text": "I spoke to Anne Sleeper today who provide an excellent explanation of my overpayment options at the end of the current mortgage product. Anne also confirmed the options via email after the call ended.",
      "rating": 5,
      "date": "17th September 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Contact to amend email details.",
      "text": "Contact to amend email details. Anne was very helpful, polite and professional. Excellent communication and interpersonal skills. Thank you.",
      "rating": 5,
      "date": "17th September 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Customer Service not same as products",
      "text": "Your customer service and your products are two very different experiences. The lady I spoke with was clear, helpful, and professional. However, I wouldn’t recommend your products based on the outrageous rates",
      "rating": 5,
      "date": "17th September 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Pleasant polite and efficient",
      "text": "Lady i spoke to was pleasant and polite and handled my request efficiently",
      "rating": 5,
      "date": "17th September 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Always amazing service so helpful",
      "text": "Always amazing service so helpful",
      "rating": 5,
      "date": "17th September 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Kim was so helpful and patient",
      "text": "Kim was so helpful and patient with all my questions. She made everything easy to understand , what we need to do next, what our options are , the costs, everything. Amazing help to me and it meant alot that she was so kind and professional at what she does. Thank you",
      "rating": 5,
      "date": "12th September 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Saffron Building Society are great to deal with.",
      "text": "Saffron Building Society are great to deal with....I was previously with NatWest who where useless....",
      "rating": 5,
      "date": "11th September 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Fantastic company to deal with.",
      "text": "Fantastic company to deal with.......I was previously with NatWest....who where absolutely useless........Thank heavens I found Saffron Building Society.....",
      "rating": 5,
      "date": "11th September 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Helpful and friendly customer service.",
      "text": "Helpful and friendly customer service.",
      "rating": 5,
      "date": "11th September 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Anne Sleeper was especially helpful and speedy at re...",
      "text": "Anne Sleeper was especially helpful and speedy at resolving my issue. Thank you",
      "rating": 5,
      "date": "10th September 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "I receieved fab servics via the online chat and then...",
      "text": "I receieved fab servics via the online chat and then a call back from Kim in retentions who was brilliant.",
      "rating": 5,
      "date": "10th September 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Rates are high but customer service is second to none.",
      "text": "Rates are high but customer service is second to none. Staff are always obliging and happy to help and very friendly.",
      "rating": 3,
      "date": "9th September 2025",
      "product": "Product Switch Survey",
      "sentiment": "mixed"
    },
    {
      "title": "Kim in Mortgage Retention Team Really Helpful",
      "text": "Spoke to Kim in the Mortgage Retention Team, really helpful and patient, spoke through all available options and broke them down for me so it was easy to understand. Really friendly and provided great customer service.",
      "rating": 5,
      "date": "9th September 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Mortgage Retention Team Really Helpful",
      "text": "Spoke to Kim in the Mortgage Retention Team, really helpful and patient, spoke through all available options and broke them down for me so it was easy to understand. Really friendly and provided great customer service.",
      "rating": 5,
      "date": "9th September 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Spoke to Kim in the Mortgage Retention Team, really...",
      "text": "Spoke to Kim in the Mortgage Retention Team, really helpful and patient, spoke through all available options and broke them down for me so it was easy to understand. Really friendly and provided great customer service.",
      "rating": 5,
      "date": "9th September 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "I had a fantastic experience dealing with Lisa Howar...",
      "text": "I had a fantastic experience dealing with Lisa Howard today. She given accurate information and dealt my query swiftly in issuing redemption statement",
      "rating": 5,
      "date": "8th September 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Very professional and knowledgeable excellent service",
      "text": "Very professional and knowledgeable excellent service",
      "rating": 5,
      "date": "8th September 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "I couldn’t ask for more.",
      "text": "I couldn’t ask for more. Clear explanations regarding my options. Both Lisa’s were fast at replying to me and this has helped me to make a plan and do things the right way.",
      "rating": 5,
      "date": "8th September 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "End of fixed term",
      "text": "I spoke with Lisa who was friendly, informative and very helpful with my query. She was patient and explained everything in “layman’s terms” to me which was very reassuring",
      "rating": 5,
      "date": "8th September 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Customer service team was great each time i called.",
      "text": "Customer service team was great each time i called. Much better than any other banks i deal with. Anne was very helpful. I think your company and staff are great, its just a a shame you dont offer competitive rates. I did call your company before remortgaging but the rates were not so good. Overall a great experience with Saffron.",
      "rating": 5,
      "date": "5th September 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Very polite staff, made things very easy.",
      "text": "Very polite staff, made things very easy.",
      "rating": 5,
      "date": "5th September 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Very swift talk and concise chat.",
      "text": "Very swift talk and concise chat. Everything was clearly explained and questions answered.",
      "rating": 5,
      "date": "5th September 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Excellent",
      "text": "Excellent customer service,helpful , and very knowledgeable advice has been provided.",
      "rating": 5,
      "date": "5th September 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Wonderful customer service",
      "text": "Saffron Building Society has been excellent throughout my 19 years of mortgage. Consistently great customer service, nothing too much trouble (sort of wish I still had a mortgage the service has been that good). Mention for Lisa Howard today who was so nice about our momentous paying our mortgage in full xxx",
      "rating": 5,
      "date": "4th September 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Quick efficient and knowledgeable advice",
      "text": "Quick efficient and knowledgeable advice",
      "rating": 5,
      "date": "4th September 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Easy and efficient to get what I needed done",
      "text": "Easy and efficient to get what I needed done",
      "rating": 5,
      "date": "4th September 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Anne was very helpful.",
      "text": "Anne was very helpful. Dealt efficiently with my enquiry.",
      "rating": 5,
      "date": "4th September 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Good experience .",
      "text": "Good experience . Staff are friendly.",
      "rating": 5,
      "date": "3rd September 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Easy to connect to someone, not a robot/chatbox.",
      "text": "Easy to connect to someone, not a robot/chatbox. Very thorough and friendly.",
      "rating": 5,
      "date": "2nd September 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Really helpful and patient staff.",
      "text": "Really helpful and patient staff. Every time I’ve spoken with a customer service representative they have been friendly and supportive.",
      "rating": 5,
      "date": "2nd September 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Lisa Howard was friendly, professional, efficient an...",
      "text": "Lisa Howard was friendly, professional, efficient and knowledgeable. All questions were answered and the solution to my queries found.",
      "rating": 5,
      "date": "2nd September 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Lisa was supremely helpful and friendly and managed...",
      "text": "Lisa was supremely helpful and friendly and managed to help access my account with minimal fuss after I had forgotten some log in information.",
      "rating": 5,
      "date": "2nd September 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Kim was exceptional in providing all the information...",
      "text": "Kim was exceptional in providing all the information I needed.",
      "rating": 5,
      "date": "1st September 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Super Saffron // my call was answ...",
      "text": "Well, still amazed with how quickly my call was answered, may be two rings ,& I was talking to a real person,,And such a lovely well spoken & polite , well informed member of staff she was,,Much impressed with her ,so friendly& so willing to help,,My call was made 11.05 Mon 1st Sept…well done Saffron..Mr V Hooper..",
      "rating": 5,
      "date": "1st September 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "quick phone response.",
      "text": "quick phone response. asnwered question with 2 miutes",
      "rating": 5,
      "date": "29th August 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "The mortgage customer service team and u/writing tea...",
      "text": "The mortgage customer service team and u/writing teams have been simply superb - they have made our engagement stress free and simple - exactly the way I needed it to be - hats off to them - well done",
      "rating": 5,
      "date": "28th August 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Communicating and helpful",
      "text": "clear in communicating the steps and extremely helpful and supportive through out the self build process",
      "rating": 5,
      "date": "28th August 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Leon in the Retention department was very helpful, c...",
      "text": "Leon in the Retention department was very helpful, clear and informative.",
      "rating": 5,
      "date": "28th August 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Fantastic Customer Service.",
      "text": "Fantastic response, didn’t wait long. Amazing customer service.",
      "rating": 5,
      "date": "28th August 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Great Customer Service, Poor Rates & Retention Produ...",
      "text": "Great Customer Service, Poor Rates & Retention Products For Existing Customers",
      "rating": 5,
      "date": "28th August 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "They have been very informative and helpful.",
      "text": "They have been very informative and helpful. In particular Lisa Howard as my mortgage officer. Very responsive.",
      "rating": 5,
      "date": "27th August 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Lisa was the best adviser I have ever spoken to",
      "text": "Lisa was the best adviser I have ever spoken to at a bank/building society- she was kind, helpful and polite. WHAT A STAR.",
      "rating": 5,
      "date": "27th August 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Lisa was very helpful with my mortgage enquiry.",
      "text": "Lisa was very helpful with my mortgage enquiry. It’s always refreshing to deal with a company that still has good customer service.",
      "rating": 5,
      "date": "27th August 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Easy to contact, staff always helpful",
      "text": "Easy to contact, staff always helpful",
      "rating": 5,
      "date": "26th August 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Clear, concise and friendly",
      "text": "Lisa (and Kim previously) were both incredibly helpful and patient whilst describing my options. They were clear, concise and friendly. Got through to customer services quickly without having to speak to any robots",
      "rating": 5,
      "date": "26th August 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Very quick and efficient in answering queries and so...",
      "text": "Very quick and efficient in answering queries and sorting out issues.",
      "rating": 5,
      "date": "26th August 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Leon was very knowledgeable and easy to talk to",
      "text": "Leon was very knowledgeable and easy to talk to",
      "rating": 5,
      "date": "24th August 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Customer service is second to none.",
      "text": "Customer service is second to none. The interest rate seems to be a little higher than the market average",
      "rating": 5,
      "date": "23rd August 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "When the going gets tough - shout for the 'Sleeper'!",
      "text": "I haven't actually used Saffrons services as such, I tend to just make enquiries as a third-party on behalf of my elderly mums mortgage queries etc. I've answered the prelinary questions as well as I could though but I have to say the help I have received from Anne Sleeper has been second-to-none. Nothing ever seems to be too much trouble for her - she has even gone above and beyond (last year) to give me ideas of which organisations to try for a new boiler / new windows that my mum has desperately needed in order to keep her warm. It is the help from Anne alone that means I would recommend the services of Saffron to others, and gladly so. Front-line / customer service staff are so important to a company and Anne seems to be a very good Ambassador of Saffron BS. Thank you!",
      "rating": 5,
      "date": "22nd August 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Very fast, quick and straightforward",
      "text": "Very fast, quick and straightforward",
      "rating": 5,
      "date": "22nd August 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Always answer in a few seconds, responses always cle...",
      "text": "Always answer in a few seconds, responses always clear and polite",
      "rating": 5,
      "date": "22nd August 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Lisa Howard has been patient, kind and very supporti...",
      "text": "Lisa Howard has been patient, kind and very supportive during a challenging time, making what could have been quite a problem, into a smooth solution. Greatly appreciated.",
      "rating": 5,
      "date": "21st August 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Staff I spoke to seemed very professional in their a...",
      "text": "Staff I spoke to seemed very professional in their attitude.",
      "rating": 5,
      "date": "21st August 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Consistently Better Than Their Competitors",
      "text": "Always helpful, knowledgeable about their products, kind & personable.",
      "rating": 5,
      "date": "21st August 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Early repayment options",
      "text": "I had queries regarding early repayments which were answered in full.",
      "rating": 5,
      "date": "21st August 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Great service, a pleasure to deal with.",
      "text": "Great service, a pleasure to deal with.",
      "rating": 5,
      "date": "21st August 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Great service",
      "text": "Lisa was friendly and informative my call was answered quickly",
      "rating": 5,
      "date": "21st August 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Very efficient and friendly service.",
      "text": "Very efficient and friendly service.",
      "rating": 5,
      "date": "20th August 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "High service delivery",
      "text": "My query was dealt with in a professional manner",
      "rating": 5,
      "date": "20th August 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Perfect advisor for an introduction",
      "text": "Rosanna was a perfect advisor in the first instance. Spoke very eloquently, with clarity and I did not feel rushed and nothing was too difficult. The information that was required by me was not only clearly identified, but she advised when and at what stage I would require the data so I did not feel overwhelmed to correlate a folder of Statements instantly.",
      "rating": 5,
      "date": "19th August 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Helpful, friendly, professional",
      "text": "Lisa was very helpful, friendly, professional and authentic. She helped me very quickly and it was a pleasure talking to her.",
      "rating": 5,
      "date": "19th August 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Always really helpful whoever I speak to, make thing...",
      "text": "Always really helpful whoever I speak to, make things clear and straight forward and always get a resolution to any queries.",
      "rating": 5,
      "date": "18th August 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Extremely helpful, clear and personable",
      "text": "Extremely helpful, clear and personable",
      "rating": 5,
      "date": "18th August 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Very friendly, gave clear advice and helped me under...",
      "text": "Very friendly, gave clear advice and helped me understand the remortgage process",
      "rating": 5,
      "date": "14th August 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Very helpful phone call with Anne",
      "text": "Very helpful phone call with Anne",
      "rating": 5,
      "date": "14th August 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Self build finance review",
      "text": "Everyone was very pleasant to interact with throughout. The setup process for our self build finance was quite prolonged but in the end quite reasonable. The whole service team once we were up and running were excellent, helpful and responsive, particularly Lisa Howard.",
      "rating": 4,
      "date": "14th August 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "I am an overseas investor and can be challenging but...",
      "text": "I am an overseas investor and can be challenging but this building society is super helpful .",
      "rating": 5,
      "date": "14th August 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Really helpful as always, great df",
      "text": "Really helpful as always, great df",
      "rating": 5,
      "date": "14th August 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Wonderful personality who I spoke to , very helpful...",
      "text": "Wonderful personality who I spoke to , very helpful and considerate.",
      "rating": 5,
      "date": "14th August 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Simply great service",
      "text": "Kimberley Willett provided us with clear information, reassured us on the method of transferring products and gave us a time scale to transfer by. A great ambassador for your business",
      "rating": 5,
      "date": "13th August 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "So helpful. Nice to have a check in.",
      "text": "Mortgage repayment details sent in post were so high. We have been shopping around due to this. Kim rang today offering extra details and told me rates had decreased. She walked me through (first repayment so all new to us) it all and was so helpful. Reassured and offered support. Very helpful.",
      "rating": 5,
      "date": "13th August 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Excellent service delivery",
      "text": "My query was dealt with in a processional manner",
      "rating": 5,
      "date": "13th August 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Excellent Service!",
      "text": "Super friendly and efficient support and help with renewing our mortgage.",
      "rating": 5,
      "date": "12th August 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Super friendly efficient service.",
      "text": "Super friendly efficient service. We needed to renew our mortgage and were helped quickly.",
      "rating": 5,
      "date": "12th August 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Such lovely friendly and very efficient service when...",
      "text": "Such lovely friendly and very efficient service when renewing our mortgage.",
      "rating": 5,
      "date": "12th August 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Leon was very helpful and prompt in response to my e...",
      "text": "Leon was very helpful and prompt in response to my enquiry",
      "rating": 5,
      "date": "11th August 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Great customer service.",
      "text": "Great customer service. Always polite and friendly and always very personable and professional.",
      "rating": 5,
      "date": "11th August 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "The staff has been very helpful everytime I’ve called",
      "text": "The staff has been very helpful everytime I’ve called",
      "rating": 5,
      "date": "11th August 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Truly outstanding",
      "text": "I cannot recommend Saffron highly enough. Every team member I’ve interacted with across various departments has been consistently friendly and efficient; however my recent experience with Lisa was exceptional. She went above and beyond to help with my complex situation, and her expertise, care and professionalism resulted in an outcome that far exceeded my expectations. Fantastic service!",
      "rating": 5,
      "date": "9th August 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Kimberley wallet was excellent and so informative an...",
      "text": "Kimberley wallet was excellent and so informative and friendly. Wonderful experience!",
      "rating": 5,
      "date": "8th August 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Very helpful lady that I spoke to and I got the answ...",
      "text": "Very helpful lady that I spoke to and I got the answers I needed for my call. Thank you Kim",
      "rating": 5,
      "date": "8th August 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Superb service through the whole process.",
      "text": "Leon Walker. His help and communication was exceptional. Precise . Straightforward. Responsive.The experience made me feel I was his only client.Polite and Professional.Made the whole process enjoyable.Well done to him.",
      "rating": 5,
      "date": "7th August 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Very friendly, informative, and knowledgeable",
      "text": "Very friendly, informative, and knowledgeable",
      "rating": 5,
      "date": "7th August 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Everyone that we spoke with has been extremely helpful.",
      "text": "Everyone that we spoke with has been extremely helpful.",
      "rating": 4,
      "date": "4th August 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "A lady called Kim dealt with my enquiry very efficie...",
      "text": "A lady called Kim dealt with my enquiry very efficiently.",
      "rating": 5,
      "date": "4th August 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "They are very approachable, and 'normal\" in a world...",
      "text": "They are very approachable, and 'normal\" in a world of complicated company speak.. . I will be moving all my properties to Saffrons. I find them very straightforward",
      "rating": 5,
      "date": "1st August 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Kim Willett was fantastic!",
      "text": "Kim Willett was fantastic! It’s so lovely and reassuring to speak with someone who is truly helpful. Kim answered all my questions and made the process simple & stress free!",
      "rating": 5,
      "date": "31st July 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "No issues and very easy.",
      "text": "No issues and very easy. And quick to answer the phone",
      "rating": 5,
      "date": "30th July 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Kim Willett most helpful on this occasions.",
      "text": "Kim Willett most helpful on this occasions. Would prefer to see more mortgage products without redemption penalties. Our original application process, some while back now, was extremely long winded and tedious.",
      "rating": 5,
      "date": "30th July 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "The person on the phone was polite and helpful and c...",
      "text": "The person on the phone was polite and helpful and clear - I'm only sorry I didn't get her name.",
      "rating": 5,
      "date": "28th July 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Positive experience all around",
      "text": "I had an extremely pleasant and constructive experience with Lisa Howard this morning. I found her to be understanding and get we got to the root cause efficiently.",
      "rating": 5,
      "date": "28th July 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Really simple and positive customer experience.",
      "text": "Really simple and positive customer experience. None of the endless hoops jumping through with the big banks. Got what I needed quickly. Thanks for the help Saffron.",
      "rating": 5,
      "date": "24th July 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Great and engaging customer service and connected th...",
      "text": "Great and engaging customer service and connected through very fast",
      "rating": 5,
      "date": "24th July 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "The staff in the Retentions Team are very professional",
      "text": "The staff in the Retentions Team are very professional and do what they can to ensure the customer is provided with the best mortgage terms possible.",
      "rating": 5,
      "date": "23rd July 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Helpful, supportive and professional",
      "text": "I spoke to Lisa who was incredibly helpful, supportive and professional. A credit to the company.",
      "rating": 5,
      "date": "23rd July 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Helen was brilliant on the phone, understood me and...",
      "text": "Helen was brilliant on the phone, understood me and my circumstances and helped in the right way, brilliant.",
      "rating": 5,
      "date": "22nd July 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Communication clear and accurate",
      "text": "Communication clear and accurate",
      "rating": 5,
      "date": "21st July 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Always easy to talk to, provides information correct...",
      "text": "Always easy to talk to, provides information correctly and efficiently. 1 minute call and I had all I needed.",
      "rating": 5,
      "date": "18th July 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Enquiry on additional funding",
      "text": "Kim walked me through the process for additional funds and did some checks on affordability so I understood the amount that could be looked at for additional funds. She was very professional, helpful and knowledgeable",
      "rating": 5,
      "date": "16th July 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "lisa is lovely.",
      "text": "lisa is lovely. very helpful. informative",
      "rating": 5,
      "date": "16th July 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Polite and friendly customer service",
      "text": "Polite and friendly customer service",
      "rating": 5,
      "date": "15th July 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Professional and knowledgeable service provided",
      "text": "Lisa was very professional and knowledgeable. I appreciate her sending an email to confirm the conversation.",
      "rating": 5,
      "date": "14th July 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "My pre mortgage application including porting my pre...",
      "text": "My pre mortgage application including porting my previous mortgage included my proposal at age 77 of increasing my new mortgage to £100,000 over ten years plus planned deposit(safe) savings enabled my wife and I to gift money to our daughter to buy a house for cash and gift money to our son and family for them to have a large extension built for cash. Over the first three years of this mortgage we have felt comfortable to reduce our Saffron mortgage by the allowable 10% each year without penalty. The part one of our mortgage originally belonged to a staff mortgage I took out with the Bradford and Bingley in 1981 so part 1 has been going for 44 years. Anne Sleeper as has all of her colleagues I have dealt with from mortgage application to every administrative call have made, have dealt with me in an extremely efficient way. I send my thanks to Anne and her colleagues.",
      "rating": 5,
      "date": "11th July 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Kim was really helpful!",
      "text": "Kim was really helpful! She was able to clarify any questions I had. Thanks again Kim",
      "rating": 5,
      "date": "11th July 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Lisa was incredible.",
      "text": "Lisa was incredible. Assisted with me with an account lockout. She was friendly, polite, sympathetic and very patient whilst she held on the phone call whilst I got logged in. Was a great touch and now I can manage my account online. Thanks Lisa",
      "rating": 5,
      "date": "9th July 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Amazing customer service",
      "text": "I couldn’t have asked for a more friendly and helpful advisor than Anne. She answered all my questions and I am extremely happy with the customer service provided",
      "rating": 5,
      "date": "9th July 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Well done and thank you to all the team.",
      "text": "I have had a mortgage with Saffron since 2021, all staff have been extremely helpful , pleasant and given time so I haven't felt rushed. Well done and thank you to all the team",
      "rating": 5,
      "date": "9th July 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Leon was excellent friendly supportive and quick",
      "text": "Leon was excellent friendly supportive quick and efficient and knowledgable. Mortgage rates on offer are 2% higher than others.",
      "rating": 5,
      "date": "8th July 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Thank you Rosanna",
      "text": "I contacted saffron on 7/7/25 and spoke to a lovely lady named Rosanna, she helped me woth my query and got me a new fixed mortgage rate within 10 minutes, i am genuinely surprised and happy with the level of service given on sich short notice, once again thank you team and especially Rosanna",
      "rating": 5,
      "date": "8th July 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "The service given was very informative",
      "text": "The service given was very informative",
      "rating": 4,
      "date": "8th July 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Helpful staff",
      "text": "Great reliable service and helpful",
      "rating": 5,
      "date": "7th July 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Reliable",
      "text": "Always helpful and deliver a good service",
      "rating": 5,
      "date": "7th July 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Customer Service",
      "text": "Excellent customer service, prompt reply to all quires",
      "rating": 5,
      "date": "7th July 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Mortgage Renewal",
      "text": "Good customer service, early warning about switch options.",
      "rating": 5,
      "date": "7th July 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Superb Customer Service",
      "text": "We had a buy-to-let mortgage with Saffron from 2019 - 2024 and their service is exemplary. Always happy to help and assist with queries, they are easy to deal with, responsive, friendly and professional.",
      "rating": 5,
      "date": "3rd July 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "The customer service department was really good",
      "text": "The customer service department was really good",
      "rating": 5,
      "date": "2nd July 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Beautiful Service",
      "text": "The service provided has always been very accessible and accommodating in time constraints and with the stress of financial matters. Extremely happy with Saffron as a mortgage provider and definitely a recommendation from myself to others.",
      "rating": 5,
      "date": "2nd July 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "One of the best Building Societys I have ever used.",
      "text": "One of the best Building Societys I have ever used. Sadly you were not able to extend my mortgage for a further two years for some company rule, so went straight back to my bank who re mortgaged straight away.",
      "rating": 5,
      "date": "1st July 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Anne Sleeper was very professional and pleasure to d...",
      "text": "Anne Sleeper was very professional and pleasure to deal with.",
      "rating": 5,
      "date": "27th June 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Saffron Building Society Mortgage",
      "text": "I’ve had a deeply disappointing experience with Saffron Building Society’s mortgage. Their interest rates have consistently remained far above market conditions, even during periods when most lenders were offering relief. As a result, I’ve lost a significant amount of money and faced prolonged financial strain. What’s been most distressing is the lack of flexibility or fairness in their pricing—rates that feel extortionate in comparison to the broader market left us feeling trapped and anxious about our financial future. This experience has caused real emotional and financial distress for our household, and I wouldn’t recommend their mortgage products to anyone seeking stability or support from their lender.",
      "rating": 3,
      "date": "27th June 2025",
      "product": "Product Switch Survey",
      "sentiment": "mixed"
    },
    {
      "title": "Mortgage Review",
      "text": "Proactive and clear recommendations when moving from self-build to a residential mortgage product.",
      "rating": 5,
      "date": "25th June 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Rosanna was very helpful",
      "text": "Rosanna is a knowledgeable advisor and helped provide the initial information I needed to make a decision soon",
      "rating": 5,
      "date": "24th June 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Very good and clear.",
      "text": "Very good and clear. Very helpful",
      "rating": 5,
      "date": "23rd June 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Good every time I’ve spoken with someone",
      "text": "Good every time I’ve spoken with someone",
      "rating": 5,
      "date": "23rd June 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Very helpful, took time to explain everything and qu...",
      "text": "Very helpful, took time to explain everything and quick service.",
      "rating": 5,
      "date": "23rd June 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Excellent customer service, helpfull and answered al...",
      "text": "Excellent customer service, helpfull and answered all the relevant questions",
      "rating": 5,
      "date": "21st June 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Very efficient, informative call that met my require...",
      "text": "Very efficient, informative call that met my requirements.",
      "rating": 4,
      "date": "20th June 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Mortgage query",
      "text": "My query was professionally dealt with",
      "rating": 5,
      "date": "20th June 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Professional customer service",
      "text": "Professional customer service - i.e clear and knowledgable",
      "rating": 5,
      "date": "18th June 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "I have been with the bank over 5 years and they had...",
      "text": "I have been with the bank over 5 years and they had the wrong email address for me.",
      "rating": 5,
      "date": "16th June 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "The lady I communicated with was both informative an...",
      "text": "The lady I communicated with was both informative and precise.",
      "rating": 5,
      "date": "16th June 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Staff member knowledglable and patient",
      "text": "Staff member knowledglable and patient",
      "rating": 5,
      "date": "16th June 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Lisa was incredibly knowledgeable and attentive, gui...",
      "text": "Lisa was incredibly knowledgeable and attentive, guiding me patiently through my myriad mortgage queries with clear explanations and insightful advice. Her expertise made the complex process feel much more manageable, and I truly appreciated her support every step of the way.",
      "rating": 5,
      "date": "16th June 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Easy and friendly would recommend",
      "text": "Easy and friendly would recommend",
      "rating": 5,
      "date": "13th June 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    },
    {
      "title": "Great advice from knowledgeable team",
      "text": "Kim gave me great advice on my options for updating my mortgage. Explained the everything clearly to allow me to make my own decision. Overall a great service.",
      "rating": 5,
      "date": "13th June 2025",
      "product": "Product Switch Survey",
      "sentiment": "positive"
    }
  ]
}