{
  "society": "Scottish Building Society",
  "slug": "scottish-building-society",
  "smpUrl": "https://smartmoneypeople.com/scottish-building-society-reviews/products",
  "totalReviewsOnSMP": 3452,
  "avgRating": 4.6,
  "scrapedAt": "2026-02-06T16:06:26.112844+00:00",
  "reviews": [
    {
      "title": "Great Service",
      "text": "The Customer Service Team are very efficient, friendly and do everything they can to make things pleasant and easy.",
      "rating": 5,
      "date": "24th December 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Approachable, Friendly, Professional",
      "text": "Extremely approachable, good range of products, specialists in Scottish lending.",
      "rating": 5,
      "date": "27th October 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Efficient and helpful",
      "text": "Excellent mortgage advisor in Kay. Very helpful, efficient and patient. Process worked very smoothly for me in spite of some difficulties with house buying over the last 9 months.",
      "rating": 5,
      "date": "17th October 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "In branch service review",
      "text": "I haven't actually spoken to anyone from SBS. I had my mortgage renewed though a broker and SBS were the best value for Money.",
      "rating": 5,
      "date": "17th October 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Easy and Helpful",
      "text": "Customer service is very fast to reply and very helpful.",
      "rating": 5,
      "date": "3rd October 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Small is beautiful",
      "text": "Katie dealt with my query promptly and efficiently - such a pleasure after some of my recent calls to other businesses’ so-called ‘customer services’. What a difference, query sorted in full and no sense of frustration!",
      "rating": 5,
      "date": "11th September 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Incredibly helpful and quick customer service team.",
      "text": "Incredibly helpful and quick customer service team. Spoke to Erin who was fantastic and got my query regarding mortgage overpayments sorted in",
      "rating": 5,
      "date": "5th September 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Efficient, Reliable, Helpful",
      "text": "I dealt with Jill, Mortgages advisor in Edinburgh and the service and received from her was outstanding. The service in Glasgow today for transfer of funds re house purchase was also very good.",
      "rating": 5,
      "date": "22nd August 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "I needed assistance regarding title deeds and Katie...",
      "text": "I needed assistance regarding title deeds and Katie has taken the relevant details to pass onto the relevant department in order to give me an appropriate answer to my query as it cannot be answered immediately.",
      "rating": 5,
      "date": "30th July 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "good experience easy to deal woth",
      "text": "good experience easy to deal woth",
      "rating": 5,
      "date": "20th July 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great customer service",
      "text": "Great customer service,good to know older people can get a mortgage",
      "rating": 5,
      "date": "18th July 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Smooth process and positive experience",
      "text": "Very smooth process, liked the fact this was a mutual society and a historical presence in the mortgage market. Staff were very helpful, I had to call for some advice and found they answered the phone quickly, had the answer I needed and were very easy to communicate with, that's a big positive for me.",
      "rating": 5,
      "date": "18th July 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "It was a limited experience through a mortgage broke...",
      "text": "It was a limited experience through a mortgage broker but one which was completed quickly and efficiently.",
      "rating": 4,
      "date": "17th July 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "My mortgage was easily and quickly arranged.",
      "text": "My mortgage was easily and quickly arranged.",
      "rating": 5,
      "date": "16th July 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "They were always very helpful when I needed help",
      "text": "They were always very helpful when I needed help or advice regarding our mortgage and were surprisingly quick at replying to emails.",
      "rating": 5,
      "date": "15th July 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "A very positive experience",
      "text": "A very positive experience in setting up then extending a mortgage with my daughter for her flat, Scottish Building Society mortgage advisors from the outset were very straightforward to communicate with. Have been a few hiccups in the process but their team have been consistently helpful & approachable .",
      "rating": 5,
      "date": "24th June 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent Service a",
      "text": "I had an excellent service and no complaints whatsoever.",
      "rating": 5,
      "date": "20th May 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Remortgage process was smooth.",
      "text": "Remortgage process was smooth. All OK, thank you",
      "rating": 5,
      "date": "15th May 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Everything went smoothly with the mortgage, app wor...",
      "text": "Everything went smoothly with the mortgage, app works well and cus69mwr advisors were polite and knowledgeable.",
      "rating": 4,
      "date": "15th May 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Good experience",
      "text": "Overall a good experience, but took quite a long time to give a decision",
      "rating": 4,
      "date": "15th May 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Overall a good experience",
      "text": "Speed of loan approval could be improved though I think this is symptomatic of the industry/process as a whole, not just Scottish Building Society",
      "rating": 4,
      "date": "29th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "A mortgage provider that has a friendly, human touch!",
      "text": "As first time buyers, we found Scottish Building Society made the whole process of getting our mortgage simple, efficient and friendly. They definitely have the human touch over other mortgage providers and our broker, who has vast experience in the industry, assured us we'd be in good hands with Scottish.",
      "rating": 5,
      "date": "26th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Super friendly and helpful!",
      "text": "Recently took out a mortgage with SBS as a first time buyer & the staff I've spoken to have been super friendly and always eager to help in any way that they can which has been great!",
      "rating": 5,
      "date": "25th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "The whole experience was smooth throughout and I was...",
      "text": "The whole experience was smooth throughout and I was kept informed of the progress without having to ask for updates.",
      "rating": 5,
      "date": "24th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "I've had my mortgage with the Scottish Building Soci...",
      "text": "I've had my mortgage with the Scottish Building Society for a number of years. Everything has gone so smoothly. On the one occasion I needed to contact them, to arrange an overpayment, their customer service was brilliant.",
      "rating": 5,
      "date": "4th March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "I just like them and I felt the need to say it.",
      "text": "I just like them and I felt the need to say it. I like how I'm not trying to tell a robot what I am calling about. I like the wait times when I call usually less than 30 seconds. I like how simple it is to renew my mortgage on to a new deal when my current one expires. Some of the advisors speak Scottish so there can be a bit of a language barrier but other than that friendly, quick and just really good.",
      "rating": 5,
      "date": "3rd February 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Efficient and stress-free",
      "text": "Fast and efficient service and would recommend to anyone.",
      "rating": 5,
      "date": "22nd January 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Clearer Information Please",
      "text": "Generally fine however it would have saved some confusion if in the mass of paperwork there was a summary sheet stating the amount the fee how the fee would be paid and explanation that the first payment is for the first two months and when it would be taken. All this information was obtained but only by contacting the Building Society and speaking to a helpful representative",
      "rating": 4,
      "date": "22nd January 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "So grateful for this company",
      "text": "We applied at the wrong time of year really, but this is the only company willing to look at us for us, and not just a tick box. Extremely grateful to SBS for everything",
      "rating": 5,
      "date": "20th January 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Old school service but in the best way.",
      "text": "Old school service but in the best way. Personal touch and friendly customer service.",
      "rating": 5,
      "date": "28th December 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Outstanding SBS mortgage service.",
      "text": "Both Jackie Simpson Lending Manager and Kay Baird Mortgage Adviser were both exemplary in the comprehensive, informative and thoroughly professional manner in which they carried out their work in relation to switching mortgage products at SBS. Their calculated, flexible approach in treating applicants individually was most accommodating and tremendously refreshing in today's predominantly technical decision making age. Top marks indeed to two extremely capable SBS personnel. I would highly and unreservedly recommend their quality service.",
      "rating": 5,
      "date": "2nd December 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Lifetime Mortgagr",
      "text": "Very efficient and speedy response when obtaining a lifetime mortgage",
      "rating": 4,
      "date": "14th November 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Breath of fresh air putting customers first",
      "text": "The customer experience I have had at Scottish Building Society it that you get the personal touch it feels much more customer focused and one on one not that you are just a number. It's a breath of fresh air.",
      "rating": 5,
      "date": "27th October 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Retirement mortgage",
      "text": "Arranged our retirement mortgage, yes there was a lot of paperwork required, but found them extremely flexible and helpful. Would strongly recommend them if you are after a similar product",
      "rating": 5,
      "date": "17th October 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "SBS offered the specialises Guarantor Mortgage produ...",
      "text": "SBS offered the specialises Guarantor Mortgage product that we required. The application was very thorough, verging at times on painstaking and it was carried out within a tight timescale allowing toe property to be purchased in time for the start of the University term. The communication between SBS and our financial adviser Claudia Kydd at Orchard Independent was highly professional extremely prompt and very helpful",
      "rating": 4,
      "date": "20th September 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Reviewer",
      "text": "The review of my documents was slow and over cautious",
      "rating": 4,
      "date": "6th September 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Reliable and Reassuring",
      "text": "Scottish Building Society were very fast in replying to any questions or queries I had and happy to change minor details for me, which was very reassuring and put my mind at ease during a busy and stressful time buying my first home.",
      "rating": 5,
      "date": "6th September 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Overall straightforward and clear, no suprises",
      "text": "Overall straightforward and clear, no suprises",
      "rating": 5,
      "date": "29th August 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Self Build Mortgage - great product and service",
      "text": "Self Build Mortgage - great product and service",
      "rating": 5,
      "date": "29th August 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "First Class",
      "text": "From start to completion this we thought was an excellent service. All communication either by phone or post was first class.",
      "rating": 5,
      "date": "27th August 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Home remortgaged",
      "text": "this was the best way to take money from our house with a mortgage.we pay monthly interest & our house doesnt decrease in value",
      "rating": 5,
      "date": "23rd August 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Speedy communication, thoroughness of approach and a...",
      "text": "Speedy communication, thoroughness of approach and asssesment, coupled with reliability and transparency make SBS an excellent Company to deal with. Hats off especially to Lesley in their Inverness branch. Thoroughly recommend..",
      "rating": 5,
      "date": "15th August 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Easy and stress free",
      "text": "Easy to speak to and not difficult, only issue is that a product fee was due was informed this could be added to the loan amount but it was not but this was not communicated to me at the start, had to pay it myself which was no issue but then I was not given details on how to do this so ended up having to ring which was a little time consuming",
      "rating": 5,
      "date": "7th August 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very easy to deal with",
      "text": "First time I had dealt with the Scottish Building Society and everything went so smooth with no hassle at all. Anytime I had to phone them the staff were very friendly and helpful.",
      "rating": 5,
      "date": "2nd August 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "From start to completion we were very pleased with t...",
      "text": "From start to completion we were very pleased with the service received, it was quick and easy and we were sent all documentation which answered any questions we had. we would definitely recommend Scottish Building Society.",
      "rating": 5,
      "date": "26th July 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "SBS experience",
      "text": "Only one snag along the way but the whole process was really good and went very smoothly. Going with SBS was a good decision and I would definitely recommend their services to anyone in a similar position.",
      "rating": 5,
      "date": "22nd July 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Best rate available,honoured the initial interest ra...",
      "text": "Best rate available,honoured the initial interest rate after rates rises",
      "rating": 4,
      "date": "9th July 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Simple and relatively quick.",
      "text": "Simple and relatively quick. Got us sorted easy enough, and interest rate was okay.",
      "rating": 4,
      "date": "5th July 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Information clear with excellent explanations.",
      "text": "Information clear with excellent explanations. Helpful staff, very easy to deal with and very quick service.",
      "rating": 5,
      "date": "28th June 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "New customer very friendly & efficient",
      "text": "New customer very friendly & efficient",
      "rating": 5,
      "date": "27th June 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Highly recommend",
      "text": "Everything went well with our remortgage and we appreciate that SB honoured the original offer while we had to wait for my EU settlement status",
      "rating": 5,
      "date": "26th June 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "very satisfied customers",
      "text": "We used a Mortgage Broker to apply for our mortgage so did not deal directly with SBS, however, both our Mortgage Broker and Solicitor could not praise SBS highly enough. SBS responded very quickly to queries at critical points in our purchase. We were able to find a mortgage product that suited our needs perfectly at a good rate. The welcome phone call from customer service to welcome us as new customers is something we have not had before and were pleasantly surprised. We are very satisfied customers.",
      "rating": 5,
      "date": "25th June 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Professional, helpful, friendly",
      "text": "Excellent service provided. Clear communication and explanation in a professional, friendly and non-patronising way.",
      "rating": 5,
      "date": "12th June 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "there were difficulties in the initial processes",
      "text": "there were difficulties in the initial processes in communication. This caused unnecessary delays which could have been avoided there seemed to be so many people involved in the decision making process at SBS end of the arrangement.",
      "rating": 4,
      "date": "10th June 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "The application process is very outdated",
      "text": "The application process is very outdated and of a legacy nature. Everything seems to be done via post with no modern online elements like other lenders. The process to sign documents and setup direct debit has too many opportunities for error and mistakes. The communications were okay in terms of providing important information though. Theres also no way to track mortgage payments or balances via an app or through online banking which in 2024 is difficult to accept.",
      "rating": 2,
      "date": "10th June 2024",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "Quick response to our enquiry",
      "text": "Basically we had a quick response to our enquiry so we were able to proceed with the application. Scottish BS was the only financial institution that considered us for a remortgage.",
      "rating": 5,
      "date": "7th June 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Was a great experience for buying our first home wou...",
      "text": "Was a great experience for buying our first home would of liked to receive a bigger loan to have left a bit of wiggle room to do up the new home with money I used for deposit but I get that it was based off my current wage so don’t hold a grudge about it",
      "rating": 5,
      "date": "7th June 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent service",
      "text": "Very easy and quick to deal with",
      "rating": 5,
      "date": "6th June 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Responded quickly, went through mortgage advisor, cl...",
      "text": "Responded quickly, went through mortgage advisor, clear documentation",
      "rating": 5,
      "date": "28th May 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "I dealt mainly with Kay Baird in your Glasgow office...",
      "text": "I dealt mainly with Kay Baird in your Glasgow office who has been courteous helpful and professional at all times.rs",
      "rating": 5,
      "date": "14th May 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "It's fair to say I've a fairly complex income(4 priv...",
      "text": "It's fair to say I've a fairly complex income(4 private employers and a mix of short and long contracts which end regularly.) However nowadays, this isn't totally outwith modern ways of working. In terms of risk- I had a large deposit, 17yrs of proven sustainable income from the same industry, excellent credit rating and a mortgage already in place but I was saddened to see many banks still apply such a rigid underwriting process for their mortgages. My broker was advised by some larger lenders to not even bother applying and I was offered borrowing that really was no where near in proportion to my salary. 7 weeks later, my broker suggested The Scottish Building Society. We required a lender who gave consideration to my individual circumstances, focused on the facts I'd given with my work vs asking what ifs and were able to show us flexibility ( for example I had a new contract but I'd been same job for 17yrs. My contracts may end but again, the industry is children so the nature of the work won't end.) The Scottish Building Society applied common sense with the application and demonstrated a straight forward,personalised approach to their lending. They worked efficiently , always meeting their deadlines they gave us and provided me with a better interest rate. I've also preferred their communication method through mail or phone- I've found it more refreshing than speaking to an online chat. I'd highly recommend The Scottish Building Society for their underwriting process, interest rate and communication and would always return to them in future before trying any larger bank.",
      "rating": 5,
      "date": "2nd May 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Straightforward and implement to deal with",
      "text": "Good exerience. Simple to contact with a human being on the phone.",
      "rating": 5,
      "date": "9th April 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very friendly service",
      "text": "Overall, my experience was very positive. However, the process was held up by uncertainty around a particular detail. This meant an inconvenient delay to the mortgage. This was a pity as, apart from the delay, I have very much appreciated becoming a member of the Scottish Building Society and its friendly service.",
      "rating": 4,
      "date": "27th March 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "The process was very easy, staff were excellent and...",
      "text": "The process was very easy, staff were excellent and made us feel secure. Providing us with a mortgage has helped us get back to home ownership, something we wondered after a long period in the rental sector, would ever be possible again.",
      "rating": 5,
      "date": "11th March 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent Customer Service",
      "text": "Spoke to Peter today re overpaying my mortgage. He could not have been more helpful. Patient and very clear explanation. Made everything very straightforward. Outstanding customer service. Thank you",
      "rating": 5,
      "date": "5th March 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Mortgage Redemption Procedure",
      "text": "Within 2 hours of seeking a redemption arrangement the necessary paperwork was in my possession. Furthermore there was only one phone call ! If there was to be a criticism it would be that the early redemption fee of over £2000 seemed excessive",
      "rating": 5,
      "date": "16th February 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Friendly and helpful.",
      "text": "Friendly and helpful. Very prompt in terms of communication. Clarity of information. Contact details easy to follow. Will have no problem if I have any issues.",
      "rating": 5,
      "date": "13th February 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "SBS were efficient and communicative",
      "text": "SBS were efficient and communicated regular on the progress of my mortgage. Whilst I was waiting for the purchase of my house to go through, the mortgage rate dropped so SBS issued another mortgage offer with a lower rate and a longer term without me having to ask. The new Mortgage Offer documents arrived promptly, quick I sign the same day and returned. All sorted within 5 days ready for completion of my house. It's easy too deal with SBS and they have a customer contact number which is based in Scotland. This too me is very important that it's in the UK and not a call centre abroad.",
      "rating": 5,
      "date": "8th February 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "very good experiance,nice pople.",
      "text": "very good experiance,nice pople. i like it",
      "rating": 5,
      "date": "20th January 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great customer service, staff were very friendly and...",
      "text": "Great customer service, staff were very friendly and helpful.",
      "rating": 5,
      "date": "8th January 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great Society",
      "text": "I used a broker but was copied into the conversation. Very helpful and dealing with a human rather than a computer was great. They went over and above for us.",
      "rating": 5,
      "date": "5th January 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Overall had a good experience, however the wait time...",
      "text": "Overall had a good experience, however the wait time to find out if my application had been approved was too long. Think overall I was left waiting around 3 weeks",
      "rating": 4,
      "date": "5th January 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Later life lending",
      "text": "Delighted with common sense approach and flexibility, prompt and personable underwriting, hands on BDM and excellent communication throughtout process.",
      "rating": 5,
      "date": "28th December 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Retirement Remortgage",
      "text": "Most impressive service from Alex Moffat and his colleagues, professional, friendly and seamless process ,provided our remortgage on a tight timescale.",
      "rating": 5,
      "date": "5th December 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "easy and efficient",
      "text": "Getting a mortgage with SBS was easy and efficient",
      "rating": 5,
      "date": "5th December 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent from start to finish",
      "text": "Didn't have to speak to SBS much during the process but when I did need to they were always available and very quick to respond. Very helpful throughout the process and always happy to explore any further options I was considering. Excellent in general.",
      "rating": 5,
      "date": "5th December 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Seamless experience",
      "text": "Thank you SBS for enabling me to buy my first property! My experience dealing with SBS has always been professional, efficient and hassle free. Thanks again!",
      "rating": 5,
      "date": "24th November 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent customer service",
      "text": "This is my first mortgage with Scottish Building Society and I have been enormously impressed by their professionalism, combining a friendly and respectful manner while also being adept at tuning in to individual requirements.",
      "rating": 5,
      "date": "19th November 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Scottish Building Society Branch Review",
      "text": "I like their practicality, and their solutions that are client centred.",
      "rating": 5,
      "date": "16th November 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Good.",
      "text": "Straight forward. Fill in forms. Done.",
      "rating": 5,
      "date": "14th November 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent customer service.",
      "text": "Once our mortgage advisor had put us in touch with Scottish Building Society everything went smoothly.",
      "rating": 5,
      "date": "9th November 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "got there",
      "text": "always knew the fall back was borrowing against the house",
      "rating": 4,
      "date": "8th November 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very slow decision but may be financial advisors fault",
      "text": "Took over 4 months to get mortgage approved but in fairness might have been due to our utterly hopeless financial advisor",
      "rating": 3,
      "date": "7th November 2023",
      "product": "Mortgages",
      "sentiment": "mixed"
    },
    {
      "title": "patient and sympathetic",
      "text": "I wanted to remortgage my house to free up money to help my son to buy a house in London. I am 72 and The Scottish Building Society was the only one to offer a loan. During the process of arranging the loan my doctor told me I probably had cancer. I then thought I would be better to sell my house and move close to my other son, about an hour away. I put a hold on the mortgage. However winter was approaching and I was advised not to market the house until next year. I then asked to have the mortgage process restarted. By this time I was very close to losing the loan due to its time limit. My broker in discussion with SBS was able to get a short extension to the time limit which enabled the mortgage to go through. The Scottish Building Society showed sympathy and understanding.",
      "rating": 5,
      "date": "15th October 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "It was ok",
      "text": "Hated the fact I had to install an app on my phone and answer a ton of questions, the answers already been provided.",
      "rating": 3,
      "date": "13th October 2023",
      "product": "Mortgages",
      "sentiment": "mixed"
    },
    {
      "title": "Free legals cost £1200!",
      "text": "SBS offered mortgages to older people so we were interested. We asked for less than 40% LTV. They asked for an exhausting amount of extra financial info, including about two other investment houses we own. Once started, SBS were surprised to learn that we lived in England despite having had that info for months. As a result they changed the free legals to a £250 contribution to our English legals, which were £650. Once in process they insisted on a further legal form which had to be administered by a lawyer, costing a further £600. Mortgage completed 5 months after initiation at a net legal cost of £1000. Very stressful.",
      "rating": 2,
      "date": "11th October 2023",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "Satisfaction Guaranteed",
      "text": "Would recommend your company to any friends looking for your type of services and question that you may have are answered in a language you understand ( no jargon) Thank you customer advisors You are a credit to your company",
      "rating": 5,
      "date": "11th October 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Remortgaged to a RIO",
      "text": "Scotttish Building Society were professional and friendly",
      "rating": 5,
      "date": "12th September 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Contact",
      "text": "Great when I phoned myself, efficient and helpful",
      "rating": 4,
      "date": "11th September 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Happy with service",
      "text": "I was happy with the service though the period and demands needed before the mortgage was offered took quite a long time! I understand the need for security so accepted the need for documents etc.",
      "rating": 4,
      "date": "8th September 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Smooth Transition",
      "text": "Very smooth transition from one mortgage lender to another. No unnecessary communication, everything was kept to the point and informative. We appreciated the follow up phone call to welcome us to the society and ask how the re-mortgage went.",
      "rating": 5,
      "date": "8th September 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "First Time Buyer experience",
      "text": "Lender was quick to issue AIP and clearly set out and explained Documents required to progress . This was done at a reasonable pace and Offer Issued not too long after . This is a local Scottish based Lender I was happy to use and they gave the impression they were helpful and customer friendly looking at each case and not working off some tick list .",
      "rating": 5,
      "date": "7th September 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent",
      "text": "Experience was excellent customer service was excellent",
      "rating": 5,
      "date": "6th September 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Communication",
      "text": "Fantastic service but think it could have been made better by focusing more of the return documentation through a digital service rather than by post. This would have sped up the process tenfold.",
      "rating": 4,
      "date": "6th September 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Quite a difficult process with many errors",
      "text": "I was porting a mortgage and adding another loan to move to a new property. There were many errors along the way including incorrect charges, incorrect t's and c's being sent out and overly prescriptive conditions. We got there in the end though.",
      "rating": 3,
      "date": "6th September 2023",
      "product": "Mortgages",
      "sentiment": "mixed"
    },
    {
      "title": "Mortgage Application & Arrangement review",
      "text": "All good - always able to speak with adviser and Society honoured an agreement despite a change in the broker, which could have cost me in terms of interest rate!",
      "rating": 4,
      "date": "16th August 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Pleasure to deal with",
      "text": "The opposite of a \"computer says no\" mentality that you get with banks",
      "rating": 5,
      "date": "14th August 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very happy customer!",
      "text": "The process of remortgaging my property was straightforward and hassle free. Great service!",
      "rating": 5,
      "date": "8th August 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Simple process",
      "text": "Liaised through a independent advisor",
      "rating": 5,
      "date": "4th August 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Straightforward and well presented",
      "text": "Advisor gave a full breakdown on liabilities.",
      "rating": 5,
      "date": "3rd August 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very good service",
      "text": "No problems from start of remortgage to completion",
      "rating": 5,
      "date": "3rd August 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Mortgage",
      "text": "Overall pleasing experience. Would recommend!",
      "rating": 5,
      "date": "3rd August 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Reasonably straightforward aside from a last minute hitch over the direct debit mandate",
      "text": "Aside from the hitch over the direct debit and a delay in settlement with the funds taking later in the afternoon to arrive, all fine",
      "rating": 3,
      "date": "2nd August 2023",
      "product": "Mortgages",
      "sentiment": "mixed"
    },
    {
      "title": "Easy remortgage",
      "text": "Process so smooth and team very helpful",
      "rating": 4,
      "date": "28th July 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "All good",
      "text": "Everything went well with remortgage",
      "rating": 5,
      "date": "27th July 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Use a mutual!",
      "text": "No interest mortgage for old people only through a broker. This was a slow process! Very thorough for a small mortgage.",
      "rating": 3,
      "date": "26th July 2023",
      "product": "Mortgages",
      "sentiment": "mixed"
    },
    {
      "title": "Scottish Building Society",
      "text": "From dealing with my mortgage broker to obtaining mortgage from Scottish was a seamless exercise.",
      "rating": 5,
      "date": "26th July 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great Mortgage deal.",
      "text": "The re-mortgage process from beginning to end was professional, efficient and thorough. I felt as though as I was in 'safe hands'. Most important when dealing with such an important financial commitment.",
      "rating": 5,
      "date": "26th July 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent service, hassle free.",
      "text": "After having to withdraw a very time consuming mortgage application with another lender who were very difficult to deal with, my broker recommended Scottish Building Society and i couldn't have been happier, swift action, no fuss and prompt results. Would recommend.",
      "rating": 5,
      "date": "25th July 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Good service",
      "text": "Good service for remortgage, would be better if app improved to give more details of my account",
      "rating": 4,
      "date": "25th July 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Simple, clear, straighforward process. Outstandng customer service. Thank you.",
      "text": "The whole process of re-mortgaging, which I thought would be nightmare was just so very easy & straightforward. Very speedy too - I had envisaged interminable delays and a mass of issues. In contrast, there were none. Thank you!",
      "rating": 5,
      "date": "24th July 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Dissatisfied",
      "text": "My experience with the BS was good however there were a few things I found disappointing. I was unaware that the offer made was subject to change and unfortunately your lawyers were so slow in dealing with my transfer that I have ended up paying a lot more than I expected on a monthly basis for the mortgage. The lawyers (Simpson and Marwick) also made mistakes with the costs and these also kept rising. I was rarely able to get hold of anyone to speak to about my queries as the person dealing with it seemed to be constantly “out of the office”. To add “insult to injury” they did not believe I had paid the correct amount to finalise the mortgage and I had to overpay so that the deal could be finalised without incurring more costs. However, they did recognise their mistake and reimbursed me for this. Altogether I was very unhappy the lawyers and wish in retrospect I had not used them. I am afraid this has not been a very pleasant experience overall.",
      "rating": 3,
      "date": "24th July 2023",
      "product": "Mortgages",
      "sentiment": "mixed"
    },
    {
      "title": "Process is fine, account management is poor",
      "text": "The remortgage process was fine. We didn't receive any paperwork other than one letter telling us what our monthly payment would be. No mortgage terms documentation etc. Was also shocked to hear they didn't have an online facility to check and manage our mortgage. Only a yearly statement!? I can't fathom how in the 21st century a major Building Society does not have an account management facility - we're not all 75yo. Early days yet, will see where we are in 6 months.",
      "rating": 3,
      "date": "24th July 2023",
      "product": "Mortgages",
      "sentiment": "mixed"
    },
    {
      "title": "Overall happy but very long process",
      "text": "Overall I am somewhere between a 4 and a 5 star rating for customer experience. The only reason why I am reluctant to give a 5 star is because the surveyor was never instructed when they should have been. This resulted in a delay in the already lengthy mortgage process. However I do appreciate the more thorough checks done by SBS.",
      "rating": 4,
      "date": "24th July 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Service was fantastic. Clear communication, fully understood our needs and the fact we needed to move quickly. Financial advisor commented on the excellent service and speedy response",
      "text": "were in a complicated situation with our cash purchase falling through. However team made us feel at ease and took total control of the situation guiding us through the process quickly and efficiently in a language we understand. The on line portal was an effective way of passing information. To be honest we had never heard of Scottish building society prior to mortgage however on discussion with my son he was aware of your bank and could also vouch for your impeccable reputation. So many thanks and would definitely recommend you.",
      "rating": 5,
      "date": "24th July 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great service",
      "text": "Effective and personal service in all aspects. Great communication throughout.",
      "rating": 5,
      "date": "23rd July 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "People",
      "text": "What a refreshing exoerience to be dealing with real professional people. I have had a long standing mortgage with SBS and every time I speak to them I get the feeling they are genuinely trying to do business with me and get the right outcome. Huge thanks to Peter for his patience in working through the paperwork with me. Straight talking and thorough, couldn't ask for more.",
      "rating": 5,
      "date": "19th July 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Satisfactory",
      "text": "We possibly started the process too early 5months before previous lender deal expired. Led to issues with mortgage offer expiring and not being noticed until last minute Delay in then mortgage transferring over. Now complete and happy",
      "rating": 4,
      "date": "5th July 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Friendly and personal",
      "text": "Appreciated their work with our brokers which went smoothly, with a lot of due diligence by SBS on our financial position.",
      "rating": 4,
      "date": "1st July 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Recommended",
      "text": "SBS was recommended by our mortgage advisor and gave us a competitive deal.",
      "rating": 3,
      "date": "30th June 2023",
      "product": "Mortgages",
      "sentiment": "mixed"
    },
    {
      "title": "Great service, by people!!",
      "text": "Applied for a remortgage, and although the process was relatively long, I was heartened by the fact that parole, not computers, were making the decisions. Refreshing to get some proper customer service. Would definitely recommend.",
      "rating": 5,
      "date": "29th June 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Judith Barr-Lundie",
      "text": "Totally happy with the service especially the team at Simpson Marwick in particular Linda Bryson who was exceptional on her customer service. Happy customer!",
      "rating": 5,
      "date": "27th June 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Mortgage porting",
      "text": "Excellent service during house move. No problems with the whole process. Why is there a minimum number of characters required.",
      "rating": 5,
      "date": "24th June 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Thumbs Up",
      "text": "It was a great experience going with Scottish Building Society as they made what was expected to be a stressful process more straightforward.",
      "rating": 5,
      "date": "23rd June 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "smooth achievement",
      "text": "We decided on a new mortgage for our otherwise unencumbered property to enable some improvements and to have support funds if required. The approach to SBS was done through a helpful intermediary, and an offer in satisfactory terms was soon achieved. The whole process was achieved without hassle up to completion.",
      "rating": 4,
      "date": "23rd June 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great",
      "text": "Kind and informative, got me the answers i needed to for my mortgage",
      "rating": 5,
      "date": "23rd June 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great mortgage products and perfect customer service",
      "text": "Easy remortgage process even though our circumstances involved settling two old mortgages over two properties.",
      "rating": 5,
      "date": "23rd June 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent service and easy process",
      "text": "Switching to Scottish Building Society was a very easy process and regular updates were provided on the progress of our application.",
      "rating": 5,
      "date": "22nd June 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Self Build Mortgage",
      "text": "Good experience overall, always available to talk which is nice. The wait for further instalments and the surveys from both the architect surveyor and Shepard's surveyor is very time consuming and very expensive. This could have been done by the same person and ended up adding £3000+ to my project. I understand that this is necessary to keep everything monitored, but one survey should have been plenty. Very costly",
      "rating": 4,
      "date": "22nd June 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Prefessionaly Handled with no issues",
      "text": "Seemless re-mortgage with SBS, good customer service, kept informed troughout",
      "rating": 5,
      "date": "22nd June 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Mortgage repayment",
      "text": "I am paying back by interest only equity taken out on my property.. The interest payment is the most managble on the market I have found and the Scottish Building Society to have been most helpfull in guiding me throughout the process of setting up the repayments with my Bank",
      "rating": 5,
      "date": "15th June 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Reasonably easy change to provider.",
      "text": "All good with the exception of some unusual questions about pensions.",
      "rating": 5,
      "date": "15th June 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Quick, easy and helpful",
      "text": "Was a good experience. I asked to upgrade the valuation to include a level 2 survey which saved me paying twice. Once for a valuation and again for a survey. Service was very friendly albeit sometimes a bit difficult to understand because I don't speak Scottish.",
      "rating": 5,
      "date": "13th June 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "We got there in the end",
      "text": "Thoroughness and being canny with money engenders confidence in a company",
      "rating": 4,
      "date": "11th June 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great service.!!",
      "text": "Great service from the start. Rate was the lowest at the time. Will see what the next 3 years brings.",
      "rating": 5,
      "date": "9th June 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Not happy with this remortgage at all",
      "text": "I have remortgaged many times over the last 20 years and this has been the worst yet!! Having to provide paperwork for an extension that's been up for 10 years. Some i had to buy from the council. There's an ongoing dispute with the solicitors you use and myself and the mortgage centre in regards to lying, with holding information and not providing me with the correct information. As soon as I can im moving to a better company",
      "rating": 2,
      "date": "9th June 2023",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "Mortgage review",
      "text": "Good efficient service and information",
      "rating": 5,
      "date": "8th June 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Positive",
      "text": "Generally a good experience. My only complaint is that I had requested the mortgage fee to be added to the loan value and it wasn’t. This meant an unexpected fee of nearly 1k I hadn’t allowed for. It was too late to amend due to date constraints and waiting for the whole process again.",
      "rating": 4,
      "date": "8th June 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Hassle free mortgage",
      "text": "Excellent communication clear documentation and friendly UK call centre",
      "rating": 5,
      "date": "8th June 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very straightforward",
      "text": "Got our mortgage with SBS through or mortgage advisor. Very straightforward process. Got a good deal too.",
      "rating": 5,
      "date": "7th June 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Straight-forward",
      "text": "Our switch to SBS was sitraight-forward and all dealings with the society have been very easy. We asked to change the date of our payments and it was dealt with straight away with no fuss.",
      "rating": 5,
      "date": "7th June 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Experience with SBS",
      "text": "Very efficient service. Mortgage settled very quickly and without fuss.",
      "rating": 4,
      "date": "6th June 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Easy process and hassle free",
      "text": "Everything about or remortgage to SBS was easy and hassle free. The app worked great for sharing docs and carrying out ID checks and everything went to plan on time. Great experience.",
      "rating": 5,
      "date": "6th June 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very easy transaction of switching mortgage over.",
      "text": "Very straightforward by advisor, client, and Scottish Building society",
      "rating": 4,
      "date": "6th June 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Good customer service",
      "text": "A good service experience overall",
      "rating": 4,
      "date": "16th May 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Good servicel",
      "text": "Although dealt with by a broker no problems at all",
      "rating": 5,
      "date": "15th May 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Simple and straightforward",
      "text": "Everything went smoothly. Whole process was efficient and clearly explained.",
      "rating": 5,
      "date": "15th May 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "The right solution",
      "text": "As a retired couple there are tax implications when taking money out of a SIPP. This loan has saved me paying a marginal rate of over 40%, with no further tax implications.",
      "rating": 5,
      "date": "15th May 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Friendly and efficient",
      "text": "We remortgaged with the Scottish Building Society and found the process quick while being kept up to date throughout. The application process was smooth and I've had follow up calls and letters to make sure all has been ok. We had to get our own solicitor to complete the conveyancing but this wasn't really a problem, just something we haven't experienced with a remortgage before. SBS paid for most of the solicitor fees which was helpful.",
      "rating": 5,
      "date": "15th May 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great company",
      "text": "They solved our problem with various options",
      "rating": 5,
      "date": "15th May 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "All very smoothly handled",
      "text": "Our mortgage was arranged through a broker, everything went very smoothly and our dealings with Scottish Building Society were totally satisfactory throughout.",
      "rating": 4,
      "date": "15th May 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great throughout the process!",
      "text": "Would highly recommend SBS they are thorough and take care with your application, have good communication and were helpful when we needed answers!",
      "rating": 5,
      "date": "12th May 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "The Ideal mortgage for the retired",
      "text": "We needed to raise a large sum using our house as collateral",
      "rating": 5,
      "date": "12th May 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Thorough, friendly support",
      "text": "Very good rate offered through broker (Landc) Completion of questions and provision of information was very detailed (eg copies of bank accounts etc) which was good but the requests came in phases - we would provide one lot and then more was asked for. The final outcome was very satisfactory and reassuring. The personal support provided and offered looks excellent (through Lisa Soutar).",
      "rating": 4,
      "date": "12th May 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Top marks.",
      "text": "In the short time I have been with the Scottish Building Society I have been impressed by the helpful and courtesy of the assistants to whom I have spoken.",
      "rating": 5,
      "date": "12th May 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "An independent person centred building society",
      "text": "I enjoyed the experience of working with the Scottish Building society as it offers an individual approach for people with diverse needs.",
      "rating": 5,
      "date": "11th May 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Helpful staff but slow process",
      "text": "Firstly I'd like to say that the staff were incredibly friendly and helpful if I called up with a query or concern and the rates are very reasonable compared to other lenders so we are overall happy. Our only issue though was the insistence on doing everything by post in a time when it can be done electronically. This was heightened by there being a postal strike, however we received a lot of pressure from the seller as a result of how long it took, and this caused us a great deal of stress and sleepless nights as we were buying our first home in such a turbulent time for the market. In summary, great staff, reasonable rates but slow service.",
      "rating": 3,
      "date": "30th April 2023",
      "product": "Mortgages",
      "sentiment": "mixed"
    },
    {
      "title": "Good service and kept informed",
      "text": "I was recommended Scottish Building Society by a broker. SBS and my broker kept me informed throughout the process and the property purchase was seamless.",
      "rating": 5,
      "date": "28th April 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Review of Scottish Building society",
      "text": "I found the process of obtaining a mortgage from Scottish Building Society rather difficult and over complicated. They were overly prescriptive requiring questions to be answered that I have never come across previously when applying for a mortgage from other v=building societies As a result, the process took far longer than was perhaps necessary as some of the required information was highly detailed and took a very long time to acquire.",
      "rating": 4,
      "date": "27th April 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Mortgage was approved and went through without any problems",
      "text": "Once mortgage was approved all paperwork came explaining payment details, did not experience any issues and was dealt with professionally.",
      "rating": 5,
      "date": "26th April 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Helping people in Scotland and North England with biggest purchase",
      "text": "Personal, flexible and putting customer and broker at heart of everything they do",
      "rating": 5,
      "date": "31st March 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Best Building Society",
      "text": "Excellent provider of savings and mortgage products",
      "rating": 5,
      "date": "31st March 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent customer service and support",
      "text": "SBS are excellent to deal with, whatever the query or problem, they are always happy to support.",
      "rating": 5,
      "date": "30th March 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Bespoke Service",
      "text": "Scottish Building Society are a;ways quick in their response and their bespoke service means you can speak with them on a case by case basis. They have competative products",
      "rating": 5,
      "date": "23rd March 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great service- quick response",
      "text": "Mortgage offered quickly and without fuss",
      "rating": 5,
      "date": "23rd March 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent service from BDMs",
      "text": "BDMs are helpful and respond quickly to queries.",
      "rating": 5,
      "date": "23rd March 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Fantastic lender to use",
      "text": "It always feels personal when you use SBS, all the way down the line, from first contact with Alex right through to the Underwriter. You know they are not following a \"script\" and actually look for ways to lend (rather than putting obstacles in front of themselves). And afterwards, the client is always happy.",
      "rating": 5,
      "date": "23rd March 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great lender and service",
      "text": "A lender that will consider all applications and try to find a suitable outcome.",
      "rating": 5,
      "date": "23rd March 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great business",
      "text": "I have worked for The Society now for three years and in this time have found the team to strive for the highest levels of customer service both for our direct customers and mortgage brokers.",
      "rating": 5,
      "date": "23rd March 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Remortgaging",
      "text": "I was recommended to SBS and was very pleased with the clear and straightforward responses and information received. The product information and application document was very clear which made the whole process very straightforward. The completion and setting up of DD etc went without a hitch. I would recommend SBS.",
      "rating": 5,
      "date": "23rd March 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Problem free remortgaging",
      "text": "Having been recommended to the SBS I was impressed with the helpful and efficient handling of my enquiry through to offer and completion of the remortgaging process. All communications were very clear and helpful. I would definitely recommend SBS to others.",
      "rating": 5,
      "date": "23rd March 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "A fairly positive experience",
      "text": "A lot of issues in satisfying the society in relation to my wife’s and my pensions. Certainly in relation to my pension. The required information was in the public domain, however the specific detail was requested which took a number of weeks to obtain in writing which caused considerable delays",
      "rating": 3,
      "date": "21st March 2023",
      "product": "Mortgages",
      "sentiment": "mixed"
    },
    {
      "title": "Great help with first time mortgage",
      "text": "Easily contactable, quick responses and communication, friendly staff",
      "rating": 5,
      "date": "20th March 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Mortgage for an over 60",
      "text": "I found the SBS easy to deal with, they delivered what I required.",
      "rating": 5,
      "date": "20th March 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Early Retirees",
      "text": "Great personalised experience of service and all the benefits of a mutual. But mortgage products for early retired limitted,",
      "rating": 3,
      "date": "18th March 2023",
      "product": "Mortgages",
      "sentiment": "mixed"
    },
    {
      "title": "excellent",
      "text": "really easy to use, friendly advice, nice colleagues and a good product",
      "rating": 5,
      "date": "16th March 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Good rates but slow",
      "text": "The rates are fantastic and were cheapest at the time of applying however it felt like I was applying for a mortgage in 1980. It’s a shame as I used the Scottish building society app to prove my identity which was brilliant and then was never told to use it again. Everything was done by post. I personally think 3 months to set up a mortgage is too long, All that been said, I would still use SBS again in the future if the rates were the most competitive. I just think modernising the application process would be a brilliant step forward.",
      "rating": 3,
      "date": "16th March 2023",
      "product": "Mortgages",
      "sentiment": "mixed"
    },
    {
      "title": "Easy process",
      "text": "A modern and easy application process with good amount of communication",
      "rating": 4,
      "date": "16th March 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Got there eventually!",
      "text": "The process for approval is cumbersome compared to previous lenders RBS and Santander. Got there eventually though after providing documents I’d never been asked for before!",
      "rating": 3,
      "date": "16th March 2023",
      "product": "Mortgages",
      "sentiment": "mixed"
    },
    {
      "title": "Good",
      "text": "We had no problem with setting up our mortgage for the Scottish Building Society. We did have some small issues with the legal side which caused some delay however nothing that would stop me from recommending them.",
      "rating": 5,
      "date": "15th March 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Smooth and efficient process.",
      "text": "Nothing to add, the process was smooth and efficient.",
      "rating": 5,
      "date": "15th March 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Financial advisor got us best deal with Scottish building society.",
      "text": "Didn’t encounter any difficulties with getting mortgage from Scottish Building Society.",
      "rating": 4,
      "date": "15th March 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Good process",
      "text": "Easy process with updates along the way. Good discounted rates.",
      "rating": 5,
      "date": "10th March 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent Service",
      "text": "As per title, SBS have been fantastic dealing with our mortgage for our new home. Due to rising rates, we were concerned that our new build wouldn’t be ready before the expiration of the offer. After discussions back and forth, we managed to get everything finalised and handover happened very quickly. Would highly recommend.",
      "rating": 5,
      "date": "9th March 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Reasonably good experience but it took too long!",
      "text": "Started in September and completed in December. This is two months too long and the whole process could have been sorted much earlier. Requesting information specific for Scotland and I live in Derbyshire...just didn't seem anyone had a handle or took responsibility for my re-mortgage. So my experience wasn't the best and cost me £1200 in additional mortgage payments made a full interest rate while this deal was sorted.",
      "rating": 2,
      "date": "13th February 2023",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "Great communication!",
      "text": "Extremely easy to get a hold of someone for help, great line of communication.",
      "rating": 5,
      "date": "10th February 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Process was hard work, slow and no online presence",
      "text": "Your process required a huge amount of financial evidence, including personal questions (eg why are you sending £50 to your mum a week?) Despite being a very affordable borrowing. I have had many mortgages in the past and this was the most information I have ever had to produce. Your legal team were very slow and obviously working to a tight margin, pushing most of the work onto us as clients. Their process cost us 2 weeks unnecessary delay in completion costing us hundreds of pounds at SVR. My complaint to S&M received a very weak reply ie we are very busy at the moment and your case handler has been off sick. It would also be good to be able to view our balance online. The fact you contacted my husband for feedback despite me having dealt with the whole process is also very disappointing.",
      "rating": 2,
      "date": "7th February 2023",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "Very satisfied",
      "text": "I was very satisfied with your service, very helpful.",
      "rating": 5,
      "date": "7th February 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Practical and effective support through postal strike",
      "text": "Easy to get through to on the phone to resolve paperwork issues and maintain move if date. Easy to work with. Pragmatic though postal strike.",
      "rating": 5,
      "date": "7th February 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Mortgage refused for trivial purposes",
      "text": "Took a valuation fee of £360 after mortgage being approved in principle. Underwriters then rejected mortgage application on basis of applicant \"spending too much in last few months\" on a particular entertianment hobby, despite LTV of 60%, substantial savings and high salary. No credit check done either. Absolute despicable charlatans, avoid like the plague and use a mortgage provider that doesn't shaft you without reason. CEO emailed and let's see what the repsonse is. Amateurs!",
      "rating": 1,
      "date": "5th February 2023",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "Excellent personal service.",
      "text": "Excellent experience. Very professional and showed great compassion during what was a very stressful time .",
      "rating": 5,
      "date": "3rd February 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Helpful, Friendly and professional",
      "text": "From start to finish, it was a very smooth process.",
      "rating": 5,
      "date": "17th January 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent service from Scottish Building Society",
      "text": "My move to Orkney was tricky but I couldn't have done it without Scottish Building Society. My first mortgage was agreed in principle by another lender but they declined to offer for property in Orkney! My adviser directed my request to SBS and they came up trumps with a good offer. When the sale was delayed they enabled me to extend the offer, and when it eventually fell through they gave me a second offer on another property. Admittedly this couldn't be as good an offer as the first due to the economic downturn but their quick response enabled me to stay in the limits of my finances before the worst of the increases came through.",
      "rating": 5,
      "date": "15th January 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "First Class and Professional Service",
      "text": "Used SB for our remortgage. We found them to offer a first class and professional service. We were guided step by step process and even when we had problem on our legal side with Land Registry they were accommodating.",
      "rating": 5,
      "date": "12th January 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Easy Money!",
      "text": "I was put in touch with Scottish Building Society via a financial advisor who had recommended them because one of their products suited my financial needs. The documentation was easily completed and their positive response was quick. From acceptance to completion only took a few weeks allowing me to put my plans into action.",
      "rating": 5,
      "date": "12th January 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Slow and antiquated with very poor service from third party providers.",
      "text": "We were very happy to be joining SBS - and still are - but it has been a painful and slow process to get here. We began a straightforward remortgage in mid August- our mortgage finally drew down in mid November and cost us over £200 in excess interest as a result. It took over six weeks to receive a mortgage offer. The broker (MAB) was only interested in securing his referral fee and progress with the application was then only made after constant chasing and direct intervention from us. Every time we called SBS direct the service was excellent. The legal service from Simpson Marwick was like something from the 1990s. A fax was even used on some occasions! The 'solicitor' was clearly following a one size fits all step by step tick box process, with no willingness to combine steps or anticipate what might be needed next. Early contact was only by post and required hand written completion of basic details forms - no digitisation at all. Since telephone contact was impossible throughout the process (just office answerphone) we were required to enter into lenghty email exchanges to resolve questions - with typically up to 24 hours between responses. Ultimately this resulted in us missing our remortgage deadline and incurring significantly higher interest costs. Overall, we are happy to be with SBS but your third party suppliers are letting you down in a major way and damaging your brand. My advice would be to bring as much of the process as possible back in house because your own people are excellent!",
      "rating": 2,
      "date": "12th January 2023",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "Prompt in response",
      "text": "Was let down at last minute by another company, SBS managed to turn my application round in 10 days and they offered better deal than previous bank Santander.",
      "rating": 5,
      "date": "10th January 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Remortgage",
      "text": "No issues process carried out with aid of financial advisor",
      "rating": 5,
      "date": "10th January 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Professional customer service",
      "text": "We are absolutely satisfied with Scottish Building Society’s customer service. They are always available by phone, our queries were replied in a timely manner, mortgage process was going smoothly.",
      "rating": 5,
      "date": "5th January 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "First time buyers",
      "text": "Excellent experience from start to finish first time buyers, they are very understanding would highly recommend",
      "rating": 5,
      "date": "5th January 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Want a mortgage then give SBS a call",
      "text": "Very quick processing of application to offer in principle. Great communication throughout, and a good rate as well. The product range is also good and they had exactly what we were looking for. Overall I cannot recommend SBS highly enough.",
      "rating": 5,
      "date": "5th January 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Remortgage of Property",
      "text": "Remortgaged our property with the Scottish Building Society through broker “Fluent”. The experience was a pleasant one and reasonably straight forward. The remortgage took slightly longer to finalise but this was due to going through the broker.",
      "rating": 4,
      "date": "5th January 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Customer friendly",
      "text": "Mortgage was way to set up. Staff were efficient and friendly. Explained everything properly",
      "rating": 5,
      "date": "5th January 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "MR JOHN MCKELL",
      "text": "I USED A FINACIAL ADVISER, DAVID MUNRO. EVERTHING WAS COMPLETED QUICKLY AND WITHOUT FUSS.",
      "rating": 5,
      "date": "5th January 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "No major concerns.",
      "text": "All fine really, main concern was that after notifying you of a change of address, various correspondence was still sent to the old address.",
      "rating": 4,
      "date": "5th January 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Extremely relieved to find a mortgage lender who considers drawdown pensions",
      "text": "My experience of trying to obtain a mortgage using one of my drawdown pensions as income was disappointing and very worrying. I felt that my plans of buying a retirement bungalow were not going to happen, until my mortgage broker found Scottish Building Society. They were happy to use my drawdown pension along with my works pension as income and offered me a retirement mortgage that is affordable and flexible. I am extremely happy with the service they have provided.",
      "rating": 5,
      "date": "30th December 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Efficient, straightforward, friendly service",
      "text": "I secured a lifetime mortgage to enable me to remain in my home after marital separation. At all times my interactions with the Society’s staff were stress free and positive,",
      "rating": 4,
      "date": "30th December 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Remortgage Application - quick & easy",
      "text": "I recently remortgaged to Scottish Building society and also took additional funds to consolidate debt, I was turned down by other lenders but SBS look at the bigger picture and were able to help. Great customer service throughout and I am glad I went with SBS!!",
      "rating": 5,
      "date": "29th December 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent customer service and product knowledge",
      "text": "The lending proposition was difficult and the individual assessment of the Society Underwriting is very refreshing in the marketplace.",
      "rating": 5,
      "date": "23rd December 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Smooth remortgage, no issues",
      "text": "Simple and straight forward, easy transaction, good communication",
      "rating": 5,
      "date": "22nd December 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent Mortgage Lender",
      "text": "Throughout I have found them to maintain excellent communications. One major thing that stood out to me was when you call the bank you are connected to an advisor within minutes and they are pleasant and very helpful. This is not always the case with these types of establishments. Easy to deal with.",
      "rating": 5,
      "date": "7th December 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "A fast and easy experience",
      "text": "Got a great offer and it was turned around quickly.",
      "rating": 5,
      "date": "29th November 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "The deal was good, the application process was slowwwwwww",
      "text": "There was an awful lot of to/fro to get to the finish line. Glad we did as the deal was ok, but the number of \"post application\" questions that came up that I hadn't previously been informed of delayed things for weeks and weeks and caused a lot of stress. It wasn't helped by going through a broker which meant I was one step removed from the lender. Got there in the end and hopefully it will be smooth sailing ongoing.",
      "rating": 4,
      "date": "17th November 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Clear timely replies and seem less service",
      "text": "Having had a disappointing experience with current lender was recommended to applet to SBS by broker and everything was explained clearly and the entire process was made as stress free as possible",
      "rating": 5,
      "date": "17th November 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "My Mortgage",
      "text": "Content with the process. However it is painfully slow. A lot of high;y superfluous information was sought",
      "rating": 4,
      "date": "17th November 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "friendly, polie & helpful",
      "text": "Peter was great in helping my partner & I obtain a mortgage. There were tight deadlines to meet the Entry date, and SBS had a high volume of applicatons to process, however Peter ensured that our application was processed & approved in sufficient time. Peter was friendly, polite and informative throughout the process and made the application easy for us to complete. We look forward to moving into our new home at the end of the month, and are greatful for the upport of both Peter & the SBS team.",
      "rating": 5,
      "date": "12th November 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Had the Product I required, Retirement Interest Only, at competitive rates.",
      "text": "Good to deal with a Building Society that has a local feel to it, not just a Branch of a big Bank. Deals with queries quickly, and answers the phone, not put on an endless loop of pressing buttons to get through to someone. Approval did take longer than expected, although as I went through a Broker, that could have been down to them, and not the Building Society. Would be good if you could manage your account on-line. All in all, a very good experience.",
      "rating": 4,
      "date": "6th October 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent and Seamless Service",
      "text": "My request for mortgage facilities from the SBS was dealt with very quickly. The entire process was handled extremely efficiently from beginning to end and I would not hesitate to recommend the Society to anyone looking for any of the Services it provides.",
      "rating": 5,
      "date": "5th October 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "The whole process was hassle free",
      "text": "Most of my dealings were via a mortgage broker so there was little direct contact with yourselves. However, everything that was needed was completed without any difficulties.",
      "rating": 4,
      "date": "5th October 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Smooth proces",
      "text": "Was a really easy experience and easy to contact someone direct with any queries.",
      "rating": 5,
      "date": "5th October 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Re-mortgage",
      "text": "Very professional service and friendly knowledgeable staff",
      "rating": 5,
      "date": "4th October 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very easy and straighforward",
      "text": "This was a re-mortgage so I could find the documents and information easily. But nevertheless the whole process felt seamless and straightforward. No problems at all.",
      "rating": 5,
      "date": "4th October 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Efficient, no nonsense service from happy staff.",
      "text": "I recently needed to temporarily release some funds from my portfolio and remortgage my property was the quickest and cheapest method. Previous experience led me back to the Scottish Building Society who were most efficient in helping me.",
      "rating": 5,
      "date": "4th October 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Fast and Efficient Customer Experience",
      "text": "This was an extremely positive customer experience. All aspects of applying for and obtaining my mortgage were dealt with very efficiently and courteously by both SBS and it’s agents.",
      "rating": 5,
      "date": "4th October 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Good rates and simple process",
      "text": "Remortgage of existing property with good rate and very simple process.",
      "rating": 4,
      "date": "3rd October 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very friendly and reliable staff",
      "text": "Staff were very friendly and efficient in supporting me complete my mortgage application despite some difficulties I faced with my broker, they made me feel at ease and I was comforted knowing that SBS would complete my mortgage application as efficiently and effectively as possible.",
      "rating": 5,
      "date": "3rd October 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Mr and Mrs Alexander Murray Mortgage Application",
      "text": "Excellent advice from the Mortgage Consultant David Rolleston. He recommended highly the Scottish Building Society. As a result the application was made to the Company and we were delighted with the very professional response and assistance at every step of the process. We will certainly recommend the Company to friends and family.",
      "rating": 5,
      "date": "2nd October 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "No problems encountered",
      "text": "Overall excellent. Maybe a little more trusting in future.",
      "rating": 3,
      "date": "30th September 2022",
      "product": "Mortgages",
      "sentiment": "mixed"
    },
    {
      "title": "No fuss - smoothly completed",
      "text": "Just a little confusion about mortgage documents sent from solicitors and where they should be returned.",
      "rating": 4,
      "date": "29th September 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Totally Satisfied",
      "text": "Our Financial advisor gave us several options and we chose the Scottish Building Society as everything was clearly laid out which made the process seamless Everything was completed to our total satisfaction",
      "rating": 5,
      "date": "29th September 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Amazing",
      "text": "They were very patient whilst out move in date was constantly delayed",
      "rating": 4,
      "date": "28th September 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Self build to fixed rate mortgage",
      "text": "Overall we have had a great experience with SBS, when in the self build phase of the mortgage SBS were easy to deal with and provided drawdown funds quickly and painlessly once all paperwork was in order. Once we had our building control completion certificate in place we got transferred to a fixed rate mortgage of our choosing within around a week saving us a considerable amount. Overall an excellent experience.",
      "rating": 4,
      "date": "28th September 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very helpful with as a first time buyer",
      "text": "Very helpful throughout the whole process, and good rates too! I was asking for a slightly more complicated mortgage and they were incredibly helpful in getting this setup. A big thumbs up.",
      "rating": 5,
      "date": "28th September 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "No hastle",
      "text": "Everything went smooth and was kept informed all the way",
      "rating": 5,
      "date": "27th September 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Brilliant options for First-Time Buyers",
      "text": "Although I applied for the mortgage through a mortgage adviser, I was happy with the options for first-time buyers that were available from the Scottish Building Society. The process of application was smooth and the documents were easy to provide. They gave me all the information I need, and I feel like I can easily get in touch with them if I have any queries.",
      "rating": 5,
      "date": "27th September 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Remortgage made easy",
      "text": "Efficient, knowledgeable and professional",
      "rating": 5,
      "date": "27th September 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Remortgage made easy.",
      "text": "From my first contact with SBS my remortgage was made easy. Any time I called I received the information I required. A lady called Nikki even called me from her home. Would have no hesitation in recommending SBS to anyone. Thank you. Ian.",
      "rating": 5,
      "date": "27th September 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Happy to have first mortgage approved",
      "text": "Our situation was a bit tricky and many lenders dropped out, so was very happy that SBS approved my mortgage. I was also keen to work with a local Scottish provider. The rate was decent and the communication was fast. My only wish is to have an online account to manage mortgage online (not found a way yet).",
      "rating": 4,
      "date": "27th September 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great service and support",
      "text": "My new build was delayed. The team at SBS were fantastic and made the whole process seamless. They certainly alleviated my stress relating to the delay in the build. Well done to a great team.",
      "rating": 5,
      "date": "27th September 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Efficient open process",
      "text": "An overall efficient and speedy process from start to finish. Although using a broker, they were able to reach out and get information quickly when questions arose on deal and process. Only a few items, which isnt really negative, but, all paper based, which can slow things down a bit (and will become tedious when wanting to check balances etc quickly in future), and lack of direct contact (again used a broker though) during and after process. Neither above would stop me using SCB again or recommending. Deal was agreed and processed roughly in tome frame given, even when other lenders nearly quadrupled lead times! Overall great experience, and suited my needs. Thanks",
      "rating": 5,
      "date": "27th September 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Good once it was set up",
      "text": "The set up process was arranged through a broker, seemed to take a long time for additional information to be requested, perhaps a standard list of requirements should be drawn up to give to brokers/clients so that they know from the start what is required? Generally arranging draw downs was fine, a few of the times additional/different info was asked for by SBS so again perhaps a standard list of requirements issued at the start would help speed things up?",
      "rating": 4,
      "date": "26th September 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "No hassle",
      "text": "Slight issue with first payment taken but all ok now.",
      "rating": 4,
      "date": "26th September 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Quite easy process.",
      "text": "Professional and helpful. No further comments.",
      "rating": 4,
      "date": "23rd September 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent and prompt service",
      "text": "Questions answered promptly - as well as coming back to us very quickly if we need to respond queries. Highly recommend as service was very professional",
      "rating": 5,
      "date": "22nd September 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "A smooth experience all round.",
      "text": "A smooth experience all round. ...................................................",
      "rating": 5,
      "date": "16th August 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great service and great rates",
      "text": "My mortgage application was processed quickly and efficiently. I am happy with the fixed rate I got. All contact with SBS staff has been pleasant and helpful",
      "rating": 5,
      "date": "10th August 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "MORTGAGE RENEWAL",
      "text": "No fuss from start of process to completion",
      "rating": 5,
      "date": "9th August 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Impressed",
      "text": "Application dealt with efficiently & process went smoothly.",
      "rating": 5,
      "date": "5th August 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Easy process with good customer service",
      "text": "We found the process to be very smooth and without complication. All paperwork sent was easily understandable and well put together. I have had to call SBS a couple of times to ask questions and I have always found the customer service to be friendly and helpful.",
      "rating": 4,
      "date": "5th August 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Recommend by me",
      "text": "I never thought It would be so easy to apply, everything was done for me only had to answer a few questions and they done the rest no pressure",
      "rating": 5,
      "date": "20th July 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    }
  ]
}