{
  "society": "Skipton Building Society",
  "slug": "skipton-building-society",
  "smpUrl": "https://smartmoneypeople.com/skipton-building-society-reviews/products",
  "totalReviewsOnSMP": 123,
  "avgRating": 4.39,
  "scrapedAt": "2026-02-06T16:07:21.657543+00:00",
  "reviews": [
    {
      "title": "Great",
      "text": "Simply great, easy on the ball, reliable and trustworthy",
      "rating": 5,
      "date": "6th April 2023",
      "product": "Insurance",
      "sentiment": "positive"
    },
    {
      "title": "Cash back scam",
      "text": "I purchased home insurance via Quidco in June 2018 because there was an offer of cash back. Have chased this several times via Quidco who informed me it just takes time. 9 months later got email from Quidco telling me skipton had refused to pay something to do with the terms and conditions. If I had been told 9 months ago that they weren’t going to pay I would have cancelled my insurance and looked elsewhere. I get 14 days to cancel but they get 9 months to refuse cash back. What a scam. Don’t use Quidco or Skipton if you want a fair deal.",
      "rating": 1,
      "date": "12th March 2019",
      "product": "Insurance",
      "sentiment": "negative"
    },
    {
      "title": "Skipton with a professional company smile.",
      "text": "I have been with the Skipton Building Society in Perth for many years. The professional staff members are a joy to talk to and are so friendly. Always greeted with a smile and extremely helpful.",
      "rating": 5,
      "date": "22nd January 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Approachable and caring service",
      "text": "We were very impressed with how helpful and approachable they were, we decided to renew our mortgage with them.",
      "rating": 5,
      "date": "18th March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "quick home valuation, very good communication",
      "text": "quick home valuation, very good communication",
      "rating": 5,
      "date": "18th March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Amazing experience with SBS",
      "text": "I got a colleague Mortgage through SBS and the whole experience from start to end, me & my partner are first time buyers so never experienced buying a mortgage before. Everything was clear in the conversations and when we had any question's they were answered straight away, the process was really fast and we got the mortgage cheaper than we thought we would",
      "rating": 5,
      "date": "12th March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Helpful, friendly and efficient",
      "text": "Really pleased with their efficiency and customer service. Helpful and clear on the phone and quick with paperwork. The app is intuitive. Fab rates on savings",
      "rating": 5,
      "date": "26th February 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Friendly and helpful customer service",
      "text": "Friendly and helpful customer service",
      "rating": 4,
      "date": "26th February 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Long wait times for customer service",
      "text": "Long wait times for customer service and early exit fees still really high",
      "rating": 3,
      "date": "2nd April 2024",
      "product": "Mortgages",
      "sentiment": "mixed"
    },
    {
      "title": "Customers service",
      "text": "Very helpful when you call them. Explain products in details .",
      "rating": 5,
      "date": "17th August 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Fantastic Mortgage Provider",
      "text": "We have recently taken out a mortgage with Skipton. Their communication with our Financial Advisor was excellent. We were treated fairly and fast. The mortgage we have has a good rate. I am pleased with the easy access to view the mortgage information. Communication and notifications for the first payment were excellent we knew exactly what was happening. Very happy and would fully recommend Skipton..",
      "rating": 5,
      "date": "10th March 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Really good company to deal with",
      "text": "Excellent and professional. Would certainly use them again",
      "rating": 5,
      "date": "22nd February 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Straightforward and easy",
      "text": "We took out a mortgage through a broker and Skipton delivered the best offer by a long shot. They honored the timeframes they gave and the process was absolutely painless. The app is very easy to use to monitor payments. I have contacted their customer support for something small and had a good experience.",
      "rating": 5,
      "date": "22nd February 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great mortgage",
      "text": "Easy to use the app. It puts in in control",
      "rating": 5,
      "date": "22nd February 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Skipton fixed rate mortgage",
      "text": "Excellent customer service products and mortgage was easy to apply for",
      "rating": 5,
      "date": "21st January 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Good company",
      "text": "Very quick and reasonable to deal with",
      "rating": 5,
      "date": "15th July 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Conspiracers",
      "text": "Dont trust lots of fatal errors will let you down never admit no matter how vital they dont care will let you down reiterate lies to all including F O S avoid .",
      "rating": 1,
      "date": "26th April 2021",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "Flexible and Sensible approach to lending",
      "text": "Our situation was unusual in that my wife worked for the family business and took a wage cut during Covid. Skipton looked at matters for us from a personal viewpoint - we felt like they considered us a people, not just number crunching. Overall an amazing experience with friendly people who care.",
      "rating": 5,
      "date": "25th February 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Total failure to do their jobs constant cut and paste mentality zero adjustments for disabled customers",
      "text": "Terrible just terrible toward diverse customers... Where to start! Firstly they don't understand anything relating to disabled customers. Managers don't even deal with complaints always front line customer service advisor teams instead. Front line staff in the contact centre clearly have no disability awareness training and the same for departments behind the scenes as constant failures to even look at disability needs throughout all dealings. Clear a customer financially ok but then faff about no end to avoid having to lend. Weeks and months of endless LIVING HELL stress with constantly being passed about and cut and paste generic responses no regard for disabled customers accessibility needs or circumstances at all. Clearly don't understand the Equality Act at all. Even told me to go elsewhere! What a disgrace. For a company that advertises when your money is in a good place so are you... Clearly not living up to your values! Treating customers as individuals would be a good start. Quite happy to give lots of money to Mental Health UK as their charity partner but have zero regards for the distress of their failure to make disability accommodations has on their own members and customers. Don't even include full information in the complaints when submitted and issue final responses before they even compile the full information. \"This is our final response\" only to then read down the page where it says if we have missed any information please let us know... How can you issue a final reply without even referencing the content of the complaint??? Or even having used the full information you were supplied with...???!!!! Shambles doesn't even sum this up. HR seriously need to start educating about disability and train their staff on what the Equality Act means. So sad as you would think that with a presence and perception to the public of local service they would do well.",
      "rating": 1,
      "date": "18th April 2020",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "Excellent !",
      "text": "Great service and advice. Couldnt have done more to support me at a very difficult time.",
      "rating": 4,
      "date": "7th January 2019",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "DIP granted but full application declined after 2 week wait for decision!!!",
      "text": "Vey unhappy and annoyed that it took two weeks for them to tell me they were declining my full mortgage application. Underwriter made assumptions that I was upsizing and therefore made the assumptions that my outgoings will increase because if this. Nonsense! My current home is over 100 years old and the new premise was a new build and no bigger than what I live in now so will be far more energy efficient. Also quoted unrealistic figures when trying to justify her reasons for declining the mortgage. My husband and I both have very good credit scores as we have checked this with Experian and our records show we never miss or make any late payments. I can't understand how anyone with a ccj or bad debt can get mortgages but someone with a good record can't. The whole process has been long, drawn out and extremely stressful. Avoid at all costs!!!!!",
      "rating": 1,
      "date": "3rd October 2016",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "Loyalty is rewarded again and again",
      "text": "Constantly offering great rates and products for loyal customers",
      "rating": 5,
      "date": "12th June 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "easy to use and great rates.",
      "text": "easy to use and great rates. Simple online website. Extra benefits for members are worthwhile and I have taken some up.",
      "rating": 5,
      "date": "12th June 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Long standing customer who has had good service up u...",
      "text": "Long standing customer who has had good service up until now. I renewed an isa bond which pays the interest monthly to an external account and worked fine up untill I renewed in March. Now the interest isnt showing and the online chat just says the admin dept are dealing with it and will take 15 working days. Really unhappy about it. If I owed them money on a mortgage it would be different I'm sure. Other than complaining does anyone know of the procedure for taking this further?",
      "rating": 2,
      "date": "28th April 2025",
      "product": "Savings",
      "sentiment": "negative"
    },
    {
      "title": "Transfers are quick and easy with instant confirmation",
      "text": "Transfers are quick and easy with instant confirmation",
      "rating": 5,
      "date": "15th April 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Really excellent customer service, they always expla...",
      "text": "A good range of savings products from a building society you can trust. Really excellent customer service, they always explain things so clearly.",
      "rating": 5,
      "date": "4th April 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Great service",
      "text": "Fantastic service at the Taunton branch with excellent rates on their ISA products.",
      "rating": 5,
      "date": "2nd April 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "nt twelve months ago.",
      "text": "Opened an account twelve months ago. Always polite service when l have to visit. Noticed other staff being really helpful + patience to help others.",
      "rating": 5,
      "date": "26th March 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Initially started an account from Accrington branch...",
      "text": "Initially started an account from Accrington branch the lady ( sorry can't remember her name now was very good at explaining what was on offer we chose an account convenient for us. Sadly Accrington branch closed went into Clitheroe and one of the ladies Ann was someone I knew from my school class over 50 years ago! Also young girl Laura who is lovely. We are happy with Skipton very friendly informative and would highly recommend to family and friends",
      "rating": 5,
      "date": "25th March 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "So easy to transact with",
      "text": "I have a couple of savings accounts with Skipton. They are extremely responsive. Offer good interest rates and the App is so easy to use.",
      "rating": 5,
      "date": "24th March 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "I had a twelve month fixed rate bond that matured w...",
      "text": "I had a twelve month fixed rate bond that matured while I was hospitalised I was unable to get in touch with the skipton, when I was eventually discharged from hospital I went to my local branch to give instructions only to find out that the skipton had second guessed my intentions and reinvested my money into another twelve months bond which is exactly what I wanted .I know that other banks deposit your money into a measly account paying a very low rate of interest but not the skipton ,they did what was best for the customer",
      "rating": 4,
      "date": "21st March 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Rang today to upgrade my cash ISA the young man was...",
      "text": "Rang today to upgrade my cash ISA the young man was very helpful",
      "rating": 5,
      "date": "21st March 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Man I spoke too could not speak English well and fou...",
      "text": "Man I spoke too could not speak English well and found it.difficult to understand",
      "rating": 3,
      "date": "21st March 2025",
      "product": "Savings",
      "sentiment": "mixed"
    },
    {
      "title": "Very good customer experience in the branch at Keigh...",
      "text": "Very good customer experience in the branch at Keighley",
      "rating": 5,
      "date": "18th March 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Went to branch last month.",
      "text": "Went to branch last month. Excellent service and advice",
      "rating": 5,
      "date": "17th March 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Good rates for loyalty.",
      "text": "Good rates for loyalty and good service over the phone",
      "rating": 4,
      "date": "17th March 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Friendly, efficient, to the point without pressure t...",
      "text": "Friendly, efficient, to the point without pressure to make decisions, well informed staff and confident in the process.",
      "rating": 5,
      "date": "16th March 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Customer service",
      "text": "My interactions with all the staff at Skipton has been positive. The make me feel important and valued.",
      "rating": 5,
      "date": "15th March 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Simple and efficient",
      "text": "Opening a savings account online was very simple and efficient. Initial rates are good compared to market and they offer better rates once established as a member. There are also still branches!",
      "rating": 5,
      "date": "15th March 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Been with Skipton 3 years very happy",
      "text": "Been with Skipton 3 years very happy",
      "rating": 5,
      "date": "15th March 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Good service and one of the few bank/building societ...",
      "text": "Good service and one of the few bank/building societies that still have many branches in towns and cities around the United Kingdom",
      "rating": 5,
      "date": "15th March 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Friendly with competitive products",
      "text": "Very pleasant communication/interaction. Friendly Building society with good range of competitive products. Good interest rates and options for instant access and fixed term savings.",
      "rating": 5,
      "date": "14th March 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Skipton have looked after my money extremely well.",
      "text": "Skipton have looked after my money extremely well. They have investment products that are just right for me.",
      "rating": 5,
      "date": "14th March 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Moving Forward",
      "text": "They have been most helpful in my journey post death of my husband and subsequent downsizing of property",
      "rating": 5,
      "date": "14th March 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Got a good rate on savings not tied up either which...",
      "text": "Got a good rate on savings not tied up either which is flexible for our joint account the rate is competitive to the ISA's and we ate suited with this account I haven't got the name of the account to hand but it's a variable saving's account and so far been really good rate for what we have invested in recommend anyone to call in their local branch of Skipton BS who are happily able to help! Give them a visit you won't be disappointed.",
      "rating": 5,
      "date": "13th March 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "savings over app",
      "text": "seamless app experience, clear and user friendly. ability to open accounts in app. clean uncluttered interface. helpful guidance and ability to chat with customer service reps.",
      "rating": 5,
      "date": "13th March 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "As a long-standing customer you gave me terrible ser...",
      "text": "As a long-standing customer you gave me terrible service today. Your systems are lousy. You have lost me forever and I shall be investing in the Nationwide instead.",
      "rating": 1,
      "date": "13th March 2025",
      "product": "Savings",
      "sentiment": "negative"
    },
    {
      "title": "Friendly and knowledgable staff in my local branch.",
      "text": "Friendly and knowledgable staff in my local branch. I always feel welcome and never rushed",
      "rating": 5,
      "date": "13th March 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Great experience in branch very friendly and helpful...",
      "text": "Great experience in branch very friendly and helpful, however the app could be improved to help me better manage my money.",
      "rating": 4,
      "date": "13th March 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "I find Skipton BS one of the better building society...",
      "text": "I find Skipton BS one of the better building society, offering a good range of savings accounts with a good interest rate. The site and app are easy to use and I can do everything I need too online. I find it easy to open new accounts and renew them all online. Skipton offer a good range of different ways to save from easy excess accounts, to bonds, ISA's and save as you go accounts.",
      "rating": 5,
      "date": "1st March 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Skip to Skipton Building Society *****",
      "text": "Always alert me to any changes in savings rates. Always treat me like a valued customer",
      "rating": 5,
      "date": "26th February 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Straightforward and smooth from start to finish",
      "text": "Straightforward and smooth from start to finish",
      "rating": 5,
      "date": "28th January 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Excellent experience with Skipton Building Society",
      "text": "I’ve had an excellent experience with Skipton Building Society! Their customer service is outstanding—friendly, helpful, and genuinely interested in finding the best solutions for your needs. Whether in-branch or online, the process is smooth, transparent, and straightforward. Their savings products are competitive and well-suited for various goals, and I particularly appreciate their no-pressure approach when discussing mortgages or investments. The app and online banking platform are also very user-friendly, making it easy to stay on top of your accounts. It’s clear they prioritize their members' needs and maintain a personal touch, which is rare these days. I would highly recommend Skipton to anyone looking for a trusted and reliable financial institution.",
      "rating": 5,
      "date": "27th January 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "I have a LISA with Skipton and has never had any pro...",
      "text": "I have a LISA with Skipton and has never had any problems. Bonuses are paid always.",
      "rating": 5,
      "date": "27th January 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Excellent service.",
      "text": "Excellent service. Accessible via chat and my query was dealt with promptly.",
      "rating": 5,
      "date": "27th January 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Mortgage Application was sent on the Friday and the...",
      "text": "Mortgage Application was sent on the Friday and the Offer was received back the following Wednesday. This was the quickest process I have experienced, it was really easy.",
      "rating": 5,
      "date": "27th January 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Always go the extra mile when I need it",
      "text": "Always go the extra mile when I need it",
      "rating": 5,
      "date": "27th January 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Overall good",
      "text": "overall good but i do think that the app is not great & could be far more advanced like others. The rates are not always the best but very competitive",
      "rating": 5,
      "date": "27th January 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Excellent customer service",
      "text": "Great service always on the telephone. Really enjoy the skipton app",
      "rating": 5,
      "date": "27th January 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "My friend finds Skipton Building Society’s savings p...",
      "text": "My friend finds Skipton Building Society’s savings products reliable, with competitive interest rates and excellent customer service",
      "rating": 5,
      "date": "27th January 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "I called them and they picked up the call straight a...",
      "text": "I called them and they picked up the call straight away and they were more than happy to help me. They hire inside UK too.",
      "rating": 5,
      "date": "27th January 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Great remortgage experience",
      "text": "I remortgaged to Skipton and have found the process to be very straightforward and have had a good experience with Natalie.",
      "rating": 5,
      "date": "27th January 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "amazing and incredible and very good",
      "text": "amazing and incredible and very good",
      "rating": 5,
      "date": "27th January 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Always have the time to talk to you like a human and...",
      "text": "Always have the time to talk to you like a human and not just a stat",
      "rating": 5,
      "date": "27th January 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Great customer service from the staff in branch maki...",
      "text": "Great customer service from the staff in branch making my fixed rate maturity easy and quick. Had a lovely chat with the staff who told me about my benefits being with Skipton",
      "rating": 5,
      "date": "16th January 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "I’ve had a savings account with Skipton for many yea...",
      "text": "I’ve had a savings account with Skipton for many years, and in recent years opened an ISA. The process was so smooth and the staff so helpful. I also have the mobile banking app which is so easy to use",
      "rating": 5,
      "date": "14th January 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Cannot transfer funds, no customer service solution",
      "text": "My Husband has (soon to be had) a savings account with Skipton for 1 yr. He wanted to move some funds but the app said he needed to use his nominated phone (he only has one phone) however his phone would not let him enter the secure number. He called customer service to ask for support and they said they could do nothing as his only phone was not registered... To get his phone activated he had to take in photo ID to a branch, (as branches are closing) the nearest is central London and will take a 4hr round trip. Alternatively he can wait 3-5 days for a form and get his ID verified by a solicitor. Neither option are very modern or user friendly. He is now writing to the CEO Stuart Haire, [email protected] to complain about this unacceptable process which only became apparent when he wanted to move money and will now take approx 14 days to do and he will miss the deadline he needs to meet.",
      "rating": 1,
      "date": "7th October 2024",
      "product": "Savings",
      "sentiment": "negative"
    },
    {
      "title": "A clunky not so ethical building society",
      "text": "Has some great products including low value fixed savings, and reg savers, plus the app is easy to use. One of my accounts matured, but getting the money out required logging into the desktop and setting up nominated bank account.. for each of the accounts I had; 4. Took more effort than needed, and meant I received 4 paper letters to confirm the changes. They're powered by Barclays which has terrible green credentials, ill fitting for the ethics of a building society.",
      "rating": 4,
      "date": "9th September 2024",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Overall.",
      "text": "At present they have competitive rates and a presence on my High Street.",
      "rating": 5,
      "date": "4th September 2024",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Seamless, easy LISA",
      "text": "I had a Skipton LISA for a number of years, everything was easy to set up, the app was easy to use and navigate and when i came to buy a house with that money as the deposit the whole process was seamless.",
      "rating": 5,
      "date": "18th June 2024",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Rewards loyalty and excellent to deal with",
      "text": "Skipton have rewarded loyal savers more than most banks and building societies over the past year, and have been a pleasure to deal with whenever I've needed to contact them. The product terms are often very clear and they provide excellent flexibility for savers. They are one of my favourite financial institutions andI'll remain a customer for many years to come.",
      "rating": 5,
      "date": "11th April 2024",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Professional, helpful and decent without pressure.",
      "text": "Excellent advice given and time spent on investing for better savings. No intrusive or controlling behaviour just incredibly helpful, actually knowledgeable and professional from the call centre to the bank staff especially at Ilkley. Super clear communication and actively try to help you not just sign you up. It’s like having an accountant, investment advisor and expert all in one and you still don’t feel pressured. Been wonderful so far for my savings.",
      "rating": 5,
      "date": "10th April 2024",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Great family society",
      "text": "Great value rates and always a friendly face if you need to speak to over the phone or in-branch. Efficient and quite technologically advanced for a building society, transfers usually only take a couple of hours. I also find them excellent for child savings. Just wish they had a Fairer Share like Nationwide!",
      "rating": 4,
      "date": "11th March 2024",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Good saving rates for bondsmonthly intrest",
      "text": "Good rate for fixed bonds paying monthly intrest",
      "rating": 4,
      "date": "15th February 2024",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Skipton psych service is really good",
      "text": "Skipton psych service is really good",
      "rating": 3,
      "date": "15th February 2024",
      "product": "Savings",
      "sentiment": "mixed"
    },
    {
      "title": "Helpful staff, limited support hours",
      "text": "I like Skipton. It's a smaller building society with lovely, helpful staff and convenient branches. App and online banking are convenient, the app being functional but not perfect. Skipton sometimes offer competitive products, and their customer service is helpful. However, the limited hours that support is available is seriously limiting, as is the fact that bank transfers can only be completed Monday to Friday before 9pm.",
      "rating": 5,
      "date": "8th January 2024",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Solid trustworthy company",
      "text": "I’m so pleased I found Skipton B S Their rates are good and their customer service excellent.",
      "rating": 5,
      "date": "30th August 2023",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "So very helpful thank",
      "text": "Explained everything in simple terms and helped me wi5h my application to open the account",
      "rating": 5,
      "date": "19th July 2023",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Poor interest rate",
      "text": "Poor interest rate on investments",
      "rating": 2,
      "date": "18th July 2023",
      "product": "Savings",
      "sentiment": "negative"
    },
    {
      "title": "Reliable friendly bukding Society",
      "text": "I place trust in the Skipton and its friendly local branches",
      "rating": 4,
      "date": "30th April 2023",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Amazing if you can wait for the money",
      "text": "The bonus 25% is amazing but if you need to withdraw early for something other than a first home then you will not see that bonus.",
      "rating": 4,
      "date": "11th April 2023",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Fab product for first time buyers",
      "text": "Absolutely love the Lifetime ISA helping people like myself save more towards a deposit.",
      "rating": 5,
      "date": "5th April 2023",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Wonderful",
      "text": "It has been to easy to set up my savings account and the rates a great too!",
      "rating": 5,
      "date": "4th April 2023",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Honest Building Society",
      "text": "Good Customer Service Great App Plenty Of Choice Of Accounts",
      "rating": 5,
      "date": "16th March 2023",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Great lifetime isa",
      "text": "Easy to set up, could see the government money going in each month with helped with savings",
      "rating": 5,
      "date": "10th March 2023",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Best rate for flexible isa",
      "text": "Best rate available for flexible isa , automatically increase",
      "rating": 4,
      "date": "27th February 2023",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Love my lifetime ISA",
      "text": "I've managed to save so much with Skipton. I can't thank them enough. I'm nearly at my goal deposit. The app is easy to use and I trust them as a company.",
      "rating": 5,
      "date": "19th January 2023",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Fixed term savings",
      "text": "I have recently converted an obsolete savings account to a fixed term savings. The process was easy once I was through to the right person. I am also relieved to see Skipton getting positive reviews for their tree planting.",
      "rating": 4,
      "date": "17th January 2023",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "INCREASED CO2, INCONVENIENCE AND LOW INTEREST ...THATS GOOD!",
      "text": "(As per Skipton BS)! When you discover the account you opened only a few months ago is only paying three quarters the rate new investors are getting, Skipton say that's OK, because you can:- 1)Watch the website like a hawk for new rates 2)Phone up to make an appointment to get updated account (Can take 40 mins to get through). 3)Drive in spending on petrol and parking and increasing CO2. 4)Use your own time, and staff time, transferring to a near identical new account to gain a few pennies interest.(That's why you can't just call in and do it, but need an appointment ... The staff are too busy transferring funds to near identical accounts!) 5)Complete transfer to the new account. After this:- 6)Skipton bring out an account within a few months offering a better rate to new investors. 7)You repeat 1,2,3,4 and 5. 8)Skipton repeat (6) 9)You repeat 1,2,3,4,5,and 7 10)They repeat 6 and 8 .... And so on ad finitum! You lose the will to live and complain. They say:- It's OK:- You can watch the website like a hawk and phone up for an appointment to transfer to a new account ...... again!",
      "rating": 1,
      "date": "22nd December 2022",
      "product": "Savings",
      "sentiment": "negative"
    },
    {
      "title": "ROBBING LOYAL CUSTOMERS!",
      "text": "Skipton's approach these days seems to be to constantly degrade existing customers accounts to ensure they pay less interest than they do new customers (Beware new customers, your time will come!). In the case of my ISA an account opened last year had been degraded to about 75% of the rate offered new investors! And account had already been changed by me last year because exactly the same had happened then! If you don't keep checking, you lose interest. If you do check, you waste time going in to \"upgrade\" account , causing inconvenience, and extra CO2 caused by extra unnecessary visits! They say they all do it, but compare Nationwide and Family/National Counties who have treated loyal customers fairly throughout. When it's re-opened, it's the same money as before, but change is necessitated by Skipton constantly moving the Goal posts. Come on Skipton, start treating long term loyal customers fairly. You wouldn't be there without us!",
      "rating": 1,
      "date": "1st November 2022",
      "product": "Savings",
      "sentiment": "negative"
    },
    {
      "title": "Simple online procedure and help at hand",
      "text": "I opened a fixed rate bond online and it was pretty simple - a couple of questions which were answered instantly via online chat",
      "rating": 4,
      "date": "1st August 2022",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Lifetime ISA makes saving easy",
      "text": "Hoping to buy our first home, but struggling to put away much money to get the deposit. I heard about Skipton from a friend and now my partner and I both have a LISA and find it easier to put money away knowing the gov top up anything we save. It also stops us from spending it. The accounts were easy to set up and information clear to understand, on the few instances I’ve spoken to staff they have been knowledgeable and friendly. The app is also nice and easy to use.",
      "rating": 5,
      "date": "29th March 2022",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Horrible - difficult to withdraw your own money!",
      "text": "If you ever need to withdraw your entire funds from a savings account at Skipton to buy a house, you'll go through hell and high water to get YOUR money out, even from a flexible savings account. They will drag it out 4 weeks or so and many many calls of absolute misinformation. First they tell you it is being processed one week. Two weeks later someone will tell you they need a letter from your solicitor to authorise a withdrawal of YOUR funds. Unbelievable! Their customer service is appalling with one person telling you it is being processed and then another putting a stop on the transfer to YOUR bank account and this will likely go on for 4-6 weeks. If you happen to be managing funds for someone with a legitimate legally recognised and registered Power of Attorney (with the Office of Public Guardian), well they refuse to recognise it even though months prior, they acknowledged it. They can't tell you what law they use to refuse withdrawal of funds, because clearly they are acting illegally. They will tell you that THEY will decide if purchasing a house by the account holder in the account holder's name is the right thing for that account holder. Really! Since when did the consumer entrust their purchasing power and freedom to a building society? Since when did we hand over that freedom? I don't recall they had the right to manage funds over and above the Lasting Power of Attorney. Stay away from this horrible organisation who think the consumer account is their money. There are plenty of other reputable financial institutions to choose from who operate more ethically and morally. Customer service and my review would be negative 10 (-10) if I could give such a rating here.",
      "rating": 1,
      "date": "12th October 2021",
      "product": "Savings",
      "sentiment": "negative"
    },
    {
      "title": "Maturing Online ISA Instruction Difficulties",
      "text": "After 5 year ISA maturing online account. Wanted to withdraw all funds including closing interest. Was very confusing online and tried for over 45 mins to get through to help desk. Left message for a call back and never received. Eventually through web chat I think I managed to get assistance. Obviously online account is not user friendly. A total waste of about 90 mins of my time Their current interest rates are currently uncompetitive but even if they were I wouldn't be using them again. A total waste of about 90 mins of my time",
      "rating": 3,
      "date": "6th October 2021",
      "product": "Savings",
      "sentiment": "mixed"
    },
    {
      "title": "as good as any other but more personable",
      "text": "great customer service in all branches i have been to. know their products well too.",
      "rating": 4,
      "date": "24th September 2021",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Excellent Building Society",
      "text": "Skipton have just launched a regular saver account for existing customers, paying 3.50% interest. This is an excellent rate. I have always found the staff at Skipton to be friendly and helpful. The app and service from staff are really excellent - it is easy to send a direct mail via the app, and I can see all of my former accounts and the interest rates. Everything is simple to use and well thought through.",
      "rating": 5,
      "date": "29th August 2021",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Invaluable when not much choice out there",
      "text": "When searching for a way to save for a house 3 years ago, Skipton were one of the few offering lifetime ISAs. They have allowed me to save consistently and securely.",
      "rating": 5,
      "date": "24th March 2021",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "The Lifetime ISA is the Gift that Keeps on Giving",
      "text": "I have been a Skipton Building Society customer for over 3 years now, and it is without a doubt one of the best decisions I have made in my adult life. The first product I used was the Lifetime ISA. Without this account I would not be the position I am in right now where I can put in offers on properties to buy. The 25% interest applied to any savings is frankly incredible! The fact that savings in a Lifetime ISA can only be withdrawn (without penalty) for a first-time buyer mortgage or retirement has been fantastic as it has allowed me to commitment to saving for my future. Admittedly, without the penalty I may very well have wasted a significant proportion of my savings instead of securing it for my future. I will be forever grateful for this product from Skipton Building Society and I know that it has given me the 'leg up' that I needed towards being able to buy my first home!",
      "rating": 5,
      "date": "9th July 2020",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Interest rates dropped through the floor",
      "text": "After being with Skipton for 3 years and the BoE rate drop the rates applied to the isa have dropped steeply.",
      "rating": 3,
      "date": "27th April 2020",
      "product": "Savings",
      "sentiment": "mixed"
    },
    {
      "title": "Lifetime isa",
      "text": "An excellent product which sees the government reward you for saving by adding to your savings in line with the amount that you save up to a maximum of £4,000.00 per year for a set period of time within prescribed timescale. All money paid out when you reach age 60 years, ideal savings plan to benefit you at retirement.",
      "rating": 5,
      "date": "9th February 2020",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Quit renting",
      "text": "Great way to focus on getting money into an account and it costs more to withdraw, provides a focus if saving for something like a first home",
      "rating": 5,
      "date": "24th January 2020",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Lisa",
      "text": "A really great experience with Skipton. Fantastic from start to finish and helped me on the journey to owning my own house",
      "rating": 5,
      "date": "22nd November 2019",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Local",
      "text": "A few local branches, however interest rates have been decreasing",
      "rating": 4,
      "date": "22nd November 2019",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "One of the few products on the market",
      "text": "Competitive rate with the other 2 products on the market for Cash LISAS",
      "rating": 4,
      "date": "15th April 2019",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Lifetime Isa for first home",
      "text": "One of the few banks to offer a lifetime isa and make it easy to understand through their website. The ISA can be managed online and email notifications let you know when the bonus is being applied. Very good and informative bank making it easy for young professionals to hop onto the property ladder.",
      "rating": 4,
      "date": "12th January 2019",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Great product",
      "text": "Great service, easy to use and have recommended to various friends",
      "rating": 5,
      "date": "9th January 2019",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "They're one of the few that offer a Cash LISA",
      "text": "It's been a smooth process and due to the method of transferring the HTB to LISA i got 25% for the entire HTB balanced (which ended on the last tax year). Couldn't be happier.",
      "rating": 4,
      "date": "9th November 2018",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Simple and Efficient",
      "text": "Skilton Life ISA was simple to set up, easy to deposit money each month and the HMRC bonus is instant for helloing first time buyers. The house value is limited to £250k for the U.K. on a help to buy but the Life ISA is £450k",
      "rating": 5,
      "date": "8th November 2018",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "One of the best interest rates out there",
      "text": "Very friendly , convenient branch banking",
      "rating": 5,
      "date": "6th November 2018",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Lifetime ISA",
      "text": "Unique opportunity for first time buyers to get onto the property ladder and give themselves security in retirement.",
      "rating": 5,
      "date": "14th January 2018",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "The only company to offer an online cash lifetime ISA.",
      "text": "Reliable, unique opportunity to invest in a cash lifetime ISA to give people the opportunity to get on the property ladder or secure retirement.",
      "rating": 5,
      "date": "14th January 2018",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Helping us where the big banks let us down",
      "text": "Skiptons did an amazing job launching the lifetime isa. At a time where house prices are higher than ever it has never been harder to be a first time buyer! Skiptons are giving us a method to cut through the pain and get into our first home quicker!",
      "rating": 5,
      "date": "8th January 2018",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Great Savings Product",
      "text": "I have encouraged both of my children-aged 18 and 20- to open a LISA with Skipton this year. It is great to know that they will both be saving for a house deposit in the future and getting a great bonus. The easy online application helped a great deal.",
      "rating": 5,
      "date": "1st January 2018",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Great advice and customer service",
      "text": "I have had really good advice from the Skipton. No pressurised selling, friendly helpful staff and they contact you if there is a better deal to be had.",
      "rating": 5,
      "date": "8th November 2017",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Only Cash LISA on the market",
      "text": "its been smooth for the most part hoping to transfer in my H2B ISA soon.",
      "rating": 3,
      "date": "7th November 2017",
      "product": "Savings",
      "sentiment": "mixed"
    },
    {
      "title": "Could do better",
      "text": "I never really got on with Skipton Building Society. I could not seem to get their online account to work, and I do everything online now so this is a huge annoyance. The staff in my local branch have always been nice and polite though so that is a positive. Unsure whether I'd recommend though, would depend on the person.",
      "rating": 3,
      "date": "5th July 2017",
      "product": "Savings",
      "sentiment": "mixed"
    },
    {
      "title": "Skipton Building Society",
      "text": "I've never had a problem with Skipton Building Society yet. They are always very helpful whenever I go into branch and always try to help me get the best return on my money. I would recommend Skipton to others. The one issue I have is that I don't find their website very user friendly but if you live close enough or have transport then you can pop into branch.",
      "rating": 4,
      "date": "22nd June 2016",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Great sevice by friendly competent staff ,",
      "text": "We have had a saving account with The Skipton for 8 years , The company advise other options so you are always on the best scheme . The staff always competent ,knowledgeable and friendly . I wouls reccomend them to friends and famuily",
      "rating": 5,
      "date": "19th February 2016",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Excellent service in branch",
      "text": "My branch of the Skipton maybe small but the service is really excellent. I love the 1 year saver account which I use to save for Christmas, very easy to manage with a good interest rate",
      "rating": 5,
      "date": "24th December 2015",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Friendly and easy to manage",
      "text": "Fantastic service in branch makes it a delight to have this account with the Skitpon.",
      "rating": 5,
      "date": "19th October 2015",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Helpful and clear staff.",
      "text": "Created a cash ISA with Skipton due to the competitive offer due to other companies. One of the most helpful meetings I have had with staff when setting up an ISA, and received a lot of clear advice about the investment I was making.",
      "rating": 5,
      "date": "25th August 2015",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "On-line Saver with 4% interest",
      "text": "I have been a customer of Skipton Building Society for the last 20 years and in January this year they brought out a fixed rate on-line savings account paying 4% interest for the first year. I think this is one of the most competitive rates I've seen for a few years. They are always very easy to deal with - either in the local office or when you telephone their UK based office. When I had to \"wind\" up my parents estate last year after their passing they were most compassionate and helpful. Every so often they have a deal on where they will do a free Will writing campaign, which I took advantage of last year. When the interest rates change on any savings account - they always write to you well in advance so that you can move your money to a higher paying account. I would recommend Skipton as a trustworthy Company to invest in.",
      "rating": 5,
      "date": "9th August 2015",
      "product": "Savings",
      "sentiment": "positive"
    }
  ]
}