{
  "society": "Stafford Railway Building Society",
  "slug": "stafford-building-society",
  "smpUrl": "https://smartmoneypeople.com/stafford-building-society-reviews/products",
  "totalReviewsOnSMP": 49,
  "avgRating": 4.69,
  "scrapedAt": "2026-02-06T16:07:42.369676+00:00",
  "reviews": [
    {
      "title": "I was really glad to find a lender that understood m...",
      "text": "I was really glad to find a lender that understood my situation. A single person with a 100k plus deposit, and a modest income. The only downside to my experience, was the time it took to get the mortgage agreed. Especially the second time. Unfortunately I started the process of buying a property, and the seller sadly died. Meaning I had to look for another property. Getting the second mortgage agreement seemed to take a long time (the first time wasn't exactly swift, either) and this really caused me stress in terms of not wanting to lose out on the second property, to a buyer who was able to get their mortgage agreed more quickly. I didn't have much direct contact with The S B S, as I had paid for a mortgage advisor to take care of that for me, and they advised that as SBS was smaller, it might take longer than a highstreet lender, which I understood, but still didn't alleviate the stress for me. But overall I am happy with my mortgage and the terms and etc.",
      "rating": 4,
      "date": "26th January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Straight forward getting a mortgage and prompt repli...",
      "text": "Straight forward getting a mortgage and prompt replies to solicitors emails.",
      "rating": 5,
      "date": "26th January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "I got a mortgage so I’m very happy with their services.",
      "text": "I got a mortgage so I’m very happy with their services. Thanks!",
      "rating": 5,
      "date": "9th January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Superb service in every way since May 2016",
      "text": "We first moved our mortgage to the Stafford when we moved house in 2016 and then stayed when we moved to our current home 3 years ago. Customer service has been superb throughout, always keeping us informed of changes in the rate and offering new fixed deals when a current one was due to end. Can’t praise you highly enough.",
      "rating": 5,
      "date": "25th November 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent phone service and always helpful.",
      "text": "Excellent phone service and always helpful.",
      "rating": 5,
      "date": "24th September 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Decisions take an extremely long time, like even for...",
      "text": "Decisions take an extremely long time, like even for a basic thing such as an updated mortgage offer. The Society then puts in place ridiculously draconian processes for completion such as submitting the latest payslip before completing and insisting on buildings insurance being in place.",
      "rating": 1,
      "date": "9th September 2025",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "Stafford are the best!!",
      "text": "It is an absolute pleasure to deal with all the lovely staff at The Stafford Building Society and their products are superb!",
      "rating": 5,
      "date": "8th September 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Friendly and pleasant.",
      "text": "Friendly and pleasant. The new environment is modern and light and airy. I did like the old world charm of the previous design.",
      "rating": 5,
      "date": "24th August 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Meticulous and prompt",
      "text": "There is so much information needed to get the mortgage approved but I expect this is common to all providers nowadays - SBS were meticulous about this but very prompt with the final agreement and transfer of funds",
      "rating": 5,
      "date": "9th August 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very grateful!",
      "text": "Very grateful! We had been rejected by a previous mortgage lender in what felt like a very impersonal and unfair way. Stafford has a much more personal touch, we really felt like they were assessing us as actual people rather than just a business transaction. We're delighted with the service we've had so far.",
      "rating": 5,
      "date": "8th August 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "No hassle very prompt service good people to deal with",
      "text": "No hassle very prompt service good people to deal with",
      "rating": 5,
      "date": "7th August 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Best mortgages with the best staff!",
      "text": "We have had our UK Investment mortgage with The Stafford since 2017. We have found them to be excellent and very user friendly to deal with. Never had a problem with them in all our dealings. Great competitive rates and excellent products. Highly recommend The Stafford.",
      "rating": 5,
      "date": "18th July 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Alison Tarling",
      "text": "Had an issue with a mortgage offer and having to change solicitors, it could have been a real headache but Alison Tarling on the mortgage administration team was on hand to do all she could to help with the situation, keeping constant communication throughout. Absolute God send thank you for all your help",
      "rating": 5,
      "date": "19th April 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Straightforward mortgage - quick, efficient and problem-free",
      "text": "I took out a mortgage with the SRBS after a disastrous experience with a so-called \"interest-only\" mortgage lender. The SRBs was excellent, all arranged in a few days entirely without problems, Assessments of financial suitability etc are by real people, not a computer algorithm, and I can unreservedly recommend the SRBS for anyone looking for a straightforward mortgage. One final point; in the past, almost all the Society's properties were in Stafford and district, but now they can lend anywhere in England.",
      "rating": 5,
      "date": "11th April 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Best Customer Service",
      "text": "We moved our investment mortgage to the SRBS about 2 years ago. They are excellent to deal with and although we reside from outside the UK the process of delaing with them online and through email was flawless. I wish other banks and building societys were run like the SRBS. Highly recommend them to anyone looking for a mortgage. You won't be disppointed with them",
      "rating": 5,
      "date": "13th May 2020",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "was great service",
      "text": "wold highly reccomend them they have great staff who are of the utmost help",
      "rating": 4,
      "date": "29th April 2015",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Attractive range of saving products and interest rates",
      "text": "Wide range of saving products. Attractive interest rates. Local presence - local branch with helpful and courteous staff.",
      "rating": 5,
      "date": "30th January 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Kind and considerate",
      "text": "All staff are kind and considerate and know their role",
      "rating": 5,
      "date": "30th January 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "The Best Building Society",
      "text": "I have been with Stafford Railway for many, many years, and throughout that time the standard of service has remained consistently first class. The staff are unfailingly friendly, professional, and genuinely helpful. At a time when so much so called progress among high street banks seems to mean removing the human element, it is a real pleasure to deal with an organisation that still values it.",
      "rating": 5,
      "date": "29th January 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Excellent",
      "text": "Always friendly nothing too much trouble.",
      "rating": 5,
      "date": "26th January 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "For a local building society it needs to offer the b...",
      "text": "For a local building society it needs to offer the best rates around, but typically doesnt.",
      "rating": 2,
      "date": "26th January 2026",
      "product": "Savings",
      "sentiment": "negative"
    },
    {
      "title": "Helpful pleasant staff at all times.",
      "text": "Helpful pleasant staff at all times. Always up for a chat even though I probably distract them with my boring banter.",
      "rating": 5,
      "date": "24th January 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Great personal engagement",
      "text": "Great personal engagement, by phone and in main branch",
      "rating": 4,
      "date": "23rd January 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Efficient teamwork",
      "text": "Efficient front of house, clear knowledgeable, and concise service. Support offered and a clear pathway of action to follow",
      "rating": 5,
      "date": "23rd January 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Visited to transfer some money.",
      "text": "Visited to transfer some money. Excellent and professional service",
      "rating": 5,
      "date": "22nd January 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Lovely place.",
      "text": "Lovely place. Friendly and professional staff",
      "rating": 5,
      "date": "17th January 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "ISA Savings book updates no problem!",
      "text": "Clare was extremely helpful in providing an update to my ISA savings book for 15 years of interest. There was a minor issue with my first name being spelled incorrectly on the SRBS system but after providing my driving licence as proof of name and address this was resolved swiftly.",
      "rating": 5,
      "date": "15th January 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "You can't beat personal service",
      "text": "I visited the Stafford branch to arrange a bank transfer & was served by Clare who was personable & efficient. Because I hadn't used my savings account in a while, it had to be reactivated. Clare explained the process & it was soon sorted.",
      "rating": 5,
      "date": "30th December 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Being dealt with by clare",
      "text": "I visited today to pay into my savings account , there was a teller free so i was dealt with straitaway , very polite very professional and quick.",
      "rating": 5,
      "date": "19th December 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Applyong a Power of Attorney",
      "text": "I visited branch to apply a power of attorney to my mom's savings account. The ladies in branch were more than helpful. They explained the next steps for me and in the end it was all quick and easy.",
      "rating": 5,
      "date": "13th December 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Served by Karen Very friendly and helpful.",
      "text": "Served by Karen Very friendly and helpful. Answered all my questions and gave good advice. Explained if l have issues to get to the building society l could access on line or phone.",
      "rating": 5,
      "date": "12th December 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "A safe home for your money savings",
      "text": "I called at the branch to open a savings account, which was arranged by a friendly and efficient staff member. My passbook arrived a few days later, and I made the initial deposit by telephoning the branch using my debit card. One comment; I had hoped to make the initial deposit when I opened the account, as I did when I opened an ISA, but this was not possible.",
      "rating": 5,
      "date": "10th December 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Great experience",
      "text": "Great customer service sorted out my account problem with my wife having dimentia POA all sorted",
      "rating": 5,
      "date": "24th November 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "The team are professional, friendly and incredibly k...",
      "text": "The team are professional, friendly and incredibly knowledgeable.",
      "rating": 5,
      "date": "14th November 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Above and beyond",
      "text": "I went into the branch this morning as last visit I left behind my passbook cover unfortunately. I asked Wendy and Debbie if they had a spare one. They looked hard but couldn’t see one and advised me to ask next time I’m in. I went on my way. They then left a message to say they had found one for me. I returned to the branch and was given one by Wendy and Debbie. They really went above and beyond. Thank you, I’m really grateful fir this.",
      "rating": 5,
      "date": "16th October 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Excellent customer service.",
      "text": "Excellent customer service. Super helpful and friendly. Would always recommend.",
      "rating": 5,
      "date": "10th October 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Amazing.",
      "text": "Amazing. Spoke with all three staff at the counter at some point (Karen, Claire, can't remember the third's apologies). Exceptionally helpful and attentive. Information passed to me was clear and concise and all my queries were answered no matter how silly the question. Highly recommend. Thank you.",
      "rating": 5,
      "date": "9th October 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Happy customer",
      "text": "Have had a few accounts over a number of years, and the staff have always been friendly and helpful, and answered any questions, even staff in training, will always make a point of asking other staff for advice if they don't know",
      "rating": 5,
      "date": "1st September 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "The process of opening two separate accounts was easy.",
      "text": "The process of opening two separate accounts was easy. One was carried out online and the other in office. The latter was conducted by staff who were friendly, helpful and professional.",
      "rating": 5,
      "date": "11th August 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Very helpful staff - good advice and easy to make ap...",
      "text": "Very helpful staff - good advice and easy to make appointment for further help. Bit of a wait in branch but the fact they're busy is good!",
      "rating": 5,
      "date": "7th August 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "very easy to open an account online and set up my mo...",
      "text": "very easy to open an account online and set up my monthly standing order and my passbook arrived very quickly ( not that i intend to touch the money !!)",
      "rating": 5,
      "date": "6th August 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Friendly helpful staff.",
      "text": "Friendly helpful staff. Felt welcome in branch. Have full confidence in the Society",
      "rating": 5,
      "date": "5th August 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Excellent service when opening new wccount",
      "text": "Excellent service when opening new wccount",
      "rating": 5,
      "date": "24th July 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "From borrower to saver - very efficient transfer.",
      "text": "Arranging to pay off my mortgage, and taking out a savings product; both dealt with in an efficient and friendly way.",
      "rating": 5,
      "date": "11th July 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Always very helpful and friendly staff in store.",
      "text": "Always very helpful and friendly staff in store. Easy to manage accounts and send directly to current accounts. Great way to have a kids saver account too that we continually build into.",
      "rating": 4,
      "date": "10th July 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Always a pleasure to come in",
      "text": "Always a pleasure to come in - friendly helpful staff",
      "rating": 5,
      "date": "20th June 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Excellent service, welcoming staff",
      "text": "Excellent service, welcoming staff",
      "rating": 5,
      "date": "16th June 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "A pleasure to do business!",
      "text": "Good traditional face to face service. My request was dealt with efficiently and my questions answered to my satisfaction.",
      "rating": 5,
      "date": "13th June 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "When is online not online?",
      "text": "Opened online account. Very basic online offering with tortuous log on using awful system beloved of building societies rather than the one run by Newcastle Building Society and used by more competent organisations. Even though it was an online account insisted on sending a passbook by post. Some financial organisations need to move forward from the 1970s",
      "rating": 1,
      "date": "18th December 2023",
      "product": "Savings",
      "sentiment": "negative"
    }
  ]
}