{
  "society": "Suffolk Building Society",
  "slug": "suffolk-building-society",
  "smpUrl": "https://smartmoneypeople.com/suffolk-building-society-reviews/products",
  "totalReviewsOnSMP": 1856,
  "avgRating": 4.8,
  "scrapedAt": "2026-02-06T16:09:17.092741+00:00",
  "reviews": [
    {
      "title": "Mightily impressed with all staff from reception thr...",
      "text": "Mightily impressed with all staff from reception through to senior managers. Polite, well informed and capable people top to bottom. The overall efficiency of customer relations made us feel valued and very respected.",
      "rating": 5,
      "date": "31st October 2025",
      "product": "Insurance",
      "sentiment": "positive"
    },
    {
      "title": "Good customer service,staff very helpful",
      "text": "Good customer service,staff very helpful",
      "rating": 5,
      "date": "2nd February 2024",
      "product": "Insurance",
      "sentiment": "positive"
    },
    {
      "title": "Always friendly staff and always very helpful",
      "text": "Always friendly staff and always very helpful",
      "rating": 5,
      "date": "7th February 2023",
      "product": "Insurance",
      "sentiment": "positive"
    },
    {
      "title": "Such an easy bank to deal with any problems you may have",
      "text": "INSRANCE PROBLEM SOON SOLVED ALBEIT A WHILE BACK",
      "rating": 4,
      "date": "16th March 2022",
      "product": "Insurance",
      "sentiment": "positive"
    },
    {
      "title": "IMortgage Redemption - great service",
      "text": "I recently,y redeemed my mortgage. Jodie Smith was fantastic at guiding me through the process.",
      "rating": 5,
      "date": "30th January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Maria Giusti - Mortgage Consultant excellence",
      "text": "Maria Giusti - Mortgage Consultant was excellent in sorting a mortgage switch for us. There were complicated elements which she resolved quickly and explained everything clearly. Due to us leaving the switch to the last minute, Maria worked efficiently to get our switch active as soon a possible. Very grateful for her help",
      "rating": 5,
      "date": "28th January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "A really good experience with a company that really...",
      "text": "A really good experience with a company that really wants to help their customers. They are happy to look at situations that dont conform to larger lenders criteria & will judge each case purely on its merits. Phones are always answered promptly and by a friendly human that wants to help.",
      "rating": 5,
      "date": "23rd January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Ethan Whight Application Process",
      "text": "Our application was a complex one but Suffolks approach and communication was excellent throughout. They were always on hand and helpful to manage the process, and we were made to feel they were working with us at all times. Ethan Whight in particular was always polite, helpful and extremely knowledgeable when proposing options that suited our position best.",
      "rating": 5,
      "date": "8th January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent service",
      "text": "I had exacting buyers and consequently I had to make various changes to my own mortgage requirements. Stephen was very patient and helpful and made sure I had all the information I needed at different stages. He was also very prompt in answering any queries I had.",
      "rating": 5,
      "date": "17th December 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Remortgage made easy",
      "text": "I was advised this morning by Joe Gregory, Mortgage Consultant. He could not have been more helpful. His advice was clear and very helpful. He is the model of excellent customer service and terrific ambassador for the Suffolk BS.",
      "rating": 5,
      "date": "15th December 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Amazing support from Jodie",
      "text": "Jodie has been so helpful and lovely to deal with. She always made everything clear and simple, and nothing was ever too much trouble. I’m really sad she’s leaving — she’ll definitely be missed!",
      "rating": 5,
      "date": "28th November 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent service from a very approachable team.",
      "text": "When my fixed rate mortgage came to an end and I became eligible to switch, I contacted Suffolk Building Society by telephone to find out what products might be available to me. From that first call right through to completion, I have received excellent service from every single one of the team with whom I have spoken....Zoey, Joe, Raj and especially Stephen. As an elderly person, I appreciate very much the patience and clarity of all the team. Every step of the way, all details were described and any clarification I needed was provided which meant I could make a decision as to what was appropriate for me with confidence. In addition to the mortgage, I wished to arrange Buildings and Contents insurance. This was accomplished with the same calm, friendly, reassuring efficiency. I am most grateful to everyone concerned.",
      "rating": 5,
      "date": "27th November 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent Support from Start to Finish",
      "text": "It was a pleasure discussing my application with Stephen. Throughout the process, he was quick to respond, knowledgeable, and professional. This was a breath of fresh air compared to other providers. My application progressed smoothly and was completed successfully.",
      "rating": 5,
      "date": "23rd November 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "A trusted partner - On hand to answer your call",
      "text": "Over the past 4 months whilst we have been searching for a property to purchase, Ethan and the team have been supportive throughout, updating the Decision in Principle as needed. Always respond with a good timeframe via email and you can always talk to somebody when you call. Shout out to Maria who has taken lots of calls:) They always remember you, and do exactly what they say they are going to do. They have made my experience stress free, and for that I am very grateful. Now we are at the stage of applying for the mortgage, in preparation for that, I had an appointment call with Ethan which was thorough and educational. Thank you to Ethan, Maria and the team at Suffolk Building Society for being a trusted partner in my house buying experience.",
      "rating": 5,
      "date": "9th October 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "The mortgage process was smooth & the time it took w...",
      "text": "The mortgage process was smooth & the time it took was reasonable. The advisor was very honest, knowledgeable & treated us like how customers should be treated; with respect. It was a personal experience.",
      "rating": 5,
      "date": "26th September 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Wonderful Mortgage Customer Service Rep",
      "text": "I had a call today with Zoey regarding a mortgage switch, and I just wanted to share how impressed I was with her service. She was absolutely lovely to speak with – friendly, patient, and professional throughout the entire conversation. Zoey has a wonderful phone manner that immediately put me at ease. She took the time to clearly explain the entire mortgage switch process, breaking down each step so I could fully understand what it would entail. I never felt rushed or confused, and her explanations made a potentially overwhelming process feel simple and manageable. It was genuinely one of the most pleasant customer service experiences I’ve had in a long time. Thank you, Zoey!",
      "rating": 5,
      "date": "22nd September 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "If they had a zero stars",
      "text": "If they had a zero stars, I would happily award it to Suffolk Building Society I’ve been a customer of Suffolk for a number of years and was recently fortunate to clear a large part of my mortgage. Due to a change in circumstances, I reapplied for additional borrowing against my mortgage, which was less then I had cleared only a few months before. Nothing else has chanced in my circumstances, but they declined the additional borrowing. Whilst I understand this is their right, it is the excuse they have given, which baffles and frustrates me. Apparently, you must say, or give the impression that you will have the mortgage and be a customer for at least 6 years (despite taking out a 2 year fixed rate deal), or they will automatically decline you. I was honest with my intent to clear the mortgage at the end of the two year fixed rate deal, and this was the reason they declined me. I’m still in shock! This, coupled with the poor customer service means I will definitely be moving from Suffolk to another provider asap.",
      "rating": 1,
      "date": "10th September 2025",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "Happy customer",
      "text": "Stephen was really great to deal with - very responsive and informative at each step. Was a very easy process with Suffolk.",
      "rating": 5,
      "date": "8th September 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Really need to review processes and products",
      "text": "We originally sought to port our mortgage but were advised that the portal was down for a sustained period, but if we chose a new mortgage it could be done quickly, which we did. The survey on the purchased property took over 8 weeks to complete and we felt that we were being encouraged to take out an expensive product, which as a 40 year term was totally senseless given I will be paying until I am 110 and my wife 100 years of age. Overall we were left frustrated by the process and disappointed by the product by felt obliged by the system to continue",
      "rating": 3,
      "date": "29th August 2025",
      "product": "Mortgages",
      "sentiment": "mixed"
    },
    {
      "title": "Disappointed",
      "text": "As fix end approaches, started shopping around, and this company is no longer the cheapest or best deal, so will be moving. Have been very satisfied up to now, but maybe now I am over 70 they don't want my business. Disappointed",
      "rating": 4,
      "date": "13th August 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "New owner, new product",
      "text": "Recently had to move a mortgage into my sole name, and then port to a new product. SBS was the gold standard throughout both, being informative, proactive, and doing their best to resolve blockers. I really appreciated everyone I spoke to and how they helped with a process that was, at times, quite frustrating.",
      "rating": 5,
      "date": "23rd July 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent customer service - Stephen Lye to be very...",
      "text": "I found the representative - Stephen Lye to be very personable and supportive. He had alot of patience and guided me through the process.",
      "rating": 5,
      "date": "14th July 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Outstanding, friendly, efficient and thoughtful serv...",
      "text": "Outstanding, friendly, efficient and thoughtful service in every way. Matched our needs to the best mortgage product available and I would say the best experience we have ever had with banks or building societies. Being a customer with the Suffolk Building Society has brought us financial peace of mind.",
      "rating": 5,
      "date": "23rd June 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent Experience",
      "text": "I came direct without a broker and had an excellent experience with Suffolk. I found the deal myself and found it to be very compatible with what I was looking for. I was assigned a single point of contact throughout and Mr Lye (the adviser) was incredibly approachable. Unlike my experience with other Building Societies, I was provided with a fairly comprehensive list of what they required to assess for the mortgage and once this was all provided I was given a timely response. Very satisfied and would highly recommend.",
      "rating": 5,
      "date": "23rd June 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Good service.",
      "text": "Good service. Everything went smoothly.",
      "rating": 5,
      "date": "23rd June 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "SBS just make my life easier.",
      "text": "SBS just make my life easier. Every communication I have them is explained so easily and straightforward. Always helpful in every way . I just spoke to Marina today, she helped me renew my mortgage with such a helpful, reassuring voice and manner. I’ve been with them now for 7 years and have never regretted it.",
      "rating": 5,
      "date": "18th June 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "I wish all companies would learn from Suffiolk BS...",
      "text": "I wish all companies would learn from and adopt the standard of service offered by Suffolk Building Society. The call was answered quickly, efficiently, kindly and with great professional competence. Well done Amanda and Jodie and thank you for making a difficult job easy for me.",
      "rating": 5,
      "date": "16th June 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Remarkable experience so far",
      "text": "Even though still awaiting an offer, I think Stephen Lye is a superb advisor and credit should always be given where due - he adds a personal touch; treats you like a customer should , which is something that is missing in most other places these days.",
      "rating": 5,
      "date": "13th June 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Outstanding mortgage service.",
      "text": "This was the most positive experience we have ever had in dealing with mortgages, banks and building societies. Suffolk Building Society was respectful, friendly, supportive and efficient. Their mortgage executive, Stephen Lye, in particular, was super professional and a magnificent communicator. We have been matched with a product that best suits our needs and has ensured we can stay in our house for the rest of our lives, should we want to.",
      "rating": 5,
      "date": "7th June 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Lots of issues with lending services who dont appear...",
      "text": "Lots of issues with lending services who dont appear to read documents completely. Excellent service and support from Stephen Lye.",
      "rating": 3,
      "date": "21st May 2025",
      "product": "Mortgages",
      "sentiment": "mixed"
    },
    {
      "title": "Outstanding customer service throughout!",
      "text": "I had an exceptional customer experience with Stephen as my mortgage adviser. From the very beginning of the application process, they provided clear, thorough explanations and made sure I understood every step. Nothing was ever too much trouble—they were always patient, professional, and genuinely committed to helping me find the best mortgage option. Their outstanding customer service made what could have been a stressful process feel smooth and straightforward. I highly recommend Suffolk Building Society to anyone looking for expert advice and top-quality support.",
      "rating": 5,
      "date": "1st May 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Incompetent, frustrating and time-wasters",
      "text": "Utterly incompetent. Took 2 months to event get our re-mortgage application processed (costing time, and money) and then every single thing we put was scrutinised and questioned - even though nothing had changed since the last time we applied for a mortgage! We gave up in the end as they wanted us to spend event MORE money getting a solicitor involved. Totally unnecessary.",
      "rating": 1,
      "date": "13th March 2025",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "Lynmede Mortgage - Stephen Lye",
      "text": "From a personal customer service perspective Suffolk Building Society are excellent. I would like to personally thank Stephen Lye for his excellent customer service and attentive nature in which he progressed what he could at pace. A true asset to the business, thank you.",
      "rating": 5,
      "date": "24th February 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Wonderful customer services.",
      "text": "Wonderful customer services. Helpful and professional when called, very understanding and caring. Nothing is too much trouble to explain. Excellent service on every call. Excellent products too.",
      "rating": 5,
      "date": "17th February 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Re Joe Gregory in the Mortgage Sales Team",
      "text": "I contacted Joe Gregory in the Mortgage Sales Team at various stages of applying for a product switch, and every time I called I found Joe very helpful in explaining things and very informative and straightforward in answering my questions. He was also extremely patient in dealing with my lack of IT skills and helping me through the various processes. I would recommend him to anyone who wanted help with a mortgage-related enquiry.",
      "rating": 5,
      "date": "10th February 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Suffolk Building Society - Simply.the Best",
      "text": "I.was.informed that.my current product was nearing completion. I subsequently spoke to.a mortgage specialist adviser (Maria) who was exceedingly helpful, extremely pleasant and I have to.add that with Maria's excellent knowledge.of product availability and professional guidance, I am 100% delighted.that.i have chosen a new.product specific to my requirements.",
      "rating": 5,
      "date": "21st January 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Additional borrowing. Excellent mortgage consultant.",
      "text": "We needed to borrow some additional money to finish the self-build that had been completed using a Suffolk/ Ipswich self-build loan. Stephen (Lye) was our consultant, and did a first class, thoroughly professional job in taking us through the process, and explaining every stage comprehensively. Stephen was a credit to the company, and thoroughly recommended. Thanks, and congratulations.",
      "rating": 5,
      "date": "20th December 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent advice on taking out an additional advance.",
      "text": "Very good advice on taking out an additional advance on our Suffolk Mortgage. The Advisor (EW) explained everything clearly and helped us come to a decision re how to proceed. He was much more knowledgeable than other bank or building society advisers I have dealt with before.",
      "rating": 5,
      "date": "3rd December 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great delivery",
      "text": "A really quick, helpful response to my enquiry about extending my mortgage and this has been my uniform experience of Suffolk BS.",
      "rating": 5,
      "date": "28th November 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Stephen Lye and his team really supported me through...",
      "text": "Stephen Lye and his team really supported me throughout my mortgage. He was professional, helpful and communicative. I would recommend him and the building society for being supportive, knowledgeable and helping me to buy my first home.",
      "rating": 5,
      "date": "20th November 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Mortgage",
      "text": "I have always received excellent and comprehensive customer service delivered in a patient manner",
      "rating": 5,
      "date": "14th October 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Mixed review",
      "text": "Great product with good rates. Disappointed the online service does not work for the expat loans. I wish someone told me about this before I took out the loan",
      "rating": 3,
      "date": "30th September 2024",
      "product": "Mortgages",
      "sentiment": "mixed"
    },
    {
      "title": "Great customer service.",
      "text": "Stephen was extremely helpful, and constantly kept me updated. I would highly recommend.",
      "rating": 5,
      "date": "30th September 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Beware false promises from this lender!",
      "text": "We were pre-approved for a loan, which was a 35% loan to value purchase. With our large down payment and small loan we felt comfortable making an offer on a home we liked and expected a fairly simple closing process. Then we were told the parameters of our loan had changed despite already being pre-approved. We agreed to the change, though it put a bit of strain on us. Now, we believed we could proceed, but after foot dragging by the lender, once again they changed the terms, and once again we reluctantly found a way to make it work. And then, after all our capitulations, we found out that our loan was denied on a technicality we had never been made aware of. So we have a contract with no lending secured after weeks thinking that approval was already somewhat assured. We feel deceived and cheated out of precious time which might result in us losing our contract on our purchase and out the fees we incurred from this lender and our solicitors.",
      "rating": 1,
      "date": "12th August 2024",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "Excellent and Prompt Response and Advice",
      "text": "Just to quickly pass on my thanks to Joe Gregory, who not only sought me out overseas by phone based on a a number of queries I had had with my re-mortgaging options, but did so very promptly indeed. He provided clear advise and reassurance as to where I am and in terms of options to consider. Thanks.",
      "rating": 5,
      "date": "11th August 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent customer service from maria",
      "text": "Maria provided excellent customer service and help me through switching my product",
      "rating": 5,
      "date": "6th August 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Joe was very professional.",
      "text": "Joe was very professional. He was very patient to answer all my questions and explain the various options available to me. He promised to check the availability of mortgage advisers and call me back and he called back quickly with the information I needed for the appointment. Great customer service!",
      "rating": 5,
      "date": "6th August 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "joe the adviser was very compassionate and looked at...",
      "text": "joe the adviser was very compassionate and looked at various options for me,he even spoke to his manager for further advice.at this time i was not able to proceed but felt listened to and the explanations were clear and concise",
      "rating": 5,
      "date": "11th July 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Outstanding service with our mortgage application.",
      "text": "We have dealt with Stephen and Ethan over the last few weeks and have found their service to be outstanding. They are very helpful and friendly, while remaining professional at all times. They have always ensured our understanding of the mortgage procedure and been timely and accurate with the process. We feel that we are in safe hands with them.",
      "rating": 5,
      "date": "5th July 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent communication by email, by post and phone",
      "text": "Excellent communication by email, by post and on the phone. It is possible to get through to a 'real;' person who can answer all my queries and can guide me through online documents. Very helpful and patient -as i am hard of hearing",
      "rating": 5,
      "date": "24th June 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Happy to Recommend",
      "text": "Lovely polite lady, no pressing buttons or ghastly music, and she was easily understood, exceedingly knowledgeable and quickly put me at ease, as I was anxious over my fix ending, and the likely increased cost I was facing",
      "rating": 5,
      "date": "18th June 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Mortgage Product Swap",
      "text": "I have always had good customer service when ringing and this morning was no exception. I spoke to Maria Giusti, who answered all my questions thoroughly, seeking information if she didnt know the answer. She was friendly and professional and gave me a very positive experience! What a credit to your staff!",
      "rating": 5,
      "date": "10th June 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent, with exemplary staff. Highly recommended",
      "text": "We were blessed to find Suffolk Building Society in 2016, when it was still Ipswich Building Society. They had an article in the press about helping ‘Mortgage Misfits’ - which is what we were. We were in our 60s, our Interest only Mortgage deal had come to an end & our lender would no longer lend to us, despite having had a mortgage with them for 15 years, never having had arrears, or asking for a payment holiday. We felt it was definitely because of our age. The moment I called Suffolk, I knew I had found my lender. They were prepared to lend until beyond retirement age, had some excellent rates and deals - & we have never looked back. You can pay off up to 50% of the mortgage during its deal period. We opt for 2 year fixed deals and have managed to reduce our Mortgage consistently, since being with Suffolk. The staff are always ultra helpful and professional, and we cannot recommend them highly enough. We have recommended them to many friends & colleagues, who are all equally delighted with the outstanding customer service given. We would NEVER go to any other lender now. Recently, we have applied for additional borrowing, and after an initial enquiry, arranged an appointment with Ethan Whight, a Mortgage Advisor, to call me to discuss. He is an excellent Mortgage advisor, professional, efficient, patient and understanding. He has an excellent manner, and clearly explained the process to me, and next steps. Ethan is an asset to Suffolk Building Society, and we're sure he'll go far within the company with his excellent attitude and skills. It was a pleasure to do business with him. We’re very grateful to him for his help, and knowledge. We cannot praise him, and all his colleagues who have helped us over the years, highly enough. Suffolk Building Society, and its staff, are exemplary. Ethan personifies the values of the company and deserves every success. Many thanks.",
      "rating": 5,
      "date": "5th June 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Efficient, friendly service.",
      "text": "Efficient, friendly service. Very happy.",
      "rating": 5,
      "date": "26th May 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent Support and Customer Care Staff",
      "text": "We have had a mortgage with Suffolk (formerly Ipswich) for almost 2 years, and not really needed to contact them, but as the 2 year period was coming to an end our contact suddenly ramped up towards the product switch possibility. I can not stress enough how supportive, friendly, personable, and seemingly caring each individual we spoke to was towards us within the process. Excellent isn’t actually enough - to name a couple of staff, Joe called us to check on our selection of mortgage as he noticed we might have made a mistake, so talked me through where we had gone wrong… he also drew my attention to the fact that I could benefit from a month extra at a slightly lower interest rate if we make the switch immediate rather than at the end of the terms (something I wasnt aware we were allowed to do… a small saving, but still a saving). This then drove a closer deadline for our actions, which meant more calls from us to suffolk for questions. We never once felt that our questions were taken lightly, nor felt stupid in asking what we thought might be stupid questions. Joe, Maria and a couple of other staff whom I cant recall the names of sadly, all were incredibly helpful. From all our experiences so far, we strongly recommend Suffolk for ExPat mortgages. I feel like they are also good value for money, as alternative offers for this switch period were coming up with higher sign up fees etc… but our main review is their support. Thanks for being so supportive.",
      "rating": 5,
      "date": "15th May 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Maria Giusti very professional",
      "text": "Maria Giusti was a pleasure to detail and very professional service.",
      "rating": 5,
      "date": "5th April 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Friendly helpful staff.",
      "text": "Friendly helpful staff. I needed an expat mortgage and Suffolk offered a great product.",
      "rating": 5,
      "date": "18th March 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Our experience with Suffolk building society",
      "text": "We've been customers for five years and have always been kept well informed about products and services. Staff are pleasant, helpful and respond promptly to queries.",
      "rating": 5,
      "date": "19th February 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Wanted to remortgage our home in retirement to help...",
      "text": "Wanted to remortgage our home in retirement to help our son get on property ladder. Suffolk BS team could not have been more helpful and efficient",
      "rating": 5,
      "date": "3rd February 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "I was watching a Martin Lewis program about Mortgages.",
      "text": "I was watching a Martin Lewis program about Mortgages. A Mortgage Advisor was on the show and gave advice that would change our lives in retirement completely. The Advisor recommended several specialist Building Societies on the show so the very next day I rang one of them. The Suffolk Building Society. They advised I seek a Mortgage Advisor because they could not do direct applications. They were so kind, understanding and professional. We were very lucky after going through all the processes, with the help of our personal advisor, to secure a Late in Life Mortgage that saved us from having to sell our home at the age of sixty seven and sixty nine due to high interest rates. All of our wishes at such a late time in life were fulfilled. Martin Lewis, our Mortgage Advisor and The Suffolk Building Society, thank you so much. It gets better. we are now part of a bigger family, with regular updates and events being sent to us by The Suffolk. Amazing!!",
      "rating": 5,
      "date": "2nd February 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Easy to deal with",
      "text": "Have been easy to deal with. Staff are knowledgeable and easy to contact. Annual statements are easy to understand. Went them as product was extremely competitive.",
      "rating": 5,
      "date": "2nd February 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Professional service and ease of mortgage application",
      "text": "I found the whole experience in applying for a mortgage very straightforward and was undertaken in a professional manner. The Society were the only financial institution which offered us a mortgage.",
      "rating": 5,
      "date": "2nd February 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "I have an expat mortgage.",
      "text": "I have an expat mortgage. It was a complicated process, but the team was very supportive.",
      "rating": 5,
      "date": "2nd February 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent service, and rates. Highly recommended",
      "text": "We were blessed to find Suffolk Building Society in 2016, when it was still Ipswich B Soc. They had an article in the press about helping ‘Mortgage Misfits’ - which is what we were. We were in our 60s, our Interest only Mortgage deal had come to an end & our lender would no longer lend to us. -after 15 years, never having had arrears or asking for a payment holiday. We felt it was definitely because of our age.The moment I called Suffolk, I knew I had found my lender. They were prepared to lend until beyond retirement age, had some excellent rates and deals-& we have never looked back. You can pay off up to 50% of the mortgage during its deal period. We opt for 2 year fixed deals and have managed to reduce our Mortgage consistently, since being with Suffolk. The staff are always ultra helpful and professional and we cannot recommend them highly enough. We have recommended them to many friends & colleagues, who are all equally delighted with the outstanding customer service given. We would NEVER go to any other lender now.",
      "rating": 5,
      "date": "2nd February 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "What an experience",
      "text": "Great communication, fast efficient, low stress",
      "rating": 5,
      "date": "2nd February 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very helpful and knowledgable, good price",
      "text": "Very helpful and knowledgable, good price",
      "rating": 5,
      "date": "2nd February 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Additional borrowing applIcation",
      "text": "The product was just what we were looking for and the application and approval process was straight forward. We were kept up to date through out.",
      "rating": 4,
      "date": "18th October 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Charter information advice and set up",
      "text": "Stacey Jarram spoke with me today about me considering making use of the charter to enable me to have interest only mortgage payments for six months. Stacey clearly had robust knowledge about the product, how it could benefit me and what would need to be done before it could be authorised. Stacey was clear and professional throughout. I received an excellent service. Thanks Stacey!",
      "rating": 5,
      "date": "15th August 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Advice regarding temporary interest only payments",
      "text": "I spoke with Jodie Allum. She was polite professional and so helpful. I was a little nervous about calling but she helped me to feel at ease and she provided information that I needed before I asked the questions! Jodie delivered and she was a pleasure to speak with. Thank you Jodie.",
      "rating": 5,
      "date": "10th August 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Absolutely fantastic",
      "text": "I have a Mortage with Suffolk building society and the staff have been so incredibly helpful, nothing has been too much trouble. I highly recommend them to everyone",
      "rating": 5,
      "date": "9th August 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Such a support",
      "text": "I am going through a very challenging divorce with a joint variable rate mortgage the monthly payments have been spiraling out of control as interest rates continue to increase. My divorce settlement timescale have been moving further and further away as my husband refuses to provide any information to the court. I spoke to odie Allum, one of the collections officers at Suffolk Building Society , who was a tremendous help, kind, informative, and helpful. She helped me navigate to some potential options and is there for me when I need support. I can not thank her enough. Of all of the people who I thought could help me in this difficult time I never expected it to be my building society. Well Done Jodie and well done Suffolk Building Society. I'm not out of the woods yet but I certainly feel there is a path I can follow.",
      "rating": 5,
      "date": "20th June 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "a very happy customer",
      "text": "Suffolk Building Society, now known as the Ipswich Building Society, have been my mortgagees for over 15 years. They have recently helped me through some very difficult personal times, -ill health, divorce, bereavement, court hearings, financial hardship, retirement - and they have been readily accessible by telephone, I had a case worker Stacey who dealt with all my queries, was extremely careful to check all the details, very professional, and very sympathetic to my unusual circumstances. She was able to help me overcome my difficult times, and keep my home. Longer term this building society have some very competitive products, have good channels of communication with their members, and have a caring attitude towards their members. My thanks to everyone from the bottom of my heart.",
      "rating": 5,
      "date": "4th April 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "All spot on",
      "text": "Our mortgage was agreed without issue (not that we expected any) and processed efficiently. Also, the refund of a previous penalty payment was handled with no questions. All in all, very efficient.",
      "rating": 5,
      "date": "19th March 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Expat Landlord Mortgage made easy!",
      "text": "My job has taken us to Austria for a few years and we needed to rent out our home whilst we are away. We really struggled to find a expat landlord mortgage, and many of those we found had unhelpful conditions e.g. must hold a bank account with the provider with 25k in it! Thankfully the SBS were able to help and the process was straight forward. The product also allowed over-payment to a set amount, which has been really helpful as we think about our return to the UK and looking for new jobs.",
      "rating": 5,
      "date": "14th February 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Innovative , helpful and clear",
      "text": "As an older buyer I was looking for a small mortgage when moving house a couple of years ago . I was over an age at which most Building Societies would consider an applicant , or if they did they would impose very tight limits on the period of time over which any mortgage product could be taken . The Ipswich Building Society as it was at the time were the leading providor of the product I was looking for , a mortgage aimed at the older customer available over a time frame of up to 30 years making repayments highly affordable all of which was the ideal solution for myself . Why more Building Societies do not offer such products is always a mystery to me , I would be representative of a large group of potential customers who have stable income , backed by large cash reserves giving a low loan to value ratio so in many ways representing a sound investment for a mortgage company. Throughout the initial discussion and application period the society was extremely clear in its communication and the staff were always polite and accessable when questions arose . The on line portals for paperwork worked very smoothly and access to them secure yet straightforward , overall a very smooth process at what can be a stressful time if all elements dont go as planned . I would without doubt recommend the society to anyone looking for a mortgage and strongly suggest that they at least have a conversation with them to see how they may be able to help in a potential property purchase .",
      "rating": 5,
      "date": "10th February 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very helpful Self Build",
      "text": "We were looking for a Self Build mortgage and approached several lenders who purported to offer this. Iinvariably after jumping through several hoops there was always an issue of one sort or another. Tried Ipswich / Suffolk and they were exteremly helpful and helped us secure our mortgage. The people we dealt with were always very friendly and helpful and I would definitely recommend them.",
      "rating": 5,
      "date": "9th February 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Self build mortgage",
      "text": "I would like to say how impressed I am with Suffolk building society. I arranged a self build mortgage with them and the whole process was easy and went smoothly from start to finish. They are on hand to answer any questions, they were quick to arrange valuations at various stages of the build and quick to release funds. Certainly the building society to consider if you are looking to fund a building project.",
      "rating": 5,
      "date": "8th February 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "I have always recommended Ipswich Building Society to anyone who are trying to get a mortgage",
      "text": "Always helpful in all of there building society's and when you contact by phone or email",
      "rating": 5,
      "date": "8th February 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent service, really accommodating with disabled customers.",
      "text": "I’ve been with Suffolk building society for five years on a joint mortgage, recently had to change products due to now buying a house on my own and they’ve been super accommodating and really helpful. They’ve understood that I’ve been rushed by the newbuild developers and they’ve tried their best to accommodate, they have also been amazing in terms of accessibility and trying to help out as much as they could with a visually impaired customer. I can’t fault them at all, and I have been really impressed with them. They were my first choice when looking into a new mortgage for the new property",
      "rating": 5,
      "date": "7th February 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Suffolk Building Society Progressive and Responsive to Customers",
      "text": "Suffolk Building Society is a very helpful and reasonable organisation which is constantly trying to improve the customer and member experience .I would recommend it to anyone as being progressive and responsive to the needs of the community it serves .",
      "rating": 5,
      "date": "7th February 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "The listening society",
      "text": "I have always found the staff to be patient and understanding. They actually listen to you and give an honest response and take time to ensure you understand and are satisfied.",
      "rating": 5,
      "date": "7th February 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent Service",
      "text": "My new fixed 2 year mortgage was ending soon when out of the blue the Suffolk Building Society sent me a letter asking if I wanted to renew a fixed 2 year deal at the same interest rate. Brilliant. All I had to do was sign a form. No lengthy application. No credit or any other checks. A reward I suppose for No change in my circumstances and 2 years of making my payme to on the dot. Hope future deals can be as easy & quick.",
      "rating": 5,
      "date": "7th February 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Late in life mortgage",
      "text": "Due to circumstances, my partner and I, both in our early 70’s, needed a mortgage. No other Mortgage Provider would look at us despite our guaranteed retirement income. Suffolk accepted us with a 30% deposit.",
      "rating": 5,
      "date": "7th February 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent customer service",
      "text": "I have always found it very easy to contact Suffolk Building society by phone, or by email or on line, and the staff are always friendly, knowledgeable, helpful and efficient. For me, this is the most important feature of a good building society.",
      "rating": 5,
      "date": "7th February 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Outstanding service from Suffolk",
      "text": "Suffolk offered us a 15 year mortgage and we are both in retirement. We have good teachers pensions thank goodness. Communication.. written by post, emails, news leaflet, telephone is refreshingly clear. Suffolk is easy to speak to.. not hanging on the phone for ages or having to struggle with a chat bot. Their response time is a customer’s dream. Changing product at the end of its term can be daunting, especially for older customers. The system developed by Suffolk on both occasions was simple and easy to understand and with just one advice call the paperwork was completed before the deadline. It was easy to obtain a verbal redemption figure too. So… Communication outstanding: No waiting time on phone Postal and online written information is in plain English so easy to understand. Front line staff are helpful and friendly Products are realistic and have customer needs central to the Suffolk brand",
      "rating": 5,
      "date": "7th February 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Professional, friendly and efficient systems",
      "text": "Suffolk Building Society helped us get an interest only mortgage on our house in order to help our children onto the property ladder. Everything was friendly, professional and helpful and we are now able to downsize at leisure to clear the mortgage",
      "rating": 5,
      "date": "7th February 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Suffolk Building Society Cares About The Customer!",
      "text": "Suffolk Building Society offered me a mortgage when Halifax didn't and when it came time to remortgage they offered me the best rate! I am very happy with their product and consistently excellent customer service and would recommend them wholeheartedly.",
      "rating": 5,
      "date": "7th February 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Best Mortgages",
      "text": "We have had a mortgage with Suffolk Building Society formerly Ipswich Building Society for over 25 years. The society are friendly and always provide a very personal service. The information they provide is clear and the staff are always on hand to answer any questions. The society is local and I would not hesitate to recommend to others",
      "rating": 5,
      "date": "7th February 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Efficient and friendly",
      "text": "We have three mortgages with the Suffolk and each year have contact with the mortgage team regarding various matters , they are always friendly and efficient in resolving matters.",
      "rating": 5,
      "date": "7th February 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Remortgages",
      "text": "Staff are always helpful and offer individualised solutions. Maximum efficiency when implementing offers. Great online operation.",
      "rating": 5,
      "date": "7th February 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Pro",
      "text": "The Society with outstanding people skills.",
      "rating": 5,
      "date": "7th February 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "High rates, crazy termination clauses and difficult to deal with",
      "text": "We have found the Society difficult to deal with, you can’t do anything online, very slow at communicating, lots of errors in communications (like the wrong dates on mortgage statement) and the fees they have are extremely high in comparison to market rates.",
      "rating": 2,
      "date": "7th February 2023",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "Excellent People and Company.",
      "text": "Two years ago I applied for a mortgage with the then Ipswich Building Society now Suffolk Building Society. It was a thorough process but at all times I was kept properly informed by the person who was handling the application. I felt this person knew exactly what she was doing. At all times she was polite and pleasant to deal with. My application was successful. I would thoroughly recommend the Suffolk Building Society. It is a much more personal service, the people are very nice.",
      "rating": 5,
      "date": "7th February 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Delightful, considerate and human building society",
      "text": "We took out a mortgage on our house to help children get on the property ladder and have found Ipswich now Suffolk Building Society a friendly, professional and human organisation - just like building societies and banks used to be but so few are these days. A great team of people.",
      "rating": 5,
      "date": "25th November 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Pleasant people to deal with, but unnecessarily slow.",
      "text": "It took too long to finalise, which held up completion; so by the time it did the rate had increased noticeably, done in a speedier time-frame, (very do-able) it would have been at the original quote, around a hundred pounds a month cheaper. The people are all helpful and friendly.",
      "rating": 4,
      "date": "19th October 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "WORST MORTAGE COMPANY...",
      "text": "In my personal and financial career spanning over 40 years, this is the WORST organisation that I have ever had the misfortune to be involved with. They are inefficient, poor-quality staff, take time to make decisions (many weeks), constantly going back and forth mostly on nit-picking matters (why not ask all or any questions early on / up-front?). I am a credible person, no financial issues and approved mortgage in principle. But they and the surveyor constantly mess around. Also, if they have issues with expats, then they should get out of that part of the business. So much stress for me and my broker, waisted my money on costs, and my time. People do not deserve to be treated this way, and they don’t care! As a consequence of what I have been through with them, I have given up on a future retirement in UK and changed my plan and not go back home to where I was brought up in Cornwall. Keep away from them and go to another mortgage company.",
      "rating": 1,
      "date": "6th June 2022",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "efficient,understanding flexible",
      "text": "Helped us get a short term mortgage when we were close to retirement when other agencies were less flexible in light of lack of a final pension calculation for a final salary pension which was still pending but subsequently agreed.",
      "rating": 5,
      "date": "16th March 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Mortgages for older people",
      "text": "My husband and I sought a short term (5 year) mortgage when we decided to move into a new build house some years after retirement. We were given every consideration and the mortgage was explained clearly. We will have paid it off later this year. It has enabled us to have the benefits of a warm, easy to run house in our later years. Thank you Suffolk Building Society.",
      "rating": 5,
      "date": "15th March 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Brilliant to deal with, from start to finish!",
      "text": "As per the title - friendly, helpful people who made obtaining a mortgage for an \"older\" retired person possible, where so many others would not even have the conversation. Thank you all for doing exactly what you promised - every time! A little more, in the end, too!",
      "rating": 5,
      "date": "15th March 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Amazing efficient service",
      "text": "Staff are accessible and person centred and their exceptional customer care make money issues a joy not a headache to manage x",
      "rating": 5,
      "date": "14th March 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great service when getting a mortgage offer",
      "text": "Great service when getting a mortgage offer",
      "rating": 5,
      "date": "14th March 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Extremely helpful and efficient",
      "text": "Having moved to Austria for a few years and rented out our house we needed an ex pat landlord mortgage. Despite the claims of several providers many could not help us or not without unreasonable conditions. But the Suffolk Building Society did! The process was straightforward and staff were and are always very helpful!",
      "rating": 5,
      "date": "26th February 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Amazing service with friendly staff",
      "text": "I have been with the Suffolk building society for four years and they are always there to help with what ever you need. Lovely people",
      "rating": 5,
      "date": "12th February 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great personal service",
      "text": "How refreshing to speak to real people who have the time and knowledge to deal with your application in a personal and professional manner. A real change from the \"Dial 1 for this and 2 for that\" and being stuck in a loop like you get at so many places these days. Please don't change - this is a rare commodity in today's world. As a local building society you feel they are working for the benefit of their members (upholding the original mission of building societies).",
      "rating": 5,
      "date": "10th February 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "So helpful!!",
      "text": "We needed an expat landlord mortgage and the Suffolk Building Society were one of the few providers that could help us! The process was straightforward and the staff were really helpful!",
      "rating": 5,
      "date": "30th January 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Good Choice",
      "text": "Good quick friendly service, good with advice",
      "rating": 5,
      "date": "27th January 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Underwriting with care",
      "text": "Suffolk Building Society offer a manual underwriting process that ensures each and every case that is received is worked through by a person, not a machine. This gives the borrower the best chance at being able to get the offer that they want, taking their personal circumstances into account. The personal touch goes a long way",
      "rating": 5,
      "date": "27th January 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great company",
      "text": "A joy to deal with ,very friendly staff,",
      "rating": 5,
      "date": "27th January 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Amazing personable and person orientated bank",
      "text": "When contacting them for any reason I can get a name and I can speak to the same person again. It's like having a personal shopper. I also feel that they always try there best to satisfy whatever the circumstances. Afew years back before covid I wanted to reduce my repayments and increase the time. This was done swiftly and put us at ease",
      "rating": 5,
      "date": "26th January 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Superb very understanding",
      "text": "Thought things through clearly and made a superb offer",
      "rating": 5,
      "date": "26th January 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Older people are valued as borrowers",
      "text": "Excellent care and help with a short term (5 year) loan when buying a new property for our retirement. Local, accessible and just what we needed.",
      "rating": 5,
      "date": "26th January 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Personal Service. Always able to talk to someone from Ipswich Building Society",
      "text": "We got a Buy To Let mortgage over 4 years ago. It was straightforward with support with the complexity of any mortgage dealt with by a dedicated member of staff at IBS from start to end. We would 100% use them again.",
      "rating": 5,
      "date": "26th January 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Easy and helpful",
      "text": "Really happy with the service we have recieved form Suffolk Building Society. Love the quick response times and the personal approach that we have had to date. The product was very competitive and the application process was far easier then other companies that we had reached out to.",
      "rating": 5,
      "date": "24th January 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Fantastic service",
      "text": "A fantastic service where I can speak to a real knowledgeable person and can answer my queries in real time. Brilliant.",
      "rating": 5,
      "date": "17th January 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent personal service and rapid response",
      "text": "I phoned expecting to wait for ages to get an answer. Carly responded promptly and passed me on to the Admin Department. The information I needed was sent to me almost immediately and I am now able to resolve a pressing financial issue.",
      "rating": 5,
      "date": "30th November 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very antiquated",
      "text": "The lender has some niche areas in terms of underwriting but their overall processes are very backward compare to the rest of the mortgage market. Ideally they will look beyond their own world and see what others are doing to help clients.",
      "rating": 2,
      "date": "19th November 2021",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "Customer care",
      "text": "Found staff-especially Mr. Paul Blaking - very helpful and patient in our dealings.",
      "rating": 5,
      "date": "28th September 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Ipswich-so easy to do business with",
      "text": "I needed money to purchase a dream motorhome. Rang Ipswich, thinking this is going to be difficult, but they agreed in principal very quickly. Money arrived on time and what’s more so much cheaper than a bank! Thank you Ipswich !",
      "rating": 5,
      "date": "17th September 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Lack of customer service",
      "text": "Unable to provide accurate information or clear updates. Chose as local but shall stick with a bigger mortgage provider.",
      "rating": 1,
      "date": "11th September 2021",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "Avoid at all costs!!",
      "text": "reviews IBS As it says on the title, avoid IBS! Having had a mortgage with the society for close to 5 years, they have outrageously high early repayment charges( much higher than any other lender). Poor customer service, no customer loyalty. Archaic in lending- no opportunity to speak with someone at any senior level, if you request a call back with senior management they will forward messages on. Highly judgemental organisation that needs to move to the 21st century. So pleased to have left them and have always advised family and friends to AVOID!",
      "rating": 1,
      "date": "16th August 2021",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "Helpful, professional and a good mortgage deal",
      "text": "It is very easy to contact Ipswich Building society and to speak to an advisor. I received good advice and I am very happy with my mortgage. Everything was set up with the minimum of fuss.",
      "rating": 5,
      "date": "15th July 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Got there in the end",
      "text": "Overall our experience wasn't a possitive one. From a Feb 2021 engagement we ended up with a July 2021 completion. Whilst I was always able to contact the IBS team, I had to work hard to chase these communications/milestones and never felt an urgency to IBS driving these outcomes. Every time a response was made to IBS, it was subjected to a 10 working day turnaround time; this increased to 12 days towards the end of our processing. This heavily impacted the overall timetable significantly. As a self build mortgage, our engagement continues. We will draw down funds against our build milestones so this has to be an effective and timely process. Thus far, it hasn't. I find myself having to think 6 weeks ahead from the imperative date of stage funds reciept to work back factoring in IBS lead times and any additional lead time associated to instructing a revaluation of the property. This shouldn't be the norm; I've created a workaround. I understand very well the impact of remote working over the past 16 months. I understand how this can impact on day to day processes but I could not tell my Customers that their requests are sublect to a 2+ week delay. Are further resource is needed to meet your demand?. It cannot be purely attributed to the pandemic therefore perhaps internal procedures or a triage function is required to route work to the right teams at the right time.",
      "rating": 2,
      "date": "14th July 2021",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "Oldies can get mortgages",
      "text": "Needed a few more pennies and so who else but Ipswich Building Society.",
      "rating": 5,
      "date": "20th April 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Helpful and efficient",
      "text": "Ipswich Building Society explained the process very clearly at each stage. My mortgage consultant was extremely helpful and efficient, she responded to my questions and queries very promptly and in general the process went very smoothly.",
      "rating": 5,
      "date": "20th April 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "My requirement fully met and staff knowledgeable",
      "text": "We got there in the end but some delays due to Covid and valuation delays",
      "rating": 4,
      "date": "31st March 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Ravenswood service",
      "text": "Your staff at Ravenswood helped me and my wife setting up our isa’s and they d made the process easy. Thanks for this.",
      "rating": 5,
      "date": "6th February 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Very knowledgeable and friendly staff",
      "text": "Very knowledgeable and friendly staff",
      "rating": 5,
      "date": "6th February 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Fantastic experience in the Woodbridge branch.",
      "text": "Fantastic experience in the Woodbridge branch. Staff are always cheerful and happy to help with any queries.",
      "rating": 5,
      "date": "6th February 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Marie was excellent today.",
      "text": "Marie was excellent today. Very friendly",
      "rating": 5,
      "date": "6th February 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Very helpful and knowledgeable staff",
      "text": "Very helpful and knowledgeable staff",
      "rating": 5,
      "date": "6th February 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Feedback",
      "text": "Following my father’s death the service was kind, compassionate and understanding. Tracey went out of her way to sort everything out for us in a practical way finding solutions for us so that everything could be sorted quickly and with the minimum of fuss.",
      "rating": 5,
      "date": "6th February 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Very happy with service",
      "text": "Very smooth visit to Saxmundham branch to open a savings account for my son. Very happy with service provided",
      "rating": 5,
      "date": "6th February 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Woodbridge is really friendly and helpful.",
      "text": "Woodbridge is really friendly and helpful. Everything was explained very clearly.",
      "rating": 5,
      "date": "6th February 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Always come to Woodbridge, I like it here",
      "text": "Always come to Woodbridge, I like it here",
      "rating": 5,
      "date": "6th February 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "We were impressed when we opened an ISA so we came b...",
      "text": "We were impressed when we opened an ISA so we came back to open an account for our grandchildren. We have been made comfortable and feel at ease. All our questions are answered and the staff are very knowledgeable",
      "rating": 5,
      "date": "5th February 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Face to Face interview booking",
      "text": "Very friendly and helpful, recognised the fact that I was aware of much of the information that needed to be said, on the basis of my previous experience in the financial sector",
      "rating": 4,
      "date": "5th February 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Very good excellent service Very good service and s...",
      "text": "Very good excellent service Very good service and staff",
      "rating": 5,
      "date": "5th February 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Extremely pleasant and knowledgable staff",
      "text": "Extremely pleasant and knowledgable staff, and it’s so reassuring to see the person you are talking to.",
      "rating": 5,
      "date": "5th February 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Easy to set up and very basic for my kids first savi...",
      "text": "Easy to set up and very basic for my kids first saving account",
      "rating": 4,
      "date": "5th February 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "I like the Woodbridge branch very much, positive staff",
      "text": "I like the Woodbridge branch very much, positive staff",
      "rating": 5,
      "date": "5th February 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Friendly staff, very helpful, conveniently situated,...",
      "text": "Friendly staff, very helpful, conveniently situated, well lit.",
      "rating": 5,
      "date": "4th February 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "We opened an ISA with Jack today.",
      "text": "We opened an ISA with Jack today. We were very pleased with his professional approach. Very friendly and knowledgeable",
      "rating": 5,
      "date": "4th February 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Marvellous and Quick service.",
      "text": "Marvellous and Quick service. Easy",
      "rating": 5,
      "date": "4th February 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Tracey was very friendly and accommodating.",
      "text": "Tracey was very friendly and accommodating. Explained everything we wanted to know",
      "rating": 5,
      "date": "4th February 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Lovely friendly staff at Halesworth",
      "text": "Lovely friendly staff at Halesworth and well maintained building.",
      "rating": 5,
      "date": "4th February 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Woodbridge office review",
      "text": "Very helpful and friendly staff nothing is too much trouble very knowledgeable",
      "rating": 5,
      "date": "4th February 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Always find staff friendly and polite.",
      "text": "Always find staff friendly and polite. They",
      "rating": 5,
      "date": "4th February 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Came in from a dog walk to change our accounts.",
      "text": "Came in from a dog walk to change our accounts. Marie was very helpful and spoke us through the different options. Very efficient and easy",
      "rating": 5,
      "date": "4th February 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "I’ve had an account for 48yrs and no complaints",
      "text": "I’ve had an account for 48yrs and no complaints",
      "rating": 5,
      "date": "4th February 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Very helpful and very informative",
      "text": "Very helpful and very informative",
      "rating": 5,
      "date": "4th February 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Every thing I needed was done very well",
      "text": "Every thing I needed was done very well",
      "rating": 5,
      "date": "4th February 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Always helpful and efficient, courteous.",
      "text": "Always helpful and efficient, courteous.",
      "rating": 5,
      "date": "4th February 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "My experience today was wonderful, sherry is very kn...",
      "text": "My experience today was wonderful, sherry is very knowledgeable, excellent customer service and very helpful and friendly. She is a credit to the society",
      "rating": 5,
      "date": "3rd February 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Good communication, straightforward set up process.",
      "text": "Good communication, straightforward set up process.",
      "rating": 5,
      "date": "3rd February 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "the staff at the Felixstowe branch were very helpful...",
      "text": "the staff at the Felixstowe branch were very helpful and happy to help. Glad there’s a local branch with nice staff.",
      "rating": 4,
      "date": "3rd February 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Felixstowe.",
      "text": "Felixstowe. I opened a fix rate one year investment with the branch manager Louise wright to expire on February 28 2027 Louise was helpful and confident at her position.",
      "rating": 5,
      "date": "3rd February 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Tina dealt with our needs",
      "text": "Tina dealt with our request quickly and easily to change our accounts",
      "rating": 5,
      "date": "3rd February 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Good experience nice staff nice office",
      "text": "Good experience nice staff nice office",
      "rating": 5,
      "date": "3rd February 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "New account",
      "text": "Staff are always very polite, extremely helpful.",
      "rating": 5,
      "date": "3rd February 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Excellent branch",
      "text": "The staff are friendly and helpful. Everyone has assisted in providing me with an informative and productive experience.",
      "rating": 5,
      "date": "3rd February 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Very friendly and helpful at Halesworth",
      "text": "Very friendly and helpful at Halesworth",
      "rating": 5,
      "date": "3rd February 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Very good service in sudbury branch",
      "text": "Very good service in sudbury branch",
      "rating": 5,
      "date": "3rd February 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Efficient straight forward process",
      "text": "Efficient straight forward process",
      "rating": 5,
      "date": "2nd February 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Nice customer experience, looked after our needs.",
      "text": "Nice customer experience, looked after our needs.",
      "rating": 5,
      "date": "2nd February 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Laura was great at doing all the forms and transfers...",
      "text": "Laura was great at doing all the forms and transfers for my wife and I . Very patient and pleasant as we looked for numbers etc. will definitely use SBS in the future.",
      "rating": 5,
      "date": "2nd February 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Excellent Service at Ipswich Branch.",
      "text": "Visited Ipswich Branch to transfer an expired ISA to new account. We were welcomed by Michelle without appointment at lunchtime. Following advice, the transaction was completed with patience and courtesy to combine three separate accounts with pass books being retained and returned earlier than expected. Faultless customer service. Thank you.",
      "rating": 5,
      "date": "30th January 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Caring staff face to face is very important",
      "text": "Caring staff face to face is very important",
      "rating": 5,
      "date": "30th January 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Friendly informative staff",
      "text": "Every member of staff was friendly to all the customers I saw. Leah was helpful, informative and efficient",
      "rating": 5,
      "date": "30th January 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Had prompt and friendly service always",
      "text": "Had prompt and friendly service always",
      "rating": 5,
      "date": "29th January 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "A very friendly, helpful and knowledgeable staff mem...",
      "text": "A very friendly, helpful and knowledgeable staff member who explained everything concisely",
      "rating": 5,
      "date": "29th January 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Good day all went well to open account",
      "text": "Good day all went well to open account",
      "rating": 5,
      "date": "28th January 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Lovely staff, helpful and efficient",
      "text": "Lovely staff, helpful and efficient",
      "rating": 5,
      "date": "28th January 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Not applicable today thank you.",
      "text": "Not applicable today thank you. I don’t have an email so cannot give that either",
      "rating": 4,
      "date": "28th January 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Helped review my account, friendly staff",
      "text": "Helped review my account, friendly staff",
      "rating": 5,
      "date": "27th January 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Good advice caring staff love having a branch in Had...",
      "text": "Good advice caring staff love having a branch in Hadleigh face to face service very important",
      "rating": 5,
      "date": "26th January 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Good advice, caring staff, love having a branch in H...",
      "text": "Good advice, caring staff, love having a branch in Hadleigh face to face service very important",
      "rating": 5,
      "date": "26th January 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Good visit excellent service great branch",
      "text": "Good visit excellent service great branch",
      "rating": 5,
      "date": "26th January 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Very good customer service and friendly",
      "text": "Very good customer service and friendly",
      "rating": 5,
      "date": "26th January 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Great service, got what made sense for my finances.",
      "text": "Great service, got what made sense for my finances.",
      "rating": 4,
      "date": "26th January 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Sudbury Suffolk Building Society",
      "text": "Suffolk Building Society branch at Sudbury, staff are very friendly, and always take time to show me and wife how valued our customer is.",
      "rating": 5,
      "date": "25th January 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Great very professional.",
      "text": "Great very professional. Took time and explained everything in full.",
      "rating": 5,
      "date": "24th January 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Ipswich - Very good experience.",
      "text": "Ipswich - Very good experience. Accounts were explained well and clearly. The room and archives were fantastic.",
      "rating": 5,
      "date": "24th January 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Friendly staff, straightforward service",
      "text": "Friendly staff, straightforward service",
      "rating": 5,
      "date": "23rd January 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Caring advice love having a branch in Hadleigh face...",
      "text": "Caring advice love having a branch in Hadleigh face to face service very important.",
      "rating": 5,
      "date": "23rd January 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Caring staff lovely having a branch in Hadleigh.",
      "text": "Caring staff lovely having a branch in Hadleigh. Face to face service very important.",
      "rating": 5,
      "date": "23rd January 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Excellent experience",
      "text": "Great experience,lotsofhelpand information ,face to face is very important for me",
      "rating": 5,
      "date": "23rd January 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Very positive experience",
      "text": "Amanda was very helpful and friendly. She provided us with the relevant information about the account that we chose to open.",
      "rating": 5,
      "date": "23rd January 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Excellent customer care very good advice.",
      "text": "Excellent customer care very good advice. Love that there is a branch in Hadleigh this is very important",
      "rating": 5,
      "date": "23rd January 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Very kind and knowledgeable staff.",
      "text": "Very kind and knowledgeable staff. Very keen to have a branch in Hadleigh this is very important. Feel my savings are in good hands. Face to face help very important",
      "rating": 5,
      "date": "23rd January 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Very Professional",
      "text": "Very professional, very friendly and all aspects of the product explained by Carolyn at the Haverhill branch",
      "rating": 5,
      "date": "22nd January 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "All very pleasant.",
      "text": "All very pleasant. Friendly service with a good cup of tea.",
      "rating": 5,
      "date": "22nd January 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Friendly and competent at ravenswood",
      "text": "Friendly and competent at ravenswood",
      "rating": 5,
      "date": "22nd January 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Friendly, excellent customer service",
      "text": "Friendly, excellent customer service",
      "rating": 5,
      "date": "21st January 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Very kind and helpful.",
      "text": "Very kind and helpful. Helped me",
      "rating": 5,
      "date": "21st January 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Felixstowe - staff very helpful and knowledgeable.",
      "text": "Felixstowe - staff very helpful and knowledgeable. Louise helped us change our address on all our accounts.",
      "rating": 5,
      "date": "21st January 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Informative,fair service,good outcome",
      "text": "Informative,fair service,good outcome",
      "rating": 5,
      "date": "21st January 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Easy and straightforward",
      "text": "Smooth procedure to open savings account.",
      "rating": 5,
      "date": "19th January 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Very friendly and helpful staff.",
      "text": "Very friendly and helpful staff. Explained everything thoroughly.",
      "rating": 5,
      "date": "19th January 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "It was good to speak to people in person",
      "text": "It was good to speak to people in person",
      "rating": 5,
      "date": "19th January 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Very efficient and friendly staff.",
      "text": "Very efficient and friendly staff.",
      "rating": 5,
      "date": "16th January 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Very helpful and very understanding with explaining...",
      "text": "Very helpful and very understanding with explaining everything",
      "rating": 5,
      "date": "16th January 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "A warm welcome instantly recognised by the cashier.",
      "text": "A warm welcome instantly recognised by the cashier. Opening bond with Michelle was very easy and professionally done.",
      "rating": 5,
      "date": "16th January 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Friendly and helpful service.",
      "text": "Friendly and helpful service. Well explained.",
      "rating": 4,
      "date": "16th January 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Prompt and friendly staff at Saxmundham",
      "text": "Prompt and friendly staff at Saxmundham",
      "rating": 4,
      "date": "14th January 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Fantastic service, always friendly!",
      "text": "Fantastic service, always friendly!",
      "rating": 5,
      "date": "14th January 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Felixstowe branch.",
      "text": "Felixstowe branch. Competent and courteous staff.",
      "rating": 5,
      "date": "14th January 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": ".Friendly and efficient service.",
      "text": "Friendly and efficient service. Delivered to my expectations.",
      "rating": 5,
      "date": "14th January 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Great professional staff & atmosphere",
      "text": "Always find the staff very helpful and professional. There is also a good atmosphere in the office.",
      "rating": 5,
      "date": "12th January 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Very satisfied with the customer service",
      "text": "Very satisfied with the customer service",
      "rating": 5,
      "date": "12th January 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Opening an ISA",
      "text": "Everything was explained clearly. A very good experience and the staff member was very competent.",
      "rating": 5,
      "date": "12th January 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Hadleigh",
      "text": "Great experience easy and informative process",
      "rating": 5,
      "date": "9th January 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Exemplary service from Head Office",
      "text": "Exemplary service from Head Office on an ISA I had maturing at the end of December. I decided that I should break it up to give me more flexibility with some staying with Suffolk BS and some going to other providers. It wasn't a simple case of transferring into the offered maturing accounts so having opened the new account online, as a distant customer, I emailed hello@suffolk to explain what I was doing. Alex picked this up and remained in contact to the point of final closure. That was very useful because the transfer to a Building Society that had in the past been so efficient became difficult in not accepting the completed on line transfer form and wanting their own printed transfer form signed and returned in the post. Despite Suffolk BS not receiving that transfer form until after maturity it was in my accounts and the the whole maturity operation concluded with a phone call advising such on 7th January. A clear example of picking up and taking personal responsibility for a not so straight forward maturity and closure thus demonstrating that the customer is important. Thanks Alex Dave",
      "rating": 5,
      "date": "9th January 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Very good carline explained everything to us",
      "text": "Very good carline explained everything to us",
      "rating": 5,
      "date": "9th January 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Excellent service love the friendly approach",
      "text": "Excellent service love the friendly approach",
      "rating": 5,
      "date": "8th January 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Friendly staff",
      "text": "Friendly staff at saxmundham always happy",
      "rating": 5,
      "date": "8th January 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "180 day account",
      "text": "Customer service was excellent, explained accounts in detail and it was all made very clear.",
      "rating": 5,
      "date": "8th January 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Local, easy to get to, branch presence",
      "text": "Local, easy to get to, branch presence",
      "rating": 5,
      "date": "7th January 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "1to1 appointment brilliant don’t stop",
      "text": "1to1 appointment brilliant don’t stop",
      "rating": 5,
      "date": "7th January 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Came in to Woodbridge open a regular savings, staff...",
      "text": "Came in to Woodbridge open a regular savings, staff were very lovely and patient even though it was busy. Very happy",
      "rating": 5,
      "date": "7th January 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Opened an account in sudbury branch",
      "text": "Opened an account in sudbury branch",
      "rating": 5,
      "date": "7th January 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "A very friendly and welcome experience",
      "text": "As usual from past experience, a warm and friendly welcome with helpful advice in choosing a product. A most welcome experience in these modern times, much appreciated.",
      "rating": 5,
      "date": "7th January 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Efficient friendly service local",
      "text": "Efficient friendly service local",
      "rating": 5,
      "date": "6th January 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "I am delighted to have a local building society with...",
      "text": "I am delighted to have a local building society with well maintained premises. Easy access and such welcoming staff. Their knowledge of products is excellent",
      "rating": 5,
      "date": "5th January 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Saxmundham branch",
      "text": "Kind, pleasant, helpful, knowledgeable and easy to contact. Sarah is always very helpful, brilliant",
      "rating": 5,
      "date": "5th January 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Very happy do not change the way you are",
      "text": "Very happy do not change the way you are",
      "rating": 5,
      "date": "5th January 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Very polite staff.",
      "text": "Very polite staff. Everything thoroughly explained without over complicating or over simplifying things.",
      "rating": 5,
      "date": "5th January 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Excellent Service, Excellent Rates",
      "text": "I only discovered Suffolk Building Society in December 2025, when I found them online. I love the simple, gimmick free approach as well as the excellent fixed rate I managed to get on my regular savings. The website is clear, quick to react and easy to navigate. I'll definitely be recommending Suffolk Building Society to my friends and family.",
      "rating": 5,
      "date": "3rd January 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Rachael was very helpful and efficient in dealing wi...",
      "text": "Rachael was very helpful and efficient in dealing with my matters. I could not of been more pleased. The branch is easy to get to and parking is available, just one moan as doors are narrow and I had difficulty in opening doors whilst using 2 sticks",
      "rating": 5,
      "date": "2nd January 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Top rate",
      "text": "Top quality staff. Extremely helpful and friendly.",
      "rating": 5,
      "date": "31st December 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Local financial support",
      "text": "I like the helpful attitude and useful info online.",
      "rating": 5,
      "date": "31st December 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Local branches available",
      "text": "Communication at a local branch and quick service.",
      "rating": 5,
      "date": "31st December 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Reliable, local, friendly",
      "text": "Efficient, friendly and convenient - no suggested improvements.",
      "rating": 5,
      "date": "31st December 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Safe, reliable, personal",
      "text": "Clean, tody, friendly and helpful staff.",
      "rating": 5,
      "date": "31st December 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Excellent, friendly, efficient",
      "text": "Very helpful and quick to open a new ISA and transfer an existing ISA in the branch, quicker than sending forms off.",
      "rating": 5,
      "date": "31st December 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Quick, efficient, friendly",
      "text": "Was quick and easy to open a junior ISA for my children, staff were friendly, helpful and informative.",
      "rating": 5,
      "date": "31st December 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Polite knowledgable staff in halesworth",
      "text": "Polite knowledgable staff in halesworth",
      "rating": 5,
      "date": "31st December 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Very friendly and well informed staff at the Haleswo...",
      "text": "Very friendly and well informed staff at the Halesworth branch.",
      "rating": 5,
      "date": "30th December 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "The staff are fantastic and so professional and effi...",
      "text": "The staff are fantastic and so professional and efficient.",
      "rating": 5,
      "date": "30th December 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Local, Helpful, Accessible.",
      "text": "Excellent service from the young staff member. Thanks.",
      "rating": 5,
      "date": "23rd December 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "ISAs....personal choices and suitability",
      "text": "I needed advice on ISAs and how to set one up",
      "rating": 5,
      "date": "23rd December 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Friendly and efficient",
      "text": "Easy to book a face to face appointment and dealt with efficiently and politely in branch",
      "rating": 5,
      "date": "23rd December 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Woodbridge branch",
      "text": "Very help and friendly. Nothing to much trouble",
      "rating": 5,
      "date": "23rd December 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Came into branch to open a regular saver and was ser...",
      "text": "Came into branch to open a regular saver and was served by Ruby in Woodbridge. She was in training but helped us tremendously. Very happy with the service. Best of luck to her",
      "rating": 5,
      "date": "20th December 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Fair Convenient Helpful",
      "text": "Rachel described the product fully and made the whole transfer of our previous ISA very easy.",
      "rating": 5,
      "date": "19th December 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Satff very good and polite",
      "text": "A good experience staff very good and polite.",
      "rating": 5,
      "date": "19th December 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Local, Friendly, Goodvaule",
      "text": "East to access and interact a branch in busy would be useful.",
      "rating": 5,
      "date": "19th December 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Recommended, Friendly, Helpful",
      "text": "Great experience, highly recommended.",
      "rating": 5,
      "date": "19th December 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Local, Traditional, Friendly",
      "text": "Very happy with experience, nothing to be improved.",
      "rating": 5,
      "date": "19th December 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Here we Are",
      "text": "A pleasure to deal with a human and not a computer. Simple registration with a minimum of fuss. Excellent.",
      "rating": 5,
      "date": "19th December 2025",
      "product": "Savings",
      "sentiment": "positive"
    }
  ]
}