{
  "society": "Teachers Building Society",
  "slug": "teachers-building-society",
  "smpUrl": "https://smartmoneypeople.com/teachers-building-society-reviews/products",
  "totalReviewsOnSMP": 10,
  "avgRating": 3.9,
  "scrapedAt": "2026-02-06T16:09:35.093321+00:00",
  "reviews": [
    {
      "title": "me deaf thanks help how work shell quiet",
      "text": "me deaf thanks help how work shell quiet",
      "rating": 5,
      "date": "15th April 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Fabulous!",
      "text": "I switched to Teachers from another lender years ago, and have had nothing but outstanding service from them. Reviewing my mortgage, adding to it for building works and other reasons and now finally paying it off! Everyone I have spoken to has always been polite, friendly and professional, explaining what needs to be done at every step of the way. Thank you for such a good service over the years.",
      "rating": 5,
      "date": "27th July 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Highly recommended!",
      "text": "My husband and I had been told we would need a high deposit because of his poor credit by other mortgage companies when we began looking at the possibility of a mortgage back in January. We had almost given up hope until we spoke to Gary Andrews (mortgage advisor) who was incredibly helpful from start to finish. Gary was very responsive to all of my daft questions and concerns throughout the process and was always very patient and knowledgeable. We had our mortgage offer today (November) via post and are absolutely ecstatic. I would highly recommend them, especially Gary!",
      "rating": 5,
      "date": "1st November 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Avoid",
      "text": "Avoid using these time wasters. Had a mortgage approved with absolutely no issues for a holiday let mortgage. We explained at the start of the process we were looking to maximise our income and wanted a cottage that needed a small amount of renovating so that we could not only make money from the rent but also increase the value of the property. This they said was not an issue. However After a month or so of looking and offers they rejected any property we put an offer on based on the most ridiculous things (one was rejected as it was next to a church and had a small graveyard!). When I pushed them they eventually admitted they didn’t want us to get a house that required work and we had to go and find one that was already renovated. Do not use them don’t waste your time with them.",
      "rating": 1,
      "date": "25th August 2020",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "Really helpful, they know your case straight away. Really happy with customer service.",
      "text": "They did always know me right after telling the my name. Had no problem asking all my questions, and getting answers. Straightforward process",
      "rating": 5,
      "date": "25th January 2017",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "The staff are helpful but the ISA rate has dropped a...",
      "text": "The staff are helpful but the ISA rate has dropped a so I am about to move my savings to a significantly higher rate. Also, it is not possible to print a statement from their website which is most annoying.",
      "rating": 2,
      "date": "20th April 2025",
      "product": "Savings",
      "sentiment": "negative"
    },
    {
      "title": "Great 1yr fixed ISA rates and d staff very helpful o...",
      "text": "Great 1yr fixed ISA rates and d staff very helpful over the phone.",
      "rating": 5,
      "date": "26th February 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "NO LOYALTY TO LOYAL SAVERS!",
      "text": "I've saved with Teachers Building Society for years and years and, whilst they have never paid a headline rate, its always been competitive. I've now found out not only that my savings have been languishing at about half the rate I could get elsewhere, but they are now reducing the rate even further! Although I'm transfering to a new Teachers account to get nearly twice as much interest, I'll also be looking to move funds elsewhere to a Society which treats me fairly, and values my loyalty!",
      "rating": 1,
      "date": "16th August 2024",
      "product": "Savings",
      "sentiment": "negative"
    },
    {
      "title": "Love it keep up the good",
      "text": "My experience with them as always been great and they are very helpful as well",
      "rating": 5,
      "date": "23rd May 2024",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Easy to deal with",
      "text": "It's easy being one of their savings customers.",
      "rating": 5,
      "date": "21st November 2015",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Awful archaic systems and processes",
      "text": "Awful archaic systems and processes. Everything is paper-based. They're a bit like a 1980s Skoda. The good thing is that they fully admit to how outdated their systems are!",
      "rating": 1,
      "date": "6th November 2025",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    },
    {
      "title": "They posted my login details to the…",
      "text": "They posted my login details to the wrong address (twice); despite providing exactly the right address. Provided a measly £50 compensation. \n\nInsist on hand-filled applications (in 2023). Use an archaic transfer system for ISA transfers. Transferring my ISA in took months; cost me £151.90 in lost interest.\n\nI would not recommend Teachers Building Society.",
      "rating": 1,
      "date": "2nd March 2024",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    },
    {
      "title": "Unfortunately",
      "text": "Unfortunately, not a happy experience for my wife and me. Logging in could be easier and I recommend that the Society should review all its procedures. I did receive a four page letter of explanations and apologies but even that contained a significant time-sensitive error. How can we operate accounts when a Society makes significant mistakes?",
      "rating": 1,
      "date": "13th January 2024",
      "product": "General",
      "sentiment": "negative",
      "source": "trustpilot"
    }
  ],
  "trustpilotUrl": "https://uk.trustpilot.com/review/teachersbs.co.uk"
}