{
  "society": "Cumberland Building Society",
  "slug": "the-cumberland",
  "smpUrl": "https://smartmoneypeople.com/the-cumberland-reviews/products",
  "totalReviewsOnSMP": 106,
  "avgRating": 4.78,
  "scrapedAt": "2026-02-06T15:35:52.761124+00:00",
  "reviews": [
    {
      "title": "First Class",
      "text": "First Class Service from individuals that care.",
      "rating": 5,
      "date": "30th March 2022",
      "product": "Business Account",
      "sentiment": "positive"
    },
    {
      "title": "Great local building society.",
      "text": "Very helpful, friendly and knowledgeable staff wether you call in person or phone.",
      "rating": 5,
      "date": "2nd March 2022",
      "product": "Business Account",
      "sentiment": "positive"
    },
    {
      "title": "Helpful and friendly",
      "text": "All staff are always helpful and friendly, providing excellent service, easily accessible and practical support.",
      "rating": 5,
      "date": "1st March 2022",
      "product": "Business Account",
      "sentiment": "positive"
    },
    {
      "title": "Amazing service, amazing staff,",
      "text": "Long time banking with Cumberland, why go anywhere else, they have always been totally supportive, always there to answer questions and faultless, Dave Laverock Law",
      "rating": 5,
      "date": "7th April 2021",
      "product": "Business Account",
      "sentiment": "positive"
    },
    {
      "title": "Business account for small business",
      "text": "We have held a business account with the Cumberland Building Society for over 8 years now. From the switch transfer of the account from our bank to date, the service has been fantastic. They are always there both at the local branch and head office/ customer service to help with any queries. The branch network is amazing and makes it so easy to access when you need a branch service. In the main we use the internet banking, always working, secure, easy to use facility. This links easily with our personal accounts which are also with the Cumberland. I would not consider any other provider for our business or personal banking. They are at the forefront of technology with an excellent customer service.",
      "rating": 5,
      "date": "1st April 2021",
      "product": "Business Account",
      "sentiment": "positive"
    },
    {
      "title": "Excellent service",
      "text": "Always a pleasure with The Cumberland x Staff are so friendly and lovely",
      "rating": 5,
      "date": "1st April 2021",
      "product": "Business Account",
      "sentiment": "positive"
    },
    {
      "title": "LONG LOST VALUES FOUND HERE",
      "text": "We have a commercial mortgage and a business account with the Cumberland and we are very, very pleased that this has been the case during this last awful year. Fortunately, we have not had to borrow or refinance to survive but our business manager contacted us early on to offer help and advice. They have been supportive and kind. It is a mystery to me why they were not permitted to administer the Bounce Back loans since they are, in my extensive experience, more efficient than any other bank I have dealt with. Excellent customer service all round.",
      "rating": 5,
      "date": "31st March 2021",
      "product": "Business Account",
      "sentiment": "positive"
    },
    {
      "title": "Friendly, local, personal service",
      "text": "I used my local branch to set up a small business account. They couldn't have been more helpful and it's a joy to be able to talk to them face to face. The online banking is excellent. Highly Recommend",
      "rating": 5,
      "date": "25th March 2021",
      "product": "Business Account",
      "sentiment": "positive"
    },
    {
      "title": "CUmberland",
      "text": "Customer services internet baking and phone apps are brilliant - the products themselves and the charges are not.",
      "rating": 3,
      "date": "11th July 2019",
      "product": "Business Account",
      "sentiment": "mixed"
    },
    {
      "title": "Very helpful and friendly",
      "text": "Local very helpful and friendly building society",
      "rating": 5,
      "date": "26th February 2024",
      "product": "Day 2 Day Current Accout",
      "sentiment": "positive"
    },
    {
      "title": "Account",
      "text": "Great day to day account runs smoothly any problems there soon rectified by lovely friendly staff.",
      "rating": 5,
      "date": "23rd March 2022",
      "product": "Day 2 Day Current Accout",
      "sentiment": "positive"
    },
    {
      "title": "Very helpful very friendly very professional",
      "text": "I recently had my bank account hacked & the team at CBS responded immediately, replaced my funds & were very reassuring",
      "rating": 5,
      "date": "28th February 2022",
      "product": "Day 2 Day Current Accout",
      "sentiment": "positive"
    },
    {
      "title": "Amazing Customer Service",
      "text": "Everytime I have a query or issue I just give customer service a quick ring, never on hold for more than 5 mins. And they always resolve my issue instantly.",
      "rating": 5,
      "date": "28th February 2022",
      "product": "Day 2 Day Current Accout",
      "sentiment": "positive"
    },
    {
      "title": "Excellent customer service",
      "text": "I’ve always received excellent support from the Cumberland when I’ve needed it.",
      "rating": 5,
      "date": "28th February 2022",
      "product": "Day 2 Day Current Accout",
      "sentiment": "positive"
    },
    {
      "title": "Reputation",
      "text": "The Cumberland has an extremely good reputation and it is 100% deserved :-)",
      "rating": 5,
      "date": "25th February 2022",
      "product": "Day 2 Day Current Accout",
      "sentiment": "positive"
    },
    {
      "title": "Great, personal service",
      "text": "Really friendly local staff both in branches and in the call centre.",
      "rating": 5,
      "date": "25th February 2022",
      "product": "Day 2 Day Current Accout",
      "sentiment": "positive"
    },
    {
      "title": "Always used Cumberland I wouldn't go anywhere else for banking and mortgage.",
      "text": "Staff are always knowledgeable and friendly. Get things done quickly. Mobile banking app is great and easy to use.",
      "rating": 5,
      "date": "25th February 2022",
      "product": "Day 2 Day Current Accout",
      "sentiment": "positive"
    },
    {
      "title": "Brilliant building society",
      "text": "Very friendly customer service both in person and on the phone, always reassuring when dealing with problems. I have both a current account and savings and find them easy to access and use.",
      "rating": 4,
      "date": "25th February 2022",
      "product": "Day 2 Day Current Accout",
      "sentiment": "positive"
    },
    {
      "title": "Always polite and helpful unlike a lot of banks.",
      "text": "Been with them 22yrs and wouldn't go anywhere else.",
      "rating": 5,
      "date": "10th November 2021",
      "product": "Day 2 Day Current Accout",
      "sentiment": "positive"
    },
    {
      "title": "Fresh and modern feel",
      "text": "Love the App for all my accounts. Its so easy to use and transferring money and paying bills is a simple straightforward process",
      "rating": 5,
      "date": "23rd March 2021",
      "product": "Day 2 Day Current Accout",
      "sentiment": "positive"
    },
    {
      "title": "Personal service",
      "text": "Always greeted with a friendly smile in the branch. Great customer service.",
      "rating": 5,
      "date": "16th March 2021",
      "product": "Day 2 Day Current Accout",
      "sentiment": "positive"
    },
    {
      "title": "Local Cumbrian Bank",
      "text": "The Cumberland is a key part of Cumbria and has always been the home bank of me and all my family. Simple and very helpful",
      "rating": 5,
      "date": "16th March 2021",
      "product": "Day 2 Day Current Accout",
      "sentiment": "positive"
    },
    {
      "title": "Best ethical bank",
      "text": "Hi I would like to endorse the Cumberland as the best ethical financial provider. Their support for the community and their customers has been amazing. They support so many great organisations and do this in a way that provides sustainable support rather than just quick donations so it's great to see organisations like Susan's Farm get support over a number of years",
      "rating": 5,
      "date": "12th March 2021",
      "product": "Day 2 Day Current Accout",
      "sentiment": "positive"
    },
    {
      "title": "Fantastic Customer Service",
      "text": "I’ve been with the Cumberland ever since I got my first debit account and the have been absolutely fantastic. The customer service team are very dedicated and quick to respond. They’ll get any query sorted. Highly recommended",
      "rating": 5,
      "date": "5th March 2021",
      "product": "Day 2 Day Current Accout",
      "sentiment": "positive"
    },
    {
      "title": "Awful with hidden charges",
      "text": "Avoid like the plaque. Lots of hidden charges and terrible customer service due to their bullying nature towards their staff. They also sent me someone else's online banking details when I requested my online banking pin.",
      "rating": 1,
      "date": "11th November 2017",
      "product": "Day 2 Day Current Accout",
      "sentiment": "negative"
    },
    {
      "title": "Excellent all round",
      "text": "Cumberland BS have been fantastic - every step of the way, no fuss, no problems.",
      "rating": 5,
      "date": "20th January 2017",
      "product": "Day 2 Day Current Accout",
      "sentiment": "positive"
    },
    {
      "title": "A great building society",
      "text": "I have used them for years and always had great service. In fact it would seem that the other reviewer had a similar experience until they incurred a charge and then tried to blame the staff. Take responsibility yourself dear.",
      "rating": 5,
      "date": "7th September 2016",
      "product": "Day 2 Day Current Accout",
      "sentiment": "positive"
    },
    {
      "title": "Disappointing considering my Grannie set up this account for me 20 years ago.",
      "text": "Appalling service, sneaky about when and where you'll be charged for unauthorised overdrafts. Rude staff cannot wait till I close my account.",
      "rating": 1,
      "date": "19th February 2016",
      "product": "Day 2 Day Current Accout",
      "sentiment": "negative"
    },
    {
      "title": "Just awful",
      "text": "I very much regret taking a mortgage out with this building society. Worst lender I’ve encountered in over 30 years. Customer service is non existant. They want an insane amount of information when it comes to borrowing anything and then tell me that I can’t afford £5k extra on my mortgage even though my salary just increased by £14k. Won’t use the again.",
      "rating": 1,
      "date": "1st September 2023",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "Very poor",
      "text": "Awful application process. Staff were like robots. Very, very disappointed and won’t use again",
      "rating": 1,
      "date": "27th July 2023",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "Brilliant from start to finish",
      "text": "From the first call to moving in the Cumberland kept me informed about my application, best part was being able to speak to the same person for the whole time - Thank you",
      "rating": 5,
      "date": "28th March 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Good Customer Service",
      "text": "Always great customer service every time I call or pop into a branch. Staff are friendly and go the extra mile.",
      "rating": 5,
      "date": "25th March 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Genuine Friendly People!",
      "text": "We got our first Mortgage with The Cumberland and it was a very calm and friendly experience. Everything was explained thoroughly and help was always just a phone call away!",
      "rating": 5,
      "date": "25th March 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Mortgage and loans support",
      "text": "Always friendly polite and helpful",
      "rating": 5,
      "date": "22nd March 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Locals",
      "text": "Great BS in the South West and northern England . Who look after there customers with that personal touch . Love that you can go on holiday with no charges on your debit card . Been a customer for 35 years and will not be moving",
      "rating": 5,
      "date": "12th March 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Not just a number",
      "text": "I lobe how personal this building society is. Ive used this bank for as long as I can remember as My Mum has too. They are reliable and always there to help with anything you need or want from a bank. I trust them and would never want to look elsewhere to look after my money. My little boy also has 2 savings accounts now and i hope he chooses the Cumberland when he grows up. Annie",
      "rating": 5,
      "date": "6th March 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Personal service, great products",
      "text": "The Cumberland has a range of specialist products all sold by knowledgeable and friendly staff. I can always pick up the phone and speak to someone who knows what they're talking about.",
      "rating": 5,
      "date": "4th March 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "They saved our lives gave h us a mortgage",
      "text": "We were after a mortgage and we were in our late 60s they give us one I can not thank them enough the manager at the branch was a absolute star I thank her as well hope they win a brilliant company and wonderful staff",
      "rating": 5,
      "date": "3rd March 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great mortgage rates",
      "text": "So easy and straightforward to get a first time buyers mortgage with the Cumberland. Lovely staff!",
      "rating": 5,
      "date": "28th February 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Initial mortgage appointment",
      "text": "As a first time buyer I was a little unsure as to what to expect from my initial mortgage appointment. Lewis at the Cumberland was very knowledgeable and gave me all the tools I needed to feel more confident in making an offer on my first home.",
      "rating": 5,
      "date": "28th February 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great service, great team",
      "text": "All the mortgages are really helpful and offer a friendly local service compared to other financial institutions",
      "rating": 5,
      "date": "25th February 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Moved house",
      "text": "Moved house and had been mortgage free for many years.Needed a little top up and had used Cumberland Building Society many years ago.Advisor was great with us",
      "rating": 5,
      "date": "22nd January 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Good service and competitive rates",
      "text": "Mortgage advisor was supportive, attentive and helpful whilst helping us to find the best rate. Good service over the phone",
      "rating": 5,
      "date": "12th May 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Innovative and resposive",
      "text": "Cumberland Buiding Society provide outstanding service with friendly, helpful and knowledgable staff. Their new mortage into reitrement products are a godsend to us older clients who until now had no options for home ownership without getting a Lottery win and buying outright.",
      "rating": 5,
      "date": "18th April 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Real People serving Real People",
      "text": "They operate as a small family business but with the weight of a large bank. Love the personal approach - not a robot in sight",
      "rating": 5,
      "date": "17th April 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "A green mortgage",
      "text": "I just saw you topped the Ethical Consumer rating for banks and lenders. I am surprised that green investing is still only an option. Thank you for leading the way. No-one should be investing in financing climate change.",
      "rating": 5,
      "date": "10th April 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "So helpful and supportive",
      "text": "From start to finish, the experience was friendly, helpful and easy. Excellent customer service, accurate and efficient.",
      "rating": 5,
      "date": "2nd April 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Renewing Mortgage",
      "text": "Incredible service from start to finish. I appreciated how all the staff were aware of my case so everytime I spoke to someone, I didn't have to keep repeating myself. Informative and very slick organisation",
      "rating": 5,
      "date": "2nd April 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Retirement mortgage",
      "text": "We applied for a retirement mortgage to enable us to extend our current property. This was not an issue for the Cumberland Building Society and we were granted it without any problem despite our age.",
      "rating": 5,
      "date": "1st April 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Although we are retired the Cumberland made our mortgage possible so we could extend our home.",
      "text": "They went the extra mile to reassure us we could have a retirement mortgage to achieve our objective. Very helpful.",
      "rating": 5,
      "date": "1st April 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Ggf",
      "text": "Yyjjhhhhhhhhhhhhhhhgggggggggggggggg",
      "rating": 5,
      "date": "24th March 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Friendly local service and good online banking.",
      "text": "Friendly local service and good online banking. Thankfully The Cumberland Building Society is one of the very few banks left in town and soon will be the last. It is appreciated for its branch availability, friendly staff, good range of savng products and great customer service. It is the best bank I have ever dealt with.",
      "rating": 5,
      "date": "29th January 2024",
      "product": "Current Account",
      "sentiment": "positive"
    },
    {
      "title": "Excellent Service",
      "text": "I have been with the Cumberland for the over 10 years and have always found them to be friendly and efficient.",
      "rating": 5,
      "date": "20th January 2023",
      "product": "Current Account",
      "sentiment": "positive"
    },
    {
      "title": "Great customer service",
      "text": "Really helpful local bank. They go out of their way to sort any issues out for you with local service at the end of the phone or in brach. No international help centres located halfway across the world.",
      "rating": 5,
      "date": "14th August 2022",
      "product": "Current Account",
      "sentiment": "positive"
    },
    {
      "title": "Customer Serrvice at its best",
      "text": "I've never once had an issue with the Cumberland since I opened my account 6 years ago. I will support my local Building Society for the foreseeable future",
      "rating": 5,
      "date": "25th March 2022",
      "product": "Current Account",
      "sentiment": "positive"
    },
    {
      "title": "Good Old Fashioned Customer Service",
      "text": "People you can talk to, who have a direct line and are always willing to help. True relationship banking.",
      "rating": 5,
      "date": "25th March 2022",
      "product": "Current Account",
      "sentiment": "positive"
    },
    {
      "title": "Great company",
      "text": "Always doing the right thing to help customers",
      "rating": 5,
      "date": "24th March 2022",
      "product": "Current Account",
      "sentiment": "positive"
    },
    {
      "title": "Great personal service",
      "text": "The colleagues in the local branches and at the Call Centre are helpful and friendly and make a genuine effort to provide a personal service to customers.",
      "rating": 5,
      "date": "24th March 2022",
      "product": "Current Account",
      "sentiment": "positive"
    },
    {
      "title": "Friendly, ethical banking",
      "text": "I have banked with the Cumberland for a few years now. I get straight through on the phone whenever I need to call and the staff are amazingly helpful. I even recently took a mortgage out with them too. I love that they are ethical with a personal service. Only slight downside is that electronic payments to other bank accounts do not appear immediately as with some other banks, but for me the ethical aspect is worth waiting those few hours for a transfer.",
      "rating": 5,
      "date": "15th March 2022",
      "product": "Current Account",
      "sentiment": "positive"
    },
    {
      "title": "Ethical banking across Cumbria",
      "text": "Cumberland Building Society has the ethics I want, and the branches I need.",
      "rating": 5,
      "date": "14th March 2022",
      "product": "Current Account",
      "sentiment": "positive"
    },
    {
      "title": "Ethical banking on your doorstep",
      "text": "I recently switched my banking to The Cumberland. I found them to be efficient and helpful. I wanted to change to more ethical, sustainable banking. The Cumberland more than fitted the bill - local banking services for local people, there's even a branch on the high street :-)",
      "rating": 5,
      "date": "1st March 2022",
      "product": "Current Account",
      "sentiment": "positive"
    },
    {
      "title": "How banks should be",
      "text": "They are such an amazing place to bank. I feel like I can go to them with anything, and they are always happy to help. Whether visiting my local branch, or calling head office, they just make you feel like the most important customer.",
      "rating": 5,
      "date": "28th February 2022",
      "product": "Current Account",
      "sentiment": "positive"
    },
    {
      "title": "Twenty five years of good service.",
      "text": "We have been with the Cumberland Building Society since we got married and wouldn’t go anywhere else, friendly and helpful people x",
      "rating": 5,
      "date": "28th February 2022",
      "product": "Current Account",
      "sentiment": "positive"
    },
    {
      "title": "Always friendly and helpful",
      "text": "Very informative about best available products for the customer. Have been a customer for 30+years this speaks for itself.",
      "rating": 5,
      "date": "28th February 2022",
      "product": "Current Account",
      "sentiment": "positive"
    },
    {
      "title": "Local, friendly, informed, accessible,",
      "text": "I've banked with the Cumberland for over 20 years and made use of a wide range of their products from mortgages and re-mortgages to Savings, current and children's savings accounts. They have lots of local branches making them very accessible to the community. As a result they are also a respected local employer. Their staff are always friendly and well informed and they offer a good range of competitive financial products.",
      "rating": 5,
      "date": "28th February 2022",
      "product": "Current Account",
      "sentiment": "positive"
    },
    {
      "title": "Friendly and reliable",
      "text": "It is so good to be able to bank locally and staff always friendly.",
      "rating": 4,
      "date": "26th February 2022",
      "product": "Current Account",
      "sentiment": "positive"
    },
    {
      "title": "Best for Cumbrians",
      "text": "Been with them over 25years and would not change to another provider. Local and understands the people",
      "rating": 5,
      "date": "26th February 2022",
      "product": "Current Account",
      "sentiment": "positive"
    },
    {
      "title": "Excellent",
      "text": "I switched to a Cumberland current account this year and have been very happy with the service received.",
      "rating": 5,
      "date": "25th February 2022",
      "product": "Current Account",
      "sentiment": "positive"
    },
    {
      "title": "Great customer Service",
      "text": "Always there with a smiley face and a helpful attitude, the staff are great",
      "rating": 5,
      "date": "25th February 2022",
      "product": "Current Account",
      "sentiment": "positive"
    },
    {
      "title": "Cumberland app",
      "text": "Had the app for years and been great, had a problem with the app for 2 or more weeks after popping in to the branch and the IT on it, phone calls a lady called Amy got it all sorted. She was brilliant and got it working. Thanks",
      "rating": 5,
      "date": "30th October 2021",
      "product": "Current Account",
      "sentiment": "positive"
    },
    {
      "title": "Ethical local business",
      "text": "Really Easy to switch when I wanted to get my money out of one if the big banks to avoid investment in oild & gas. Good to know I'm now supporting local businesses, groups and residents who need loans and grants.",
      "rating": 5,
      "date": "13th April 2021",
      "product": "Current Account",
      "sentiment": "positive"
    },
    {
      "title": "Simple and easy to understand the app.",
      "text": "I use this app on a daily basis to keep up to date with my spending. Very easy to understand.",
      "rating": 5,
      "date": "1st April 2021",
      "product": "Current Account",
      "sentiment": "positive"
    },
    {
      "title": "Efficient and friendly service",
      "text": "The Cumberland provides us with free current account banking and linked savings. The website is easy to use and staff are very helpful with any non-standard transactions.",
      "rating": 5,
      "date": "30th March 2021",
      "product": "Current Account",
      "sentiment": "positive"
    },
    {
      "title": "Outstanding customer service",
      "text": "Great range of current and savings accounts available. Internet and mobile banking easy to access and navigate, with useful, straightforward functionality. Staff are extremely helpful if you need to ring Customer Services, with limited waiting times. Highly recommend. What are you waiting for?",
      "rating": 5,
      "date": "26th March 2021",
      "product": "Current Account",
      "sentiment": "positive"
    },
    {
      "title": "Friendly local branch teams",
      "text": "While most of the big banks have abandoned the market town of Cockermouth, The Cumberland Building Society has stayed open though economic downturn and Covid-19. We really appreciate the Cumberland's loyalty to the town and the friendly service from our local branch team., Thank you all.",
      "rating": 5,
      "date": "23rd March 2021",
      "product": "Current Account",
      "sentiment": "positive"
    },
    {
      "title": "Friendly service, easy to use app",
      "text": "Staff always friendly, easy straightforward banking. App is clear and easy to use, as is the website. If you ever need anything it’s easy to speak to a member of customer service",
      "rating": 5,
      "date": "22nd March 2021",
      "product": "Current Account",
      "sentiment": "positive"
    },
    {
      "title": "Anywhere, anytime",
      "text": "The flexibility of this, and other, Cumberland account suits my needs perfectly. Staff are both knowledgeable and helpful and the online interface is simple and flows seamlessly, allowing instant access anywhere at anytime.",
      "rating": 5,
      "date": "20th March 2021",
      "product": "Current Account",
      "sentiment": "positive"
    },
    {
      "title": "Personal Service",
      "text": "Staff are always helpful and every trip is made personal. A local business I will always be happy to support",
      "rating": 5,
      "date": "19th March 2021",
      "product": "Current Account",
      "sentiment": "positive"
    },
    {
      "title": "Great local service from a friendly team",
      "text": "I use the Plus current account for all my day to day banking needs and it suits my purposes entirely. The website is easy to use and when I have queries or concerns I can call the local team at Carlisle who are patient, very helpful and always friendly. I like that the branches still have counter service and I have found the quality of service overall better than previous high street banks I have used",
      "rating": 5,
      "date": "15th March 2021",
      "product": "Current Account",
      "sentiment": "positive"
    },
    {
      "title": "Consistantly Good",
      "text": "Always there if they're needed. Always helpful. Always friendly.",
      "rating": 5,
      "date": "14th March 2021",
      "product": "Current Account",
      "sentiment": "positive"
    },
    {
      "title": "amazing",
      "text": "Easy to use, low charges, ethical standpoint",
      "rating": 5,
      "date": "9th March 2021",
      "product": "Current Account",
      "sentiment": "positive"
    },
    {
      "title": "Great service but needs work",
      "text": "They offer great option for current account personally and offer amazing customer service but i would like see bit more with the current account",
      "rating": 4,
      "date": "7th March 2021",
      "product": "Current Account",
      "sentiment": "positive"
    },
    {
      "title": "Great people offering really fantastic service",
      "text": "Great people delivering brilliant service to local communities and customers",
      "rating": 5,
      "date": "6th March 2021",
      "product": "Current Account",
      "sentiment": "positive"
    },
    {
      "title": "Still there for us!",
      "text": "The Cumberland continues to provide an open door to welcome customers with a smile despite Covid and the difficulties of lockdown in 2020 and 2021. Cockermouth, for instance, has lost four banks in the last few years (Halifax, HSBC, NatWest and Lloyds). They have loss out to our regional bank which is there for customers 6 days a week with long opening hours each day. All credit to our fantastic Cumberland Building Society!",
      "rating": 5,
      "date": "14th February 2021",
      "product": "Current Account",
      "sentiment": "positive"
    },
    {
      "title": "A trustworthy current account",
      "text": "I love the Cumberland Building Society. They don’t always get it right but the way they have helped people during the Coronavirus epidemic is brilliant. They have waived overdraft interest completely. This is the true morals of a building society. Unlike Nationwide who are still charging 18.9%! Well done Cumberland in doing the right thing.",
      "rating": 5,
      "date": "23rd April 2020",
      "product": "Current Account",
      "sentiment": "positive"
    },
    {
      "title": "Great building society",
      "text": "Excellent current account with a fair overdraft rate compared to some of the banks and now the Nationwide Building Society, who are more like a bank!! You can use your debit card abroad with no charge which is a really fair approach.",
      "rating": 4,
      "date": "13th January 2020",
      "product": "Current Account",
      "sentiment": "positive"
    },
    {
      "title": "A great Building Society",
      "text": "They offer a fair current account overdraft, as they should as a building society. Unlike Nationwide! They allow you to use your debit card worldwide with no fee. Their customer service is in the U.K. and straight through to someone. Their savings are a bit hit and miss though.",
      "rating": 4,
      "date": "13th January 2020",
      "product": "Current Account",
      "sentiment": "positive"
    },
    {
      "title": "Free withdrawals abroad",
      "text": "Use your card when you travel for free is the best thing about this account. The staff are supurb.",
      "rating": 5,
      "date": "7th September 2016",
      "product": "Current Account",
      "sentiment": "positive"
    },
    {
      "title": "Wonderful to have a friendly local bank that is stil...",
      "text": "Wonderful to have a friendly local bank that is still on the high street where I can pop in a get things done quickly. Good range of savings products at a fair interest rate.",
      "rating": 5,
      "date": "21st March 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Great service from real people",
      "text": "Great experience. Know what they're talking about and very helpful.",
      "rating": 5,
      "date": "9th February 2023",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Friendly staff and local branches",
      "text": "Unlike the big banks that have largely abandoned customers, we are delighted to have a local bank that is open 6 days a week and where the staff seem happy to see you. Convenient current account and top ISA rate.",
      "rating": 5,
      "date": "20th January 2023",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Great product, wonderful service",
      "text": "The savings account is easy to use and pays a great rate. The customer service is above and beyond and it's lovely to speak to people really easily.",
      "rating": 5,
      "date": "1st April 2022",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Great rates",
      "text": "Easy to use the app online to manage transferring funds across accounts. Friendly customer service whenever I ring for help.",
      "rating": 5,
      "date": "25th March 2022",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Amazing",
      "text": "Great service delivered by great people",
      "rating": 5,
      "date": "24th March 2022",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Savings",
      "text": "Great savings account but can access when needed",
      "rating": 5,
      "date": "23rd March 2022",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Friendly and professional",
      "text": "We have banker with the Cumberland for over 40 years & in that time they have never failed to provide superbly professional service to us",
      "rating": 5,
      "date": "14th March 2022",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Great staff",
      "text": "So helpful about different accounts.the people in wigton branch on the counter are so informative you don’t need to have an appointment to get great advice",
      "rating": 5,
      "date": "3rd March 2022",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Staff",
      "text": "They set are consistently helpful and friendly and always have time to patiently listen to customers requests.",
      "rating": 5,
      "date": "2nd March 2022",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "First Class Service",
      "text": "The staff in my local branch are very helpful and knowledgeable",
      "rating": 5,
      "date": "1st March 2022",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Ethical and helpful",
      "text": "Knowledgeable friendly helpful staff in branch, and on the end of the phone. Ethical products from an ethically responsible business.",
      "rating": 5,
      "date": "28th February 2022",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Favourite place to bank",
      "text": "Friendly and helpful staff. Always a pleasant experience visiting Cockermouth branch.",
      "rating": 5,
      "date": "28th February 2022",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Helpful and friendly advice",
      "text": "Great service, helpful and friendly advice over the phone and in branch. A good range of account options for personal and business needs.",
      "rating": 5,
      "date": "30th March 2021",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Banking with the Cumberland",
      "text": "I have been banking with the Cumberland Building Society in Dumfries some 30 years ago since it first opened there. .I have recently moved all my banking to them as I have always found the service first class.",
      "rating": 5,
      "date": "22nd March 2021",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Cumberland comes up trumps",
      "text": "Excellent and knowledgable staff, many branches available to help. Various accounts/savings available with competitive rates proud that they are my local building society",
      "rating": 5,
      "date": "7th November 2017",
      "product": "Savings",
      "sentiment": "positive"
    }
  ]
}