{
  "society": "Family Building Society",
  "slug": "the-family-building-society",
  "smpUrl": "https://smartmoneypeople.com/the-family-building-society-reviews/products",
  "totalReviewsOnSMP": 1850,
  "avgRating": 4.93,
  "scrapedAt": "2026-02-06T15:42:11.221951+00:00",
  "reviews": [
    {
      "title": "Visiting the branch",
      "text": "When I visited the branch I had little idea what I wanted to do with my expired bond. I was greeted in a friendly way and chose to be served by Alexis. She was extremely helpful and I decided to open a new ISA. Thank you. In",
      "rating": 5,
      "date": "15th May 2025",
      "product": "Insurance",
      "sentiment": "positive"
    },
    {
      "title": "Really good",
      "text": "I find them easy to deal with friendly and efficient service",
      "rating": 5,
      "date": "20th July 2022",
      "product": "Insurance",
      "sentiment": "positive"
    },
    {
      "title": "Family Building Society Mortgage Information",
      "text": "Louise was very helpful, and explained in detail all the options that are open to us. We look forward to speaking to Louise’s colleague on Friday between 10am-12noon.",
      "rating": 5,
      "date": "3rd February 2026",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "My initial telephone call for a mortgage",
      "text": "My initial telephone call with your employee Alice Bennett was excellent - very knowledgeable, polite and helpful in every way to take my mortgage enquiry further. As an employer, I would be very pleased if all my staff dealt with our enquiries in the same manner",
      "rating": 5,
      "date": "3rd February 2026",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Serena was exceptional in helping me to renew my mor...",
      "text": "Serena was exceptional in helping me to renew my mortgage. She went over and above from whatever anyone could expect. Including remembering me from a week before, and taking the trouble to walk to a different department to find out the answer to a question.",
      "rating": 5,
      "date": "29th January 2026",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Had a message chat and was given a number to talk ab...",
      "text": "Had a message chat and was given a number to talk about my new mortgage rates options, it was the savings number, but I was politely and quickly transferred to new business. Small queue, answer pretty quickly, person very polite, helpful, knowledgeable and gave me the advice I neeeded to make a product decision. Provided additional info and signposted the next steps.",
      "rating": 5,
      "date": "29th January 2026",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "New business team was very helpful.",
      "text": "New business team was very helpful.",
      "rating": 5,
      "date": "28th January 2026",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Received the usual comprehensive, professional and f...",
      "text": "Received the usual comprehensive, professional and friendly assistance when discussing my mortgage arrangements. Always provide the information I require in order for me to make an informed decision.",
      "rating": 5,
      "date": "28th January 2026",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "First Class Help",
      "text": "The few times I have made contact the help has been excellent",
      "rating": 5,
      "date": "27th January 2026",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Well Done Family Building Society",
      "text": "Louise Taylor was really helpful discussing through a possible mortgage solution for my son his wife. She was thorough and really understanding. We have past experience of an mortgage with Family Building Society and also have savings with them. They have been top rate on both sides. I would recommend them a lot.",
      "rating": 5,
      "date": "23rd January 2026",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "House Purchase",
      "text": "I received a thorough and clear explanation of every aspect of the matter at hand and I detected an air of efficiency and professionalism.",
      "rating": 5,
      "date": "22nd January 2026",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "extremely helpful and very pleasant,...",
      "text": "The advisor was extremely helpful and very pleasant, I would definitely recommend Family Building Society",
      "rating": 5,
      "date": "20th January 2026",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "FBS customer services agent was very helpful",
      "text": "FBS customer services agent was very helpful when I enquired about renewing my current interest only mortgage loan which is due to expire in April. He provided me with full details about my options and assisted me in making the best selection for my new mortgage loan product.",
      "rating": 5,
      "date": "13th January 2026",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "FRAUD NEVER APOLOGISED",
      "text": "FBS sent me a bill some 12 months after I took the loan which was unjustified and I had to fight long and hard to get this removed. Bailiff was mentioned. VERY BAD",
      "rating": 5,
      "date": "12th January 2026",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "I needed help in re-establishing my sign-on details...",
      "text": "I needed help in re-establishing my sign-on details with National Counties following a catastrophic loss of data on my laptop. This could only be done at speed, by phoning. Fortunately, with the help of Tracey Rogers I was able to recreate my full sign-on USER NAME and passwords. Despite my slow speed at getting through the necessary stages, with Tracy's very patient help and guidance I got the task completed. Thank you so much for this, Tracy.",
      "rating": 5,
      "date": "12th January 2026",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Very easy to get to speak to Luke Green who was extr...",
      "text": "Very easy to get to speak to Luke Green who was extremely helpful and informative",
      "rating": 5,
      "date": "12th January 2026",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "HI Lisa, thanks for your support. You were amazing 5*",
      "text": "HI Lisa, thanks for your support. I was really struggling with it but you helped me.",
      "rating": 5,
      "date": "10th January 2026",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Very helpful friendly advisor very knowledgable",
      "text": "Very helpful friendly advisor very knowledgable",
      "rating": 5,
      "date": "9th January 2026",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Experience of Remortgaging a BTL Mortgage",
      "text": "I generally had a seamless experience with their remortgaging team and process. Their BTL products for expats are reasonably competitive including fees. I would have liked the option, particularly in the current environment of falling interest rates of a lifetime tracker BTL mortgage product. I am generally very happy with the Family Building Society, particularly when other lending providers would not consider expats for BTL mortgages.",
      "rating": 5,
      "date": "9th January 2026",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "It was a pleasure to talk to Lisa today and she was...",
      "text": "It was a pleasure to talk to Lisa today and she was very helpful",
      "rating": 5,
      "date": "9th January 2026",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "The team at the fbs are always so helpful, polite an...",
      "text": "The team at the fbs are always so helpful, polite and knowledgeable.",
      "rating": 5,
      "date": "7th January 2026",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "excellent customer service when i called your office...",
      "text": "excellent customer service when i called your office to discuss new mortgage products... thank you, you made to whole process easy.",
      "rating": 5,
      "date": "2nd January 2026",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "I needed help getting online.",
      "text": "I needed help getting online. I used the online help number. It was answered quickly. The colleague put me at ease and stayed with me until I was happy that I was successfully active online with my mortgage account.",
      "rating": 5,
      "date": "30th December 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Good response to queries .",
      "text": "Good response to queries .Efficient and professional ser ice .",
      "rating": 5,
      "date": "29th December 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Call back service was fast and very helpful",
      "text": "I arranged a call back to confirm recent transactions. Fast call back and niceclady was very helpful and efficient",
      "rating": 5,
      "date": "29th December 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Brilliant professional service.",
      "text": "Brilliant professional service. I receive my mortgage statement yearly showing all transactions and data clearly and easy to understand. I would recommend Family Building Society to everyone.",
      "rating": 5,
      "date": "17th December 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "£1600 being taken from ex-mortgagees account",
      "text": "We had a worrying problem about £1600 being taken by the Family Building Soc from our current account from a discontinued mortgage. Spoketo your first point of contact Donnika Nelson. She was courteous, reassuring then promptly and efficiently dealt with the problem. Well done Donika. from Frank& Jenny Palmer",
      "rating": 5,
      "date": "17th December 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Enquired about a few technical & practical aspects o...",
      "text": "Enquired about a few technical & practical aspects of my mortgage. Lisa was very competent & empathetic.",
      "rating": 5,
      "date": "17th December 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "A Very Satisfied Customer!",
      "text": "Having applied,with the services of a broker,for a mortgage at the age of 69years,I was worried regarding,in my eyes,how my application might fail but was reassured,by my broker,all was okay.And,as it turned out,it was.That was 2013.I have never regretted,for any reason,joining National Counties Building Society as was and now,Family Building Society.Thank you.",
      "rating": 5,
      "date": "16th December 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "I found your staff to be very friendly & helpful",
      "text": "I found both Katherine and Louise very friendly, professional and extremely helpful. I had asked the question about porting my mortgage and Katherine passed me over to Louise who answered my queries plus more.",
      "rating": 5,
      "date": "10th December 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Amazing support from Family Building Society",
      "text": "Amazing support from Grace the Bdm and the whole mortgage helpdesk as well as the underwriting team, including Somy. A fantastic change to the norm and such a breath of Fresh Air to work with Family Building Society. Covered all of the points of acquired and communication was spot on with everything. Other lenders should take a leaf out of your book.!!!",
      "rating": 5,
      "date": "9th December 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "A PLEASURE TO DO BUSINESS WITH!",
      "text": "I took out a BTL mortgage with Family which was secured via a broker (I am an expat and couldn't go direct). Since it has been in place I have had several questions regarding possible future options and have been able to contact Family direct instead of going through the broker. I am so impressed with them. Each time I've called I've been put straight through to an appropriate team member, who has listened and given me excellent advice (not financial, of course) as to which products do what and so on, and today they couldn't help me directly as they don't offer what I am looking for, but they made enquiries and put me in touch with someone who can definitely help. They didn't have to do that - they just wanted to help a client. I can't recommend them highly enough - they're kindly and understanding, courteous and extremely informed and helpful. Bravo Family Building Society",
      "rating": 5,
      "date": "8th December 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Excellent Customer Service",
      "text": "Louise Taylor from FBS was extremely helpful",
      "rating": 5,
      "date": "28th November 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Helpful Honest Answers",
      "text": "Help with my question and helped me make the most of my mortgage",
      "rating": 5,
      "date": "27th November 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "50 years between and still as helpful as ever.",
      "text": "They have always been helpful in identifying the needs -v- the opportunities. Oddly they are my \"buffers\". They gave me my first mortgage in 1975 and now my last in 2025!",
      "rating": 5,
      "date": "27th November 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "As per usual, the customer services were second to n...",
      "text": "As per usual, the customer services were second to none. Such a breath of fresh air. Having had mortgages for the best part of 40 years, this company is by far the easiest company to deal with. Thank you!!",
      "rating": 5,
      "date": "25th November 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "I spoke to Guy.",
      "text": "I spoke to Guy. Very professional and explained things very clearly. Took his time as I didn’t fully understand and explained the options available. Was very nervous to discuss daunting remortgaging but Guy made the experience great. Great customer service Guy! Thanks.",
      "rating": 5,
      "date": "25th November 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "good advice over the phone and suggestions as to the...",
      "text": "good advice over the phone and suggestions as to the products",
      "rating": 4,
      "date": "21st November 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Well informed mortgage advisers- explaining everythi...",
      "text": "Well informed mortgage advisers- explaining everything to my satisfaction & guiding me through the process- excellent service",
      "rating": 5,
      "date": "19th November 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "I have not dealt with The Family BS until recently a...",
      "text": "I have not dealt with The Family BS until recently and I had a case which was proving a bit unusual in that it was a Joint application sole proprietor. I initially spoke to Nathan Waller as the usual BDM was on leave, Nathan was excellent. When Sam Morrison came back off leave I went through the case again with him. Before we submitted the case there was lots of questions I had to round things off, I have to say that Sam was absolutely excellent. Nothing was too much trouble for him, he called me back on time, he answered all of my questions, no issues at all, I can't praise him enough and what a nice guy to deal with. I must say that FBS have got it so right, even on the odd occasion I had to ring the main office everyone was great. Well Done FBS. I'm looking forward to seeing now that the underwriters are going to make the final process as good.",
      "rating": 5,
      "date": "14th November 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Lisa was very Helpful and answered all I need.",
      "text": "Lisa was very Helpful and answered all I need.",
      "rating": 5,
      "date": "10th November 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Moving to a new product after a fixed term deal.",
      "text": "Coming to the end of a fix with the Family, I asked about moving to a new product and had a great experience speaking with Guy Williams on the new business team. Really useful and very insightful, he explained in detail several options and allowed me to consider a few different ways of moving on. I couldn't thank him enough !",
      "rating": 5,
      "date": "7th November 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Asked about redemption of mortgage and advisor could...",
      "text": "Asked about redemption of mortgage and advisor could not be more helpful",
      "rating": 5,
      "date": "6th November 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Real people, really helpful",
      "text": "Quickly and easily accessible, friendly and jargon-free people to talk to, able to answer all our questions and guide us through the minefields. Even the waiting music is good, and I was sorry we got put through too quickly (10 seconds) for me to enjoy it more. So impressed that my daughter is opening an ISA with you so that we are keeping everything in the family...building...society.",
      "rating": 5,
      "date": "6th November 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "The Friendly BS - they live up to their name.",
      "text": "The Friendly BS have been helpful and understanding throughout the period of our mortgage. I was retired when we took out our interest only mortgage and I am 75 as I write this review as we are about to pay it off. If you are retired but still require a mortgage consider using the Friendly. They live up to their name.",
      "rating": 5,
      "date": "6th November 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Very good service by guy.",
      "text": "Very good service by guy. Clear and excellent information given good old-fashioned service. I’m now making an application as I was so impressed there was no waffle and information was crystal clear.",
      "rating": 5,
      "date": "3rd November 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Excellent professional service from Nathan.",
      "text": "Nathan was absolutely brilliant in taking my call and helping me to get the best results possible for my client. He is a credit to your company.",
      "rating": 5,
      "date": "1st November 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Excellent service.",
      "text": "Excellent service. Easy to deal with. Louise was very efficient",
      "rating": 5,
      "date": "31st October 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "I needed an Ex Pat Mortgage renewal.",
      "text": "I needed an Ex Pat Mortgage renewal. Spoke with Erick he was exceptional, talked me through the product and the process with precision. Alice was also great she was prompt to reply just as Erick was. They made the process so simple and from 3500 miles away that is exactly what I required.",
      "rating": 5,
      "date": "29th October 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "EXCELLENT PRODUCT, GREAT PEOPLE!",
      "text": "I've recently contacted Family Building Society about possibilities for the long-term future (eg extending my mortgage term) and also help with temporary difficulties, and they couldn't have been more helpful. I've been made to feel very welcome each time I have called, and all three people I've spoken with recently - Arounima, Aisha and Erick - have displayed incredible empathy and patience while I waffled on and have given me as much help as I could possibly have wished for. When I was looking to take out a mortgage 2 years ago, Family offered easily the best product for an ex-pat. I recommend Family wholeheartedly.",
      "rating": 5,
      "date": "28th October 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Mortgage",
      "text": "Phoned for information regarding my mortgage",
      "rating": 5,
      "date": "24th October 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Logging Problems",
      "text": "My call was answered by Kasey who was very helpful and guided me through the process to get a new verification code in order to be able to log in.",
      "rating": 5,
      "date": "24th October 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Great, friendly, professional service always",
      "text": "I spoke to Arounima R at great length asking in depth questions, FBS are lucky to have her, she was calm, professional and detailed. I miss the old school style service that FBS still have, highly recommend them.",
      "rating": 5,
      "date": "22nd October 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "I found the agent to be efficient and patient.",
      "text": "I found the agent to be efficient and patient. He helped me through my questions",
      "rating": 5,
      "date": "20th October 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Amy was both engaging and competent",
      "text": "Amy was both engaging and competent, and gave us all the answers we needed to decide our way ahead",
      "rating": 5,
      "date": "20th October 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Louise was very professional, answered all my querie...",
      "text": "Louise was very professional, answered all my queries and was also fun to talk to",
      "rating": 5,
      "date": "17th October 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Very cooperative staff.",
      "text": "Very cooperative staff. Today I spoke to Kasey. She was very very friendly and cooperative. She listen to me and helped me. I always advise my friends to have mortgage from family building society when they need. Family building society is the best I can recommend to others.",
      "rating": 5,
      "date": "15th October 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Good To Do Business With",
      "text": "Good to do business with and met all expectations with flexible underwriting and prompt responses.",
      "rating": 5,
      "date": "15th October 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "First class service with a friendly and confident se...",
      "text": "First class service with a friendly and confident service",
      "rating": 5,
      "date": "13th October 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Ellisa was very helpful & professional.",
      "text": "Ellisa was very helpful & professional.",
      "rating": 5,
      "date": "13th October 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Excellent customer service",
      "text": "Spoke to two staff members, Stephanie and Louise. They were both very informative and provided cleat answers to my questions. I felt treated as an individual, and not like a number. Would recommend Family Building Society",
      "rating": 5,
      "date": "10th October 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Louise was very helpful and professional",
      "text": "Louise was very helpful and professional in my mortgage application",
      "rating": 5,
      "date": "9th October 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "10 OUT OF 10 FOR ELLISSIA.",
      "text": "i was very impressed with the service i had with ELLISSIA shewas very polite and extremily patience with me considering i am not very good on a computor full marks to her",
      "rating": 5,
      "date": "9th October 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Pleasant helpful girls on the phone.",
      "text": "Pleasant helpful girls on the phone.",
      "rating": 4,
      "date": "8th October 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Staff are so helpful and patient",
      "text": "Staff are so helpful and patient",
      "rating": 5,
      "date": "3rd October 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Agent had friendly telephone manner and was informat...",
      "text": "Agent had friendly telephone manner and was informative.",
      "rating": 4,
      "date": "3rd October 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "I spoke with Louise Taylor and she was very helpful...",
      "text": "I spoke with Louise Taylor and she was very helpful and talked me through all of my options for a mortgage renewal.",
      "rating": 5,
      "date": "2nd October 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Mortgage extension review",
      "text": "They have been very efficient and friendly during the process, letting me go at my own pace.",
      "rating": 5,
      "date": "1st October 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Best customer care & service",
      "text": "Best customer care & service, we had terrible problems with computers and communication your staff (Domnika and Sandra) were the best ever!",
      "rating": 5,
      "date": "1st October 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Lisa Adams was very helpful and understanding.",
      "text": "Lisa Adams was very helpful and understanding. Her knowledge was excellent, she took her time to make sure i understood everything about my mortgage switch. She clearly explained how i could pay in money to help reduce my new switched mortgage and when i pay in the allowed 10% per annum payment allowed",
      "rating": 5,
      "date": "26th September 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Friendly and knoledgeable staff",
      "text": "Alison was very fiendly, helpful and knowledgeable in assisting me with a mortgage application",
      "rating": 5,
      "date": "26th September 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Introductory Phone Call Bodes Well!",
      "text": "What a joy to speak to an interactive person, who although has to extract certain core info, it is not through a rigid box-ticking process. A promised call-back following a criteria check happened within minutes, with a courtesy call the following day. And love the on-hold music - Santander, eat your heart out!",
      "rating": 5,
      "date": "26th September 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Efficient and polite staff.",
      "text": "Efficient and polite staff. The person who answered my call this morning answered all my questions.",
      "rating": 5,
      "date": "25th September 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Excellent communications",
      "text": "All of communications with Family Building Society have been helpful, supportive and positive. The advice and guidance provided has been excellent.",
      "rating": 5,
      "date": "25th September 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Mortgage Affordability Discussion",
      "text": "With respect to my telephone conversation with Guy Williams, the telephone call served its purpose in providing us with confirmation that we would pass the affordability check for an increase on our mortgage. The conversation was professional, pleasant and expedient.",
      "rating": 5,
      "date": "24th September 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Eric was excellent, very patient with my questions a...",
      "text": "Eric was excellent, very patient with my questions and gave comprehensive answers. The",
      "rating": 5,
      "date": "23rd September 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Arounima Rosun, was very patient during my inquiry/C...",
      "text": "Arounima Rosun, was very patient during my inquiry/Call. Very Helpful.",
      "rating": 5,
      "date": "23rd September 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "I was given good detailed and accurate information a...",
      "text": "I was given good detailed and accurate information and advice.",
      "rating": 5,
      "date": "22nd September 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Mortgage success!!",
      "text": "On the phone I spoke with Alice Bennett and she sorted out my situation effectively and efficiently. As a result I am happily continuing with TFBS. Another 5 years fixed rate with my mortgage.",
      "rating": 5,
      "date": "22nd September 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Found my initial phone contact very helpful with ver...",
      "text": "Found my initial phone contact very helpful with very amiable advisor",
      "rating": 5,
      "date": "22nd September 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Guy Williams was fantastic !",
      "text": "Guy Williams was fantastic ! Talked me through options with clarity and helped me with laptop display. A credit to your organisation.",
      "rating": 5,
      "date": "18th September 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Mortgage switch",
      "text": "Your agent was very helpful and sorted out our problem",
      "rating": 5,
      "date": "17th September 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Great customer service",
      "text": "I have had the pleasure to deal with Serena regarding my account. She has provided great support and advice in a friendly, clear and professional manner. l feel that all my questions were answered by the end of the call.",
      "rating": 5,
      "date": "17th September 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Exemplary Service",
      "text": "Customer service at Family Building Society was human, warm, informed. Thank you to Alice for her help.",
      "rating": 5,
      "date": "17th September 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "A quick response when contacting on the telephone an...",
      "text": "A quick response when contacting on the telephone and the lady was polite and helpful",
      "rating": 4,
      "date": "14th September 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Very helpful knowledgeable customer services team.",
      "text": "Very helpful knowledgeable customer services team.",
      "rating": 5,
      "date": "12th September 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Great service",
      "text": "My product was coming To an end so i called to discuss my options, spoke to Amiee who was very helpful and answered all of my questions",
      "rating": 5,
      "date": "11th September 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Good around satisfactory service",
      "text": "Good around satisfactory service",
      "rating": 5,
      "date": "10th September 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "I spoke with Dylan D’Cruz regarding my mortgage.",
      "text": "I spoke with Dylan D’Cruz regarding my mortgage. He was very helpful and explained everything I needed to know and ensured I understood.",
      "rating": 5,
      "date": "10th September 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Excellent customer service.",
      "text": "Very good customer service. Things explained clearly and very helpful, professional whilst remaining friendly. Help given with comparing products and clear advice on actions needed. I couldn’t fault the call handler, and any dealings I have had with them has been excellent. I would thoroughly recommend this Building Society.",
      "rating": 5,
      "date": "10th September 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Luke was excellent really friendly and informative",
      "text": "Luke was excellent really friendly and informative",
      "rating": 5,
      "date": "9th September 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Locked Out Of My Account",
      "text": "I was locked out of my Mortgage account on Sunday 7th Sept. Contacted Family Building Society today Monday 8/09/25 and and the problem was sorted out by Lisa Adams who was very pleasant and cheerful to speak to she was very Patient with me when I using my mobile phone to get an access code. Thanks LISA",
      "rating": 5,
      "date": "8th September 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Pure excellence.",
      "text": "Once again Family BS have shown themselves to be the best financial organisation that there is. Common sense used at all times.",
      "rating": 5,
      "date": "8th September 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Mortgage query",
      "text": "Telephoned with a query about my mortgage. First time there was no answer from customer service after 8 minutes. Phoned again later in the day. Answered in 15 seconds by Lisa Adam, who was very helpful.",
      "rating": 3,
      "date": "7th September 2025",
      "product": "Mortgage Reviews",
      "sentiment": "mixed"
    },
    {
      "title": "Called to check some details.",
      "text": "Called to check some details. Had to wait and then get a call back.",
      "rating": 4,
      "date": "5th September 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Got through to the appropriate person very quickly.",
      "text": "Got through to the appropriate person very quickly. Her name is Aisha Malik. She was very knowledgable and understood my problem.. She listened patiently and realised the sensitive nature of my concerns.",
      "rating": 5,
      "date": "5th September 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "I’m happy with this company my mortgage is due to co...",
      "text": "I’m happy with this company my mortgage is due to come to an end",
      "rating": 5,
      "date": "2nd September 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Phone call with mortgage advisor.",
      "text": "Phone call with your mortgage advisor who was very helpful, efficient & knowledgeable.",
      "rating": 5,
      "date": "29th August 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Great and clear communication.",
      "text": "Great and clear communication. Very friendly",
      "rating": 5,
      "date": "29th August 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Getting online.",
      "text": "I was struggling to access the online service. I was lucky enough to speak to Donnika who immediately identified the problem and then steered me successfully through the process.. All working now.",
      "rating": 5,
      "date": "29th August 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Simone Ayles was outstanding.",
      "text": "Simone Ayles was outstanding. She explained everything to us in detail and was very helpful.",
      "rating": 5,
      "date": "26th August 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "FBC have scored yet again!",
      "text": "I spoke to Guy Williams and whilst being very professional he was also friendly and understood that i was nervous and needed questions answered. He answered all of my questions in an easy to understand way. Before finishing my call he made sure that i was happy and didn’t have any further questions.",
      "rating": 5,
      "date": "26th August 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Catherine was professional, friendly and helpful.",
      "text": "Catherine was professional, friendly and helpful. However, as I had only 1 customer in front of me in the queue, and it took some time to answer my call, was she the only person dealing with calls. Finally, please use a lower case 'r' for 'Kind regards'.",
      "rating": 4,
      "date": "25th August 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Applying for new fixed rate mortgage product.",
      "text": "Various telephone and email conversations re applying for a new fixed interest rate. Latest telephone conversation on 21 August with Alice Bennett. She was very friendly, professional and proactively helpful in resolving my enquiry.",
      "rating": 5,
      "date": "23rd August 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Change of Interest Only Contract",
      "text": "I spoke to Catherine today with regard to the closure of our current contract and the start of a new contract. She was very polite and extremely helpful in explaining the questions we asked. She is a credit to your Company",
      "rating": 5,
      "date": "22nd August 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Very professional and friendly service from Arounima...",
      "text": "Very professional and friendly service from Arounima Rosun. Helped with all my enquiries.",
      "rating": 5,
      "date": "22nd August 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Excellent service",
      "text": "I want to congratulate Luke Green for the excellent customer service he provided me. He was extremely courteous, professional and friendly; a pleasure to deal with. He was a credit to himself and the Family Building Society. I would not hesitate to recommend the society to others based on my experience. Tony",
      "rating": 5,
      "date": "21st August 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "The telephone service was unbelievable good",
      "text": "The telephone service was unbelievable good",
      "rating": 5,
      "date": "21st August 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Downloading and Uploading files",
      "text": "I had a problem opening a file from an email I was sent. I rang up for assistance and the issue was resolved quickly and efficiently. I also asked for guidance on how to upload securely a document to their web site ..... the instructions were clear and solved my issue.",
      "rating": 5,
      "date": "20th August 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Very helpful in relation to setting our minds at res...",
      "text": "Very helpful in relation to setting our minds at rest when our fixed mortgage is due for renew.",
      "rating": 5,
      "date": "19th August 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Very polite and helpful advisor who answered my ques...",
      "text": "Very polite and helpful advisor who answered my questions quickly and efficiently",
      "rating": 5,
      "date": "18th August 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "The advisor was friendly and informative and assiste...",
      "text": "The advisor was friendly and informative and assisted me in making the right decision.",
      "rating": 5,
      "date": "16th August 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Mortgage enquiry",
      "text": "Needed answers about my mortgage and I was pleased with the service I received. Lisa was very friendly and professional and answered all my queries, thank you Lisa",
      "rating": 5,
      "date": "15th August 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Customer Service Representative Dylan D'Cruz dealt w...",
      "text": "Customer Service Representative Dylan D'Cruz dealt with my query swiftly with professionalism and politeness. A great example of how customer service should be and a credit to FBS",
      "rating": 5,
      "date": "14th August 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Louise was most helpful and reassuring.",
      "text": "Louise was most helpful and patient as i explained what I was asking for. She seems most knowledgeable and able to advise me on the way forward and reassure me that the RIO mortgage I am seeking is theoretically achievable. She confirmed that she would send an email re the next step.",
      "rating": 5,
      "date": "13th August 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Received very helpful advice regarding renewal of mo...",
      "text": "Received very helpful advice regarding renewal of mortgage. The person I spoke to was well informed, friendly and easy to talk to, and I felt more confident about making decisions about which mortgage product to choose and when to confirm that decision.",
      "rating": 5,
      "date": "13th August 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Have been very accommodating.",
      "text": "Have been very accommodating. We had to ask for a couple of extensions which FBS were happy to do. Thank you",
      "rating": 5,
      "date": "13th August 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "The Friendliest Society",
      "text": "Easy company to deal with, no real issues at all. My only comment is that the lending rates are higher than the market place",
      "rating": 5,
      "date": "13th August 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "The responder was excellent; proactive; patient and...",
      "text": "The responder was excellent; proactive; patient and kept a very successful progress through all of the online system difficulties encountered. The call was ultimately very successful and I congratulate the responder on her competence and skill",
      "rating": 5,
      "date": "12th August 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Clear answers to questions asked.",
      "text": "Clear answers to questions asked. Informative but polite",
      "rating": 5,
      "date": "8th August 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Mortgage information",
      "text": "I neededcsome advice and figures and Lisa was friendly, efficient and knowledgeable and was able to answer all my questions. I was given the informational professionally and in a way I could understand",
      "rating": 5,
      "date": "8th August 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Amy was very clear and helpful.",
      "text": "Amy was very clear and helpful.",
      "rating": 5,
      "date": "8th August 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Helpful advice",
      "text": "Rian Brasier explained everything I needed",
      "rating": 5,
      "date": "7th August 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Good experience",
      "text": "Not long waiting on phone. Spoke to a human! Knowledgeable representative. Helpful. Good experience",
      "rating": 5,
      "date": "7th August 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "good BDM support and Knowledge of products that are...",
      "text": "good BDM support and Knowledge of products that are fit for 2030 and future lending process very good using JBSP lender products that meets the demand of today. I like the fact we can discuss the case in detail with a person rather than a machine.",
      "rating": 5,
      "date": "7th August 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "2 very quick and efficient conversations re our mort...",
      "text": "2 very quick and efficient conversations re our mortgage renewal.Alice Bennett explained the options with clarity and detail.",
      "rating": 5,
      "date": "7th August 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Excellent service from all staff at Family BS",
      "text": "Always had a rapid response to emails and found all staff extremely helpful and supportive when telephoning the office with a query",
      "rating": 5,
      "date": "6th August 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Contacting Family Building Society",
      "text": "I had to make 2 calls today to The Family Building Society, and i must say on both occasions both Erick and Arounima were fantastic. Patient and very helpful !! The best staff i have spoken to in a long time.",
      "rating": 5,
      "date": "5th August 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "The agent was very helpful and clear.",
      "text": "The agent was very helpful and clear. A pleasure to talk with her",
      "rating": 5,
      "date": "4th August 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Very helpful.",
      "text": "Very helpful. Although when requested a call back on 1st August did not get one.",
      "rating": 5,
      "date": "2nd August 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Helpful & courteous conversation",
      "text": "Helpful & courteous conversation",
      "rating": 5,
      "date": "31st July 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Donnika was fantastic",
      "text": "I had a queriery about a payment and was a little worried. I spoke with Donnika she walked me through it, spoke with her team and had everything sorted in 10 minutes. An incredibly polite, efficent and speedy team/service. Cant recommend more.",
      "rating": 5,
      "date": "30th July 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "A kind, patient efficient young lady. Oustanding.",
      "text": "A kind, patient efficient young lady. Ace.",
      "rating": 5,
      "date": "29th July 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "On line help was excellent and easy to folloe",
      "text": "Very helpful. Sorted my problem out very quickly Thank you",
      "rating": 5,
      "date": "29th July 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "A friendly professional service provider",
      "text": "Easy to contact and very professional service on line/telephone.Able to answer questions in very helpful way/manner",
      "rating": 5,
      "date": "24th July 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "I received a courtesy call from Rian Brasier",
      "text": "I received a courtesy call from Rian Brasier to check I was aware of an impending mortgage renewal. I was but unfortunately had the two mortgage products we have with FBS mixed up so this was a fortuitous call that saved us from a potentially costly mistake. Many thanks!",
      "rating": 5,
      "date": "22nd July 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "It was an absolute pleasure dealing with Luke Green...",
      "text": "It was an absolute pleasure dealing with Luke Green today in the new business department, he was very professional, polite, extremely patient and very kind. He is a credit to your business and I was very suprised to find someone of his caliber at the end of a phone line. I hope he is destined for great things in your organisation. The time spent waiting for my call to answered could be improved but I dont put that down to him !",
      "rating": 5,
      "date": "21st July 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "simple log in issues quickly resolved by a very poli...",
      "text": "simple log in issues quickly resolved by a very polite and ehlpful member of staff",
      "rating": 5,
      "date": "21st July 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Happy Customer",
      "text": "All my comments about the FBS will be very positive except for the often busy phone lines.",
      "rating": 5,
      "date": "18th July 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Enquiry dealt with efficiently and satisfactorily",
      "text": "Enquiry dealt with efficiently and satisfactorily",
      "rating": 5,
      "date": "17th July 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "FBS mortgage coming to end of term",
      "text": "We have a FBS mortgage that is coming to end of term. We had a helpful letter of options if staying with them and a follow-up call today. The new offeres are a little bit higher than one or two others on the market, but the saving of no termination fee, no legal or other fees etc. make the FBS offer better overall. And the communicaion and service we hav received first time round was excellent.",
      "rating": 5,
      "date": "17th July 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Helpful and informative",
      "text": "Sereana Nalden was very helpful and understanding she explained everything to me.",
      "rating": 5,
      "date": "15th July 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Prompt and efficient service.",
      "text": "Prompt and efficient service. Very friendly, helpful and secure.",
      "rating": 5,
      "date": "9th July 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Our query delivered very quickly and efficiently by...",
      "text": "Our query delivered very quickly and efficiently by Aimee Kennedy",
      "rating": 5,
      "date": "9th July 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Simone 1st Class service,very helpful",
      "text": "we would like to thank Simone who listened to our predicament and went over and above to help us. she was very polite. Simone contacted us when she said she would. 1st class service Simone something you don't get these days. We really appreciate the help/ service given to us. Thank you",
      "rating": 5,
      "date": "6th July 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Good clear options given by Mortgage Consultant, kne...",
      "text": "Good clear options given by Mortgage Consultant, knew his product.",
      "rating": 5,
      "date": "4th July 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "I have had all my questions answered clearly and wit...",
      "text": "I have had all my questions answered clearly and with much expertise.",
      "rating": 5,
      "date": "3rd July 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Spoke to amie very helpful patient and knowledg...",
      "text": "Spoke to amie very helpful patient and knowledgeable thank you. She helped with all my questions.",
      "rating": 5,
      "date": "3rd July 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Quick to answer the telephone.",
      "text": "Quick to answer the telephone. All questions answered promptly.",
      "rating": 5,
      "date": "30th June 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Spoke to Louise she was very knowledgable and very h...",
      "text": "Spoke to Louise she was very knowledgable and very helpful excellent service",
      "rating": 5,
      "date": "30th June 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Excellent",
      "text": "Your staff have an excellent customer care manner, they explain everything in clear and concise manner",
      "rating": 5,
      "date": "25th June 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Louise Taylor deserves a big fat bonus, and a pay rise.",
      "text": "I made an enquiry to see if I am eligible to be a customer, and I received a prompt response which asked for some details, followed quickly by a phone call to take it further. Louise Taylor was my contact and she was excellent. Very helpful, friendly, professional, a joy to be treated in such a pleasant way.",
      "rating": 5,
      "date": "24th June 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Got locked out of my account.",
      "text": "Got locked out of my account. New security can be intimidating. They rang me back and sorted it. I am deaf but Rita spoke clearly and communicated well.",
      "rating": 4,
      "date": "24th June 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Choosing a new new mortgage product",
      "text": "Telephone conversation with Kieran Smith to discuss and arrange new fixed interest rate upon imminent expiry of current discounted rate. Very helpful and arranged quickly. This follows discussions with David Hobbs and Luke Green last week, both also very helpful. Thank you.",
      "rating": 5,
      "date": "23rd June 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Lisa Adams was a very courteous and helpful adviser...",
      "text": "Lisa Adams was a very courteous and helpful adviser who talked me through my repayment options",
      "rating": 5,
      "date": "20th June 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "professional knowledgeable and pleasant",
      "text": "professional knowledgeable and pleasant",
      "rating": 5,
      "date": "20th June 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "First class customer service.",
      "text": "First class customer service. I had 2 questions and received prompt email responses to both. One enquiry required a telephone call to confirm certain details and, having been promptly connected to the person I had been communicating by email, everything was resolved within minutes. Very impressed.",
      "rating": 5,
      "date": "19th June 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "The refreshingly family-oriented building society",
      "text": "I have always found the staff at the Family Building society super helpful and friendly and actually talk to you like its your own family business. Its extremely refreshing to have this level of customer service in today's automated everything.",
      "rating": 5,
      "date": "19th June 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Why was the call necessary?",
      "text": "I telephoned FBS as they had failed to pass me some information they agreed to deliver when I last contacted them some 6 weeks previously. I was dealt with efficiently and the information was promised within a few days.",
      "rating": 4,
      "date": "18th June 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Very Helpful",
      "text": "Very helpful, knowledgable and efficient. The representative (Julie) did exactly what she said she would do and timely.",
      "rating": 5,
      "date": "18th June 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Mix up over our monthly payments",
      "text": "A mix up over our monthly payments meant that 2 payments were taken out this month. Called Customer Services and they identified the issue and resolved it vweet quickly",
      "rating": 5,
      "date": "17th June 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Very friendly customer service, excellent telephone...",
      "text": "Very friendly customer service, excellent telephone manner",
      "rating": 5,
      "date": "16th June 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Spoke to an incredibly helpful lady who assisted me...",
      "text": "Spoke to an incredibly helpful lady who assisted me with altering my address, and gave reassurance about how and when I will remortgage. I felt anxious about calling as I only completed on Monday and have never had a mortgage. She was fab, and I didn’t feel nervous at all.",
      "rating": 5,
      "date": "13th June 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "I have just spent around fifteen minutes on the phon...",
      "text": "I have just spent around fifteen minutes on the phone with Lisa. My enquiry was dealt with in such à efficient way. Lisa was so helpful and has a lovely personality. What a joy.",
      "rating": 5,
      "date": "12th June 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Telephone conversation with Louise Taylor was extrem...",
      "text": "Telephone conversation with Louise Taylor was extremely helpful.",
      "rating": 5,
      "date": "11th June 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "I tried to get through on the 9th June.",
      "text": "I tried to get through on the 9th June. Automated service says I was number one in the queue. I hung on for 30 minutes each minute to be told I was first in the queue. It then offered me a call back service which I acceoted but did not get a call back. Today I phoned again and Louise Taylor answered the phome and thank goodness was extremely helpful and was able to help me.",
      "rating": 5,
      "date": "11th June 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "fixed Rate coming to an end.",
      "text": "we have had a mortgage with FBS for sometime. We recently contacted them as our fixed rate product was about to end. The lady we spoke to was very helpful and was well informed when answering our questions and was able to offer excellent advice based on our requirements.",
      "rating": 5,
      "date": "9th June 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Very good customer service, and really quick to work...",
      "text": "Very good customer service, and really quick to work with. No problems whatsoever and definitely recommended.",
      "rating": 5,
      "date": "9th June 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Gillian Collard was very very helpful thank you.",
      "text": "Gillian Collard was very very helpful thank you. very patient",
      "rating": 1,
      "date": "6th June 2025",
      "product": "Mortgage Reviews",
      "sentiment": "negative"
    },
    {
      "title": "open clear and straightforward excellent communication",
      "text": "open clear and straightforward excellent communication",
      "rating": 5,
      "date": "3rd June 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Good service and a good range of products to suit",
      "text": "Good service and a good range of products to suit",
      "rating": 5,
      "date": "29th May 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Great customer service as well as competitive rates",
      "text": "I have my mortgage with Family because they had the best rate and it hasn't been any trouble. In a position now to make an overpayment and so called up to understand the process and was very happy with the service. Spoke to Lisa and Jill on separate calls and they were both excellent. Polite, professional and proactively helpful really tremendous friendly service both times. Great to get such excellent human service will recommend Family after this experience.",
      "rating": 5,
      "date": "29th May 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Aimee was brilliant.",
      "text": "Aimee was very helpful over the phone, able to answer all my questions and anything she's didn't know she was able to find out. All done very polietly and quickly. Very impressed. Great customer service..",
      "rating": 5,
      "date": "28th May 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Great response once I got through!!",
      "text": "Great interaction with Luke on call. All queries answered in one call. Only downside was waiting 15 mins in call queue",
      "rating": 5,
      "date": "27th May 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Excellent customer service - super knowledgeable",
      "text": "Excellent custimer service with Gillian Collard being very courteous, quick and most of all very knowledgeable. Within about 10 seconds of passing security, she spotted the issue with my access and had two options to get me back up and running. Couldn't be happier.",
      "rating": 5,
      "date": "27th May 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Great Service",
      "text": "Very helpful staff. Didn't take long to get to the right person.",
      "rating": 5,
      "date": "23rd May 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "My mortgage product was coming to the end of its ter...",
      "text": "My mortgage product was coming to the end of its term and was being changed to a new product. I had a query that I needed to resolve first and contacted Kieran Smith who gave me the answers I needed. I have spoke to Kieran before and he is excellent, as are ALL the staff that I have dealt with. Great company, great staff. Thank you.",
      "rating": 5,
      "date": "23rd May 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Thank you Michelle for an excellent service experi...",
      "text": "Thank you Michelle for an excellent service experience",
      "rating": 5,
      "date": "22nd May 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Good help from Dylan on changing password and access...",
      "text": "Good help from Dylan on changing password and accessing online",
      "rating": 5,
      "date": "21st May 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "FBS sees gaps in the market to offer mortgages to th...",
      "text": "FBS sees gaps in the market to offer mortgages to those families turned away by others. This is highly appreciated and forward thinking.",
      "rating": 5,
      "date": "20th May 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Erick Dodd",
      "text": "Erick was very helpful and gave full advice",
      "rating": 5,
      "date": "19th May 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "First class service",
      "text": "Professional, knowledgeable, efficient. First class! Thank you.",
      "rating": 5,
      "date": "16th May 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Remortgaging how it should be - fast, clear and simple",
      "text": "For my remortgage as an expat, I could't ask FBS for more. From application through ongoing communication to product switch, it has been smooth sailing with excellent and transparent communication, no hidden surprises and super responsive.",
      "rating": 5,
      "date": "15th May 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Enquired about options with Aaron, good experience a...",
      "text": "Enquired about options with Aaron, good experience and please with service",
      "rating": 5,
      "date": "14th May 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Very helpful team - the service and advise was spot...",
      "text": "Very helpful team - the service and advise was spot on",
      "rating": 5,
      "date": "13th May 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "EXCELLENT SERVICE.",
      "text": "I spoke at length with Louise regarding the probability of me moving home and porting my mortgage to the new property. My overall experience was excellent and the information I was provided with was clear and easy to understand. I would like to compliment Louise for her friendly attitude whilst maintaining her level of professionalism.",
      "rating": 5,
      "date": "9th May 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "very friendly Service",
      "text": "I spoke to Simone She was very helpful & Professional. It’s very nice when you get help in difficult time . Thanks",
      "rating": 5,
      "date": "9th May 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Louise Taylor was exceptionally helpful and professi...",
      "text": "Louise Taylor was exceptionally helpful and professional. She couldn’t do enough to help us. Louise promised to get back to us, and true to her word she returned our enquiry in a very efficient manner.",
      "rating": 5,
      "date": "7th May 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "vandelle was very helpful, professional and knowledg...",
      "text": "vandelle was very helpful, professional and knowledgeable. She answered all questions thoroughly. Excellent job Vandelle. Thank you so much",
      "rating": 5,
      "date": "6th May 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Exellent customer service",
      "text": "Exellent customer service - I had some pretty dumb questions about my offset mortgage account, but your fantastic customer service representative, Gillian Collard, was patient, highly professional and explained everything perfectly. Absolutely faultless!",
      "rating": 5,
      "date": "30th April 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "The person I dealt with on the phone was really frie...",
      "text": "The person I dealt with on the phone was really friendly and super helpful. Talked me through everything very clearly.",
      "rating": 5,
      "date": "29th April 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "i wanted to pay off a capital sum on my mortgage and...",
      "text": "i wanted to pay off a capital sum on my mortgage and i spoke to Gillian Collard who was very helpful and confirmed everything had been completed as instructed",
      "rating": 5,
      "date": "28th April 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Helpful and friendly staff",
      "text": "Very helpful staff on the phone and good products for 'unusual' mortgage types",
      "rating": 5,
      "date": "28th April 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Helpful staff",
      "text": "Staff very friendly, polite & helpful as had received an unnecessary confusing letter despite having refixed the mortgage deal previously",
      "rating": 4,
      "date": "26th April 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Excellent Customer Service.",
      "text": "I needed assistance with an enquiry regarding my mortgage account, Catherine C provided this quickly and pleasantly.",
      "rating": 5,
      "date": "25th April 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Extremely polite and helpful",
      "text": "The young lady I spoke to was extremely polite and helpful and made sure I understood everything completely",
      "rating": 5,
      "date": "25th April 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "I spoke to Ryan Brasier.",
      "text": "I spoke to Ryan Brasier. He was courteous throughout and most helpful. I am most impressed and have complete confidence in the Society.",
      "rating": 5,
      "date": "25th April 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Excellent service from family building society.",
      "text": "Excellent service from family building society. This is the best building society to get mortgage. Their product is to the people need and very good cooperative and helpful staff.",
      "rating": 5,
      "date": "24th April 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Helpful and friendly advisers provided useful inform...",
      "text": "Helpful and friendly advisers provided useful information. Thank you.",
      "rating": 5,
      "date": "23rd April 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Extremely helpful and pleasant assistance on the phone.",
      "text": "Extremely helpful and pleasant assistance on the phone. Answered all my questions politely and fully.",
      "rating": 5,
      "date": "23rd April 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "GREAT SERVICE FROM RYAN VERY CLEAR AND JUST WHAT I R...",
      "text": "GREAT SERVICE FROM RYAN VERY CLEAR AND JUST WHAT I REQUIRED",
      "rating": 5,
      "date": "23rd April 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Very helpful",
      "text": "Alice was extremely helpful in answering my questions, put my mind at rest",
      "rating": 5,
      "date": "22nd April 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Very helpful, seamless transaction, very good inform...",
      "text": "Very helpful, seamless transaction, very good information provided for decision.",
      "rating": 5,
      "date": "17th April 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Criteria Check",
      "text": "We're a mortgage brokerage firm who specialise in securing BTL and Resi mortgages for UK expats living/working overseas. I needed some criteria information to add FBS to our sourcing system. Michelle was very helpful.",
      "rating": 5,
      "date": "15th April 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Their values shine through",
      "text": "In all our dealings with the Family Building Society, their values shine through: fairness, transparency and customer service that goes above and beyond. Taking out a mortgage is a major life event and FBS made it a very good experience.",
      "rating": 5,
      "date": "15th April 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Outstanding Service from start to Completion",
      "text": "My BDM Amar Mashru was so helpful in helping me present the case. He was quick with responses and very knowledgeable with all aspects of criteria. Somy, well she was just so amazing and went beyond the call of duty with her communications and understanding of the case. I cant praise her enough. Also, a mention to Eric who was quick to overcome my challenges when I called in for help. Outstanding service from all involved and one super happy broker and client. Thank you Team FBS",
      "rating": 5,
      "date": "15th April 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Excellent rage of savings products.",
      "text": "Excellent rage of savings products. Secure online message service very good. I have opened 3 accounts recently and it was easy to do so Account certificates arrived shortly afterwards. Delighted to have become a member a terrific building society.",
      "rating": 5,
      "date": "15th April 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Great service as always from Family Building Society",
      "text": "Great service as always from Family Building Society",
      "rating": 5,
      "date": "9th April 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Excellent service from start to finish",
      "text": "From start to finish have had such good support and assistance. Very clear explanations. Wuick response and I was en ex pat with no luck till FBS and they made the whole process easy. Have now cleared Morthage and they even congratulated me",
      "rating": 5,
      "date": "8th April 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "I called to discuss a case",
      "text": "I called to discuss a case and Aaron was really helpful, provided me with all the information needed",
      "rating": 5,
      "date": "8th April 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Excellent Service",
      "text": "As a broker it is important to have good support where you are discussing a case which I did when I spoke with Rosie who I discussed the case with and obtained a Decision in Principle and supported me up to when I submitted the application.",
      "rating": 5,
      "date": "8th April 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "This was my first direct contact with the Building S...",
      "text": "This was my first direct contact with the Building Society and everything was positive delivered with excellent customer service",
      "rating": 5,
      "date": "4th April 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Really Good Experience.",
      "text": "I had a really good experience and was given all the help and information I required to enable me to come to my decision. Serena was very polite, helpful and patient in explaining all the options available to me both on the telephone and online. Well done, thank you.",
      "rating": 5,
      "date": "3rd April 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Customer Service",
      "text": "Call was dealt with quickly and efficiently by Louise, friendly and helpful. 5 stars!",
      "rating": 5,
      "date": "2nd April 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Usually quick to pick up the phone, staff are always...",
      "text": "Usually quick to pick up the phone, staff are always friendly and helpful",
      "rating": 5,
      "date": "31st March 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Extremally Helpful Response",
      "text": "when ever I call for any queries I get exceptionally helpful and polite response",
      "rating": 5,
      "date": "31st March 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Friendly and knowledgeable and easy to discuss mortg...",
      "text": "Friendly and knowledgeable and easy to discuss mortgage questions",
      "rating": 5,
      "date": "28th March 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "So far my broker has been dealing with them",
      "text": "So far my broker has been dealing with them but I just called to make payment of the application fee and the lady I spoke to was polite, cheerful and helpful.",
      "rating": 5,
      "date": "27th March 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Enjoyable review",
      "text": "One each occasion when dealing with the Society the ladies I dealt with on both occasions were very polite helpful informative and concise.",
      "rating": 5,
      "date": "27th March 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Fast efficient uncomplicated.",
      "text": "Fast efficient uncomplicated and friendly and its easy to talk with a person.",
      "rating": 5,
      "date": "27th March 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Very nice staff in the phone,ran through and sorted...",
      "text": "Very nice staff in the phone,ran through and sorted my enquiry quickly and efficiently",
      "rating": 5,
      "date": "26th March 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Lisa & Ali provided excellent customer service",
      "text": "Lisa & Ali provided excellent customer service",
      "rating": 5,
      "date": "26th March 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Dave Hobbs was very helpful in navigating our enquir...",
      "text": "Dave Hobbs was very helpful in navigating our enquiry for a mortgage and provided important information that would have been difficult to find elsewhere!",
      "rating": 5,
      "date": "18th March 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "\"Keiran\" answered all my queries immediately and eff...",
      "text": "\"Keiran\" answered all my queries immediately and efficiently. Makes me glad I am with The Family Building Society.",
      "rating": 5,
      "date": "14th March 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Ryan was patient and very helpful and explained ever...",
      "text": "Ryan was patient and very helpful and explained everything we needed to know regarding portal of out mortgage.",
      "rating": 5,
      "date": "12th March 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Changing mortgage product.",
      "text": "Very clear and straight forward, response times were very good and changing product was remarkably stress free.",
      "rating": 5,
      "date": "11th March 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Brilliant company.",
      "text": "Brilliant company. Staff always lovely, not always the best rate but always the best service and I wouldn't go anywhere else.",
      "rating": 5,
      "date": "10th March 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Good service",
      "text": "Very fast in answering calls and the staffs are friendly and knowledgeable.",
      "rating": 5,
      "date": "10th March 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Ryan helped me today He patiently answered all my qu...",
      "text": "Ryan helped me today He patiently answered all my questions he was great and very helpful",
      "rating": 5,
      "date": "10th March 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Excellent Briefing Rescues Client",
      "text": "With my mortgage product coming to its end in March, i selected another product in January but then failed to provide written confirmation. On phoning FBS today, I discovered my selection was no longer available. But, the FBS agent I spoke with (Serena) led me by the hand through options available, I made my selection, and the show was back on the road. She was enormously helpful and her briefing crystal clear. Well done and thank you. Major Nick",
      "rating": 5,
      "date": "5th March 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "I have had a fantastic experience with family buildi...",
      "text": "I have had a fantastic experience with family building Society. Their customer service is outstanding—friendly, knowledgeable, and always willing to go the extra mile to assist with any inquiries.",
      "rating": 4,
      "date": "3rd March 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "I rang to find out about how to apply for a mortgage.",
      "text": "I rang to find out about how to apply for a mortgage. The security process was politely and quickly gone through, and Kieran from the New Business Team was extremely helpful and informative.",
      "rating": 5,
      "date": "28th February 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Really nice people to talk with and explained with d...",
      "text": "Really nice people to talk with and explained with detail and clarity",
      "rating": 5,
      "date": "27th February 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "LOUISE DID WELL!",
      "text": "I was more than happy with Louise's recommendations regarding possibilities for a mortgage, considering I am a 69yr old foreigner with permanent right to remain but with foreign pensions with a British wife considerably younger. A complex situation which was handled with professionalism and care.",
      "rating": 5,
      "date": "20th February 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Switching my mortgage.",
      "text": "I telephoned to arrange my mortgage switch and the agent couldn't have been more helpful. She explained the working of the associated savings account, which I'd never come across before. She also explained that the cashback offer, which I'd seen online, applied to re-mortgaging, rather than switching. I was then informed about what would happen next. Excellent service!",
      "rating": 5,
      "date": "20th February 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "I sometime struggle with the way Family BS underwrit...",
      "text": "I sometime struggle with the way Family BS underwrite a mortgage. However on this occasion my experience was what I would deem to be \"normal\" and no strange requests for items were made and once docs were received the case progressed nicely",
      "rating": 4,
      "date": "19th February 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Needed advice about changing or porting my mortgage.",
      "text": "Needed advice about changing or porting my mortgage. The customer service representa (Alice) patiently dealt with all of my 'what if' questions, was very helpful and fhad a lovely approach",
      "rating": 5,
      "date": "19th February 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Efficient communication about a complex subject.",
      "text": "Efficient communication about a complex subject. Felt very confidant the advisor was competent and well informed.",
      "rating": 5,
      "date": "19th February 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Very helpful staff and polite.",
      "text": "Very helpful staff and polite. I cannot praise them enough for helping me secure a mortgage.",
      "rating": 5,
      "date": "18th February 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Louise Taylor was very friendly and professional in...",
      "text": "Louise Taylor was very friendly and professional in her work i would highly recommend you company to others",
      "rating": 5,
      "date": "18th February 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Breath of Fresh Air",
      "text": "Generally very little waiting time to speak to customer services and all staff knowledgeable on the products. It's a breath of fresh air compared with the average experience.",
      "rating": 5,
      "date": "17th February 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Don't come much better than that!",
      "text": "No waiting, David was quick, knowledgeable, helpful and resolved my query with maximum courtesy and minimum fuss. Thank you.",
      "rating": 5,
      "date": "14th February 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "very help full people and good service",
      "text": "very help full people and good service",
      "rating": 5,
      "date": "14th February 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "We spoke with Rian Brasier today and he could not ha...",
      "text": "We spoke with Rian Brasier today and he could not have been more helpful. He gave us all the information we needed and was very very polite and understanding.",
      "rating": 5,
      "date": "12th February 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Informative and friendly.",
      "text": "Informative and friendly. Very happy with the experience.",
      "rating": 5,
      "date": "12th February 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Ryan the mortgage adviser was brilliant and gave me...",
      "text": "Ryan the mortgage adviser was brilliant and gave me all the info I needed to make my decision which deal to take. Ryan is a credit to the company",
      "rating": 5,
      "date": "11th February 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Making a call to the society",
      "text": "Only had two telephone calls to make but the service was prompt and the advice clear and helpful.",
      "rating": 5,
      "date": "10th February 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Over 60's mortgage",
      "text": "Currently lookin for an over 60's mortgage for a building renovation project. Louise has been exceptionally helpful throughout and it looks as though Family Building Society will be able to offer the product I am after.",
      "rating": 5,
      "date": "5th February 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Great customer service - poor website",
      "text": "Guy was extremely helpful and patient explaining capital and overpayments - but the process of leaving a review is overly complicated - especially if you are trying to use a phone.",
      "rating": 5,
      "date": "5th February 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    },
    {
      "title": "Aaron Nichols was extremely helpful in liaising with...",
      "text": "Aaron Nichols was extremely helpful in liaising with the underwriter to get the case agreed and then progressed to offer so was delighted with the outcome.",
      "rating": 5,
      "date": "4th February 2025",
      "product": "Mortgage Reviews",
      "sentiment": "positive"
    }
  ]
}