{
  "society": "Tipton & Coseley Building Society",
  "slug": "tipton-coseley-building-society",
  "smpUrl": "https://smartmoneypeople.com/tipton-coseley-building-society-reviews/products",
  "totalReviewsOnSMP": 26,
  "avgRating": 4.62,
  "scrapedAt": "2026-02-06T16:09:50.395504+00:00",
  "reviews": [
    {
      "title": "Show stopper, Incredible staff, service and criteria",
      "text": "Cant thank my AMAZING BDM Joanna Ridgeway enough for all her hard work on complex purchase case which was submitted on the 2nd or September and completed on the 1st October. Thank you Joanna Ridgeway, Sophie Jagpal underwriter, made myself and clients family happy with efficiency of application!",
      "rating": 5,
      "date": "2nd October 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Friendly company.",
      "text": "Decent mortgage rates, maybe not the best on offer - but more importantly good advice and customer service. A friendly company who are easy to deal with.",
      "rating": 5,
      "date": "16th April 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "First class customer service!",
      "text": "Not the most competitive rates on the market - as they freely admit - but great customer service and explanation of their products - and advice on which product is best suited to you - more than makes up for this.",
      "rating": 5,
      "date": "14th October 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great mortgage advice and service.",
      "text": "Friendly and sensible mortgage advice given. Not the most competitive rates on the market - which they admit - but the overall customer experience makes up for this in my opinion.",
      "rating": 5,
      "date": "17th June 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Unprofessional People making life like hell",
      "text": "I was trying to get mortgage. first of all there SLA is always 5 working days. like if they ask for any information and you provide it immediately you would get feedback after 1 week. The fail to understand the documents and asks sames explanation again and again wasting your time. I would not recommend it. They exaggerate such a way that they are the best and they only provide the best rates. But its completely false. please shop around. Use this company as Last option",
      "rating": 1,
      "date": "16th May 2023",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "Slow and difficult to get responses",
      "text": "7 months and still no decision. I believe Tipton lost original mortgage application. Broker has to deal with an agent who deals with underwriters so communication takes an age to filter through. Keep asking for information one item at a time, now asking for information previously supplied. Chain is about to collapse as a result of their lack of action. House being purchased has been put back on market due to vendor fearing losing her purchase so about to lose purchase unless someone revives the dead snail powering Tipton mortgages.",
      "rating": 1,
      "date": "15th April 2022",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "Friendly Building Society",
      "text": "Always good communication with friendly advice given.",
      "rating": 5,
      "date": "2nd April 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Outstanding first experience",
      "text": "My husband and I are looking to get a mortgage in the next few months so put the feelers out (as I had historic issues due to redundancy) and the advisor that emailed me back, Zoe was detailed in her reply and really put my mind at ease! When we come to get the mortgage The Tipton and Zoe will be my first port of call!! Just outstanding service especially in the midst of the pandemic too.",
      "rating": 5,
      "date": "2nd March 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Couldn't ask for more",
      "text": "Welcoming, efficient and reassuring service, nothing else to say.",
      "rating": 5,
      "date": "5th February 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Extremely helpful and professional",
      "text": "Tipton were so helpful when we were buying our home. I always spoke to the same member of the team and nothing was ever too much trouble. They have also been excellent in the two years that we have had out mortgage with them. I couldn’t recommend them enough.",
      "rating": 5,
      "date": "30th January 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "A rather pleasant experience all around!",
      "text": "When I opened an account with Tipton & Crossley I found that the process was straight forward the staff were extremely friendly and professional. Which is what you want. Their help to buy ISA will make all the difference and all the information they provided about it really helped. I'm really looking forward to the opportunity to get on the property ladder. I'd definitely recommend them to any and everybody.",
      "rating": 5,
      "date": "26th January 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Perfect every step of the way",
      "text": "Zoe made the process as simple and as smooth as we could have imagined. As first time buyers we thought it would be full of jargon and stressful. Zoe made it easier than popping to the supermarket and we can’t thank her enough!",
      "rating": 5,
      "date": "20th January 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "amazing",
      "text": "I love The Tipton. So many different types of mortgages i.e. Expat BTL, Holiday Homes, RIO and more!",
      "rating": 5,
      "date": "19th January 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great communications, friendly staff.",
      "text": "A range of mortgage options explained, no hard sell just clear and concise information.",
      "rating": 5,
      "date": "12th July 2020",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Nothing is too much effort",
      "text": "The team at Tipton and Coseley went above and beyond to help us with our mortgage needs even when our first house fell through. ZOE was incredible. So understanding even when I was so upset. They helped us through to the very end and even sent us a beautiful new home card when we finally got in our forever home. Their customer care is the best I have ever come across and highly recommend to all.",
      "rating": 5,
      "date": "30th December 2019",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "overall not bad",
      "text": "I have run into some problems but overall they are quite friendly and helpful.",
      "rating": 4,
      "date": "8th November 2019",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Friendly, knowledgeable staff.",
      "text": "I would normally shop around for mortgages like I do with most other products i.e. insurance etc. But the staff at T&C are open and honest (will admit if their products are not at market-leading rates for instance), but will always take into account your personal situation, and provide a range of options based on your requirements.",
      "rating": 5,
      "date": "15th September 2019",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Friendly, helpful, good rates",
      "text": "Always helpful and friendly, nothing too much trouble",
      "rating": 5,
      "date": "12th December 2018",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Professional and Personable",
      "text": "Been a mortgage holder with Tipton for well over a decade now and really wouldn't want to change to any other Lender. It's so refreshing being able to ring the branch directly without having the nuisance of a call centre. They certainly deserve to win!",
      "rating": 5,
      "date": "4th December 2018",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Friendly professional advice and great service",
      "text": "The whole team are so professional and always willing to go the extra mile to help. Would recommend to anyone.",
      "rating": 5,
      "date": "1st December 2018",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Fantastic",
      "text": "The service I received was very efficient . The staff were polite helpful and understanding . Fantastic all round .",
      "rating": 5,
      "date": "15th October 2018",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Friendly and personal service",
      "text": "This is a great company with a local feel. You can speak to the same person over the years (if this is the type of service that suits you) as they seem to have lower staff turnover than some of the bigger providers. They will admit when they are unable to match the rates of the big providers, but give honest and sensible advice, with your financial safety and peace of mind at the forefront of their decisions.",
      "rating": 4,
      "date": "11th June 2017",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Launched an amazing new App",
      "text": "You are now able to onboard as a new customer on the App and open new accounts, transfer funds etc. Major Achievement for such a small Building Society",
      "rating": 5,
      "date": "3rd March 2021",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Great Customer Experience",
      "text": "Always willing to assist and help. Good savings products.",
      "rating": 5,
      "date": "13th November 2019",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Amazing Service - always reliable",
      "text": "The society has always been amazing in all the years I've been a customer. I started off with having an account at 7 years old, and have held accounts all the way up to 18. Staff are always happy to help and so welcoming! Cannot fault the service",
      "rating": 5,
      "date": "13th November 2019",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Easy, no-nonsense advice",
      "text": "Nothing is too much trouble trouble at the Tipton, and there is always help on hand. When I went in to open a savings account, I asked the girls on the counter for some advice, which they were more than happy to do. Nothing is too much trouble and the advice I did receive was straight to the point and cut out all of the jargon. Perfect!",
      "rating": 5,
      "date": "20th November 2018",
      "product": "Savings",
      "sentiment": "positive"
    }
  ]
}