{
  "society": "Vernon Building Society",
  "slug": "vernon-building-society",
  "smpUrl": "https://smartmoneypeople.com/vernon-building-society-reviews/products",
  "totalReviewsOnSMP": 4356,
  "avgRating": 4.9,
  "scrapedAt": "2026-02-06T16:11:52.140907+00:00",
  "reviews": [
    {
      "title": "Vernon Building Society's insurance is fantastic!",
      "text": "Vernon Building Society's insurance is fantastic! The team is super friendly and made everything easy to understand. I feel secure knowing I'm covered without spending a fortune. Highly recommend!",
      "rating": 5,
      "date": "14th October 2024",
      "product": "Insurance",
      "sentiment": "positive"
    },
    {
      "title": "friendly helpful staff in a local branch",
      "text": "friendly helpful staff in a local branch",
      "rating": 5,
      "date": "24th January 2024",
      "product": "Insurance",
      "sentiment": "positive"
    },
    {
      "title": "Friendly, helpful & easy to talk to",
      "text": "The person I dealt with was helpful, explained everything clearly, and it was a pleasurable experience. This doesn’t happen when it’s a call centre !",
      "rating": 5,
      "date": "17th January 2023",
      "product": "Insurance",
      "sentiment": "positive"
    },
    {
      "title": "Looking for cheaper contents insurance.",
      "text": "I asked Vernon Building Society, who I have savings with, if they did contents insurance for my rented flat as it was up for renewal and the premium was quite high. The procedure of renewing with Vernon was straight forward, concise and a lot cheaper than the previous provider and has been for the following 2 years too! A very happy customer!",
      "rating": 5,
      "date": "14th April 2021",
      "product": "Insurance",
      "sentiment": "positive"
    },
    {
      "title": "Excellent Service!",
      "text": "I recently organised my Mortgage and life protection with Vernon Building Society and they were fantastic, veyr easy to use and the staff were extremely friendly!",
      "rating": 5,
      "date": "13th April 2021",
      "product": "Insurance",
      "sentiment": "positive"
    },
    {
      "title": "Quick and polite customer service",
      "text": "I would definitely recommend the insurance products, so much better than dealing with a faceless entity. A minor issue was resolved before it became a big problem.",
      "rating": 5,
      "date": "1st February 2021",
      "product": "Insurance",
      "sentiment": "positive"
    },
    {
      "title": "Ease of visiting branches close to home",
      "text": "I have had contents insurance for 3 years and also savings account for a number of years too. Whenever I visit the branches I am met with courtesy, prompt attention with a smile. My queries are met with straightforward answers and I come away knowing I have had the problem solved.",
      "rating": 5,
      "date": "21st January 2020",
      "product": "Insurance",
      "sentiment": "positive"
    },
    {
      "title": "Always helpful",
      "text": "Small Building Society = have mortgage, savings and insurance with them",
      "rating": 5,
      "date": "25th August 2017",
      "product": "Insurance",
      "sentiment": "positive"
    },
    {
      "title": "Brilliant",
      "text": "Had to find another insurer for contents only and the Vernon was the best outcome. Thanks to Jo Torkinson for prompt service with a smile!",
      "rating": 5,
      "date": "2nd April 2017",
      "product": "Insurance",
      "sentiment": "positive"
    },
    {
      "title": "Excellent",
      "text": "Super, personal service available locally",
      "rating": 5,
      "date": "3rd January 2017",
      "product": "Insurance",
      "sentiment": "positive"
    },
    {
      "title": "Hazel Grove",
      "text": "Very easy & straightforward. UK based claim's team, No paperwork, Same day response.",
      "rating": 5,
      "date": "4th July 2016",
      "product": "Insurance",
      "sentiment": "positive"
    },
    {
      "title": "Home Insurance",
      "text": "Excellent service from Tracey at the Hazel Grove branch. Tracey was so thorough and helpful. Already recommended her to a friend.",
      "rating": 5,
      "date": "28th June 2016",
      "product": "Insurance",
      "sentiment": "positive"
    },
    {
      "title": "Very happy with Vernon so far",
      "text": "I have only had one direct experience of Vernon Building Society as my mortgage broker has handled all the communication with them up til completion which has only recently occured. I needed to check their criteria for allowing a solicitor to act for them and ourselves in our remortgage before appointing my solicitor and so contacted them. The person I spoke to was extremely helpful and I also understand from my solicitors that Vernon were helpful in finalising the offer within a tight deadline. So far, so good, I am pleased to say. I would give a higher rating had I had more direct contact with them, so would be happy to submit a further review after a year or so",
      "rating": 3,
      "date": "4th February 2026",
      "product": "Mortgages",
      "sentiment": "mixed"
    },
    {
      "title": "The building loan application process was very compl...",
      "text": "The building loan application process was very complex but was successful in the end",
      "rating": 3,
      "date": "3rd February 2026",
      "product": "Mortgages",
      "sentiment": "mixed"
    },
    {
      "title": "Very smooth process, thank you.",
      "text": "Very smooth process, thank you. Everything progressed smoothly",
      "rating": 5,
      "date": "2nd February 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Absolutely outstanding",
      "text": "Absolutely outstanding from start to finish. The Vernon Building Society operates at a different altitude to the rest of the market. From first contact through to completion, delivery was disciplined, decisive, and refreshingly competent. No noise, no overpromising, no drift. Decision-making was sharp, communication was proactive, and every commitment landed exactly as scoped. The team clearly understands both risk and real-world delivery, which results in pragmatic outcomes rather than process theatre. People are empowered, accountable, and know their brief. The operating model is slick without being soulless. Queries are resolved once, properly, by individuals who take ownership instead of deflecting responsibility. Timelines are respected, documentation is clear, and execution is predictable. That is rare. In a sector saturated with mediocrity, The Vernon Building Society sets the benchmark. If you value competence, transparency, and outcomes over rhetoric, this is best-in-class performance.",
      "rating": 5,
      "date": "19th January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Retirement Interest Only Mortgage",
      "text": "We recently completed on a new style product, an Interest only Retirement Mortgage and despite being a relatively new product we found the process to be slick from start to finish",
      "rating": 5,
      "date": "19th January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Making My Dream Home Possible!",
      "text": "I’ve been with Vernon for over five years now, across two homes, and I honestly couldn’t recommend them highly enough. During this time, they’ve supported me through two remortgages as well as the porting of my mortgage. They were a huge part of why I was able to purchase my dream home. It was a particularly challenging purchase, but their attentiveness, genuine care, and willingness to go above and beyond made all the difference. I felt fully supported every step of the way. I can’t thank the team at Vernon enough for their dedication and expertise - absolutely outstanding service!",
      "rating": 5,
      "date": "18th January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "An excellent society.",
      "text": "Great help with organising our remortgage. Clear concise information with friendly staff.",
      "rating": 5,
      "date": "14th January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "A proper Friendly Society",
      "text": "I have had two mortgages with the Vernon over more than 33 years and they have always been great to deal with, had great rates and offers, have great staff and a superb and very supportive service. I cannot recommend them more highly, a great local company and a proper‘Friendly Society’.",
      "rating": 5,
      "date": "14th January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent individual service.",
      "text": "Excellent. Our individual circumstances were evaluated in person. Not just a tick box. The advice and guidance to the right mortgage for us was invaluable. The personal touch is so refreshing to find when most providers want you to fit onto a form. The Vernon do go the extra mile and make your mortgage personal to you and your individual circumstances. We were very happy with service.",
      "rating": 5,
      "date": "13th January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very straight forward application process, good afte...",
      "text": "Very straight forward application process, good after customer service",
      "rating": 5,
      "date": "13th January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Incredible customer support",
      "text": "Vernon building society helped me get my first home and helped me transfer my mortgage to my next home when the circumstances werent straight forward. I felt like an individual and I could trust them to be working conscientiously. At no point did I ever feel like just a number. They offer personalised support and I would trust them as a lender again in a heartbeat.",
      "rating": 5,
      "date": "13th January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Easy to talk to.",
      "text": "Easy to talk to. Questions answered.",
      "rating": 5,
      "date": "13th January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Mortgage management",
      "text": "I have always found Vernons to be straight forward and fair to deal with. They are not always the cheapest but are very friendly and do what they say they will do.",
      "rating": 5,
      "date": "13th January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great people to deal with",
      "text": "Have dealt with a few people and all great to deal with. Good follow up and responded to questions quickly.",
      "rating": 5,
      "date": "13th January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent Customer Service from the Vernon BS",
      "text": "I took out a Retirement Mortgage for the first time with the Vernon BS several years ago now and they made my journey stress free. Everyone I talked to at the Vernon was knowledgeable, ever so friendly and professional in all the things they did. I wouldn't hesitate to recommend them.",
      "rating": 5,
      "date": "13th January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent service great team always friendly helpful...",
      "text": "Excellent service great team always friendly helpful to get my Uni to buy mortgage",
      "rating": 5,
      "date": "13th January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "I can recommend Vernon without any hesitation",
      "text": "I had questions at the start of the process and their customer services people answered skillfully and clearly. This enabled me to feel really confident in going with Vernon. Since then everything has gone well which confirms in my mind that it was the right decision to mortgage with Vernon.",
      "rating": 5,
      "date": "13th January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Local office and community spirit makes the Vernon w...",
      "text": "Local office and community spirit makes the Vernon what it is, the staff are friendly helpful and always provide great advice and peace of mind",
      "rating": 5,
      "date": "13th January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Highly Recommended",
      "text": "Vernon were very easy to deal with and very professional. They had exactly the product we needed.",
      "rating": 5,
      "date": "13th January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great product range",
      "text": "Friendly and easy to deal with. Great to have mortgages for over 60’s with the option of interest only. I was able to renew my existing mortgage without the need for any further property survey or conveyancing making the whole process very straightforward.",
      "rating": 5,
      "date": "13th January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Have had a mortgage with them for last 6 years and i...",
      "text": "Have had a mortgage with them for last 6 years and initially they were very informative and was able to speak to an advisor with any queries which was brilliant",
      "rating": 5,
      "date": "13th January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Mortgage",
      "text": "Friendly, efficient, and a first class service throughout the time of our mortgage.",
      "rating": 5,
      "date": "13th January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Have a mortgage with Vernon.",
      "text": "Have a mortgage with Vernon. Every interaction with the team has been handled quickly and efficiently through the last 5 years. The rate offered at the time was market leading for our criteria, so it was a no-brainer to go with them!",
      "rating": 5,
      "date": "13th January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very efficient company, always been very helpful",
      "text": "Very efficient company, always been very helpful",
      "rating": 5,
      "date": "13th January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "A Comfortable, Hassle Free Experience",
      "text": "I changed my mortgage to a RIO (Retirement Interest Only) mortgage. From the point of enquiry through to completion the Vernon mortgage team clearly explained the mortgage and fully supported me throughout with a dedicated advisor available to answer any questions I had. I was never under any pressure, time constraint or influence to make my decision. Vernon made choosing a mortgage a pleasure not a chore.",
      "rating": 5,
      "date": "13th January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Customer service was 5*.",
      "text": "Customer service was 5*. Easy to talk to someone and always helpful. Thank you",
      "rating": 5,
      "date": "13th January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Down to earth",
      "text": "I have always been pleased with being able to talk to Vernon staff on the phone. The advisers have a down-to-earth, friendly approach and explain any changes to payments, for example, with clarity. It's a refreshing contrast to the proliferation of \"chatbots\" or impersonal call centres.",
      "rating": 5,
      "date": "13th January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "The best choice for customer service",
      "text": "Vernon have been outstanding since we started our journey with them, their customer service in particular has been exceptional.",
      "rating": 5,
      "date": "13th January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent face to face service.",
      "text": "The most important part of using any financing institution is to be able to talk face to face with a member of staff. We’ve always been able to do that. In addition we’ve always been treated with respect and kindness. Excellent service.",
      "rating": 5,
      "date": "13th January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Our mortgage is with Vernon and they were very helpf...",
      "text": "Our mortgage is with Vernon and they were very helpful as it was our first mortgage and needed lots of advice! Their rates were competitive and we have been very happy with the service",
      "rating": 5,
      "date": "13th January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great experience",
      "text": "I'm self-employed and as such the mortgage route is a slightly different process, Vernon made the experience very smooth and were very quick to respond to any questions.",
      "rating": 5,
      "date": "13th January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "The VBS has provided us with a mortgage product.",
      "text": "The VBS has provided us with a mortgage product that many other banks and building societies have not. They have always ensured that we get good rates and products as their range has developed. They are particularly helpful and attentive to detail",
      "rating": 5,
      "date": "13th January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Extremely knowledgeable and helpful staff",
      "text": "The mortgage offering by Vernon was perfect for our needs. All staff were extremely knowledgeable of their products, polite and customer focused.",
      "rating": 5,
      "date": "13th January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Extremely good customer service.",
      "text": "Extremely good customer service.",
      "rating": 5,
      "date": "13th January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great Service",
      "text": "Excellent service provided by Vernon's with very competitive mortgage rates",
      "rating": 5,
      "date": "13th January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "They are prepared to look at you as an individual.",
      "text": "They are prepared to look at you as an individual. When your affairs are different this is really needed and so unusual in todays world where you are force into a box.",
      "rating": 5,
      "date": "13th January 2026",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "In branch service review",
      "text": "We feel that our test interests were catered for us in a timely and helpful way.",
      "rating": 5,
      "date": "22nd December 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Pleased to have chosen Vernon for our new BTL venture",
      "text": "Very good start to the process with Jack Mottershead very responsive and supportive. Pretty smooth all through with questions answered quickly by the support team too. Negatives: some of the requirements seemed biased towards a retail mortgage rather than a commercial BTL loan, so to me were strange, as if one-size-fits-all on paperwork. I'm disappointed that you can't choose to set the monthly mortgage payment to a higher 'static' amount and pay off principal on a drip-feed basis: appreciate you can make £1k minimum, but i prefer to accelerate repayment by starting low and eating into loan principal monthly so the repayment amount starts to increase by pennies but on a compound basis.. Lower rate would have been nice: had a lower rate option (even allowing for fees over a fixed term basis) but decided to stay with Vernon given customer support in the early stages and kept fingers crossed that nothing went wrong laterly... luckily it didn't.",
      "rating": 4,
      "date": "9th December 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Professional and open",
      "text": "At our older age, my wife and I were delighted to receive our re-mortgage offer, which has allowed us to send our granddaughter to university. An investment in more ways than one! When I needed to contact Vernon on the telephone, my call was answered promptly and in a very pleasant and welcoming manner.",
      "rating": 5,
      "date": "8th December 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very good communication always on hand and money in...",
      "text": "Very good communication always on hand and money in and completed on time",
      "rating": 5,
      "date": "8th December 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Smooth application with good communication",
      "text": "Smooth application with good communication throughout the application process.",
      "rating": 5,
      "date": "8th December 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Solicitors dim as a Toc H Lamp!",
      "text": "Solicitors dim as a Toc H Lamp! We weren't in a hurry but they really took their time.",
      "rating": 4,
      "date": "8th December 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great service ran very smoothly would advise any bod...",
      "text": "Great service ran very smoothly would advise any body to choose them",
      "rating": 5,
      "date": "8th December 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Competitive product, friendly and helpful staff, app...",
      "text": "Competitive product, friendly and helpful staff, approachable, quick efficient service.",
      "rating": 5,
      "date": "8th December 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "A thorough service, and straight forward process onc...",
      "text": "A thorough service, and straight forward process once past the initial checks.",
      "rating": 4,
      "date": "8th December 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Good unbiased, traditional service.",
      "text": "I recognise we are older than the \"normal\" mortgage seekers, however Vernon looked at us in an unbiased way and were able to offer what we were seeking. Very pleasant staff when I called. A big thank you all.",
      "rating": 5,
      "date": "1st December 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very Efficient, was recommended by our financial adv...",
      "text": "Very Efficient, was recommended by our financial advisor to suit our circumstances.",
      "rating": 5,
      "date": "1st December 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Mortgage adviser was knowledgeable and responded qui...",
      "text": "Mortgage adviser was knowledgeable and responded quickly to questions",
      "rating": 5,
      "date": "1st December 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very helpful, efficient, easy to ask questions, resp...",
      "text": "Very helpful, efficient, easy to ask questions, responsive to my needs. Good competative rates.",
      "rating": 5,
      "date": "1st December 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "It has been very good they have helped us out of bad...",
      "text": "It has been very good they have helped us out of bad situation",
      "rating": 5,
      "date": "1st December 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Had my mortgage with Vernon after doing first time b...",
      "text": "Had my mortgage with Vernon after doing first time buyer ISA with them and also got regular saving account with them. Always great service whenever I deal with them or have any queries.",
      "rating": 5,
      "date": "18th November 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great for self build mortgages",
      "text": "Vernon understood the requirements for our self build and more importantly, unlike many other lenders are on the ball with modern building construction techniques. The process was quick and easy and response times were excellent.",
      "rating": 5,
      "date": "10th November 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent service",
      "text": "Easy for us as we went through a financial intermediary. Good communication during the whole process. We had to change properties part way through but this was not a problem for them.",
      "rating": 5,
      "date": "10th November 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Easy experience, good communication overall really good",
      "text": "Easy experience, good communication overall really good",
      "rating": 5,
      "date": "10th November 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Remortgage",
      "text": "Our remortgage was dealt with quickly and simply with very little input from us after the application was received. We completed earlier than we thought was possible.",
      "rating": 5,
      "date": "5th November 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Easy application process",
      "text": "Easy application as we went through the Mortgage Advice Bureau. Goog communication. Easy to change properties part way through application process",
      "rating": 5,
      "date": "3rd November 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Good service",
      "text": "Good service although most contact was via a solicitor.",
      "rating": 5,
      "date": "13th October 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "I was taking out an IOR Mortgage which was seamless...",
      "text": "I was taking out an IOR Mortgage which was seamless and straightforward I had never had anything to do with mortgages as my late husband dealt with it all. I entered this with trepidation but Vernon made it so easy. I have recommended to friends and relatives",
      "rating": 5,
      "date": "9th October 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "excellent service great communication",
      "text": "excellent service great communication",
      "rating": 5,
      "date": "9th October 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent product suited exactly to my requirements.",
      "text": "Excellent product suited exactly to my requirements. Speedy decision making and remarkable efficiency in completing despite the bonkers UK system",
      "rating": 5,
      "date": "3rd October 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Honest opinion",
      "text": "Professional and responsive keeping you informed every step of the way",
      "rating": 5,
      "date": "3rd October 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very easy and smooth transaction",
      "text": "Very easy and smooth transaction",
      "rating": 5,
      "date": "2nd October 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Spoke to Suzan Roan a few times really helpful lady.",
      "text": "Spoke to Suzan Roan a few times really helpful lady. Nothing to much trouble for her",
      "rating": 5,
      "date": "2nd October 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Kept informed and updated regularly.",
      "text": "Kept informed and updated regularly. Easy to access people on the phone",
      "rating": 5,
      "date": "9th September 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Easy to communicate with.",
      "text": "Easy to communicate with. Clear and prompt response.",
      "rating": 5,
      "date": "6th September 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Professional Mortgage experience",
      "text": "Had a very professional experience with Megan your Mortgage advisor. Nothing was too much trouble and she is now also considered a friend",
      "rating": 5,
      "date": "5th September 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Extremely efficient, informative and helpful.",
      "text": "Extremely efficient, informative and helpful. Thank you",
      "rating": 4,
      "date": "2nd September 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Professionalism Plus Personality",
      "text": "Over many years we have dealt with various people at Vernon and whilst all were good/knowledgeable, none has been as outstanding as Megan Paldino who helped us with our recent 'additional borrowing requirements'. She was polite, charming, supremely professional and knowledgeable, functioned at ultra-fast speed, and was spontaneously enthusiastic and infectiously full of life.",
      "rating": 5,
      "date": "5th August 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Mortgages",
      "text": "I had approached the Vernon directly regarding an retirement Interest only mortgage, after a conversation with Megan Pladino, this was not the product for us and we agreed on an alternative product which suited our needs better, the whole process so far has been very easy and clear.",
      "rating": 5,
      "date": "30th July 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very helpful in understanding our circumstances",
      "text": "Very helpful in understanding our circumstances and offering a solution that works for all.",
      "rating": 5,
      "date": "15th July 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Mortgage adviser was friendly and helpful and I coul...",
      "text": "Mortgage adviser was friendly and helpful and I could easily speak to them when I needed to.",
      "rating": 5,
      "date": "12th June 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "A friendly and knowledgeable building society",
      "text": "A friendly and caring building society with knowledgeable staff always ready to answer questions. We found very good forward thinking products have been developed and the guarantor option was the perfect answer to our situation.",
      "rating": 5,
      "date": "19th March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Vernon Building Society Colleague went above and beyond",
      "text": "Megan P from Vernon Building Society went above and beyond to provide guidance, support and obtain a product that fit my needs! In the end, I decided to stay as I am, but I'm really grateful for Megan's support and will certainly return to Vernon in the future! If your after a Mortgage I highly recommend Vernon",
      "rating": 5,
      "date": "12th March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "No nonsense, straight to the point.",
      "text": "No nonsense, straight to the point. Staff always pleasant and ready to help. Always get an appointment to suit ourselves. The opening times could be better I.e. weekends not everybdy can make weekdays as they have to work too. So Saturdays would be better if they could open.",
      "rating": 5,
      "date": "27th January 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Friendly staff. Excellent service.",
      "text": "Friendly staff. good product knowledge and deal with queries promptly.",
      "rating": 5,
      "date": "27th January 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Reliable",
      "text": "I love the direct service. All the staff are friendly, reliable and efficient.",
      "rating": 5,
      "date": "25th July 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Honest",
      "text": "Interest rates could be lower please - we know it's the market but it would help.",
      "rating": 5,
      "date": "25th July 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "spoke with Maureen Derbyshire various times,she was...",
      "text": "spoke with Maureen Derbyshire various times,she was so helpful,and competent, a perfect member of staff",
      "rating": 5,
      "date": "4th July 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Friendly",
      "text": "Lower your rates for long-term business.",
      "rating": 5,
      "date": "24th June 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Amazing",
      "text": "Service has been incredible and taken the stress out of it. We are self-build so not having to use Build Store/Loan would be the only thing that could be better. They were awful, Vernon was dreamy.",
      "rating": 5,
      "date": "24th June 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Jack was excellent & the Vernon had the best rate.",
      "text": "Jack was excellent, helpful, supportive, patient with my elderly relative. Easy to get hold of, always ringing back quickly. I would not hesitate to recommend Jack and the Vernon. They had the Best RIO mortgage rate on the market as well!",
      "rating": 5,
      "date": "12th June 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Professional",
      "text": "We have been dealt with in an efficient and friendly manner.",
      "rating": 5,
      "date": "22nd May 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "First class service .",
      "text": "I dealt with Vernons re a mortgage over a 2 month period . Suzan managed my case and she was outstanding . Professional , courteous and very informed and responsive . Suzan was a complete credit to the company and industry .",
      "rating": 5,
      "date": "16th May 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Helpful",
      "text": "Reduce mortgage rates back to where they were!.",
      "rating": 5,
      "date": "22nd April 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Superb",
      "text": "You could better keep the client informed with the progress of the application.",
      "rating": 5,
      "date": "22nd April 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Human touch",
      "text": "vernon listen to your needs, if things don't go to plan they work with you to get the best outcome. Not the cheapest but there is value is speaking to a person.",
      "rating": 5,
      "date": "22nd April 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Exceptional customer offerings",
      "text": "Very friendly team that are super helpful and responsive. Choices explained in detail and tailored to suit needs of the customer (me). Efficient and easy to follow process start to finish.",
      "rating": 5,
      "date": "28th March 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "why i like",
      "text": "easy to contact, always have an answer",
      "rating": 5,
      "date": "26th March 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent customer experience",
      "text": "Real and knowledgeable people at the end of the telephone line ready to help with non standard queries.",
      "rating": 5,
      "date": "26th March 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great experience - Buy For Uni",
      "text": "I used the Vernon’s buy for Uni scheme, and it was the biggest decision of my life. I’m so glad that societies like the Vernon offer mortgages to young people, without needing even a deposit",
      "rating": 5,
      "date": "26th March 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great service",
      "text": "I first heard about the building society in October 2022 when they offered a great mortgage product. The service was brilliant from beginning to end! I was kept in the loop at all times and received a nice moving home gift box, full of treats and practical items.",
      "rating": 5,
      "date": "25th March 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Knowledgeable and approachable with an excellent gra...",
      "text": "Knowledgeable and approachable with an excellent grasp of customer requirements. Easy to talk to and first rate desire to help.",
      "rating": 5,
      "date": "25th March 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Friendly people, great service",
      "text": "Super friendly people you can actually talk to, great speed of response, great service and competitive mortgage rates",
      "rating": 5,
      "date": "25th March 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Quick decisions which are so important",
      "text": "Quick decisions which are so important & very friendly staff that can’t go far enough to help.",
      "rating": 5,
      "date": "25th March 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great Service & Customer Care",
      "text": "As a first time buyer with a self build mortgage on a renovation (could I tick any more tedious boxes) the Vernon were I think the only company who would offer me a mortgage! Covid happened, we had delays & they were fantastic, patient & approachable. As they’re a smaller company I could always be sure I’d be able to speak to someone on the phone if needed. I didn’t hesitate to remortgage with them once i had completed our build & the remortgage was a straight forward, quick & painless process.",
      "rating": 5,
      "date": "25th March 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Customer service is great.",
      "text": "Customer service is great. When I called to organise a regular over-payment on my mortgage the phone was answered by a real human, not an automated 'press 1 press 2'. My query was dealt with quickly by a friendly member of the team. Can't fault them.",
      "rating": 5,
      "date": "25th March 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Good experience with Vernon so far - can’t fault them.",
      "text": "Good experience with Vernon so far - can’t fault them.",
      "rating": 5,
      "date": "25th March 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Willingness to listen and helpful",
      "text": "Willingness to listen and helpful",
      "rating": 5,
      "date": "25th March 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Simple, straightforward personalised service with a...",
      "text": "Simple, straightforward personalised service with a real person. My mortgage was tailored to my Personal circumstances not a one size fits all or computer generated product. The personal touch makes all the difference.",
      "rating": 5,
      "date": "25th March 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "trying to find a mortgage when you are getting old",
      "text": "trying to find a mortgage when you are getting old is disturbingly complex and often leads nowhere. But Vernon accepted immediately and, realising my pension is £10.000 a month and continues even after my death, Vernon accepted very quickly. I was up and running in a very short time. Since then I have been amazed and satisfied with Vernon's non-bureaucratic and thus speedy management of my case.",
      "rating": 5,
      "date": "25th March 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Pre-historic",
      "text": "Need to write letters with more empathy.",
      "rating": 1,
      "date": "19th March 2024",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "Fantastic",
      "text": "The communication from Vernon Building Society is fantastic.",
      "rating": 5,
      "date": "19th February 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent Underwriting from Leanne.",
      "text": "Excellent Underwriting from Leanne. She went above and beyond. Also excellent support from the BDM Jack..........they are both a credit to Vernon BS.",
      "rating": 5,
      "date": "31st January 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very helpful staff both over the phone and in branch.",
      "text": "Very helpful staff both over the phone and in branch. I had a minor problem with a repayment not being able to visit a branch and they sorted it immediately.",
      "rating": 5,
      "date": "24th January 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent small building society.",
      "text": "Always able to get through to speak to someone, which is very rare these days. Always friendly, helpful staff that know what they are talking about, again very rare to find. If they say they will call you back, they always do. Although they are not a big company they could certainly teach the big banks & other financial companies a thing or two.",
      "rating": 5,
      "date": "24th January 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Business-like",
      "text": "Good customer care backed up by experience. Nothing we would alter.",
      "rating": 4,
      "date": "1st January 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Personal",
      "text": "Good products, friendly people and a trustworthy business.",
      "rating": 5,
      "date": "18th December 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Personable",
      "text": "The give you the personal touch.",
      "rating": 5,
      "date": "22nd November 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Trustworthy",
      "text": "Large enough to compete in the market but small enough to office a personal service.",
      "rating": 5,
      "date": "22nd November 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Wonderful",
      "text": "Vernon embodied the old style mortgage facility and rightfully can call itself a friendly society.",
      "rating": 5,
      "date": "22nd November 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very good service and products.",
      "text": "I've been a customer with Vernon coming up to ten years. You can't beat the service, top notch, A+. The customer service that Vernon offers is very unique for the times we live in. Excellent customer service. Very good products on offer. Highly recommended.",
      "rating": 5,
      "date": "6th November 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Steady",
      "text": "Lower interest rates! Now that the Bank of England has realised they have gone too far with their increases. This is a great opportunity for the Vernon Building Society to lead the way.",
      "rating": 4,
      "date": "25th October 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Supportive",
      "text": "Flexible, supportive, professional; excellent customer service by well-informed, polite staff; over many years, despite the cut-throat business world, the Vernon still remains constantly helpful and sympathetic to customers' needs.",
      "rating": 4,
      "date": "25th October 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Proactive",
      "text": "I value the Society's always professional means of communication (by email and letter). I believe the Society is genuinely helpful and proactive.",
      "rating": 5,
      "date": "25th September 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great support and service!",
      "text": "From early mortgage discussions to drawdown and now redemption/repayment, the entire Vernon team have been a delight to deal with. Easy to get hold of, no nonsense approach and unerringly friendly. Even our conveyancing solicitor had nothing but great experiences dealing with the legals.",
      "rating": 5,
      "date": "14th August 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Brilliant service",
      "text": "As a first time buyer I was very unsure of the process and what to expect. Maureen was lovely and took me through the whole process. I didn't feel like a burden and the response was very quick. Thank you for all your help!",
      "rating": 5,
      "date": "13th July 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Highly recommend - excellent service and very helpful staff",
      "text": "I never write reviews - good or bad ones, but I feel like I must write this review for The Vernon because they've been brilliant with me as a customer., and their staff are wonderful and deserve all the praise. I have been a mortgage customer for 3 years now, and this is my first mortgage. Each time I've ever been in contact with their staff I've always received excellent customer service and they have gone above and beyond to answer my queries, get back to me promptly and offer advice and guidance as needed.. On top of that, in a market where rates are ever changing, I do believe I've been offered a brilliant product from The Vernon, and would not get the same deal or same care elsewhere. I would definitely recommend them to anyone who's looking for excellent customer care, and competitive products.",
      "rating": 5,
      "date": "11th July 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Family business with family values",
      "text": "From the very first contact you know you’re going to get a professional and more importantly personal service. Big thumbs up to Maureen Darbyshire and the team at Vernons",
      "rating": 5,
      "date": "3rd July 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great (moving forwards)!",
      "text": "Interest rates could be lower. Vernon are very helpful and have been since we joined them some years ago.",
      "rating": 5,
      "date": "26th June 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Professional, friendly and efficient",
      "text": "I asked Vernon Building Society if I could raise some money on my mortgage to undertake building work on our house (installing energy efficient measures such as insulation and an air source heat pump). From start to finish they were professionally thorough (without being unnecessarily demanding) and I felt very well looked after as there was always a point of contact if I had any questions. The whole process was quicker than I expected – they were very efficient. Using a small building society such as the Vernon means they understand you on a human level and even if you don't tick all the boxes (I'm self employed so it was a bit more complicated) they are flexible and see the whole picture. Overall very happy with the service received.",
      "rating": 5,
      "date": "6th June 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "A bank that listens",
      "text": "I have been thoroughly impressed by the helpful and responsive mortgage team at the Vernon Building Society. It has been great to interact with real people.",
      "rating": 5,
      "date": "15th March 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "complex income mortgage",
      "text": "We managed to use income projections from a client towards affordability, as the client had seen a large uplift in income year on year since covid, which was very bespoke and managed to get us where we needed to be",
      "rating": 5,
      "date": "13th March 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent, friendly and knowledgeable",
      "text": "Such good friendly service and so knowledgable, I have never dealt with anyone better",
      "rating": 5,
      "date": "6th March 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent customer focus",
      "text": "The larger lenders could learn a lot from the excellent customer service provided by the Vernon",
      "rating": 5,
      "date": "6th March 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Confidence",
      "text": "Lower rates would be an improvement.",
      "rating": 5,
      "date": "24th February 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Brilliant Customer Service",
      "text": "We contacted the Vernon BS regarding a RIO mortgage after looking at their interest rates. From the start to the finish they were brilliant, even our solicitor commented how quick and efficient they were. We would recommend them to anyone.",
      "rating": 5,
      "date": "22nd February 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Unbelievable people",
      "text": "My wife and I thought that all hope was gone when trying to remortgage due to our ages. But after using moneysavingexpert, we came across the Vernon building society. The staff actually care about the situation and nothing was a problem,. After the initail telephone interview with Lucy, the process of receiving the offer took about 3-4 weeks and now we are able to relax and have a stress-free life now. This is all thanks to the fantastic staff and a favourable mortgage deal from the Vernon. Thank you from us both.",
      "rating": 5,
      "date": "5th February 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Big help with our mortgage",
      "text": "We were trying to buy our first home during COVID. Our mortgage advisor Claire was so amazing with us, especially with helping us with the process as my partner has just come out of being furloughed and we had been through a very hard time. She was always there for a chat and kept us up to date regularly which made the process so much easier. Thank you for everything!",
      "rating": 5,
      "date": "2nd February 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Perfect",
      "text": "Just one thing - Claire at H Grove branch has assisted us perfectly with our new mortgage.",
      "rating": 5,
      "date": "25th January 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Vernon Building Society Branch Review",
      "text": "I like the good service and on a personal level, nothing could be done better.",
      "rating": 5,
      "date": "31st December 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Remortgage - Fast & Friendly Service",
      "text": "This was the first time I'd used Vernon Build Society for a mortgage product. Previously I've used online brokers or gone direct to big lenders. The mortgage I chose was one of the 'Best Buy' recommendations on MoneySavingExpert hence me contact Vernon Building Society. From the moment I contacted Vernon they made me feel like a valued customer. They offer a personal solution and have real people that review the application rather than computer based algorithms. Lucy (our advisor) was very knowledgable about the products and processed our application quickly. Within a short space of time we had our formal offer. I would definitely recommend Vernon Building Society for anyone looking for a good value mortgage.",
      "rating": 5,
      "date": "10th October 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Exemplary",
      "text": "They couldn't have been more helpful, would recommend to any senior citizen for an R.I.O. Mortgage. Jo and Clare have been fantastic. Thank you",
      "rating": 5,
      "date": "28th September 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Amazing mortgage lender",
      "text": "Releasing some equity without the extreme searching your bank statements, I tried a few years back and was told by the underwriters I socialize too much which was insulting",
      "rating": 5,
      "date": "31st August 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "POOR COMMUNICATORS",
      "text": "Led up the garden path by them with a mortgage in principal given & then withdrawn after an offer on property was accepted & fees spent only for it to be withdrawn with a poor excuse with no offer of anything else despite having several buy to lets already. Not to be trusted.",
      "rating": 1,
      "date": "3rd August 2022",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "Caring",
      "text": "I like the fact that I deal directly with real people not online.",
      "rating": 5,
      "date": "31st July 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Amazing service by Lucy",
      "text": "Lucy has been great, always kept me informed of how the process was going, even logged on to update me on her day off. She is a credit to your company, and I would like to tank her for her help",
      "rating": 5,
      "date": "7th July 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Family",
      "text": "Fantastic personal service much appreciated, excellent communication and thought for the customer.",
      "rating": 5,
      "date": "30th June 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Personal Service",
      "text": "Cheaper mortgage products would be good.",
      "rating": 5,
      "date": "25th April 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Outstanding",
      "text": "Love the fact the Vernon is local and supports the local community. Staff could not have been more helpful and friendly.",
      "rating": 5,
      "date": "25th April 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Lives up to their values",
      "text": "At the Vernon they truly believe in reviewing all mortgage applications on a case by case basis and take all of the applicants circumstances into consideration to give a truly personal and individual service.",
      "rating": 5,
      "date": "4th April 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Knowledge, understanding & service.",
      "text": "The Vernon are always willing to consider a plausible mortgage enquiry for my clients. They will look to accept cases that we would ordinarily struggle to place with most other lenders. Using common sense underwriting, they are very easy to work with.",
      "rating": 5,
      "date": "15th March 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Helpful & Fast responses",
      "text": "The staff are easy to get hold of and always helpful with queries",
      "rating": 5,
      "date": "25th February 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Lifeline",
      "text": "Thank you to all at The Vernon for your support in helping with my mortgage and looking at my situation. A real human approach!",
      "rating": 5,
      "date": "25th February 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent Customer Service",
      "text": "One of the few places that still have that ''Personal Touch'' can't beat it !!",
      "rating": 5,
      "date": "25th February 2022",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Efficient",
      "text": "I would have liked to have been notified of a better product, rather than finding it myself",
      "rating": 4,
      "date": "5th December 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great Mortgage Company!",
      "text": "Last year, I took out a mortgage with Vernon. Their customer service throughout the process was great, along with them being the best value deal for us on the market at the time.",
      "rating": 5,
      "date": "1st December 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Attentive",
      "text": "Non standard new build project. Vernon have been outstanding in support, understanding, knowledge & customer service, supporting us brilliantly throughout a very challenging project",
      "rating": 5,
      "date": "25th November 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Worthwhile",
      "text": "At a borrower I think you have got it right",
      "rating": 5,
      "date": "10th September 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Dependable",
      "text": "Current accounts. Varied mortgage accounts like you had pre-2016",
      "rating": 4,
      "date": "9th September 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Independent",
      "text": "3 generations have used the Vernon from 1930 to present day for a mortgage and savings because its local",
      "rating": 5,
      "date": "1st July 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Stamp Duty Deadline",
      "text": "Thank you so much and this one completed at 16.30 today 30/06/2021. I have some feedback from the solicitors, as they were very impressed by the Vernon. He stated he was dealing with people with excellent knowledge and intelligence. And it was great to get through quickly on the phone and he wished that all lenders were like you! In addition, my clients called me after the completion today and thanked me for choosing the Vernon. Jean Cardin - Mortgage Broker",
      "rating": 5,
      "date": "1st July 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Jo from Claisse St Vincent",
      "text": "Absolutely one of the best friendly bend over backwards lenders we have used in a very long time. Thank you to Tracey Wright and her team for helping with a very urgent case.",
      "rating": 5,
      "date": "24th June 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Mortgage review",
      "text": "More mortgage advisers so shorter waiting time",
      "rating": 5,
      "date": "17th June 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Life changing",
      "text": "I have held my first mortgage for 3 yrs, Vernon were spot on with everything. I did not have to worry about anything. Hassle free, worry free, brilliant",
      "rating": 5,
      "date": "21st May 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Mortgage Application",
      "text": "Fast efficient and very friendly service. Lucy Burnside credit to the company!!",
      "rating": 5,
      "date": "4th May 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent Service",
      "text": "Whenever you contact any of the staff they are efficient and friendly",
      "rating": 5,
      "date": "25th April 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Fabulous customer service!",
      "text": "I have used products from The Vernon for about 3 years now, firstly with my Help to Buy ISA and now with their mortgage product. I have always found the staff to be exceptionally helpful both in branch (Reddish & Hazel Grove) and over the phone. Our mortgage advisor Lucy Burnside has exceeded all expectations. She is always on hand to answer all of our questions big or small and does so in a polite, friendly and timely manner. I will be recommending The Vernon to all friends and family who require mortgages or savings in the Stockport area.",
      "rating": 5,
      "date": "20th April 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Self build mortgage",
      "text": "The Vernon building society in Marple is my local branch, from the onset the advisors were extremely helpful and friendly. I had a non conventional property to mortgage and rebuild and they did everything that they could do to help me with my application and complete the process. They have been in regular contact to see if they could help and have been very reassuring to deal with. I would always stay with them and recommend their services.",
      "rating": 5,
      "date": "20th April 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "They are helpful from start to finish and very effective and hence efficient",
      "text": "Nothing more to tell they just take care of your business",
      "rating": 5,
      "date": "13th April 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "So easy to deal with",
      "text": "We almost lost the house that we were hoping to buy because the bank we approached for a mortgage was so slow. The Vernon stepped into the breach and processed our mortgage at lightening speed, meaning that we did not loose our purchase. The Vernon’s mortgage team could not be more helpful, and we have no hesitation in recommending them to others.",
      "rating": 5,
      "date": "13th April 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "A real lifeline",
      "text": "At an age when most no longer had mortgages, circumstances meant we needed one. We were dealt with professionally, sympathetically and efficiently. What more can one ask for?",
      "rating": 5,
      "date": "13th April 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Local service",
      "text": "Always approachable in all aspects of loan",
      "rating": 5,
      "date": "13th April 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great Building Society",
      "text": "Would take a mortgage with them again. Friendly staff ready to answer to any questions!",
      "rating": 5,
      "date": "2nd April 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Mortgage Services",
      "text": "Very efficient service, shame about the use of a 'one size fits all' deed of assignment, most of which is not applicable for a holiday let.",
      "rating": 3,
      "date": "15th March 2021",
      "product": "Mortgages",
      "sentiment": "mixed"
    },
    {
      "title": "Excellent Service - Great Mortgage",
      "text": "All the contact I have had with the Vernon have been helpful and the cost of my mortgage is low compared to the Vernon's competitors. What more could anyone want?",
      "rating": 5,
      "date": "10th March 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "brilliant company",
      "text": "i have been with the Vernon now for 7 years, they are amazing",
      "rating": 5,
      "date": "10th March 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Modern approach with a personal touch",
      "text": "The Vernon has competitive products, knowledgeable staff and values which appear to have disappeared from High Street banks.",
      "rating": 5,
      "date": "10th March 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great local building society supporting the community",
      "text": "Good customer relations and communication, intelligent staff, charitable support in the local area , they provide an important role in the house buying market in the north west",
      "rating": 5,
      "date": "10th March 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Awesome!",
      "text": "Nothing, keep doing what you do. x",
      "rating": 5,
      "date": "1st March 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "One of the best in Town",
      "text": "They gave us specialist advice and understood our needs and recommended products accordingly",
      "rating": 5,
      "date": "23rd February 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "took the stress away",
      "text": "we needed a mortgage to downsize but our age was against us. The Vernon had a range of pensioner friendly products to offer which took the stress out of our siuation",
      "rating": 5,
      "date": "23rd February 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great service. Great staff",
      "text": "I have always received excellent service from Vernon and my recent experience was no exception. Everyone I have dealt with has been friendly and knowledgeable and answered my questions promptly and courteously. Great personal service.",
      "rating": 5,
      "date": "20th February 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Accomodating",
      "text": "Always found a way to support our needs at different stages of our mortgage eg further advances. Would recommend for new starters who are unsure of a) whay to do b) whether they can afford to do what they want to. Special mention \"Lesley at Stockport\" excellent",
      "rating": 5,
      "date": "19th February 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Simply the best",
      "text": "Great committed staff and smooth transition of mortgage with personal touch",
      "rating": 5,
      "date": "17th February 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "5/5 for customer service",
      "text": "Always very helpful and staff will go out of their way to provide good service.",
      "rating": 5,
      "date": "6th February 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Good strong and professional advice. Lady I dealt with (don't think I am allowed to give her name) felt more like a friend at the culmination to our decision.",
      "text": "got this the wrong way round. See above for review. Title. Great company to work with.",
      "rating": 5,
      "date": "2nd February 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Incredibly personable service in a turbulent time, thank you!",
      "text": "I was really keen to stay with The Vernon, because when the pandemic struck and nobody knew what the future would hold, I felt that they understood me as a customer and wanted to do everything possible to alleviate our concerns. At this time I had spoken to a woman called Kathy who had called me back and been really efficient. When our mortgage was then due to be renewed I had a fantastic service from Diana and was pleased to be able to stay with The Vernon on a decent fixed rate. There's a lot to be said for feeling like a person rather than a statistic and because of that I have stayed with The Vernon.",
      "rating": 5,
      "date": "2nd February 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "The most human Bank I have ever dealt with",
      "text": "You can ring them up on the phone or pop into branch and you know who you are dealing with , they don't use jargon and talk to you on your level.",
      "rating": 5,
      "date": "1st February 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Simply the best motgage provider",
      "text": "Great products excellent service and outstanding staff with human touch",
      "rating": 5,
      "date": "1st February 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Best mortgages",
      "text": "Had good mortgage experiance with vernon great products with excellent staff",
      "rating": 5,
      "date": "1st February 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "A Good Friend",
      "text": "I have lived in Stockport for over 60 years and throughout that time Vernon have always been there for those times that you need some expert friendly advice. Especially so regarding a mortgage . They are and always have been A GOOD FRIEND !!",
      "rating": 5,
      "date": "1st February 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Always a pleasure to deal with.",
      "text": "Whenever I make contact with the Vernon everything is handled in a very efficient manner with a high degree of customer service evident.",
      "rating": 5,
      "date": "1st February 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Understanding and helpful",
      "text": "The Vernon treat you as a person and not a number. I needed someone to take a view on the mortgage application because of age and family and rather than just box tick they looked at the person. Good old fashioned lending.",
      "rating": 5,
      "date": "1st February 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Outstanding service and product",
      "text": "We had a very unique set of circumstances as we needed funds to renovate and rebuild a house that had no services connected.. The Vernon were very flexible and provided an excellent self build product. They were very professional during the whole process and everyone we spoke to seemed to care and know about our project. Once we had finished the project and moved in, they were proactive in contacting us to suggest moving to a more appropriate product at a lower rate. Highly recommended.",
      "rating": 5,
      "date": "1st February 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "A friendly old style Building Society",
      "text": "It’s always good to deal with the Staff at the Vernon , it’s like dealing with Friends , something that’s got lost with the big players , sone great deals available as well , I’d recommend them to anybody 6*+ service everytime",
      "rating": 5,
      "date": "18th January 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "This mortgage company takes the long term, intelligent and practical viewpoint",
      "text": "The Vernon offered us the mortgage we needed on the terms that made sense to us and were quick and helpful all through the process. We had already wasted a lot of time with other mortgage institutions who offered us mortgages that were designed to suit them, not us. We should have gone to the Vernon in the first place.",
      "rating": 5,
      "date": "18th January 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Community",
      "text": "This Building Society has a very strong commitment to the local community",
      "rating": 5,
      "date": "18th January 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great customer and conveyancer experience",
      "text": "Vernon were recommended so we went with them for our new mortgage. They weren't just professional and competitive, but just brilliant to deal with. Even our conveyancing solicitor was blown away at how easy to deal with they were - even in these challenging Covid-19 times. Icing on the cake? A welcome box of tea/coffee/biscuits/etc waiting for us on completion .....",
      "rating": 5,
      "date": "18th January 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Fantastic service",
      "text": "I have dealt with the Vernon Building Society over a number of years, and they are consistently excellent in: service, products, speed of replying, politeness - I cannot recommend them too much. They put other banks/building societies in the shade!",
      "rating": 5,
      "date": "15th December 2020",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Brilliant!",
      "text": "Nothing - always excellent, thank you",
      "rating": 5,
      "date": "12th December 2020",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Exceptional",
      "text": "Always reliable and friendly, takes time to understand our needs and give proper advice. Great team.",
      "rating": 5,
      "date": "11th December 2020",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Happy Customer",
      "text": "Simple process, and Neil found us a competitive deal. Would recommend.",
      "rating": 5,
      "date": "8th December 2020",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "First time buyers",
      "text": "Brilliant customer service from the Vernon. Has made our first time buying/mortgage experience as easy and straight forward as possible. Our advisor Maureen is always on hand to offer advice and answer any questions we may have, nothing was too much trouble and she made us feel at ease throughout the process. Thank you Vernon building society",
      "rating": 5,
      "date": "7th December 2020",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Friendly, personal service with people that really care",
      "text": "The Vernon helped us to buy our first property when we had adverse credit in our history, and only a 5% deposit. Now as we look to expand our family and move closer to relatives, to be able to stay with them and port our mortgage across to our new home has just been a dream. Clare, one of the branch managers, dealt with our case and was a delight to speak to and work with. Not only did the whole process take much less time than expected, every step of the way she was honest, friendly, patient, understanding and did everything I have come to expect of the Vernon and their outstanding customer service. I trust our mortgage in their hands and would be reluctant to ever leave as I know we are safe with them, with what is the biggest emotional and financial investment in our lives. I can't recommend them highly enough. If you are lucky enough to be one of their customers, you'll already know this, if not, rest assured you're in the safest of hands. Thank you for being a financial institution with such good hearts - a very rare find nowadays.",
      "rating": 5,
      "date": "3rd December 2020",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "3rd year customer for a joint mortgage",
      "text": "3rd year mortgage review and everything for renewing was speedy, no stress, signed 2 forms and scanned back within the hour signed up to a new deal for another 3 years, no money needed spending :) Super amazing customer service, I already said today even though we are on a new deal till 2023 I will renew again in 2023 with them :)",
      "rating": 5,
      "date": "30th November 2020",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Mortgage Scheme",
      "text": "Excellent customer service from the Vernon, as always.",
      "rating": 5,
      "date": "20th November 2020",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Quick, professional, easy",
      "text": "Speed without losing any aspect of professionalism. Very clear, concise instructions and reporting. Made getting my mortgage offer a stress free experience. Thank you.",
      "rating": 5,
      "date": "4th November 2020",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great experience as a first time buyer",
      "text": "I was lucky enough to find Vernon Building Society through my mortgage broker who had previously worked with them. I was a bit sceptical of going with an unknown name, but took the advice. I haven’t looked back - my entire dealings with Vernon have been easy, quick and helpful. Even in the middle of a pandemic I was still able to apply and secure a mortgage and they didn’t delay the process at any point. Customer services have been helpful and the communication has been simple and clear. Thanks for the hamper too - a lovely touch. Looking forward to many more years with Vernon.",
      "rating": 5,
      "date": "4th November 2020",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Holiday Let",
      "text": "A complicated process buying via a newly setup Limited Company, turned out to be no hassle at all.",
      "rating": 5,
      "date": "4th November 2020",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Friendly professional COVID safe process",
      "text": "COVID-19 made dealing with our mortgage renewal more difficult but Neal took us through the process, simplified it and with the help of the team, gave us what we needed.",
      "rating": 5,
      "date": "31st October 2020",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Our 4th Vernon Mortgage",
      "text": "The helpful, knowledgeable, sensible and listening Building Society! Maureen is great and we would recommend her to anyone",
      "rating": 5,
      "date": "15th October 2020",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent from start to finish!",
      "text": "The Vernon were friendly and easy to deal with throughout my mortgage application. My mortgage advisor Lucy was fantastic and constantly kept me updated. I would recommend anyone who’s looking for a mortgage to speak to The Vernon.",
      "rating": 5,
      "date": "9th October 2020",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Best lender I have ever had",
      "text": "Straightforward and personal mortgages. Your not just an account number.",
      "rating": 5,
      "date": "8th October 2020",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Life savers!",
      "text": "The vernon have been very understanding of our situation. We have struggled to get a mortgage from high street lenders due to the complexity of our circumstances. The vernon had time to listen to our story and found a mortgage package that suited our needs and enabled us to get on the property ladder. Forever grateful!",
      "rating": 5,
      "date": "5th October 2020",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "terrific mortgage building society",
      "text": "Can't fault them, a tiny bit slow due to the complex case of needing a contractors mortgage and it being paperbased, but apart from that really really impressed throughout, would recommend Vernon to anyone and to add a nice touch they deliver you have thank you pack with some food/treats and a card when you move in, never had that from any bank or building society before!",
      "rating": 5,
      "date": "1st October 2020",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Very good kind staff at stockport branch",
      "text": "Very good kind staff at stockport branch",
      "rating": 5,
      "date": "6th February 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Friendly and helpful.",
      "text": "Friendly and helpful. Informative, knew about products.",
      "rating": 5,
      "date": "5th February 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Very helpful everytime i come into Stockport branch...",
      "text": "Very helpful everytime i come into Stockport branch are always pleasant such a lovely family atmosphere",
      "rating": 5,
      "date": "4th February 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Really good customer service",
      "text": "Really good customer service at the counter by Gerry",
      "rating": 5,
      "date": "4th February 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "The staff are always polite, courteous and professio...",
      "text": "The staff are always polite, courteous and professional. The Vernon isn't a society, its family. I have never had better service and that's why the Vernon is the only banking service I need or want.",
      "rating": 5,
      "date": "4th February 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Everyone very friendly and helpful",
      "text": "Everyone very friendly and helpful",
      "rating": 5,
      "date": "4th February 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Staff always pleasant and helpful.",
      "text": "Staff always pleasant and helpful.",
      "rating": 5,
      "date": "4th February 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Very helpful staff when you need help",
      "text": "Very helpful staff when you need help",
      "rating": 5,
      "date": "4th February 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "The staff are ready with tremendous advice and suppo...",
      "text": "The staff are ready with tremendous advice and support with their friendly attitude towards the customers",
      "rating": 5,
      "date": "3rd February 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "The time the staff all take to explain things to you...",
      "text": "The time the staff all take to explain things to you to recommend the best type of account the level of care they take and just how well they get to know you how friendly they are compared to everywhere else I have ever used it’s like the old days you don’t get a bot on the phone you have a face a name they give you Christmas cards remember your children’s names ect",
      "rating": 5,
      "date": "3rd February 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "A trusted Building Society.",
      "text": "This is a financial institution I would always trust with my money.",
      "rating": 5,
      "date": "3rd February 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Use the regular savings to build up money for Christ...",
      "text": "Use the regular savings to build up money for Christmas and holidays. It really easy to manage. The branch staff are fantastic. I can also manage the account online.",
      "rating": 5,
      "date": "3rd February 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "We really liked the face to face appointment more pe...",
      "text": "We really liked the face to face appointment more personal for our needs Gerry was very good with both my husband andi explained everything to each of us and more besides thank you Gerry",
      "rating": 5,
      "date": "3rd February 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Top service the way customers like it!",
      "text": "Very professional, friendly staff that know what they doing",
      "rating": 5,
      "date": "2nd February 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "HAD PROBEMS WITH ON-LINE TRANSACTIONS ALTHOUGH IT HA...",
      "text": "HAD PROBEMS WITH ON-LINE TRANSACTIONS ALTHOUGH IT HAS TAKEN A MONTH TO RESOLVE NO BODY GAVE UP ON THE COMPLAINT",
      "rating": 5,
      "date": "2nd February 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Possibly the best website experience.",
      "text": "Possibly the best website experience of any organisation and great rates",
      "rating": 5,
      "date": "2nd February 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Poynton Branch staff, always helpful and pleasant",
      "text": "Visiting your Poynton Branch is always helpful, the staff are all excellent at their respective jobs knowledgable ,helpful, pleasant and understanding whatever your query.",
      "rating": 5,
      "date": "1st February 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "I’ve only just started investing with the Vernon.",
      "text": "I’ve only just started investing with the Vernon. To date the treatment and honest explanations regarding my needs are second to none. Absolutely excellent.",
      "rating": 5,
      "date": "30th January 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "very efficient online set up for application .",
      "text": "very efficient online set up for application . good clear website",
      "rating": 5,
      "date": "30th January 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Satisfied new customer.",
      "text": "The Online Regular Savers scheme was just what I needed to complement my other savings with its good value interest rate and reasonable minimum monthly payments, the online membership process was simple, no hassle and quick with a speedy follow up acceptance message. Thanks, I am now looking at the other Vernon investment savings plans.",
      "rating": 5,
      "date": "30th January 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Very supportive and understanding will recommend to...",
      "text": "Very supportive and understanding will recommend to family and friends.",
      "rating": 5,
      "date": "30th January 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Friendly staff and very helpful",
      "text": "Friendly staff and very helpful, was given lots of advice with regards to savings",
      "rating": 5,
      "date": "30th January 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "I am very happy with the Vernon Building society.",
      "text": "I am very happy with the Vernon Building society.I have been with them a long time.Always had excellent service and the staff at my local Bramhall branch are very helpful,friendly,and it is a pleasure to do business with them.Always support local Building Society.",
      "rating": 5,
      "date": "29th January 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "I like the face to face personal attention and not t...",
      "text": "I like the face to face personal attention and not to be told to do it on line....",
      "rating": 5,
      "date": "29th January 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Always very friendly and welcoming staff",
      "text": "Always very friendly and welcoming staff, I like how it feels like old school banking and still having lots of local branches open.",
      "rating": 5,
      "date": "28th January 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Excellent service and Value",
      "text": "Great rates of savings interest, excellent customer service.",
      "rating": 5,
      "date": "26th January 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Perfect really helpful.",
      "text": "Perfect really helpful. I have dealt with Vernon for 27+ years!",
      "rating": 5,
      "date": "26th January 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Vernon...We love it",
      "text": "Vernon We love it !!!Xxx",
      "rating": 5,
      "date": "26th January 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "online regular savings account",
      "text": "I applied for an online regular savings account, had it not been for an error on my part, everything would have gone through smoothly. Leon emailed and called me to correct/ sort any issues/queries I had. He was very efficient and pleasant and confirmed everything was in order and told me next steps, which he also confirmed by email. Very impressed with the service and the rate of interest for my savings.",
      "rating": 5,
      "date": "26th January 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Openning an ISA account",
      "text": "When I went in to open an ISA account the staff were very helpful. They ensured that I knew all the details I needed to know about opening an account. The literature was easy to follow and very clear. The decision I made I knew was the best because of all the support i had received.",
      "rating": 5,
      "date": "26th January 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Staff are always warm and welcoming",
      "text": "Staff are always warm and welcoming",
      "rating": 5,
      "date": "26th January 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Viva Vernon Building Society",
      "text": "The staff always treat you with respect. They are friendly, polite and helpful. You feel like you are among friends, a human being and not just an account number. I like that it is a local building society, local to Stockport and not a national society as they are to impersonal",
      "rating": 5,
      "date": "26th January 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Not many branches",
      "text": "Not many branches do not had a lot of contact use online but happy with value",
      "rating": 4,
      "date": "26th January 2026",
      "product": "Savings",
      "sentiment": "positive"
    }
  ]
}