{
  "society": "Yorkshire Building Society",
  "slug": "yorkshire-building-society",
  "smpUrl": "https://smartmoneypeople.com/yorkshire-building-society-reviews/products",
  "totalReviewsOnSMP": 162,
  "avgRating": 4.41,
  "scrapedAt": "2026-02-06T16:12:59.564879+00:00",
  "reviews": [
    {
      "title": "Fixed rate bond",
      "text": "Because I have held a savings account with the Yorkshire my loyalty was rewarded with the offer of a fixed rate bond paying 6%",
      "rating": 5,
      "date": "4th September 2024",
      "product": "Bonds",
      "sentiment": "positive"
    },
    {
      "title": "Great!",
      "text": "Stable website and good customer service",
      "rating": 5,
      "date": "10th March 2023",
      "product": "Bonds",
      "sentiment": "positive"
    },
    {
      "title": "excellent rates",
      "text": "helpful staff, everything done without the drama,",
      "rating": 5,
      "date": "1st April 2021",
      "product": "Bonds",
      "sentiment": "positive"
    },
    {
      "title": "Old fashioned Great service with Good Rates",
      "text": "Our Fixed rate bond has been an essential part of our monthly income and YBS have provided great service especially when they mature to ensure continued income potential, much appreciated customer service",
      "rating": 5,
      "date": "25th March 2021",
      "product": "Bonds",
      "sentiment": "positive"
    },
    {
      "title": "Great service.",
      "text": "Always put the customer first. Courteous and caring. Quick to respond to queries.",
      "rating": 5,
      "date": "2nd March 2021",
      "product": "Bonds",
      "sentiment": "positive"
    },
    {
      "title": "Brilliant service",
      "text": "Carly at the Blackburn Lancashire branch was absolutely amazing in helping me over the phone during these testing times she made everything so easy I cannot thank her enough",
      "rating": 5,
      "date": "28th January 2021",
      "product": "Bonds",
      "sentiment": "positive"
    },
    {
      "title": "Great support",
      "text": "You are informed over a month before your Bond matures and the various options are written out cleary. If you decide to remain and reinvest in their recommended deal you do not have to do take any action and the money is reinvested and the certificate is posted to you a month later. If there is any queries and staff are very helpful and obliging either whether you are face to face or on the phone. I find it very helpful as I know the deal they offer is pretty good and I do not hae to take any action.",
      "rating": 5,
      "date": "10th November 2018",
      "product": "Bonds",
      "sentiment": "positive"
    },
    {
      "title": "Mortgage service is second to none, and they have re...",
      "text": "Mortgage service is second to none, and they have really friendly staff who explain everything clearly.",
      "rating": 5,
      "date": "28th March 2025",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Wonderful organisation, they care and that’s rate",
      "text": "Wonderful organisation, they care and that’s rate",
      "rating": 5,
      "date": "23rd August 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great service",
      "text": "Great service and products. Recommended..",
      "rating": 5,
      "date": "13th June 2024",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Mortgage",
      "text": "I gave renewed my mortgage with YBS for the last 12 years as I always find them to offer the best fixed rates around.",
      "rating": 4,
      "date": "9th April 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "DO NOT GO WITH YBS",
      "text": "DO NOT GO WITH YBS Spent 11 years with a YBS mortgage. Was told the mortgage deal would expire on a certain date, agreed the completion of our house on that same day and fined over £1K for early repayment. Thanks YBS, treat you loyal customers like that and you won't have any customers. DO NOT GO WITH YBS",
      "rating": 1,
      "date": "7th April 2023",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "straightforward simple and easy to use",
      "text": "I have a YBS mortgage and i have nothing but praise for YBS and its customer service. every time I have had to contact them by phone the mortgage customer service have been really helpful and have always helped sort out what i needed. I also like the simple and straightforward list of mortgage products they have including offset mortgages. this choice is very helpful. Please keep it up! i will be remortgaging soon.",
      "rating": 5,
      "date": "4th April 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Been with them 2 years and plan to stay",
      "text": "Had mortgage with them for 2 years and no issues, happy with service",
      "rating": 5,
      "date": "4th April 2023",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great",
      "text": "Recomended for everyone. It is improwing and good.",
      "rating": 5,
      "date": "31st March 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Good work",
      "text": "It is a great effort to help local community",
      "rating": 5,
      "date": "25th March 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Have been great",
      "text": "Always helpful when I have contacted",
      "rating": 5,
      "date": "19th March 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Customers at their heart.",
      "text": "I found that YBS certainly have customer satisfaction and customer experience at the very heart of everything they do. Every contact I have had both taking out my mortgage and updating my mortgage has been nothing short of excellent. I will always be a loyal customer of YBS. Big named banks simply cannot compete",
      "rating": 5,
      "date": "8th March 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Trustworthy",
      "text": "I have been a customer for over 10 years and can honestly say is it continues to be a positive experience",
      "rating": 5,
      "date": "7th March 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent service and products",
      "text": "YBS offers a fantastic range of good value products and I am especially pleased with the family offset mortgage account which allows my to give my daughter a helping hand whilst still retaining control of my money and achieving excellent value for the family.",
      "rating": 5,
      "date": "23rd February 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "No hesitation in recommending",
      "text": "Easy to apply for, straight forward process",
      "rating": 5,
      "date": "18th February 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Best financial institution for mortgages",
      "text": "YBS have the best customer service department, completely sympathetic when in times of trouble. Have managed to turn around arrears to being ahead on mortgage with their help and understanding. Couldn't recommend more highly than this. Was a very long & stressful period of years but we turned this around together and they were fabulous.",
      "rating": 5,
      "date": "16th February 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Just a great provider, great products and services",
      "text": "Simply I trust them to do the right thing, I trust they will not try to take advantage of me, trust that I don't have to keep checking they are not taking advantage of me. Alongside this great products and services",
      "rating": 5,
      "date": "6th February 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great product, great service",
      "text": "When taking out the YBS mortgage, we were moving from having shared ownership arrangement on our home to buying the full 100%. It had been a long time coming and there were extra hoops to jump through. YBS was brilliant. I was able to start the process online with a mortgage in principle but then switch to speaking to a mortgage advisor to ensure our specific set of circumstances were understood. I found it really helpful to be able switch between online and speaking to someone, because we could fit the mortgage process around our own lives and work commitments. Thanks YBS.",
      "rating": 5,
      "date": "31st January 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent Customer Service",
      "text": "I have been with YBS some 20 years and have always found them to be excellent. When changing products they are knowledgeable and really helpful. Wouldn't consider leaving.",
      "rating": 5,
      "date": "31st January 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Great product",
      "text": "Really happy with the fixed mortgage we took. The member of staff we dealt with kept us informed of developments which reassured us that we were a valued customer.",
      "rating": 5,
      "date": "26th January 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "The Yorkshire Building Society has always been easy to deal with and their customer service whenever I have had to deal with them has been faultless. I have no hesitation in recommending them.",
      "text": "From the initial re-mortgage to YBS to doing additional lending for home improvements and the subsequent product transfers when the current products needed renewing, I have always been treated well, efficiently and I’ve had the confidence knowing that my custom is appreciated compared to how I have felt when using banks who seem to class customers as punters who are there to be profited from.",
      "rating": 5,
      "date": "21st January 2021",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Excellent service",
      "text": "Very friendly, easy to apply and complete smoothly. It was a piece of cake to remortgage our house.",
      "rating": 5,
      "date": "8th November 2017",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "Rubbish",
      "text": "Calling the Mortgage Customer helpline was the worst experience ever,total lack of empathy and understanding, after I lost my job there was no help available after they kept me on the phone for ages, just pointed me to the CAB, clearly reading from a scrip.",
      "rating": 1,
      "date": "3rd March 2017",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "Worst customer service ever",
      "text": "My former partner and I have a mortgage with these sharks. My former partner still lives in the property and sadly she had a major stroke and cannot walk, read, write or speak properly . Customer services did not want to know and are now threatening legal action including repossesion rather than grant her a 2 week extension. Disgraceful company.",
      "rating": 1,
      "date": "27th January 2017",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "Offset mortgage",
      "text": "My whole experience from applying for to day-to-day management of the mortgage has been brilliant. Staff at the Yorkshire are brilliant and always happy to answer questions about the product. A refreshing change, well done YBS!",
      "rating": 5,
      "date": "28th December 2016",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "So rude, totally put off using them!",
      "text": "I called the Yorkshire Building Society to check some things prior to arranging a meeting with one of their advisers in branch for a mortgage application, but the man was so rude, instead of listening to my query and attempting to help in any way, he was abrupt and did not seem interested in assisting me. I've no patience for such appalling customer service, I'll be going elsewhere.",
      "rating": 1,
      "date": "25th October 2016",
      "product": "Mortgages",
      "sentiment": "negative"
    },
    {
      "title": "Superb service",
      "text": "The Yorkshire were really supportive when we were looking for our mortgage. We sometimes struggle with understanding financial stuff and this being so big a purchase we found them really helpful and patient.",
      "rating": 5,
      "date": "10th September 2015",
      "product": "Mortgages",
      "sentiment": "positive"
    },
    {
      "title": "everything works great and get a good interest rate",
      "text": "everything works great and get a good interest rate",
      "rating": 5,
      "date": "2nd April 2025",
      "product": "Help To Buy Isa",
      "sentiment": "positive"
    },
    {
      "title": "Top Rates",
      "text": "Always offer some of the best Savings accounts with high interest rates.",
      "rating": 5,
      "date": "11th February 2023",
      "product": "Help To Buy Isa",
      "sentiment": "positive"
    },
    {
      "title": "Good interest rates easy to deal with",
      "text": "No problems good to be a member of the society.",
      "rating": 5,
      "date": "1st March 2021",
      "product": "Help To Buy Isa",
      "sentiment": "positive"
    },
    {
      "title": "Great Customer Service",
      "text": "The YBS always have time to spend on each customer - everything is explained in great depth.",
      "rating": 5,
      "date": "14th January 2019",
      "product": "Help To Buy Isa",
      "sentiment": "positive"
    },
    {
      "title": "YBS have always put the customer first, and their home insurance is second to none!",
      "text": "Both as a member, investor and using their house insurance I found the Society to be a friendly and professional one to deal with.",
      "rating": 5,
      "date": "15th April 2021",
      "product": "Insurance",
      "sentiment": "positive"
    },
    {
      "title": "Super local Building Society...",
      "text": "Each time I go into my local branch I am so impressed with their personal service, lovely over-the-counter manners and non-pressured advice.",
      "rating": 5,
      "date": "16th November 2017",
      "product": "Insurance",
      "sentiment": "positive"
    },
    {
      "title": "Recieved a shopping voucher which offset against the cost meant I only paid £30",
      "text": "The cover of less comprehensive than the previous provider but the shopping voucher made up for it.",
      "rating": 4,
      "date": "20th September 2017",
      "product": "Insurance",
      "sentiment": "positive"
    },
    {
      "title": "They have been fantastic from the 1st day I had an a...",
      "text": "They have been fantastic from the 1st day I had an account with them. I go to an Agency Office, the staff are friendly, knowledgeable and helpful. Always willing to go the extra mile. Have a few accounts with them, they never rush me, and always reach my requirements.",
      "rating": 5,
      "date": "23rd January 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Easy website, helpful staff in their call centre area.",
      "text": "Easy website, helpful staff in their call centre area. I not been into a branch since before COVID.",
      "rating": 5,
      "date": "22nd January 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "YBS Cash ISAs",
      "text": "Online access to accounts and email reminders of maturity dates and options. Reasonable interest rates and variety of account types",
      "rating": 5,
      "date": "14th June 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "No reason to look elsewhere",
      "text": "I've been a customer of YBS for some years now and the fact that I've stayed with them is testament to the service I've received",
      "rating": 5,
      "date": "13th June 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Very simple app to use and good interest rate at 5.2%",
      "text": "I have 2 cash ISAs with YBS - the only thing I dislike is that they close the account and stop you putting any more in it quickly, however now I know this, I'll just wait until I have the amount I want to save each year. Great interest rate of 5.2% on one of them and the app is really simple to use.",
      "rating": 5,
      "date": "7th April 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "A very good building society",
      "text": "A very good building society with an excellent range of products offering decent interest rates. Their customer service is good but it is simple to manage your accounts online.",
      "rating": 5,
      "date": "26th February 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Saw Isabelle who explained everything we needed to k...",
      "text": "Saw Isabelle who explained everything we needed to know transacted our business in a superb businesslike manner and completed two new investments in less than twenty minutes. What a pleasant experience",
      "rating": 5,
      "date": "19th July 2024",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Good rates for isa savings account",
      "text": "Good rates for isa savings account",
      "rating": 5,
      "date": "15th February 2024",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Great intrest",
      "text": "Easy to deal with. Answer the phone",
      "rating": 5,
      "date": "30th July 2023",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Mutual",
      "text": "A Bradford based mutual building society",
      "rating": 5,
      "date": "4th July 2023",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Great customer service",
      "text": "This building society really looks after its Customers, I feel like I am really valued as a Customer rather than just a number in a call centre.",
      "rating": 5,
      "date": "2nd June 2023",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "This pathetic organisation is either xenophobic or racist",
      "text": "This pathetic organisation is either xenophobic or racist. My wife decided to open a cash ISA and to transfer part of her existing cash ISA balance as the interest rates were higher than her current ISA. Submitted her application and went through the ID checks conducted by external company. Was then contacted by their HQ asking lots of questions about her background, some of which were very strange but they advised this was part of their standard checks. She asked if there were any problems and was advised there wasn't but they would contact her if they had any further questions. When she hadn't heard from them but the account still hadn't been activated by them she recontacted and they informed her they were still awaiting the ID check, which was rubbish of course as this had already been completed and confirmed. She asked to speak to someone else and was then kept waiting for a few minutes before being cut off. I can't image that a so-called 'professional' organisation could be so incompetent and I'm sure their action is due to the fact that she was not born in the UK, although she has been a British citizen for many years. She's now opened an ISA elsewhere who welcome non-British born customers.",
      "rating": 1,
      "date": "21st April 2023",
      "product": "Savings",
      "sentiment": "negative"
    },
    {
      "title": "Great rates and service",
      "text": "So simple - easy and intuitive. Ready to open and use online",
      "rating": 5,
      "date": "30th March 2023",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Good Company",
      "text": "I have saved with YBS for years. They have good rates with knowledgeable friendly staff. The company cares and is transparent. Honesty goes a long way.",
      "rating": 4,
      "date": "26th March 2023",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Easy to use app and good rates",
      "text": "Hassle free banking, and regular interest rate rises.",
      "rating": 5,
      "date": "12th March 2023",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Great interest rates, particularly for loyal customers",
      "text": "Unlike many banks, The Yorkshire reward loyalty. Remain with them as a member and you get very good rates. Okay, the branch network is a bit weak in The South, but they are worth searching out and have a good 0n-line presence",
      "rating": 4,
      "date": "10th March 2023",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Good interest rate",
      "text": "The interest rate is very good for a isa.",
      "rating": 5,
      "date": "13th January 2023",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "A large professionally run Building Society",
      "text": "A fair Building Society , which acknowledges Savers & Borrowers in this competitive area . One feels confident to be associated with Yorkshire Building Society .",
      "rating": 4,
      "date": "26th September 2022",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Great interest rates",
      "text": "YBS might have the best interest rates for ISA on the market plus they offer interesting rates on other products if you are a member. Online account is straigthforward to use.",
      "rating": 5,
      "date": "23rd July 2022",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "reliable interest rates and good online banking service",
      "text": "Reliable interest rates so that I don't have keep changing savings provider. The online banking service especially the new mobile app are easy to use.",
      "rating": 5,
      "date": "25th March 2021",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Building society with good service",
      "text": "Very friendly staff, good rate for fixed rate bond or ISA, helpful services.",
      "rating": 5,
      "date": "21st March 2021",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "loyalty saver",
      "text": "This was set up in the Brighouse branch for me and my wife top marks to James.",
      "rating": 5,
      "date": "20th March 2021",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "great staff in branch ,",
      "text": "online is so easy and secure,staff in branch are helpful noledgable,",
      "rating": 5,
      "date": "16th March 2021",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Fair and square",
      "text": "Jargon free, clear and user friendly",
      "rating": 5,
      "date": "18th February 2021",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Great service by Matthew Bradley-Barker",
      "text": "Very friendly ,quick and efficient service received by my wife and i , opening an ISA , a Bond and two Annual access accounts at Chalfont st Peter branch . Mr K J O'Neill & Mrs E M O'Neill.",
      "rating": 5,
      "date": "11th February 2021",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Online account easy to access and save",
      "text": "First time user to Yorkshire why a great rate and easy to access online",
      "rating": 5,
      "date": "21st January 2021",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Good value products",
      "text": "I originally had my savings with N&P who were taken over by Yorkshire BS. Since then i have been amazed by their saving products, rates and service. They offer a wide range of saving products with good interest rates. Their is easy to use and apply for products. Excellent service.",
      "rating": 5,
      "date": "6th November 2019",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "no problems",
      "text": "Found it easy to take this out online. Interest rate was good and it was a quick and easy process. All documents received from them quickly. No branch near me but I dont expect to have to visit them as all contact will be online",
      "rating": 4,
      "date": "28th March 2016",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Great interest while it lasts!",
      "text": "Saving interest rates are poor these days, and when my ISA matured, after checking comparison sites found that Yorkshire Building Society were offering the best interest rate at that time - a market leading 2% per annum! I made an appointment at the branch office and the adviser couldn't have been more helpful. She arranged the transfer from my old ISA account, all the paperwork went through satisfactorily and the documents arrived in good time. The ISA fixed-rate bond matured at 18 months, but I was extremely disappointed to see that the YBS were only prepared to offer derisory interest rates of 1.2% for a new 1-year bond, or 1.3% for 2 years. The Bank of England rate hasn't changed within the time that I have held this account, and I couldn't understand why the building society were offering such poor rates on maturity of bonds. Were they hoping that customers would accept their poor offer and lose out on a better rate? It seemed mean to me! I have (again) checked comparison rates, and am in the process of transferring the ISA account to a financial institution which values their customers. My husband will also do the same when his YBS ISA matures shortly. Because of Yorkshire Building Society's lack of loyalty to customers, they are going to lose out on a considerably amount of money! I advise customers to vote with their feet!",
      "rating": 3,
      "date": "9th August 2015",
      "product": "Savings",
      "sentiment": "mixed"
    },
    {
      "title": "Useful product, ok overall",
      "text": "I have an instant access ISA. It's useful to have it, and it works well for me, but as mentioned by a few other reviews on here, the interest rate could be better",
      "rating": 3,
      "date": "14th October 2014",
      "product": "Savings",
      "sentiment": "mixed"
    },
    {
      "title": "Great Rates from a Caring Mutual Building Society.",
      "text": "They always seem to have very good rates of interest and keep me informed of new saving schemes. When I arrange, on-line, to transfer a large amount of money to another person’s account, they went out of their way to make sure that it was legitimate, without me feeling that they were interfering, not some anonymous text warning!",
      "rating": 5,
      "date": "23rd January 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "The customer support is really first class.",
      "text": "The customer support is really first class. Their online support is second to none and I wish we'd used them years ago",
      "rating": 5,
      "date": "22nd January 2026",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Easy to use ,with Excellent Interest Rates",
      "text": "Easy to set up account and very good interest rates. Friendly!",
      "rating": 5,
      "date": "2nd April 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Good rates",
      "text": "Good rates. Clear communication. Easy to use online platform.",
      "rating": 4,
      "date": "1st March 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Great choice of savings account.",
      "text": "Great choice of savings account. Keeps you informed regularly. Branches to go into",
      "rating": 5,
      "date": "26th February 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Simple account set-up and great rates",
      "text": "Simple account set-up and great rates",
      "rating": 5,
      "date": "6th February 2025",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Good range of higher interest savings rates and very...",
      "text": "Good range of higher interest savings rates and very easy website",
      "rating": 5,
      "date": "24th August 2024",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Yorkshire Building Society",
      "text": "Easy to use online banking but also happy that there is a physical branch within 10 miles of my home where the staff are helpful. They also reward you with better rates for loyal customers.",
      "rating": 5,
      "date": "23rd August 2024",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Excellent rates and care about customers",
      "text": "Excellent rates, online and branches, helpful and friendly staff. They care about their customers.",
      "rating": 5,
      "date": "2nd August 2024",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Poor ID checking",
      "text": "I opened a new account having been a member for years and they asked for new ID which they wouldn't accept",
      "rating": 1,
      "date": "21st June 2024",
      "product": "Savings",
      "sentiment": "negative"
    },
    {
      "title": "Best rates",
      "text": "YBS offer members higher interest rates to some of their savings accounts meaning you are rewarded for your loyalty",
      "rating": 5,
      "date": "24th May 2024",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Bereavement",
      "text": "They were very helpful when my husband died.",
      "rating": 5,
      "date": "24th May 2024",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "The savings products are good, rates are competive",
      "text": "The savings products are good, the rates are competitive, and I like that loyalty products with good rates are offered to existing customers. The web site is generally good, and you can manage your account from there very well.",
      "rating": 5,
      "date": "15th March 2024",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Very friendly Building Society.",
      "text": "Very friendly Building Society. I opened an account and received a welcome phone call.",
      "rating": 5,
      "date": "1st March 2024",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Regular Saver",
      "text": "Easy to open and manage accounts online. Good interest rates",
      "rating": 5,
      "date": "26th February 2024",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Great rates and excellent customer service.",
      "text": "Savings offer higher interest rates and the customer service is excellent.",
      "rating": 5,
      "date": "16th February 2024",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Accessible on our high street",
      "text": "Like to be able to use our high street branch",
      "rating": 5,
      "date": "15th February 2024",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Rubbish out of hours service",
      "text": "Got locked out after continually being told I was entering wrong code. Customer help now closed. Stuck woth no way to transfer money",
      "rating": 1,
      "date": "26th October 2023",
      "product": "Savings",
      "sentiment": "negative"
    },
    {
      "title": "Exemplary service, thank you!",
      "text": "I received stunning service at the London branch this afternoon from Courtney Linley-Lavin. She calmly negotiated the verification of my ID and my mum's, sorted everything out and answered every question before I could ask it. Highly recommend.",
      "rating": 5,
      "date": "7th September 2023",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Competitive interest rates",
      "text": "Interest rates are competitive and increased as base rate increases",
      "rating": 4,
      "date": "23rd August 2023",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Transparency",
      "text": "I have banked with a few banks and have had savings with them over the years, but none of them come close to the customer care and transparency of Yorkshire Building Society. Every single month they write and explain about their interest rates, product changes, how they are doing as a company and anything that is new. Everything, whether good or not so good is explained clearly and with absolute transparency, this is something that feels good when they are caring for your money.",
      "rating": 5,
      "date": "17th August 2023",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Great Experience",
      "text": "It was a great experience opening a Savings account in person at my local YBS. Friendly and professional Staff who fully explained the process to me. I've now also opened two ISAs online using the YBS app which I found was very user friendly.",
      "rating": 5,
      "date": "31st May 2023",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Frequent raises",
      "text": "YBS have been excellent passing on all the interest rate rises and website is easy to use too. Have been a member for over a year now and think entitled to a few preferential products too so all good.",
      "rating": 5,
      "date": "31st May 2023",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Great products, loyal customer",
      "text": "I’ve been a customer of YBS for years. Great customer service and reward their loyal customers with great rates",
      "rating": 5,
      "date": "11th April 2023",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Friendly and Effecient",
      "text": "Really great experience at Yorkshire Building Society. I'm so glad they haven't closed my local branch. I think speaking to a person is so much better than a chat bot.",
      "rating": 5,
      "date": "10th April 2023",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Good interest on a fixed rate saver",
      "text": "Account was easy to open and has an accessible app. Local branch phoned me within a few days of opening online.",
      "rating": 5,
      "date": "7th April 2023",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Good rates for members",
      "text": "Good savings rates for members. Good app and website.",
      "rating": 5,
      "date": "3rd April 2023",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Consistently great savings rates",
      "text": "Consistently great savings rates that they automatically increase without you having to close and open new accounts",
      "rating": 5,
      "date": "3rd April 2023",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Decent app, ok interest",
      "text": "Haven't competed with recent rate rises but otherwise good service",
      "rating": 4,
      "date": "30th March 2023",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Good saving rate",
      "text": "It was a good rate and a branch in town.",
      "rating": 4,
      "date": "25th March 2023",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Fabulous customer service",
      "text": "The Yorkshire will go out of their way to help, even when, as in my case, your issue is of your own making.",
      "rating": 5,
      "date": "19th March 2023",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Easy to use app",
      "text": "App is easy to use and easy to pay in and withdraw cash",
      "rating": 4,
      "date": "17th March 2023",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Great loyalty savers",
      "text": "Some of the best rates and always keeps up with rate changes",
      "rating": 5,
      "date": "16th March 2023",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Great value",
      "text": "Best rates in the market and brilliant customer service",
      "rating": 5,
      "date": "16th March 2023",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Loyalty account",
      "text": "With interest rates being generally terrible I was pleased to be offered a loyalty account by the Yorkshire, paying a slightly increased rate.",
      "rating": 5,
      "date": "15th March 2023",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Good products and services",
      "text": "Competitive, sometimes market leading, savings and ISA interest rates. Good loyalty accounts. Easy to use app. Helpful in branch staff.",
      "rating": 5,
      "date": "10th March 2023",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Respect loyalty",
      "text": "Great building society, top loyalty accounts with great personal customer service!",
      "rating": 5,
      "date": "9th March 2023",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Mutual society with great customer service",
      "text": "Local branch with great staff and savings rates.",
      "rating": 5,
      "date": "27th February 2023",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Best interest rates",
      "text": "Consistently seem to be the best interest rates for easy access savings from a bank I've actually heard of",
      "rating": 5,
      "date": "16th February 2023",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Rubbish building society",
      "text": "Disgusting bank, treats vunerable adults with no care, taken cards away so forced use rubbish books, staff lazy clueless and ceo same no reply to complaints, do not use ybs go else where disgusting place to bank",
      "rating": 1,
      "date": "15th February 2023",
      "product": "Savings",
      "sentiment": "negative"
    },
    {
      "title": "Yorkshire continue to have great products for both new and existing members",
      "text": "They constantly raise their interest rates for existing products to keep them competitive and also provide outstanding exclusive savings to reward loyal members.",
      "rating": 5,
      "date": "1st February 2023",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Falsely promise interest rate increases and ignore emails",
      "text": "Yorkshire BS promised to 'Increase the interest rate on the majority of its variable rate saving accounts by at least 0.25%on the 5th April' I left funds in two variable rate accounts on the basis of this promise. For several days after the 5th April I checked the rates, which did not increase. Looking at all the variable rate accounts, I found that the only one to go up was a childrens account. This is certainly not an increase to the majority of variable rate accounts. I emailed all this information to them a week ago, asking for an explanation. I pointed out that the false promise has cost me money as I would have transferred both accounts to a bank offering much better rates a month ago. They have ignored my email. The false, fraudulent promise is STILL coming up on their website. Make your own decision as to whether this is a company you wish to trust with your savings. I am closing both accounts and will look into reporting them to the relevant authority.",
      "rating": 1,
      "date": "14th April 2022",
      "product": "Savings",
      "sentiment": "negative"
    },
    {
      "title": "Misuse of the word \"loyalty\"",
      "text": "I don't get it. They launch a \"loyalty\" ISA for existing customers. Then the next year they launch another one with the exact same name with a better rate. The rate on the old one doesn't go to the new rate. And if you have the first one, when it ends, it kicks out into a standard ISA. There is no easy way to change that or request it goes to the new loyalty one with the better rate. When you question it they just tell you how to transfer to another provider. So the ISA we've held with YBS since ISAs wer invented, they suggest we move somewhere else? If it wasn't irritating, it would just be laughable, it feels like the basis for an essay question in a customer service course....",
      "rating": 1,
      "date": "12th April 2022",
      "product": "Savings",
      "sentiment": "negative"
    },
    {
      "title": "Withdrawn Direct Debit Facility",
      "text": "I've been with YBS for 20 years and they've suddenly decided to withdraw all Direct Debits and Standing Orders. They've told me I can use Switch to move them to another bank account, but it's not possible from my YBS account. I'll have to phone 30 different companies and change everything over, really bad service wouldn't recommend them to anyone and I'll be closing all my accounts and moving my mortgage to a different lender. Avoid at all costs",
      "rating": 1,
      "date": "3rd October 2021",
      "product": "Savings",
      "sentiment": "negative"
    },
    {
      "title": "Outstanding customer service",
      "text": "I hold several accounts with different banks and building societies, but by far the friendliest and most helpful is the Ashton-Under-Lyne branch. Never had an issue with them and they have always done what I requested.",
      "rating": 5,
      "date": "9th June 2021",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "YBS Group has the best services",
      "text": "Their life insurance is very reliable",
      "rating": 5,
      "date": "22nd April 2021",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Always friendly",
      "text": "Whenever i need to contact YBS Wetherby, they are always so helpful and friendly. Nothing is a bother. A great advert for Yorkshire values",
      "rating": 5,
      "date": "16th April 2021",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Great products, services and rates",
      "text": "I've always been pleased by their products and rates, but have been especially pleased with their member loyalty products. It's why I save with a building society.",
      "rating": 5,
      "date": "3rd April 2021",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Strong Communications",
      "text": "I've been a long standing customer of YBS and have used several of their products over the years. In particular, really like their email communications regarding new saving accounts, keeping me informed on a frequent basis. I have also received telephone calls providing more information when required and answering any queries in a helpful, friendly fashion.",
      "rating": 4,
      "date": "2nd April 2021",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Apparently dazed",
      "text": "Happy says since with them, bank branches always close by. Thank you for giving me the opportunity to bank with you lovely bunch.",
      "rating": 5,
      "date": "26th March 2021",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Always Their for you.",
      "text": "Like having a best friend look over you when leaving your finances to Yorkshire Building Society. Trust and Reliability from the first £1 of investment of my first pocket money to Mortgage and 3rd House purchase. A Society to be relied upon. No sleepless nights always fully informed through good times and tough times. Thank You for being personal.",
      "rating": 5,
      "date": "20th March 2021",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Tastes just like dairy yoghurt",
      "text": "It's great to be rewarded for loyalty with a market leading rate.",
      "rating": 5,
      "date": "10th March 2021",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Forward thinking society",
      "text": "Helpful, knowledgeable, well versed, understanding advice tailored to individual requirements each time you contact YBS",
      "rating": 5,
      "date": "5th March 2021",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Regular Savings",
      "text": "Just recently they set up a loyalty savings account with good interest. The staff I have experienced at two of their branches has been very friendly and a pleasure to be a part of. I think they care about their customers and want to keep updating plus being friendly efficient as well.",
      "rating": 4,
      "date": "4th March 2021",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Brilliant customer service",
      "text": "Easy to deal with, friendly, helpful and knowledgeable",
      "rating": 5,
      "date": "17th February 2021",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Super branch",
      "text": "Everyone who works in the Pontefract Branch are very friendly and professional they can’t do enough to help you. Nothing is too much trouble. They really helped us understand our options for our savings fantastic service.",
      "rating": 5,
      "date": "3rd February 2021",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Untrustworthy",
      "text": "Lost documents supplied, claimed they had responded by email and hadn’t. Long delays in response if they even bother to respond and terrible customer service.",
      "rating": 1,
      "date": "30th January 2021",
      "product": "Savings",
      "sentiment": "negative"
    },
    {
      "title": "Great people to deal with",
      "text": "Made saving easy and worthwhile. Really enjoyed saving and building a lump sum, that I can choose how to spend!",
      "rating": 5,
      "date": "28th January 2021",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Products & People",
      "text": "The branch staff (especially in the Liverpool branch) are an absolute pleasure. I see an account I’m interested in and visit the branch for an appointment. I know I will always be given factual information in order to make the right decision for myself. I recommend the YBS to family and friends knowing they will be given five star service and a five star product to match.",
      "rating": 5,
      "date": "21st January 2021",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Amazing customer service",
      "text": "Staff that are empathetic, compassionate and treat you like a friend. Highly recommended",
      "rating": 5,
      "date": "21st January 2021",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Fantastic service in all aspects",
      "text": "Always go the extra mile, doesn’t matter who you get. Real people who take the time to get to know you and understand what you need. Fantastic and especially through COVID-19. They do not get enough praise and treat everyone as an individual and don’t send them to a machine! I don’t know what it is about YBS but they employ the friendliest people on the planet. Great company and proud to be a member",
      "rating": 5,
      "date": "21st January 2021",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Better rates than high street banks",
      "text": "Better rates than high street banks",
      "rating": 5,
      "date": "21st January 2021",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Friendly service",
      "text": "I have been with YBS for over 30 years, staff always have a smile on their faces and so helpful! Rates are always higher than high street - don’t change",
      "rating": 5,
      "date": "21st January 2021",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Fabulous company",
      "text": "Amazing, friendly, helpful staff.",
      "rating": 5,
      "date": "21st January 2021",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Amazing staff",
      "text": "Whenever we have visited a branch we have always found the staff to be attentive and helpful.",
      "rating": 5,
      "date": "21st January 2021",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Superb service!",
      "text": "Caring, professional, knowledgeable staff make this the best financial institution on the high street. Honestly can’t be beaten on service and are always very competitive with their products.",
      "rating": 5,
      "date": "21st January 2021",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Really good service",
      "text": "Really good service in branches only need a lot of improvement on thier online & telephone service but recommend to open a/c in branch",
      "rating": 5,
      "date": "21st January 2021",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Untrustworthy Building Society as they lose documents",
      "text": "I applied for a mortgage with Yorkshire Building Society and it was proceeding until they lost all the documents I sent to them including my Driving Licence, my payslips and my utility bills. This was despite the fact that they initially stated that they had them. Furthermore, the staff were rude and unhelpful. I was also going to invest some savings with them but I won’t do this now as they give extremely poor customer service and they are unhelpful and rude. My advice is to apply for a mortgage or invest money elsewhere as this organisation do not carry out what they promise to do. Very poor.",
      "rating": 1,
      "date": "17th November 2020",
      "product": "Savings",
      "sentiment": "negative"
    },
    {
      "title": "Rude staff and lack of diversity awareness",
      "text": "Having some money to invest, I visited the Yorkshire Building Society at Bristol where I live with my partner. The person I spoke to was vague and rude and my partner (who is not from this country)was made to feel uncomfortable by the way she was treated and spoken to. It was a terrible experience and it showed a lack of diversity awareness. I felt that I could not invest with the Yorkshire Building Society due to this terrible experience and I wonder just what attitude this Society has towards customers.",
      "rating": 1,
      "date": "14th November 2020",
      "product": "Savings",
      "sentiment": "negative"
    },
    {
      "title": "Crass stupidity or what?",
      "text": "YBS wanted six forms of identity to verify the ID's and address of my wife and myself (3 each) during the process of setting up a savings account. YBS rejected three of them. For example, I sent our local authority's council tax demand for the current year to verify my address (which is also oddly enough the same as my wife's). I redacted the amount of council tax to be paid for the simple reason that that information is none of YBS business; I am simply verifying my address. Other than that, the document verified my address, the council's address, the date etc. YBS then wrote to us to state that three of the forms of ID/address that we used were unacceptable, including the above. Of course, that YBS letter used our ID's and address, which YBS said we had been unable to confirm!! (Wait till you try its satirically named 'Customer Services'. YBS can be crassly inept over the phone as well as via the post). It really is time that consumers stopped using foolishly over-officious, banks/building societies like this. Credit it or not, there is a BS in the Midlands that among the few methods by which my 16 year old son could prove his ID/address was possession of a shotgun license!",
      "rating": 1,
      "date": "10th October 2020",
      "product": "Savings",
      "sentiment": "negative"
    },
    {
      "title": "Dreadful experience",
      "text": "Dreadful experience. I had a house sale fall through so put money in an instant access account. The sale then came through unexpectedly so I tried to withdraw the money I had put in 2 days earlier I was informed by a dreadful, surly and rude customer service agent that I couldn't for 14 days due to money laundering laws. I was advised by Lloyds bank this is not true and if I could prove where the money was from they couldn't keep it but they did. I have now had to go overdrawn and beg and borrow money to complete on my sale while this awful company holds onto my money! When talking to the awful customer services agent who was rude and unhelpful I asked to make a complaint she said she rejected the complaint without me even putting one in! Dreadful company I will take my money they are holding for ransdom asap then close my account and never use again.....BEWARE",
      "rating": 1,
      "date": "26th March 2020",
      "product": "Savings",
      "sentiment": "negative"
    },
    {
      "title": "Easy access accounts, poor value vs great value.",
      "text": "I have been a Halifax customer for over 40 years and I have several easy access accounts with the them which are paying just 0.05%. I recently visited Yorkshire building society where I have an account and was pleasantly surprised what they are offering for their easy access accounts. 0.85% if you open an account with £1000 and 1.00% if you open an account with £10,000. I will slowly be moving my money over to the Yorkshire BS. Loyalty certainly does not pay.",
      "rating": 5,
      "date": "25th January 2020",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Very friendly branch service",
      "text": "Very friendly branch service. Internet savings accounts very easy to operate",
      "rating": 5,
      "date": "16th January 2020",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Brilliant and could offer more.",
      "text": "They are fair with their savings approach and products are great. YBS really considers customers needs first. They are so fair in their approach and service I just wish they’d start offering their own current accounts and credit cards.",
      "rating": 4,
      "date": "13th January 2020",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Excellent customer service",
      "text": "I was trying to invest money left to me after my mother died. The staff were extremely sympathetic and helpful. The interest rate In the recommended account is favourable.",
      "rating": 4,
      "date": "20th November 2019",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Lovely friendly people",
      "text": "Very friendly and reliable people.",
      "rating": 5,
      "date": "2nd July 2019",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Friendly helpful building society",
      "text": "I can really recommend the Yorkshire Building Society because they have always been friendly and helpful. Good customer service goes such a long way!",
      "rating": 4,
      "date": "9th January 2019",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Easy to use website and friendly customer services",
      "text": "I never have any trouble with the website and if I have a query they answer the phone promptly and are helpful and friendly. I don't get frustrated with them as I always I do with my bank.",
      "rating": 5,
      "date": "3rd January 2019",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Great rates",
      "text": "YBS has not only got competative rates, the service in branch is excellent.",
      "rating": 5,
      "date": "12th December 2018",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Friendly and knowledgable staff",
      "text": "Really good local branch, with pleasant, friendly staff. Good range of products",
      "rating": 5,
      "date": "11th February 2018",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Good rates, easy online service",
      "text": "Easy to use account online. Good interest rates. Would recommend.",
      "rating": 5,
      "date": "8th February 2018",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Helpful for childrens savings accounts",
      "text": "Helpful staff when setting up/changing childrens savings accounts",
      "rating": 3,
      "date": "7th January 2018",
      "product": "Savings",
      "sentiment": "mixed"
    },
    {
      "title": "Banking with a smile",
      "text": "Caring about the individual with personal service every time.",
      "rating": 5,
      "date": "24th November 2017",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Great Bank",
      "text": "Used multiple of there products and always had great service, results and care.",
      "rating": 5,
      "date": "9th November 2017",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "AT least unethical decision to close an old regular savings account",
      "text": "Suddenly announced that an old regular account was not only variable on the interest rate paid but also that they could get away with ending the bonus rate which had been paid for some years. To add insult to injury they closed the account, moved balance into a new account favourable to them as still with the old single access. I am in the process of moving my accounts elsewhere.",
      "rating": 1,
      "date": "6th November 2017",
      "product": "Savings",
      "sentiment": "negative"
    },
    {
      "title": "yorkshire building society",
      "text": "I operate this account all online and have never had any problems",
      "rating": 4,
      "date": "27th July 2017",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Lovely people",
      "text": "i have been using this building society for more than 20 years and the staff know us by name and always ask after our family members and how we are doing , do loads of charity work for chosen charities and so very helpful at getting the best returns possible that we are happy to use a most pleasant and effecient place",
      "rating": 3,
      "date": "24th December 2016",
      "product": "Savings",
      "sentiment": "mixed"
    },
    {
      "title": "Friendly, Efficient and helpful",
      "text": "I would just like to say that the staff at our local branch of the Yorkshire Building Society are always welcoming, friendly and helpful. I am very happy with the service I receive. My daughter recently misplaced her ATM card and the staff were very kind and sorted out the problem immediately and efficiently. It was a very simple procedure without any fuss and she had a new card within 3 days. Excellent service :D",
      "rating": 5,
      "date": "6th February 2016",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Banking in a good way ...........",
      "text": "The staff at the Yorkshire Building Society in Prestatyn branch are second to none. They always make you feel valued and go out of their way to help you. It feels like banking in a good way, and not just about profits and large salaries and bonus for bankers. I also recommend their online banking, it is very easy to use and for me so far trouble free.",
      "rating": 4,
      "date": "5th December 2015",
      "product": "Savings",
      "sentiment": "positive"
    },
    {
      "title": "Great mortgage and great staff",
      "text": "ADVICE ON SAVINGS & MORTGAGE ALLOWED ME TO PLAN AND PAY OFF MORTGAGE SEVERAL YEARS EARLY SAVED ME '000'S",
      "rating": 5,
      "date": "5th March 2021",
      "product": "Tracker Mortgage",
      "sentiment": "positive"
    }
  ]
}