{
  "nationwide": [
    {
      "title": "Great bank, so no surprise the mortgages are good too",
      "text": "Been with Nationwide for accounts and savings and enjoyed it. See my bank account review for them. So when it came to getting a mortgage, it was likely to be Nationwide. They were actually the 3rd cheapest option for us, but we still went with them as we both had good experiences with them. The mortgage allows overpayments, a choice of how it's processed, and only takes £500 to trigger (much less than a previous mortgage I had). They also base the overpay limit on the original mortgage value, not the current; allowing you to pay more without hitting a penalty.",
      "rating": 5,
      "date": "7th September 2024",
      "category": "mortgages",
      "sentiment": "Positive"
    },
    {
      "title": "Excellent rates, knowledgeable staff",
      "text": "Cheap mortgage rate, good overpayment terms. Fabulous in branch (mine is in North Herts) Slow to answer the phone at times, but you ALWAYS get someone who knows the answer to your query. Good opening hours. They're like the informed, capable adults of the call centre world. (AVIVA pensions call centre manager - take note!) Good app, strong seeming security, low mortgage rates. Plus its a building society so ethically you know they get a tick.",
      "rating": 5,
      "date": "4th March 2021",
      "category": "mortgages",
      "sentiment": "Positive"
    },
    {
      "title": "Excellent product",
      "text": "We have held our mortgage with Nationwide for over 22 years now. We have always received excellent mortgage advice and have been on a lifetime tracker for many years. This product has always performed well and given the ups and downs of the economy, even in recent times with high Bank of England interest rates our increase on mortgage cost have only been modest. Excellent online and in branch support.",
      "rating": 5,
      "date": "18th January 2023",
      "category": "mortgages",
      "sentiment": "Positive"
    },
    {
      "title": "Always always give high praise to nationwide for the...",
      "text": "Always always give high praise to nationwide for their mortgages and the application process. We were made to feel like a lost cause by Halifax because my partner had a £1000 credit card he had forgotten about, we were told nobody would touch us, we went to nationwide the next week and were accepted right there and then, the advisor wasn’t pushy, was very informative and kept in touch throughout.",
      "rating": 5,
      "date": "22nd January 2026",
      "category": "mortgages",
      "sentiment": "Positive"
    },
    {
      "title": "Needed help to set up a cash ISA, being a bit of a...",
      "text": "Needed help to set up a cash ISA, being a bit of a \"dinasour\" with technology, went into branch. Having the patience to listen and help made the process much easier. Have always found the staff in our branch of Nationwide will go that extra mile, especially with us older people. Have recommended Nationwide to friends and family, some of whom are now customers.",
      "rating": 5,
      "date": "3rd April 2025",
      "category": "savings",
      "sentiment": "Positive"
    },
    {
      "title": "Arranged an account opening meeting at Edinburgh Sou...",
      "text": "Arranged an account opening meeting at Edinburgh South St Davids Street branch. Very convenient and comfortable seated introduction and efficiently ran through the digital application and checking my ID. I signed on the dotted line and less than a week later I had a current account with a £200 joining bonus and a cash ISA. Painless!",
      "rating": 5,
      "date": "26th February 2024",
      "category": "savings",
      "sentiment": "Positive"
    },
    {
      "title": "Nationwide App",
      "text": "Nationwide have a great App — I can see exactly what’s going on with my mortgage. I also have a flex plus account with them and it’s so convenient. I was stuck once -struggling to pay the mortgage and Nationwide arranged a mortgage holiday — it was easy to arrange and didn’t cost us anything g as we’d made overpayments.",
      "rating": 5,
      "date": "24th January 2025",
      "category": "mortgages",
      "sentiment": "Positive"
    },
    {
      "title": "Nationwide offered us a very competitive mortgage ra...",
      "text": "Nationwide offered us a very competitive mortgage rate at a good price, and they have been completely transparent and helpful with their customer support. I have been able to access my mortgage very easily on the app, and see a detailed breakdown of my payments and interest. Definitely recommend.",
      "rating": 5,
      "date": "4th April 2024",
      "category": "mortgages",
      "sentiment": "Positive"
    },
    {
      "title": "Very helpful in structuring a mortgage",
      "text": "Very helpful in structuring a mortgage for a new house purchase, carrying forward an existing fixed-rate mortgage from our existing property. Good communications throughout, options clearly explained and all processed in a timely manner. with an interest rate that we're happy with.",
      "rating": 5,
      "date": "23rd January 2026",
      "category": "mortgages",
      "sentiment": "Positive"
    },
    {
      "title": "Slow poor mistakes",
      "text": "Don’t use online to close joint accounts. Service is poor. Post is slow. Communication is poor. When it goes wrong it’s impossible to correct. Took over one month to get them to issue cheque to correct address. I had to contact them five times and go in branch.",
      "rating": 1,
      "date": "26th March 2023",
      "category": "savings",
      "sentiment": "Negative"
    },
    {
      "title": "Cheap and flexible",
      "text": "I was looking for a cheap and flexible saving account. The team at nationwide came back to me very sickly with great advice and a perfect solution for me. Everything was super clear and easy to understand (which is not always the case with banking services!).",
      "rating": 5,
      "date": "26th February 2025",
      "category": "savings",
      "sentiment": "Positive"
    },
    {
      "title": "Nationwide usually provides competitive rates for it...",
      "text": "Nationwide usually provides competitive rates for its ISA products, especially in 2024. It also allowed multiple ISA accounts under a single “ISA”, which was important before the rule change allowing multiple ISA account openings within the same year.",
      "rating": 5,
      "date": "12th April 2024",
      "category": "savings",
      "sentiment": "Positive"
    },
    {
      "title": "Great customer service",
      "text": "Had a great experience getting a new mortgage deal, phone call was at a time to suit us and all done over the phone. Very simple and great communication - text messages and emails which were sent very quickly. Also a great rate for us. Would reccomend",
      "rating": 5,
      "date": "15th November 2017",
      "category": "mortgages",
      "sentiment": "Positive"
    },
    {
      "title": "Their customers matter",
      "text": "I’ve been with nationwide a few times years now and from savings to normal banking, they have been brilliant. The App works efficiently and their customer service has always been five star. they even give you money back from the shareholders. Amazing",
      "rating": 5,
      "date": "2nd April 2025",
      "category": "savings",
      "sentiment": "Positive"
    },
    {
      "title": "Fixed-rate mortgage with Nationwide",
      "text": "I have a fixed-rate mortgage with Nationwide and am very happy with it so far: the interest rate was competitive, the app works well, customer service has been great (in branch) when I needed it, and not least it’s a bank with some ethical values.",
      "rating": 5,
      "date": "26th February 2025",
      "category": "mortgages",
      "sentiment": "Positive"
    },
    {
      "title": "Simple, easy and great customer service",
      "text": "Had almost no problems with my saving account just applied online and all postal information was prompt and informative. My one query was answered by a lovely call handler who cleared up my issue in a super friendly way. Would recommend.",
      "rating": 5,
      "date": "11th April 2023",
      "category": "savings",
      "sentiment": "Positive"
    },
    {
      "title": "Flexible overpayments",
      "text": "Tracker deal allows unlimited overpayments with no charges. Also as I am a current account holder, received a cashback bonus. Good products, incentives and customer service. Their website is also very intuitive and easy to navigate.",
      "rating": 5,
      "date": "8th November 2017",
      "category": "mortgages",
      "sentiment": "Positive"
    },
    {
      "title": "Great rate for getting on property ladder!",
      "text": "I took a mortgage with Nationwide and got a good rate for seven years and I'm still so happy I made this decision and was able to get on the property ladder when other banks don't even come close to offering the same level of help.",
      "rating": 5,
      "date": "25th January 2026",
      "category": "mortgages",
      "sentiment": "Positive"
    },
    {
      "title": "Nationwide",
      "text": "Went in without an appointment but was still seen straight away at my local Haverfordwest branch. Was assisted by talking through my options of savings and helped me understand my choosen account would offer best intrest rate.",
      "rating": 5,
      "date": "26th February 2025",
      "category": "savings",
      "sentiment": "Positive"
    },
    {
      "title": "Good customer service",
      "text": "Over the course of the mortgage I get regular updates and they (occasionally) put the rate down even when the BoE interest rates stay the same. Communication is clear and I get invited to the AGMs and opportunities to vote.",
      "rating": 5,
      "date": "14th March 2024",
      "category": "mortgages",
      "sentiment": "Positive"
    },
    {
      "title": "BEST SWITCH I EVER MADE",
      "text": "Switched to this bank about two years ago.Had some great offers and taken advantage of their high interest rates on cash isa's.prevoiusly with the Halifax for years.That banks gone stale and not interested in the customers",
      "rating": 5,
      "date": "23rd January 2026",
      "category": "savings",
      "sentiment": "Positive"
    },
    {
      "title": "Great products and fantastic customer service!",
      "text": "I was able to reactivate a very old savings account, transfer it into a modern Regular Saver, open a current account and take out a 1-year Fixed Rate ISA........ all with one visit to my local branch.",
      "rating": 5,
      "date": "29th May 2024",
      "category": "savings",
      "sentiment": "Positive"
    },
    {
      "title": "Great saving options",
      "text": "In the current context Nationwide continues to offer generous interest and savings options. Love their recent offering, a lottery style savings account the seems to run similar to bonus bond scheme.",
      "rating": 5,
      "date": "10th March 2021",
      "category": "savings",
      "sentiment": "Positive"
    },
    {
      "title": "Savings pots",
      "text": "I love the freedom of opening different savings pots with Nationwide and naming them to different things. Transferring is so easy and the Flex Instant Saver as an industry average rate currently.",
      "rating": 5,
      "date": "11th March 2024",
      "category": "savings",
      "sentiment": "Positive"
    },
    {
      "title": "It was very easy to set up a spousal isa with Natoin...",
      "text": "It was very easy to set up a spousal isa with Natoinwide during a stressful period with the death of my wife the staff were very helpful both on the telephone and when I visited the local branch.",
      "rating": 5,
      "date": "23rd January 2026",
      "category": "savings",
      "sentiment": "Positive"
    }
  ],
  "yorkshire": [
    {
      "title": "This pathetic organisation is either xenophobic or racist",
      "text": "This pathetic organisation is either xenophobic or racist. My wife decided to open a cash ISA and to transfer part of her existing cash ISA balance as the interest rates were higher than her current ISA. Submitted her application and went through the ID checks conducted by external company. Was then contacted by their HQ asking lots of questions about her background, some of which were very strange but they advised this was part of their standard checks. She asked if there were any problems and was advised there wasn't but they would contact her if they had any further questions. When she hadn't heard from them but the account still hadn't been activated by them she recontacted and they informed her they were still awaiting the ID check, which was rubbish of course as this had already been completed and confirmed. She asked to speak to someone else and was then kept waiting for a few minutes before being cut off. I can't image that a so-called 'professional' organisation could be so incompetent and I'm sure their action is due to the fact that she was not born in the UK, although she has been a British citizen for many years. She's now opened an ISA elsewhere who welcome non-British born customers.",
      "rating": 1,
      "date": "21st April 2023",
      "category": "savings",
      "sentiment": "Negative"
    },
    {
      "title": "Great product, great service",
      "text": "When taking out the YBS mortgage, we were moving from having shared ownership arrangement on our home to buying the full 100%. It had been a long time coming and there were extra hoops to jump through. YBS was brilliant. I was able to start the process online with a mortgage in principle but then switch to speaking to a mortgage advisor to ensure our specific set of circumstances were understood. I found it really helpful to be able switch between online and speaking to someone, because we could fit the mortgage process around our own lives and work commitments. Thanks YBS.",
      "rating": 5,
      "date": "31st January 2021",
      "category": "mortgages",
      "sentiment": "Positive"
    },
    {
      "title": "straightforward simple and easy to use",
      "text": "I have a YBS mortgage and i have nothing but praise for YBS and its customer service. every time I have had to contact them by phone the mortgage customer service have been really helpful and have always helped sort out what i needed. I also like the simple and straightforward list of mortgage products they have including offset mortgages. this choice is very helpful. Please keep it up! i will be remortgaging soon.",
      "rating": 5,
      "date": "4th April 2023",
      "category": "mortgages",
      "sentiment": "Positive"
    },
    {
      "title": "The Yorkshire Building Society has always been easy to deal with and their customer service whenever I have had to deal ",
      "text": "From the initial re-mortgage to YBS to doing additional lending for home improvements and the subsequent product transfers when the current products needed renewing, I have always been treated well, efficiently and I’ve had the confidence knowing that my custom is appreciated compared to how I have felt when using banks who seem to class customers as punters who are there to be profited from.",
      "rating": 5,
      "date": "21st January 2021",
      "category": "mortgages",
      "sentiment": "Positive"
    },
    {
      "title": "Best financial institution for mortgages",
      "text": "YBS have the best customer service department, completely sympathetic when in times of trouble. Have managed to turn around arrears to being ahead on mortgage with their help and understanding. Couldn't recommend more highly than this. Was a very long & stressful period of years but we turned this around together and they were fabulous.",
      "rating": 5,
      "date": "16th February 2021",
      "category": "mortgages",
      "sentiment": "Positive"
    },
    {
      "title": "Great Rates from a Caring Mutual Building Society.",
      "text": "They always seem to have very good rates of interest and keep me informed of new saving schemes. When I arrange, on-line, to transfer a large amount of money to another person’s account, they went out of their way to make sure that it was legitimate, without me feeling that they were interfering, not some anonymous text warning!",
      "rating": 5,
      "date": "23rd January 2026",
      "category": "savings",
      "sentiment": "Positive"
    },
    {
      "title": "Customers at their heart.",
      "text": "I found that YBS certainly have customer satisfaction and customer experience at the very heart of everything they do. Every contact I have had both taking out my mortgage and updating my mortgage has been nothing short of excellent. I will always be a loyal customer of YBS. Big named banks simply cannot compete",
      "rating": 5,
      "date": "8th March 2021",
      "category": "mortgages",
      "sentiment": "Positive"
    },
    {
      "title": "DO NOT GO WITH YBS",
      "text": "DO NOT GO WITH YBS Spent 11 years with a YBS mortgage. Was told the mortgage deal would expire on a certain date, agreed the completion of our house on that same day and fined over £1K for early repayment. Thanks YBS, treat you loyal customers like that and you won't have any customers. DO NOT GO WITH YBS",
      "rating": 1,
      "date": "7th April 2023",
      "category": "mortgages",
      "sentiment": "Negative"
    },
    {
      "title": "Very simple app to use and good interest rate at 5.2%",
      "text": "I have 2 cash ISAs with YBS - the only thing I dislike is that they close the account and stop you putting any more in it quickly, however now I know this, I'll just wait until I have the amount I want to save each year. Great interest rate of 5.2% on one of them and the app is really simple to use.",
      "rating": 5,
      "date": "7th April 2025",
      "category": "savings",
      "sentiment": "Positive"
    },
    {
      "title": "They have been fantastic from the 1st day I had an a...",
      "text": "They have been fantastic from the 1st day I had an account with them. I go to an Agency Office, the staff are friendly, knowledgeable and helpful. Always willing to go the extra mile. Have a few accounts with them, they never rush me, and always reach my requirements.",
      "rating": 5,
      "date": "23rd January 2026",
      "category": "savings",
      "sentiment": "Positive"
    },
    {
      "title": "Excellent service and products",
      "text": "YBS offers a fantastic range of good value products and I am especially pleased with the family offset mortgage account which allows my to give my daughter a helping hand whilst still retaining control of my money and achieving excellent value for the family.",
      "rating": 5,
      "date": "23rd February 2021",
      "category": "mortgages",
      "sentiment": "Positive"
    },
    {
      "title": "Exemplary service, thank you!",
      "text": "I received stunning service at the London branch this afternoon from Courtney Linley-Lavin. She calmly negotiated the verification of my ID and my mum's, sorted everything out and answered every question before I could ask it. Highly recommend.",
      "rating": 5,
      "date": "7th September 2023",
      "category": "savings",
      "sentiment": "Positive"
    },
    {
      "title": "The savings products are good, rates are competive",
      "text": "The savings products are good, the rates are competitive, and I like that loyalty products with good rates are offered to existing customers. The web site is generally good, and you can manage your account from there very well.",
      "rating": 5,
      "date": "15th March 2024",
      "category": "savings",
      "sentiment": "Positive"
    },
    {
      "title": "Great interest rates, particularly for loyal customers",
      "text": "Unlike many banks, The Yorkshire reward loyalty. Remain with them as a member and you get very good rates. Okay, the branch network is a bit weak in The South, but they are worth searching out and have a good 0n-line presence",
      "rating": 4,
      "date": "10th March 2023",
      "category": "savings",
      "sentiment": "Positive"
    },
    {
      "title": "Just a great provider, great products and services",
      "text": "Simply I trust them to do the right thing, I trust they will not try to take advantage of me, trust that I don't have to keep checking they are not taking advantage of me. Alongside this great products and services",
      "rating": 5,
      "date": "6th February 2021",
      "category": "mortgages",
      "sentiment": "Positive"
    },
    {
      "title": "Saw Isabelle who explained everything we needed to k...",
      "text": "Saw Isabelle who explained everything we needed to know transacted our business in a superb businesslike manner and completed two new investments in less than twenty minutes. What a pleasant experience",
      "rating": 5,
      "date": "19th July 2024",
      "category": "savings",
      "sentiment": "Positive"
    },
    {
      "title": "Yorkshire Building Society",
      "text": "Easy to use online banking but also happy that there is a physical branch within 10 miles of my home where the staff are helpful. They also reward you with better rates for loyal customers.",
      "rating": 5,
      "date": "23rd August 2024",
      "category": "savings",
      "sentiment": "Positive"
    },
    {
      "title": "A very good building society",
      "text": "A very good building society with an excellent range of products offering decent interest rates. Their customer service is good but it is simple to manage your accounts online.",
      "rating": 5,
      "date": "26th February 2025",
      "category": "savings",
      "sentiment": "Positive"
    },
    {
      "title": "Great interest rates",
      "text": "YBS might have the best interest rates for ISA on the market plus they offer interesting rates on other products if you are a member. Online account is straigthforward to use.",
      "rating": 5,
      "date": "23rd July 2022",
      "category": "savings",
      "sentiment": "Positive"
    },
    {
      "title": "Excellent Customer Service",
      "text": "I have been with YBS some 20 years and have always found them to be excellent. When changing products they are knowledgeable and really helpful. Wouldn't consider leaving.",
      "rating": 5,
      "date": "31st January 2021",
      "category": "mortgages",
      "sentiment": "Positive"
    },
    {
      "title": "Great product",
      "text": "Really happy with the fixed mortgage we took. The member of staff we dealt with kept us informed of developments which reassured us that we were a valued customer.",
      "rating": 5,
      "date": "26th January 2021",
      "category": "mortgages",
      "sentiment": "Positive"
    },
    {
      "title": "A large professionally run Building Society",
      "text": "A fair Building Society , which acknowledges Savers & Borrowers in this competitive area . One feels confident to be associated with Yorkshire Building Society .",
      "rating": 4,
      "date": "26th September 2022",
      "category": "savings",
      "sentiment": "Positive"
    },
    {
      "title": "Good Company",
      "text": "I have saved with YBS for years. They have good rates with knowledgeable friendly staff. The company cares and is transparent. Honesty goes a long way.",
      "rating": 4,
      "date": "26th March 2023",
      "category": "savings",
      "sentiment": "Positive"
    },
    {
      "title": "reliable interest rates and good online banking service",
      "text": "Reliable interest rates so that I don't have keep changing savings provider. The online banking service especially the new mobile app are easy to use.",
      "rating": 5,
      "date": "25th March 2021",
      "category": "savings",
      "sentiment": "Positive"
    },
    {
      "title": "Great customer service",
      "text": "This building society really looks after its Customers, I feel like I am really valued as a Customer rather than just a number in a call centre.",
      "rating": 5,
      "date": "2nd June 2023",
      "category": "savings",
      "sentiment": "Positive"
    }
  ],
  "coventry": [
    {
      "title": "Great service and staff",
      "text": "I applied for a mortgage with Coventry Building Society and I was very impressed by their service. They were quick, efficient and helpful throughout the process. They offered me a competitive rate and flexible terms. They communicated clearly and regularly with me and answered all my questions. I would recommend them to anyone looking for a mortgage. This review is based on information from various sources1234. It is not intended to be a substitute for your own research or personal experience. Please note that your experience may vary depending on your circumstances and preferences. Received message. Here is a possible review on Coventry Building Society mortgage services: I applied for a mortgage with Coventry Building Society and I was very impressed by their service. They were quick, efficient and helpful throughout the process. They offered me a competitive rate and flexible terms. They communicated clearly and regularly with me and answered all my questions. I would recommend them to anyone looking for a mortgage. This review is based on information from various sources . It is not intended to be a substitute for your own research or personal experience. Please note that your experience may vary depending on your circumstances and preferences.",
      "rating": 4,
      "date": "9th March 2023",
      "category": "mortgages",
      "sentiment": "Positive"
    },
    {
      "title": "I have recently opened a Junior ISA for my child, an...",
      "text": "I have recently opened a Junior ISA for my child, and it was really funny because they said there would be no app or website to control or just check the the account. You have to, literally either walk to your nearest branch or phone them up! I laughted and asked them if they thought it was 1986. It's very old fashioned! It's a way of putting it. I have now read some reviews of how people have been treated unfairly and it's really made me think.",
      "rating": 2,
      "date": "27th May 2025",
      "category": "savings",
      "sentiment": "Negative"
    },
    {
      "title": "Feeble Staff Training",
      "text": "Don't even think of applying for a mortgage with these people if you are a company director. They have absolutely no idea how Ltd companies operate. If you're a sole director and your company has shareholder funds just under a million this does not compute with the Coventry. Feeble training of underwriters and ludicrous questions. They feel they are doing you a favour not providing a service.",
      "rating": 1,
      "date": "28th November 2019",
      "category": "mortgages",
      "sentiment": "Negative"
    },
    {
      "title": "Competitive Interest Rates",
      "text": "I have a limited access cash ISA with Coventry Building Society and after the last Bank of England base rate cut I was expecting my rate to fall by 0.25% in line with all my other accounts with other banks/building societies. However the rate only fell by 0.15% which was a pleasant surprise. I think Coventry Building Society do try to offer the best possible rates.",
      "rating": 5,
      "date": "26th January 2026",
      "category": "savings",
      "sentiment": "Positive"
    },
    {
      "title": "TERRIBLE COMPANY AVOID AND DO NOT USE !!!!",
      "text": "shocking company offered us a mortgage held till october then when we came back to finalise told us we could still have it then two weeks later someone higher up said we couldnt !! shocking has put us back two weeks and we may lose the house now AVOID USING THESE PEOPLE",
      "rating": 1,
      "date": "24th August 2022",
      "category": "mortgages",
      "sentiment": "Negative"
    },
    {
      "title": "Good Rates for existing Customers",
      "text": "Unlike a lot of companies who get you in with low rates for a fixed term, we were pleasantly surprised to get comparably good rates for a new fixed term mortgage, meaning we didn't have to remortage completely and we saved on the cost of moving to another company.",
      "rating": 4,
      "date": "28th April 2023",
      "category": "mortgages",
      "sentiment": "Positive"
    },
    {
      "title": "A good account for small savers",
      "text": "Opening an account online was a quick and easy experience. The interest rate is excellent and the added bonus of a monthly prize draw mad it even more attractive. The limit on monthly deposits is not very high but otherwise the account is very flexible.",
      "rating": 5,
      "date": "4th September 2024",
      "category": "savings",
      "sentiment": "Positive"
    },
    {
      "title": "Mortgage fraud",
      "text": "Coventry building society used a forged mortgage to steal an OAPs home. He died a scared broken old man. Coventry building society does it really take 10 years to show him the unsigned mortgage he never signed. How long before this is taken down?",
      "rating": 1,
      "date": "12th August 2022",
      "category": "mortgages",
      "sentiment": "Negative"
    },
    {
      "title": "Competitive rates",
      "text": "They keep you informed about rate changes and are as quick to raise them as they are drop them when the base rate changes. They have competitive interest rates and I like being a member of a building society rather than a customer of a bank.",
      "rating": 5,
      "date": "29th August 2024",
      "category": "savings",
      "sentiment": "Positive"
    },
    {
      "title": "Friendly, quick service.",
      "text": "Friendly, quick service. Great products with good solid rates . A well known , trust name with branches on the High Street. Clear to understand product information and good communication about rate changes and maturity.",
      "rating": 5,
      "date": "26th February 2025",
      "category": "savings",
      "sentiment": "Positive"
    },
    {
      "title": "Simple to use, excellent interest rates, and much more",
      "text": "Simple to use, excellent interest rates, great communications, helpful advice - profits go back to investors and into the local community rather than to a bunch of hifalutin directors and/or alien trust and hedge funds",
      "rating": 5,
      "date": "2nd April 2025",
      "category": "savings",
      "sentiment": "Positive"
    },
    {
      "title": "Refuse porting to sting you with ERC",
      "text": "Portable mortgage but when trying to port they offer 15% less than current mortgage, quoting changes in their lending policies. I guess a good way to sting (ex)customers with an early exit fee. Never again CBS.",
      "rating": 1,
      "date": "26th June 2024",
      "category": "mortgages",
      "sentiment": "Negative"
    },
    {
      "title": "Branch experience great, online poor",
      "text": "Branch is great and accessible. Sadly online access leaves a lot to be disputed. Clunky, difficult to use and lots of repetition and waiting around. Even telephone banking is not as easy as it could be.",
      "rating": 3,
      "date": "12th February 2025",
      "category": "savings",
      "sentiment": "Mixed"
    },
    {
      "title": "Pleasant surprise for existing customer",
      "text": "Customer service were good at dealing with my re-mortgage queries, and it was a pleasant surprise to find that re-mortgage rates for existing customers were better than those for new clients.",
      "rating": 5,
      "date": "11th March 2024",
      "category": "mortgages",
      "sentiment": "Positive"
    },
    {
      "title": "Bad experience",
      "text": "I have applied for a mortgage 3 weeks ago and still waiting for a decision. Keep asking stupid and irrelevant questions. Do not recommend, don't waste your time and money with them.",
      "rating": 1,
      "date": "22nd May 2019",
      "category": "mortgages",
      "sentiment": "Negative"
    },
    {
      "title": "Competitive Cash ISA",
      "text": "The four access cash ISA pays a competitive interest rate. Coventry Building Society are good at communicating any changes to the interest rate. They now have an app as well.",
      "rating": 5,
      "date": "23rd November 2024",
      "category": "savings",
      "sentiment": "Positive"
    },
    {
      "title": "Dropped off a little on interest rates but still good",
      "text": "I like saving with a building society rather than a bank. Coventry haven't been quite as competitive for interest rates this year but they are good at communication.",
      "rating": 5,
      "date": "2nd March 2025",
      "category": "savings",
      "sentiment": "Positive"
    },
    {
      "title": "Good overall",
      "text": "Quick customer service reply, good range of regular savings accounts and saving accounts. Easy to access. Transfers out happen next day but website easy to use.",
      "rating": 5,
      "date": "2nd March 2025",
      "category": "savings",
      "sentiment": "Positive"
    },
    {
      "title": "Offer competitive interest rates on cash ISAs.",
      "text": "Offer competitive interest rates on cash ISAs. Easily allow you to switch to another cash ISA they have recently launched. Good communication.",
      "rating": 5,
      "date": "24th March 2025",
      "category": "savings",
      "sentiment": "Positive"
    },
    {
      "title": "Great value, great service",
      "text": "Cheap rates speak for themselves, but Coventry also provides superb customer experience and the best complaints handling I've ever experienced",
      "rating": 5,
      "date": "27th January 2019",
      "category": "mortgages",
      "sentiment": "Positive"
    },
    {
      "title": "Fantastic customer service",
      "text": "Fantastic customer service and wonderful help in-branch. Staff proactively offer relevant additional information and are very friendly.",
      "rating": 5,
      "date": "26th February 2025",
      "category": "savings",
      "sentiment": "Positive"
    },
    {
      "title": "Good mortgage , simpler than other banks to pass the...",
      "text": "Good mortgage , simpler than other banks to pass the checks. Also like that it's easy to check the current balance with their app.",
      "rating": 5,
      "date": "18th March 2025",
      "category": "mortgages",
      "sentiment": "Positive"
    },
    {
      "title": "Early exit fees were ridiculously high with my product.",
      "text": "Early exit fees were ridiculously high with my product. I didn’t find the self service features like the app very easy to use.",
      "rating": 2,
      "date": "2nd April 2024",
      "category": "mortgages",
      "sentiment": "Negative"
    },
    {
      "title": "Changing ,saving accounts!.",
      "text": "Changing accounts,was done seamlessly and efficiently,assistants very professional,friendly and financially competent!",
      "rating": 5,
      "date": "23rd January 2026",
      "category": "savings",
      "sentiment": "Positive"
    },
    {
      "title": "Excellent communication and products",
      "text": "Excellent mortgage products to suit every lender and their comunication makes you feel like you are a valued customer.",
      "rating": 5,
      "date": "12th March 2025",
      "category": "mortgages",
      "sentiment": "Positive"
    }
  ],
  "skipton": [
    {
      "title": "Total failure to do their jobs constant cut and paste mentality zero adjustments for disabled customers",
      "text": "Terrible just terrible toward diverse customers... Where to start! Firstly they don't understand anything relating to disabled customers. Managers don't even deal with complaints always front line customer service advisor teams instead. Front line staff in the contact centre clearly have no disability awareness training and the same for departments behind the scenes as constant failures to even look at disability needs throughout all dealings. Clear a customer financially ok but then faff about no end to avoid having to lend. Weeks and months of endless LIVING HELL stress with constantly being passed about and cut and paste generic responses no regard for disabled customers accessibility needs or circumstances at all. Clearly don't understand the Equality Act at all. Even told me to go elsewhere! What a disgrace. For a company that advertises when your money is in a good place so are you... Clearly not living up to your values! Treating customers as individuals would be a good start. Quite happy to give lots of money to Mental Health UK as their charity partner but have zero regards for the distress of their failure to make disability accommodations has on their own members and customers. Don't even include full information in the complaints when submitted and issue final responses before they even compile the full information. \"This is our final response\" only to then read down the page where it says if we have missed any information please let us know... How can you issue a final reply without even referencing the content of the complaint??? Or even having used the full information you were supplied with...???!!!! Shambles doesn't even sum this up. HR seriously need to start educating about disability and train their staff on what the Equality Act means. So sad as you would think that with a presence and perception to the public of local service they would do well.",
      "rating": 1,
      "date": "18th April 2020",
      "category": "mortgages",
      "sentiment": "Negative"
    },
    {
      "title": "DIP granted but full application declined after 2 week wait for decision!!!",
      "text": "Vey unhappy and annoyed that it took two weeks for them to tell me they were declining my full mortgage application. Underwriter made assumptions that I was upsizing and therefore made the assumptions that my outgoings will increase because if this. Nonsense! My current home is over 100 years old and the new premise was a new build and no bigger than what I live in now so will be far more energy efficient. Also quoted unrealistic figures when trying to justify her reasons for declining the mortgage. My husband and I both have very good credit scores as we have checked this with Experian and our records show we never miss or make any late payments. I can't understand how anyone with a ccj or bad debt can get mortgages but someone with a good record can't. The whole process has been long, drawn out and extremely stressful. Avoid at all costs!!!!!",
      "rating": 1,
      "date": "3rd October 2016",
      "category": "mortgages",
      "sentiment": "Negative"
    },
    {
      "title": "I had a twelve month fixed rate bond that matured w...",
      "text": "I had a twelve month fixed rate bond that matured while I was hospitalised I was unable to get in touch with the skipton, when I was eventually discharged from hospital I went to my local branch to give instructions only to find out that the skipton had second guessed my intentions and reinvested my money into another twelve months bond which is exactly what I wanted .I know that other banks deposit your money into a measly account paying a very low rate of interest but not the skipton ,they did what was best for the customer",
      "rating": 4,
      "date": "21st March 2025",
      "category": "savings",
      "sentiment": "Positive"
    },
    {
      "title": "Long standing customer who has had good service up u...",
      "text": "Long standing customer who has had good service up until now. I renewed an isa bond which pays the interest monthly to an external account and worked fine up untill I renewed in March. Now the interest isnt showing and the online chat just says the admin dept are dealing with it and will take 15 working days. Really unhappy about it. If I owed them money on a mortgage it would be different I'm sure. Other than complaining does anyone know of the procedure for taking this further?",
      "rating": 2,
      "date": "28th April 2025",
      "category": "savings",
      "sentiment": "Negative"
    },
    {
      "title": "Initially started an account from Accrington branch...",
      "text": "Initially started an account from Accrington branch the lady ( sorry can't remember her name now was very good at explaining what was on offer we chose an account convenient for us. Sadly Accrington branch closed went into Clitheroe and one of the ladies Ann was someone I knew from my school class over 50 years ago! Also young girl Laura who is lovely. We are happy with Skipton very friendly informative and would highly recommend to family and friends",
      "rating": 5,
      "date": "25th March 2025",
      "category": "savings",
      "sentiment": "Positive"
    },
    {
      "title": "Fantastic Mortgage Provider",
      "text": "We have recently taken out a mortgage with Skipton. Their communication with our Financial Advisor was excellent. We were treated fairly and fast. The mortgage we have has a good rate. I am pleased with the easy access to view the mortgage information. Communication and notifications for the first payment were excellent we knew exactly what was happening. Very happy and would fully recommend Skipton..",
      "rating": 5,
      "date": "10th March 2023",
      "category": "mortgages",
      "sentiment": "Positive"
    },
    {
      "title": "Amazing experience with SBS",
      "text": "I got a colleague Mortgage through SBS and the whole experience from start to end, me & my partner are first time buyers so never experienced buying a mortgage before. Everything was clear in the conversations and when we had any question's they were answered straight away, the process was really fast and we got the mortgage cheaper than we thought we would",
      "rating": 5,
      "date": "12th March 2025",
      "category": "mortgages",
      "sentiment": "Positive"
    },
    {
      "title": "Straightforward and easy",
      "text": "We took out a mortgage through a broker and Skipton delivered the best offer by a long shot. They honored the timeframes they gave and the process was absolutely painless. The app is very easy to use to monitor payments. I have contacted their customer support for something small and had a good experience.",
      "rating": 5,
      "date": "22nd February 2023",
      "category": "mortgages",
      "sentiment": "Positive"
    },
    {
      "title": "Flexible and Sensible approach to lending",
      "text": "Our situation was unusual in that my wife worked for the family business and took a wage cut during Covid. Skipton looked at matters for us from a personal viewpoint - we felt like they considered us a people, not just number crunching. Overall an amazing experience with friendly people who care.",
      "rating": 5,
      "date": "25th February 2021",
      "category": "mortgages",
      "sentiment": "Positive"
    },
    {
      "title": "Simple and efficient",
      "text": "Opening a savings account online was very simple and efficient. Initial rates are good compared to market and they offer better rates once established as a member. There are also still branches!",
      "rating": 5,
      "date": "15th March 2025",
      "category": "savings",
      "sentiment": "Positive"
    },
    {
      "title": "Skipton with a professional company smile.",
      "text": "I have been with the Skipton Building Society in Perth for many years. The professional staff members are a joy to talk to and are so friendly. Always greeted with a smile and extremely helpful.",
      "rating": 5,
      "date": "22nd January 2026",
      "category": "savings",
      "sentiment": "Positive"
    },
    {
      "title": "Conspiracers",
      "text": "Dont trust lots of fatal errors will let you down never admit no matter how vital they dont care will let you down reiterate lies to all including F O S avoid .",
      "rating": 1,
      "date": "26th April 2021",
      "category": "mortgages",
      "sentiment": "Negative"
    },
    {
      "title": "Helpful, friendly and efficient",
      "text": "Really pleased with their efficiency and customer service. Helpful and clear on the phone and quick with paperwork. The app is intuitive. Fab rates on savings",
      "rating": 5,
      "date": "26th February 2025",
      "category": "mortgages",
      "sentiment": "Positive"
    },
    {
      "title": "nt twelve months ago.",
      "text": "Opened an account twelve months ago. Always polite service when l have to visit. Noticed other staff being really helpful + patience to help others.",
      "rating": 5,
      "date": "26th March 2025",
      "category": "savings",
      "sentiment": "Positive"
    },
    {
      "title": "Really excellent customer service, they always expla...",
      "text": "A good range of savings products from a building society you can trust. Really excellent customer service, they always explain things so clearly.",
      "rating": 5,
      "date": "4th April 2025",
      "category": "savings",
      "sentiment": "Positive"
    },
    {
      "title": "So easy to transact with",
      "text": "I have a couple of savings accounts with Skipton. They are extremely responsive. Offer good interest rates and the App is so easy to use.",
      "rating": 5,
      "date": "24th March 2025",
      "category": "savings",
      "sentiment": "Positive"
    },
    {
      "title": "Good service and one of the few bank/building societ...",
      "text": "Good service and one of the few bank/building societies that still have many branches in towns and cities around the United Kingdom",
      "rating": 5,
      "date": "15th March 2025",
      "category": "savings",
      "sentiment": "Positive"
    },
    {
      "title": "easy to use and great rates.",
      "text": "easy to use and great rates. Simple online website. Extra benefits for members are worthwhile and I have taken some up.",
      "rating": 5,
      "date": "12th June 2025",
      "category": "savings",
      "sentiment": "Positive"
    },
    {
      "title": "Friendly, efficient, to the point without pressure t...",
      "text": "Friendly, efficient, to the point without pressure to make decisions, well informed staff and confident in the process.",
      "rating": 5,
      "date": "16th March 2025",
      "category": "savings",
      "sentiment": "Positive"
    },
    {
      "title": "Approachable and caring service",
      "text": "We were very impressed with how helpful and approachable they were, we decided to renew our mortgage with them.",
      "rating": 5,
      "date": "18th March 2025",
      "category": "mortgages",
      "sentiment": "Positive"
    },
    {
      "title": "Customer service",
      "text": "My interactions with all the staff at Skipton has been positive. The make me feel important and valued.",
      "rating": 5,
      "date": "15th March 2025",
      "category": "savings",
      "sentiment": "Positive"
    },
    {
      "title": "Excellent !",
      "text": "Great service and advice. Couldnt have done more to support me at a very difficult time.",
      "rating": 4,
      "date": "7th January 2019",
      "category": "mortgages",
      "sentiment": "Positive"
    },
    {
      "title": "Great service",
      "text": "Fantastic service at the Taunton branch with excellent rates on their ISA products.",
      "rating": 5,
      "date": "2nd April 2025",
      "category": "savings",
      "sentiment": "Positive"
    },
    {
      "title": "Man I spoke too could not speak English well and fou...",
      "text": "Man I spoke too could not speak English well and found it.difficult to understand",
      "rating": 3,
      "date": "21st March 2025",
      "category": "savings",
      "sentiment": "Mixed"
    },
    {
      "title": "Long wait times for customer service",
      "text": "Long wait times for customer service and early exit fees still really high",
      "rating": 3,
      "date": "2nd April 2024",
      "category": "mortgages",
      "sentiment": "Mixed"
    }
  ],
  "leeds": [
    {
      "title": "The epitome of bad digital design and bureaucracy.",
      "text": "I've been lured in by reasonable though not outstanding rates more than once but each time I've regretted it. The whole design of their website and online forms is a masterclass in how not to do it. Nothing is intuitive- you click one thing and it links to another page, then more options, dead ends, errors etc. It's like wading through treacle. I wanted to withdraw some funds by faster payment, but couldn't get through to the right bit. I am very experienced in navigating online forms etc. I reluctantly accepted a paper cheque withdrawal. It took well over a week to arrive (Royal Mail's fault? I'm not so sure) Great difficulty in getting it to scan on my current account app, finally scanned but the following day it got rejected. The printing on the cheque was very feint. I had to make a journey to a physical bank branch. All this time I was earning 0% on a fair bit of money while Leeds still had my funds. Despite numerous messages with them, I still don't know whether I could have had a faster payment after all.",
      "rating": 1,
      "date": "23rd January 2026",
      "category": "savings",
      "sentiment": "Negative"
    },
    {
      "title": "I have been a customer of Leeds Building Society sin...",
      "text": "I have been a customer of Leeds Building Society since 2022, and I have consistently found that Leeds Building Society offers highly competitive savings rates, which has allowed me to grow my savings effectively and with peace of mind. On the years, I have needed to contact their customer service team with various queries. Each time, I was met with outstanding service – the staff were always knowledgeable, attentive, and genuinely willing to help. It is clear that customer satisfaction is a priority for them, as my questions have always been answered promptly and thoroughly. Thanks to their excellent savings options and the consistently high standard of customer care, I plan to continue banking with Leeds Building Society for many years to come. I would highly recommend them to anyone seeking a reliable and rewarding place to save.",
      "rating": 5,
      "date": "19th January 2026",
      "category": "savings",
      "sentiment": "Positive"
    },
    {
      "title": "I had recently lost my mother who had been caring fo...",
      "text": "I had recently lost my mother who had been caring for the past 10 years. I had opened a Savings account in order to receive my small inheritance from the sale of her house,which was being divided 5 ways between my siblings. I was very distressed during this time and staff showed me care and compassion by dealing with me sympathetically when I was very emotional, and took the time to listen and was a shoulder to cry on literally, providing me with a private room in which to sit. I couldn't have got through the difficult weeks of bereavement without the support from your wonderful and caring staff!! I cannot thank them enough!",
      "rating": 5,
      "date": "23rd January 2024",
      "category": "savings",
      "sentiment": "Positive"
    },
    {
      "title": "FEELING REALLY BULLIED BY LEEDS BS",
      "text": "After a review on Trustpilot revealing Leeds BS instant access savings rate was 1.9% and between 2 and 3 times that available elsewhere; Also that Martin Lewis stated if getting less than 4% \"ditch and switch\", Leeds have demanded review be taken down! Clearly bothered at people being given this information! I've been with Leeds BS for nearly 30 years and feel that, rather than being treated as a loyal customer, I've lost out substantially on interest and now feel they are trying strong arm tactics versus an OAP to hide their awful approach to loyal customers/long term members.",
      "rating": 1,
      "date": "30th June 2023",
      "category": "savings",
      "sentiment": "Negative"
    },
    {
      "title": "Impressive customer service",
      "text": "I had the best experience renewing my mortgage product last year. My existing product was about to end and I was able to simply complete my application for a new product online, so long as I was not altering the amount or term. As I was interested in reducing the term I contacted an advisor. She answered every question I had and advised that I could reduce the term retrospectively without penalty. It's great to leave a call with the confidence that you're making the right decision.",
      "rating": 5,
      "date": "8th March 2023",
      "category": "mortgages",
      "sentiment": "Positive"
    },
    {
      "title": "Very poor administration and customer service",
      "text": "Requested a new savings account but to be sent the interest from my existing account. Despite giving written instructions and a phone call also told my request would be actioned. They failed to follow my instructions and I had to cancel the account. To make matters worse they sent me a cheque rather than electronic transfer unlike the other three providers I was with. Woeful administration and glacier like slow responses. Find a better financial institution.",
      "rating": 1,
      "date": "14th May 2025",
      "category": "savings",
      "sentiment": "Negative"
    },
    {
      "title": "Shambles",
      "text": "Opened 5 Cash ISAs for family members. Did all the online checks and set up all the passwords. Received the welcome pack to say all opened and a PIN to activate to the accounts. Went in and did this. Went to go back in to put money in and none of the accounts worked. Was told I need to go into the branch with new ID for each member to open the accounts again. I had spent about 6 hours to this point setting them up. Gave up in the end. Shambles.",
      "rating": 1,
      "date": "21st May 2025",
      "category": "savings",
      "sentiment": "Negative"
    },
    {
      "title": "Shocking service and bad advice",
      "text": "I moved house and needed to port my existing mortgage across. Should have been simple. Not only has the process been like pulling teeth, it cost me thousands extra as I was given bad advice by LBS which was highlighted by my conveyancer. Consultants were pompous, unhelpful and sly. Steer well clear! I would have rated 0 stars in review but was not possible.",
      "rating": 1,
      "date": "16th June 2021",
      "category": "mortgages",
      "sentiment": "Negative"
    },
    {
      "title": "Best customer service",
      "text": "I've had a mortgage with LBS for almost 8 years (3 products on 2 properties); as well as good interest rates, the customer service has always been excellent - even when I made a complaint about something that turned out not to be their fault, they were very helpful with providing information so that I could pursue the matter with the appropriate party.",
      "rating": 5,
      "date": "26th March 2023",
      "category": "mortgages",
      "sentiment": "Positive"
    },
    {
      "title": "Amateurs",
      "text": "Put money into an isa for a one year fix. On maturity I wanted my money transferred to another company. Everything was set up to have money transfered with the new company. Leeds bs then sent everything to my current account blaming the new company for not informing them which is total rubbish. Investigation is on going. Don't deal with these cowboys!",
      "rating": 1,
      "date": "4th January 2024",
      "category": "savings",
      "sentiment": "Negative"
    },
    {
      "title": "Leek Building Society : first class !",
      "text": "I would like to commend the professionalism, attitude and knowledge of your staff. My enquiries were always dealt with a timely manner. Our application was in many ways a difficult one; nevertheless, your staff should be congratulated on seeing matters through to a conclusion. Really, really appreciate all your hard work.",
      "rating": 5,
      "date": "19th March 2024",
      "category": "mortgages",
      "sentiment": "Positive"
    },
    {
      "title": "A Happy Customer",
      "text": "Two members of staff on the front desk were extremely helpful and arranged an appointment for the next day.Saw Pam the next day right on time. She was very friendly and extremely helpful. Really patient and accommodating guiding me to what would be best savings wise for me. One happy customer. Thanks.",
      "rating": 5,
      "date": "21st May 2025",
      "category": "savings",
      "sentiment": "Positive"
    },
    {
      "title": "Been with the Building society for over 60 years.",
      "text": "Been with the Building society since it was Leeds and Holbeck and I was a very young child (over 60 years). Always found them very professional and personable. Recently went to update my accounts to the best interest ones. Lesley was very informative and helpful at the Morley Branch",
      "rating": 5,
      "date": "31st July 2024",
      "category": "savings",
      "sentiment": "Positive"
    },
    {
      "title": "problem....",
      "text": "The eternal problem with address confirmation.. I've been fighting for 2 weeks to confirm my wife's address.. first it was supposed to be P60 as they have in the letter, now it's not enough for them ... the worst bank I've come across ... I don't recommend it.",
      "rating": 1,
      "date": "23rd January 2023",
      "category": "mortgages",
      "sentiment": "Negative"
    },
    {
      "title": "Amazing services and competent advisors",
      "text": "I've been with Leeds Building Society for nearly 7 years. They helped me buy my first family house. They supported me all the way with brilliant advice. Even when I decided to pay off the help to buy, they made it possible. Will certainly recommend them.",
      "rating": 5,
      "date": "4th April 2023",
      "category": "mortgages",
      "sentiment": "Positive"
    },
    {
      "title": "Great building society for mortgage",
      "text": "I have a mortgage with Leeds Building Society with an awesome rate. I was able to fix my rate before the interest rates peaked. Leeds Building Society extended my offer despite the huge difference in the rate I was offered and the current rate",
      "rating": 5,
      "date": "29th March 2024",
      "category": "mortgages",
      "sentiment": "Positive"
    },
    {
      "title": "Great service",
      "text": "Always happy to help and reassuring when things took an unexpected turn. The staff member took time to look things over then said they would need to call me back and that same member phoned me back which was great and really meant a lot to me.",
      "rating": 5,
      "date": "8th February 2019",
      "category": "mortgages",
      "sentiment": "Positive"
    },
    {
      "title": "Been with Leeds Building Society since a child.",
      "text": "I have been with Leeds Building Society since I was a child (formerly Leeds and Holbeck Building Society. The still have places where you can go in and sort out your savings. Always very friendly and trustworthy",
      "rating": 5,
      "date": "28th February 2025",
      "category": "savings",
      "sentiment": "Positive"
    },
    {
      "title": "Shared ownership",
      "text": "We were first time buyers with great affordability and good credit but due to the market we were declined by NatWest on “score”. Leeds offered us a great rate and do shared ownership which is great",
      "rating": 4,
      "date": "17th February 2023",
      "category": "mortgages",
      "sentiment": "Positive"
    },
    {
      "title": "Phone hacked after giving my details",
      "text": "Possible confidential information breech. My phone got hacked after my mortgage broker give my details to this company. They also reduced the offer to 50%, even though I work for the NHS.",
      "rating": 1,
      "date": "1st June 2024",
      "category": "mortgages",
      "sentiment": "Negative"
    },
    {
      "title": "Very high SVR - permanently it seems",
      "text": "They have had an SVR of well over 5% for the 15 years I have noted, not so good for those wishing to overpay large sums or avoid early repayment charges if potentially moving, beware..",
      "rating": 1,
      "date": "2nd February 2022",
      "category": "mortgages",
      "sentiment": "Negative"
    },
    {
      "title": "Been with them since I was a young girl",
      "text": "Been with the building society since I was a young girl. Always friendly and helpful and professional Always found them very personable and able to tailor accounts to my needs",
      "rating": 5,
      "date": "10th October 2024",
      "category": "savings",
      "sentiment": "Positive"
    },
    {
      "title": "Excellent experience at Leicester Branch",
      "text": "Staff could not have been more helpful. Really easy to open an account Would return again and would have no hesitation recommending the Leicester Branch to anyone.",
      "rating": 5,
      "date": "5th August 2023",
      "category": "savings",
      "sentiment": "Positive"
    },
    {
      "title": "isa transfer",
      "text": "this was not a straight forward transfer and jamez of the Morley branch dealt with task professionally and with a sense of humour. thank you janet&john Leeds 12",
      "rating": 5,
      "date": "28th September 2023",
      "category": "savings",
      "sentiment": "Positive"
    },
    {
      "title": "Mortgage services",
      "text": "We have a mortgage with Leeds building society and their customer service is brilliant Very informative staff every time I phone and always go above and beyond",
      "rating": 5,
      "date": "3rd April 2023",
      "category": "mortgages",
      "sentiment": "Positive"
    }
  ],
  "principality": [
    {
      "title": "Unfair to disabled people",
      "text": "I started to invest with the Principality when we were planning our move to Wales. I saved steadily and by the time we moved had a good sum in my investment accounts. I had both passbook and online accounts and found that initially, the staff were friendly and helpful. However, when I had a stroke, it became difficult for me to manage my online accounts. My speech and mobility were poor and I realised that my various savings were not in the best accounts for me. The Principality were poor at communicating my options to me. When I went into the branch, I asked for help and explained that I had had a stroke. Whilst they were quite willing to update my husband's passbook without any form of ID, they bizarrely required ID from me before they would discuss my accounts. They wanted a bank statemnt, which I had not brought with me. When I told them that my Halifax statements were online on my phone and I could send a copy to their printer, the staffer pretended that she could not understand what I was saying. I felt humiliated and went home. I then went back a couple of weeks later and went into the branch with my passbooks and asked for them to be updated. The three staffers just talked to each other about their families, their slimming club and so on. They did not speak to me directly, One of them referred to me as \"this customer\". So I decided to close my accounts on the spot, which I did. I took the cheques across the road to the Nationwide and bought bonds and such like with them. When I got home I contacted the Principality to complain. They said that they could not see the problem. Eventually, they sent me a little food hamper of stuff that I could not eat because I am a vegan. They sent me an email saying that as far as they were concerned, the matter was closed.",
      "rating": 2,
      "date": "31st May 2023",
      "category": "savings",
      "sentiment": "Negative"
    },
    {
      "title": "Refused Mortgage",
      "text": "We had an issue over seven and a half years ago and our Mortgage Broker said Principality were a good lender and should have no problems. We passed our AIP no problems and were up front with our issue from many years ago and even showed the issue was resolved. Our credit score was good otherwise we would not have passed. We met all their lending criteria and they decided to turn us down. They would not even give a reason to the Broker why. What's the point in having a lending criteria and then move the goalposts? Really disappointed with them. We all make mistakes in the past and we addressed ours and have been clean for many years... just seems some lenders hold on to the past even though it was many years ago. Hi just an update guys. I spoke to the Broker who spoke to a manager directly at Principality and after looking in to it, she agreed we did meet the criteria but was not able to overturn the decision. They have now amended their criteria so it doesn't happen again. Absolutely shocking from Principality. Just to let you know I was able to get a Mortgage with another high street lender with a fantastic rate who didn't judge us on our past from seven years ago.",
      "rating": 1,
      "date": "3rd December 2017",
      "category": "mortgages",
      "sentiment": "Negative"
    },
    {
      "title": "Principality is 'simply the best'!",
      "text": "My husband Tom and I have been customers of the Principality Building Society for 3 years. The website provides clear information and is easy to navigate. The highlight of the service is the ability to speak to an experienced member of staff directly on the phone. Telephone calls are answered quickly and professionally. Unlike some other financial institutions which direct you to an automated chat line or keep passing you from one department to another, this does not happen with the Principality Building Society. We have 12 month regular savers accounts. When the savers mature, we start new ones but do not need to set up a new account and new standing orders. We continue with what we have previously set up. It is a simple user friendly system which limits unnecessary work on our behalf. Nothing seems too much trouble on the phone. Principality Building Society set the gold standard in excellent customer relations and interpersonal skills and should serve as a role model to certain other financial institutions.",
      "rating": 5,
      "date": "22nd January 2026",
      "category": "savings",
      "sentiment": "Positive"
    },
    {
      "title": "Efficient, simple to use with no fuss",
      "text": "I have been a customer of the Principality for a few years now with a Cash Isa and Instant Saver accounts and have found them to be very easy to contact and knowledgeable. Our nearest branch is open from Monday - Saturday, so it is fairly easy to call in. The staff are friendly and easy to talk to about any banking issues that I may have. I have never had a bad experience with them and recommend anyone to give them a chance. The staff at the Principality are efficient and they explain exactly what their banking products do and how they work in plain, simple language without all the jargon for a quick sale. The Principality does everything that you'd want a building society to do.",
      "rating": 5,
      "date": "9th April 2017",
      "category": "savings",
      "sentiment": "Positive"
    },
    {
      "title": "Alternative products with great rates",
      "text": "Principality's products are available to the whole of the UK, I started with a regular saver that had a high rate, and since then they've had 6 month and Christmas savers; both products not found with many other banks. The website is well designed and easy to navigate, and the few times I've needed to call; they were friendly and helpful. The only downsides is they still don't have an app despite the home page showing a webpage on a phone that could be confused for an app. Also their bank.green score could better, as they use Barclays in the background which is the worst for ethical-environmental concerns. These two issues stop it being a 5 star building society.",
      "rating": 4,
      "date": "3rd November 2024",
      "category": "savings",
      "sentiment": "Positive"
    },
    {
      "title": "Excellent., local customer service, always very helpful and friendly",
      "text": "I have had a principality building society acccount for many years and have always found them to be very personable and helpful towards any questions I may have. I am served as quickly as possible and they are happy to have a quick chat, which helps build rapport. They are professional In their approach. Also, the are a local company and I am proud to support a company that has its ethics and goals aligned with its customers.",
      "rating": 5,
      "date": "2nd February 2017",
      "category": "savings",
      "sentiment": "Positive"
    },
    {
      "title": "Good service and high interest rate account",
      "text": "Good account with a very good interest rate,website is a bit slow to work with and it appears whatever you say you will be contacted by phone to confirm instructions before the maturity date. Building soc. has regular good interest rates and consistently features in best account literature. . .",
      "rating": 5,
      "date": "13th June 2025",
      "category": "savings",
      "sentiment": "Positive"
    },
    {
      "title": "T & Cs on website not current.",
      "text": "I wished to close my 2 year ficed rate bond after 1 year but was told I couldnt despite current website information stating with loss of 180 days interest I could. https://www.principality.co.uk/savings-accounts/fixed-term-savings-and-bonds/fixed-term-bond-account-terms",
      "rating": 1,
      "date": "7th July 2021",
      "category": "savings",
      "sentiment": "Negative"
    },
    {
      "title": "Pacesetter.",
      "text": "Very little 'phone-waiting time, then ... a miracle! Contact is made with a most friendly, polite and helpful 'humanoid', capable of providing a solution, without having to refer to anyone else. - A template for the vast majority of similar institutions to follow!",
      "rating": 5,
      "date": "24th January 2026",
      "category": "savings",
      "sentiment": "Positive"
    },
    {
      "title": "Their regular savers are market leading.",
      "text": "Their regular savers are market leading. The maturity process is best in market. They even transmit matured funds on none working days. They offer using some of funds to start off a new policy that day so you lose no days of investing.",
      "rating": 5,
      "date": "22nd January 2026",
      "category": "savings",
      "sentiment": "Positive"
    },
    {
      "title": "Very Good Customer Service",
      "text": "Can’t rave about their customer service enough. Have always been able to have a transparent conversation regarding our options. Only thing is they’re more expensive than a lot of other mortgages not the most competitive on rates",
      "rating": 4,
      "date": "16th April 2021",
      "category": "mortgages",
      "sentiment": "Positive"
    },
    {
      "title": "Nice Security",
      "text": "Switch banks/Building Societies quite a bit, and I think this is the first time that I ever have had to confirm my address to set up a saver, maybe it was because I havent banked with them before but even so, I appreciate it.",
      "rating": 5,
      "date": "10th March 2021",
      "category": "savings",
      "sentiment": "Positive"
    },
    {
      "title": "Excellent online Cash ISA with 12 month bonus",
      "text": "I have held a cash ISA with Principality for several years but noticed a new online ISA account with a bonus rate for 12 months. Upon request, they transferred my existing ISA to the new account with a minimum of fuss.",
      "rating": 5,
      "date": "26th February 2024",
      "category": "savings",
      "sentiment": "Positive"
    },
    {
      "title": "5 Year ISA On-Line Application Doesn't Work",
      "text": "Processing an on-line 5 year ISA application gives error code 4530 and won't let you complete. Like a twot it tried it twice on an iPad and once on a windows laptop, same error code so a good waste of half an hour",
      "rating": 1,
      "date": "4th March 2018",
      "category": "savings",
      "sentiment": "Negative"
    },
    {
      "title": "excellent service I received from the Branch",
      "text": "I wanted to put away a small amount of money each month for 6 months and this account offered very good interest rates. What made the experience even better was the excellent service I received from the Branch",
      "rating": 5,
      "date": "23rd January 2026",
      "category": "savings",
      "sentiment": "Positive"
    },
    {
      "title": "A nice wee saver",
      "text": "Good product for receiving a decent interest rate in exchange for regular savings which they can hold for a fixed period of time. Easy to set up online. Staff on the phone friendly and helpful to deal with.",
      "rating": 5,
      "date": "9th February 2020",
      "category": "savings",
      "sentiment": "Positive"
    },
    {
      "title": "Excellent",
      "text": "Excellent service. The staff at our local branch are welcoming, professional and organised. They are also very knowledgeable about the wide range of products that the branch can offer. Thank you",
      "rating": 5,
      "date": "9th November 2018",
      "category": "savings",
      "sentiment": "Positive"
    },
    {
      "title": "Great product",
      "text": "Easy to set up, website is easy to navigate around. The staff in our local prestatyn branch are polite, friendly, organised and professional. They are also very knowledgeable. Well worth a look",
      "rating": 5,
      "date": "4th February 2023",
      "category": "savings",
      "sentiment": "Positive"
    },
    {
      "title": "Friendly staff",
      "text": "You can't get better customer service than the staff at principality. The mortgage advisor is very helpful and offered good unbiased opinions to help us make our decision regarding or mortgage",
      "rating": 5,
      "date": "17th May 2017",
      "category": "mortgages",
      "sentiment": "Positive"
    },
    {
      "title": "Large withdrawal swiftly dealt with.",
      "text": "Needed to withdraw large some of money, this was swiftly paid into my bank account unlike some other building societies that are painfully slow with large withdrawals.",
      "rating": 5,
      "date": "26th February 2025",
      "category": "savings",
      "sentiment": "Positive"
    },
    {
      "title": "Easy to access account",
      "text": "Easy account to access online. Online banking easy to set up. The process of moving money in and out of the account is simple but there is ample security.",
      "rating": 5,
      "date": "24th January 2020",
      "category": "savings",
      "sentiment": "Positive"
    },
    {
      "title": "Consistently competitive interest rates",
      "text": "Principality offer consistently competitive interest rates. Opening and operating an account is easy and helpful support is provided when required.",
      "rating": 5,
      "date": "23rd January 2026",
      "category": "savings",
      "sentiment": "Positive"
    },
    {
      "title": "Customer Service above all",
      "text": "Principality is a company that can always be relied on to help with their knowledgeable contact centre and helpful admin team alongside good rates.",
      "rating": 5,
      "date": "25th January 2020",
      "category": "savings",
      "sentiment": "Positive"
    },
    {
      "title": "Good Product",
      "text": "Excellent service, polite, organised and professional staff. Great product, easy to set up and easy to understand. Thank you",
      "rating": 5,
      "date": "22nd November 2019",
      "category": "savings",
      "sentiment": "Positive"
    },
    {
      "title": "Good but no app available in 2021!?!",
      "text": "A bit behind the times but then again it's a building society. Rates are usually pretty tempting and customer services.ok.",
      "rating": 3,
      "date": "11th March 2021",
      "category": "savings",
      "sentiment": "Mixed"
    }
  ],
  "cumberland": [
    {
      "title": "Not just a number",
      "text": "I lobe how personal this building society is. Ive used this bank for as long as I can remember as My Mum has too. They are reliable and always there to help with anything you need or want from a bank. I trust them and would never want to look elsewhere to look after my money. My little boy also has 2 savings accounts now and i hope he chooses the Cumberland when he grows up. Annie",
      "rating": 5,
      "date": "6th March 2022",
      "category": "mortgages",
      "sentiment": "Positive"
    },
    {
      "title": "Just awful",
      "text": "I very much regret taking a mortgage out with this building society. Worst lender I’ve encountered in over 30 years. Customer service is non existant. They want an insane amount of information when it comes to borrowing anything and then tell me that I can’t afford £5k extra on my mortgage even though my salary just increased by £14k. Won’t use the again.",
      "rating": 1,
      "date": "1st September 2023",
      "category": "mortgages",
      "sentiment": "Negative"
    },
    {
      "title": "Innovative and resposive",
      "text": "Cumberland Buiding Society provide outstanding service with friendly, helpful and knowledgable staff. Their new mortage into reitrement products are a godsend to us older clients who until now had no options for home ownership without getting a Lottery win and buying outright.",
      "rating": 5,
      "date": "18th April 2021",
      "category": "mortgages",
      "sentiment": "Positive"
    },
    {
      "title": "Initial mortgage appointment",
      "text": "As a first time buyer I was a little unsure as to what to expect from my initial mortgage appointment. Lewis at the Cumberland was very knowledgeable and gave me all the tools I needed to feel more confident in making an offer on my first home.",
      "rating": 5,
      "date": "28th February 2022",
      "category": "mortgages",
      "sentiment": "Positive"
    },
    {
      "title": "Locals",
      "text": "Great BS in the South West and northern England . Who look after there customers with that personal touch . Love that you can go on holiday with no charges on your debit card . Been a customer for 35 years and will not be moving",
      "rating": 5,
      "date": "12th March 2022",
      "category": "mortgages",
      "sentiment": "Positive"
    },
    {
      "title": "A green mortgage",
      "text": "I just saw you topped the Ethical Consumer rating for banks and lenders. I am surprised that green investing is still only an option. Thank you for leading the way. No-one should be investing in financing climate change.",
      "rating": 5,
      "date": "10th April 2021",
      "category": "mortgages",
      "sentiment": "Positive"
    },
    {
      "title": "They saved our lives gave h us a mortgage",
      "text": "We were after a mortgage and we were in our late 60s they give us one I can not thank them enough the manager at the branch was a absolute star I thank her as well hope they win a brilliant company and wonderful staff",
      "rating": 5,
      "date": "3rd March 2022",
      "category": "mortgages",
      "sentiment": "Positive"
    },
    {
      "title": "Friendly staff and local branches",
      "text": "Unlike the big banks that have largely abandoned customers, we are delighted to have a local bank that is open 6 days a week and where the staff seem happy to see you. Convenient current account and top ISA rate.",
      "rating": 5,
      "date": "20th January 2023",
      "category": "savings",
      "sentiment": "Positive"
    },
    {
      "title": "Banking with the Cumberland",
      "text": "I have been banking with the Cumberland Building Society in Dumfries some 30 years ago since it first opened there. .I have recently moved all my banking to them as I have always found the service first class.",
      "rating": 5,
      "date": "22nd March 2021",
      "category": "savings",
      "sentiment": "Positive"
    },
    {
      "title": "Renewing Mortgage",
      "text": "Incredible service from start to finish. I appreciated how all the staff were aware of my case so everytime I spoke to someone, I didn't have to keep repeating myself. Informative and very slick organisation",
      "rating": 5,
      "date": "2nd April 2021",
      "category": "mortgages",
      "sentiment": "Positive"
    },
    {
      "title": "Great customer service",
      "text": "I really prefer the Cumberland to bigger building societies as they are a local company and I feel valued by them. I always get a happy smile from the staff at my branch. Keep up the great work you do.",
      "rating": 5,
      "date": "25th February 2022",
      "category": "savings",
      "sentiment": "Positive"
    },
    {
      "title": "Personal service, great products",
      "text": "The Cumberland has a range of specialist products all sold by knowledgeable and friendly staff. I can always pick up the phone and speak to someone who knows what they're talking about.",
      "rating": 5,
      "date": "4th March 2022",
      "category": "mortgages",
      "sentiment": "Positive"
    },
    {
      "title": "Wonderful to have a friendly local bank that is stil...",
      "text": "Wonderful to have a friendly local bank that is still on the high street where I can pop in a get things done quickly. Good range of savings products at a fair interest rate.",
      "rating": 5,
      "date": "21st March 2025",
      "category": "savings",
      "sentiment": "Positive"
    },
    {
      "title": "Genuine Friendly People!",
      "text": "We got our first Mortgage with The Cumberland and it was a very calm and friendly experience. Everything was explained thoroughly and help was always just a phone call away!",
      "rating": 5,
      "date": "25th March 2022",
      "category": "mortgages",
      "sentiment": "Positive"
    },
    {
      "title": "Cumberland comes up trumps",
      "text": "Excellent and knowledgable staff, many branches available to help. Various accounts/savings available with competitive rates proud that they are my local building society",
      "rating": 5,
      "date": "7th November 2017",
      "category": "savings",
      "sentiment": "Positive"
    },
    {
      "title": "Brilliant from start to finish",
      "text": "From the first call to moving in the Cumberland kept me informed about my application, best part was being able to speak to the same person for the whole time - Thank you",
      "rating": 5,
      "date": "28th March 2022",
      "category": "mortgages",
      "sentiment": "Positive"
    },
    {
      "title": "Moved house",
      "text": "Moved house and had been mortgage free for many years.Needed a little top up and had used Cumberland Building Society many years ago.Advisor was great with us",
      "rating": 5,
      "date": "22nd January 2022",
      "category": "mortgages",
      "sentiment": "Positive"
    },
    {
      "title": "Great staff",
      "text": "So helpful about different accounts.the people in wigton branch on the counter are so informative you don’t need to have an appointment to get great advice",
      "rating": 5,
      "date": "3rd March 2022",
      "category": "savings",
      "sentiment": "Positive"
    },
    {
      "title": "Great product, wonderful service",
      "text": "The savings account is easy to use and pays a great rate. The customer service is above and beyond and it's lovely to speak to people really easily.",
      "rating": 5,
      "date": "1st April 2022",
      "category": "savings",
      "sentiment": "Positive"
    },
    {
      "title": "Friendly and professional",
      "text": "We have banker with the Cumberland for over 40 years & in that time they have never failed to provide superbly professional service to us",
      "rating": 5,
      "date": "14th March 2022",
      "category": "savings",
      "sentiment": "Positive"
    },
    {
      "title": "Helpful and friendly advice",
      "text": "Great service, helpful and friendly advice over the phone and in branch. A good range of account options for personal and business needs.",
      "rating": 5,
      "date": "30th March 2021",
      "category": "savings",
      "sentiment": "Positive"
    },
    {
      "title": "Ethical and helpful",
      "text": "Knowledgeable friendly helpful staff in branch, and on the end of the phone. Ethical products from an ethically responsible business.",
      "rating": 5,
      "date": "28th February 2022",
      "category": "savings",
      "sentiment": "Positive"
    },
    {
      "title": "Real People serving Real People",
      "text": "They operate as a small family business but with the weight of a large bank. Love the personal approach - not a robot in sight",
      "rating": 5,
      "date": "17th April 2021",
      "category": "mortgages",
      "sentiment": "Positive"
    },
    {
      "title": "Great rates",
      "text": "Easy to use the app online to manage transferring funds across accounts. Friendly customer service whenever I ring for help.",
      "rating": 5,
      "date": "25th March 2022",
      "category": "savings",
      "sentiment": "Positive"
    },
    {
      "title": "Good service and competitive rates",
      "text": "Mortgage advisor was supportive, attentive and helpful whilst helping us to find the best rate. Good service over the phone",
      "rating": 5,
      "date": "12th May 2021",
      "category": "mortgages",
      "sentiment": "Positive"
    }
  ],
  "monmouthshire": [
    {
      "title": "Excellent support from MBS",
      "text": "I have had a mortgage with the Monmouthshire BS for 8 years - both during my working life and after retirement. At all times I have been treated with courtesy and given very helpful service from informed and efficient advisers who have shown considerable understanding of my individual situation (I am now 73) and have successfully matched products to my requirements at different times. I have also consulted independent mortgage advisers and visited mortgage comparison websites. On the last 3 occasions I have returned to the Monmouthshire because of their excellence.",
      "rating": 5,
      "date": "27th November 2025",
      "category": "mortgages",
      "sentiment": "Positive"
    },
    {
      "title": "Fast turnaround, great service from Jamie!",
      "text": "I contacted MBS about porting my mortgage on a new property purchase. Jamie Warburton picked up the request, and has been nothing but brilliant ever since. Every step of the journey there more than adequate updates, explanations when they were needed, and other relevant information. I really felt like Jamie was on my side, really pled my case with the underwriters to get the mortgage offer over the line. For a process that has generally been quite stressful in the past, Jamie made it a lot less so, on top of probably a record time turnaround.",
      "rating": 5,
      "date": "10th November 2025",
      "category": "mortgages",
      "sentiment": "Positive"
    },
    {
      "title": "I have been a member of Monmouthshire Building Socie...",
      "text": "I have been a member of Monmouthshire Building Society for many years now and I have always received a consistently high standard of service.I would particularly like to mention all of the team at the Monmouth branch AND Hannah at the Chepstow branch…….M B S are fortunate to have such a dedicated and professional team working for them. Please pass on my thanks. On a slightly different note thread, I shall be looking for a home for my ISA ,on April 6 ,2026 ,so hopefully M B S will have some competitive fixed rates on the table.",
      "rating": 5,
      "date": "30th January 2026",
      "category": "savings",
      "sentiment": "Positive"
    },
    {
      "title": "Brilliant Mortgage Advisor",
      "text": "Our experience from start to finish couldn’t have been better. Whilst there was a lot of information to go through, our mortgage advisor Anita was always there to answer any questions. Even though we had to go through some difficult questions regarding our finances it never felt like we were being judged, Anita was so professional and supportive which made the whole process as stress free as possible.",
      "rating": 5,
      "date": "6th October 2025",
      "category": "mortgages",
      "sentiment": "Positive"
    },
    {
      "title": "App would not take info given",
      "text": "App would not take the information given to start the account and kept getting messages to call the BS. Cust service told me to delete app and reload but same problems. Cust service tried to sort out but couldn’t. 4th attempt and a few days later, finally got it sorted. Also app tells you to call the BS between 9and 5 but seems to forget they don’t open until 10 on Wednesdays for their sleep in.",
      "rating": 2,
      "date": "14th January 2026",
      "category": "savings",
      "sentiment": "Negative"
    },
    {
      "title": "One of the good B Societies",
      "text": "I have been a regular customer of the building society for the last 3 years benefiting from best Savings rates. I have sometimes used customer services with good outcomes . The app service introduced is useful. It would have been convenient to access closed accounts for interest for self assessment. HOPE MY REQUEST FOR THE PAPER COPY FOR YEAR 2024-25 would be complied with Thanks",
      "rating": 5,
      "date": "14th January 2026",
      "category": "savings",
      "sentiment": "Positive"
    },
    {
      "title": "Brilliant service from start to finish!",
      "text": "Anita was just fantastic from start to finish for BF above and beyond, understanding my confusions and acknowledging them in a wonderful way! She was a wonderful lady to speak with and I could tell she genuinely cared for me as a customer, ensuring everything was for my best interests! The Monmouthshire Building Society continues to support me 10 years down the line- thank you!",
      "rating": 5,
      "date": "25th January 2026",
      "category": "mortgages",
      "sentiment": "Positive"
    },
    {
      "title": "Be open to advice",
      "text": "As retired Corporate bankers Ian and I thought we knew all that we needed to about mortgages but we were wrong!! Anita was extremely knowledgeable and helpful in explaining why we were able to fix the rate for a longer term than we had expected and the amount we can repay early without penalty. Both of these have resulted in a far better outcome for us than we had hoped for.",
      "rating": 5,
      "date": "13th October 2025",
      "category": "mortgages",
      "sentiment": "Positive"
    },
    {
      "title": "Tried to access account.",
      "text": "Tried to access account. Required to re-register as system fault. When doing do, entered unique number as e-mailed on 3 occasions but rejected on each occasion and therefore blocked. Now need to make personal contact to access account. Not very good service via app.",
      "rating": 1,
      "date": "17th January 2026",
      "category": "savings",
      "sentiment": "Negative"
    },
    {
      "title": "It was a positive experience.",
      "text": "It was a positive experience. The staff were very friendly, helpful and polite. We were welcomed and immediately shown into a private room with a designated member of staff. We were offered refreshments and the whole experience wasn't rushed in any way.",
      "rating": 5,
      "date": "3rd February 2026",
      "category": "savings",
      "sentiment": "Positive"
    },
    {
      "title": "Generating funds",
      "text": "I wanted to generate additional funds to invest in my property and thought about additional borrowing. After discussing with their advisor, they came up with a better and more cost efficient method of generating the funds.",
      "rating": 5,
      "date": "4th November 2025",
      "category": "mortgages",
      "sentiment": "Positive"
    },
    {
      "title": "Great customer service",
      "text": "Anita was really helpful taking care to provide detail every step of the way, really focusing on the customer and our requirements. Her advice and friendly approach made the whole process easy and enjoyable",
      "rating": 5,
      "date": "28th January 2026",
      "category": "mortgages",
      "sentiment": "Positive"
    },
    {
      "title": "App nightmare",
      "text": "App nightmare…. I just want to open another account but had to reset pin , the put in unique id. Apparently in my original welcome letter. Found an email with id. App wouldn’t accept it. Frozen out. Aaaagh",
      "rating": 1,
      "date": "27th January 2026",
      "category": "savings",
      "sentiment": "Negative"
    },
    {
      "title": "Anita my mortgage advisor was fantastic and so helpf...",
      "text": "Anita my mortgage advisor was fantastic and so helpful going over all the options for my new mortgage, making sure it was the right one for me and looking at my affordability. A definite 10/10 for her!",
      "rating": 5,
      "date": "13th November 2025",
      "category": "mortgages",
      "sentiment": "Positive"
    },
    {
      "title": "Leon Jenkins has helped us with a few mortgage renew...",
      "text": "Leon Jenkins has helped us with a few mortgage renewals, he is always so helpful and knowledgeable. Nothing is ever too much trouble and explains things very clearly.",
      "rating": 5,
      "date": "10th December 2025",
      "category": "mortgages",
      "sentiment": "Positive"
    },
    {
      "title": "Very positive experience with second mortgage",
      "text": "Very positive experience, Jamie took the time to explain everything, was dedicated to our case and ensured we got everything across the line before our deadline.",
      "rating": 5,
      "date": "31st October 2025",
      "category": "mortgages",
      "sentiment": "Positive"
    },
    {
      "title": "Great Customer Service, very help full and easy to s...",
      "text": "Great Customer Service, very help full and easy to speak with. Went through a variety of accounts until they found the best one to suit my needs. Very happy.",
      "rating": 5,
      "date": "13th January 2026",
      "category": "savings",
      "sentiment": "Positive"
    },
    {
      "title": "Very good!",
      "text": "Very good! Extremely smooth process. Anita was excellent and kept us informed at each stage of the application. Each step was explained well.",
      "rating": 5,
      "date": "4th February 2026",
      "category": "mortgages",
      "sentiment": "Positive"
    },
    {
      "title": "Quick and easy.",
      "text": "Quick and easy. Michelle Groves was knowledgeable and easy to talk too. He understood our needs and was very helpful",
      "rating": 5,
      "date": "30th September 2025",
      "category": "mortgages",
      "sentiment": "Positive"
    },
    {
      "title": "Exceptional Service",
      "text": "Anita, who handled our mortgage was exceptional. Knowledgeable, friendly and professional. Could not be better.",
      "rating": 5,
      "date": "7th October 2025",
      "category": "mortgages",
      "sentiment": "Positive"
    },
    {
      "title": "Extremely Helpful!",
      "text": "Sharon Penn was extremely helpful in resolving a transfer of equity in a difficult time for me. Hats off!",
      "rating": 5,
      "date": "29th September 2025",
      "category": "mortgages",
      "sentiment": "Positive"
    },
    {
      "title": "Very personal and efficient, informative and easy to...",
      "text": "Very personal and efficient, informative and easy to understand. very happy with progress.",
      "rating": 5,
      "date": "21st November 2025",
      "category": "mortgages",
      "sentiment": "Positive"
    },
    {
      "title": "Good that branches are still on high street.",
      "text": "Good that branches are still on high street. Staff helpful in branch. New app is a bonus.",
      "rating": 5,
      "date": "2nd February 2026",
      "category": "savings",
      "sentiment": "Positive"
    },
    {
      "title": "MoBSStaff have been amazing.",
      "text": "Staff have been amazing. Always there to help if there’s a problem",
      "rating": 5,
      "date": "12th November 2025",
      "category": "mortgages",
      "sentiment": "Positive"
    },
    {
      "title": "A very professional new mortgage experience from sta...",
      "text": "A very professional new mortgage experience from start to finish.",
      "rating": 5,
      "date": "13th November 2025",
      "category": "mortgages",
      "sentiment": "Positive"
    }
  ],
  "bath": [
    {
      "title": "A Smooth, Stress-Free Mortgage Experience",
      "text": "I’m extremely impressed with the service I received from Bath Building Society, and especially from my mortgage advisor, Tim. From the very start, Tim has been incredibly supportive, professional, and reassuring. He guided me through every stage of the process, answered all my questions clearly, and helped me complete the forms with confidence. What could have been a stressful experience felt smooth and straightforward thanks to Tim’s calm, positive attitude and attention to detail. He was always quick to respond and very good at explaining what was important—and what I didn’t need to worry about! That made a huge difference. I’m absolutely delighted that my mortgage offer was produced so quickly, in just five working days. The efficiency and personal service I received exceeded all expectations. I genuinely felt looked after throughout the entire process. Thank you to Tim and everyone at Bath Building Society for making this such a positive experience.",
      "rating": 5,
      "date": "12th December 2025",
      "category": "mortgages",
      "sentiment": "Positive"
    },
    {
      "title": "Retirement mortgage with exceptional service",
      "text": "Bath Building Society (Tim and the team) provided exceptional service from start to finish. The team was professional, knowledgeable, and genuinely supportive, with a personal touch far superior to anywhere else (we went to other building societies and brokers). The key differences were we weren’t passed from pillar to post, endlessly repeating ourselves to different people filling in forms without context and more importantly treated with respect and listened to. The Retirement Mortgage itself perfectly met our needs too, which is flexible, reliable with longevity, and unlike anything we found elsewhere. It truly feels like a well-kept secret. On top of that, they worked to our timelines, which was a fantastic bonus. Definitely a 5 star service - thank you!",
      "rating": 5,
      "date": "4th December 2025",
      "category": "mortgages",
      "sentiment": "Positive"
    },
    {
      "title": "The Best Banking Team Around!",
      "text": "The team at Bath Building Society are always so helpful. I love having an account with them because you always receive a very personalised service where you are speaking to a very helpful representative from their side, you aren't ever kept waiting long for an answer and it is so refreshing and appreciated these days to be speaking directly with a human not endlessly trying to communicate via a 'live chat' or AI bot which many other banks now use. Whenever I have had a query this is responded to usually on the same day, they also keep you informed on any pending decisions. I have to give a special mention to Nick and Natasha who I was working with recently in regards to one of my accounts with them.",
      "rating": 5,
      "date": "5th November 2025",
      "category": "mortgages",
      "sentiment": "Positive"
    },
    {
      "title": "A very complicated case, fantastic support & outcome.",
      "text": "A very complicated case, and slightly off criteria basis, was sensitively assessed by the underwriting team with a positive outcome. This was supported by the fantastic BDM Kerrin White, who listened and liaised between myself and the underwriting team, despite numerous hurdles - I cannot recommend Kerrin any more, as he is a polite, attentive, understanding, fair, and consummate professional. He stood out above even some of the best I have worked with from different lenders over the last 5 years. I would recommend him for an industry award if it were possible. Many thanks.",
      "rating": 5,
      "date": "15th January 2026",
      "category": "mortgages",
      "sentiment": "Positive"
    },
    {
      "title": "Applied for a mortgage with the Bath Building Societ...",
      "text": "Applied for a mortgage with the Bath Building Society and from initial enquiry to getting the offer the service has been excellent . My adviser Ian Birch has been amazing . He took time to explain everything in great detail and quickly responded to any questions I had regarding my application. I cannot recommend him highly enough. Process was easy to complete and all done in a very good timescale. Was kept informed at all times and made the whole process painless. I would have no hesitation in recommending Ian and the Bath Building society.",
      "rating": 5,
      "date": "3rd November 2025",
      "category": "mortgages",
      "sentiment": "Positive"
    },
    {
      "title": "Arranging our remortgage with Bath Building Society...",
      "text": "Arranging our remortgage with Bath Building Society was an overall very positive experience. In particular the support offered by Tim Randall was excellent. From the initial contact through the application process and beyond Tim guided us, offering appropriate advice and information and we are very grateful for his sage counsel. The underwriting process felt somewhat protracted at times, however, we do appreciate that this may be due to the individuality applied to each individual application.",
      "rating": 5,
      "date": "21st November 2025",
      "category": "mortgages",
      "sentiment": "Positive"
    },
    {
      "title": "5-Star Review for Tim Randall",
      "text": "I had an excellent experience working with Tim as my Mortgage Advisor. As a first-time buyer, the whole process felt overwhelming at first, but Tim made everything clear, manageable, and stress-free. He was incredibly patient, explained every step in simple terms, and always responded quickly whenever I had questions.",
      "rating": 5,
      "date": "18th November 2025",
      "category": "mortgages",
      "sentiment": "Positive"
    },
    {
      "title": "Excellent all round Service",
      "text": "From first registering an interest online in order to re-mortgage my property, the service has been fast and very professional. My Mortgage adviser, Tim Randall was excellent. Always handled my correspondence and queries very promptly and efficiently.",
      "rating": 5,
      "date": "22nd December 2025",
      "category": "mortgages",
      "sentiment": "Positive"
    },
    {
      "title": "great service and comms",
      "text": "As a Mortgage Intermediary it’s important to have good contacts and timely communications and we recently received exemplary service from the team at Bath BS and Nick T was exceptional in the way that he continued to keep us informed of progress",
      "rating": 5,
      "date": "28th January 2026",
      "category": "mortgages",
      "sentiment": "Positive"
    },
    {
      "title": "Great BDM",
      "text": "I spoke to Kerrin White regarding a Holiday Let mortgage for my client and he has been nothing but helpful during the start of the process. Answered all of my emails and calls quickly and made sure i was fully aware of the process.",
      "rating": 5,
      "date": "11th November 2025",
      "category": "mortgages",
      "sentiment": "Positive"
    },
    {
      "title": "Always treated like a person, not just a member.",
      "text": "Local, convenient. Friendly staff and helpful. Rates are always competitive, hours are convenient. Visited the Oldfield branch and was served by Antonia. I am always treated as a person, not just a member.",
      "rating": 5,
      "date": "4th February 2026",
      "category": "savings",
      "sentiment": "Positive"
    },
    {
      "title": "Specialist new build loan",
      "text": "I had a specialist loan to finance a new build property. The application process and management of the loan drawdowns was very efficient. There was always someone available to speak to with any queries.",
      "rating": 5,
      "date": "6th January 2026",
      "category": "mortgages",
      "sentiment": "Positive"
    },
    {
      "title": "Friendly, knowledgable and efficient service from al...",
      "text": "Friendly, knowledgable and efficient service from all at the company. From initial contact to offer was less than 3 weeks, a great rate and good product perfect for a university student.-",
      "rating": 5,
      "date": "29th January 2026",
      "category": "mortgages",
      "sentiment": "Positive"
    },
    {
      "title": "Excellent service",
      "text": "Ian Burch and the team were outstanding with their advice, help and assistance. They were always on hand for any queries or concerns we had and made the whole progress stress free",
      "rating": 5,
      "date": "25th November 2025",
      "category": "mortgages",
      "sentiment": "Positive"
    },
    {
      "title": "Opening further accounts",
      "text": "Inconsistent information given as to what is required to open a new account even when an existing customer! Try the Coventry B S excellent service at all times",
      "rating": 1,
      "date": "16th January 2026",
      "category": "savings",
      "sentiment": "Negative"
    },
    {
      "title": "Mortgage Port",
      "text": "We sold and were looking at porting our mortgage. Start was good, then it went a little wrong but then resolved very well and professionally",
      "rating": 5,
      "date": "20th January 2026",
      "category": "mortgages",
      "sentiment": "Positive"
    },
    {
      "title": "The telephone is answered by a real live person.",
      "text": "The telephone is answered by a real live person. All the staff I encountered were friendly, professional and knowledgeable.",
      "rating": 5,
      "date": "26th January 2026",
      "category": "savings",
      "sentiment": "Positive"
    },
    {
      "title": "The telephone is answered by a real live person, all...",
      "text": "The telephone is answered by a real live person, all the staff I encountered were friendly, professional and knowledgable.",
      "rating": 5,
      "date": "27th January 2026",
      "category": "savings",
      "sentiment": "Positive"
    },
    {
      "title": "A local branch where you can speak to someone.",
      "text": "A local branch where you can speak to someone. I visited the Wood Street branch and spoke to Jane - keep up the good work!",
      "rating": 5,
      "date": "15th January 2026",
      "category": "savings",
      "sentiment": "Positive"
    },
    {
      "title": "Came into Oldfield park today to open a new account.",
      "text": "Came into Oldfield park today to open a new account. Daisy and the whole team were really helpful, thank you!",
      "rating": 5,
      "date": "29th January 2026",
      "category": "savings",
      "sentiment": "Positive"
    },
    {
      "title": "Like being able to come in and sort out my ISA rathe...",
      "text": "Like being able to come in and sort out my ISA rather than stress of doing it on-line. Ella was very helpful.",
      "rating": 5,
      "date": "14th January 2026",
      "category": "savings",
      "sentiment": "Positive"
    },
    {
      "title": "Staff at Wood Street are always very friendly and he...",
      "text": "Staff at Wood Street are always very friendly and helpful. A nice office and convenient in the City of Bath.",
      "rating": 5,
      "date": "19th January 2026",
      "category": "savings",
      "sentiment": "Positive"
    },
    {
      "title": "Kerrin (BDM) was very helpful and Tom (on live chat)...",
      "text": "Kerrin (BDM) was very helpful and Tom (on live chat) answered my query really quickly. Thanks both.",
      "rating": 5,
      "date": "5th November 2025",
      "category": "mortgages",
      "sentiment": "Positive"
    },
    {
      "title": "Very helpful staff, in the branch and on the phone",
      "text": "Very helpful staff, both in the branch and Ella was helpful when I rang with a query on the phone.",
      "rating": 5,
      "date": "3rd February 2026",
      "category": "savings",
      "sentiment": "Positive"
    },
    {
      "title": "Prompt and friendly service.",
      "text": "Visited the Wood Street branch and was served by Rachelle. Prompt and friendly service.",
      "rating": 5,
      "date": "15th January 2026",
      "category": "savings",
      "sentiment": "Positive"
    }
  ],
  "ecology": [
    {
      "title": "Excellent experience - Eco renovation mortgage",
      "text": "The Ecology Building Society (BS) have been exceptional. We bought an agricultural property, which had a number of restrictions that other lenders knew very little about and/or were not willing to consider (either at all or without a 20%+ deposit). The Ecology BS had fantastic working knowledge of agricultural ties and Mary Blackburn supported us throughout the application process - which involved a number of additional steps, due to the type of property. Their customer service is truly amazing, run by a small and incredibly friendly team. We are renovating the mortgaged property to a high energy efficient standard. The Ecology BS shared our enthusiasm for the project, advising on both short and long term options. We will soon complete Phase 1 of the retrofit, with the Ecology renovation mortgage offering C-Change discounts on the mortgage interest rate, to reward improved energy ratings. Amid the current context of a climate emergency, this type of financial incentive for Eco works is immensely valuable – both in terms of individual finances and the wider impact on the planet. It has been a genuine pleasure to deal with such an ethical and sustainable bank and I would 100% recommend them to anyone and everyone. Thank you Ecology!",
      "rating": 5,
      "date": "8th April 2021",
      "category": "mortgages",
      "sentiment": "Positive"
    },
    {
      "title": "Mrs Carole Neal",
      "text": "They were the only Building Society that would finance our unusual eco project and provided support and took an interest right through to completion. We were invited to present our project to other members at their AGM in order to help those members in their own projects. We have not hesitated to recommend the Ecology Building Society to other people in our position. They provided finance up front which meant that we didn't have to get a bridging loan which is common practice for self builders, When we required more money late in the project that money was readily forthcoming. As both borrowers and savers we have attended many AGMs, which are always well attended, and have been made welcome and our points and opinions have been valued. It is truly a members' society.",
      "rating": 5,
      "date": "13th April 2021",
      "category": "mortgages",
      "sentiment": "Positive"
    },
    {
      "title": "Always helpful, kind and professional, with a mission that is positive to the world",
      "text": "They gave us a self build mortgage at a time that no one else would as mortgages were tougher to get. Our house is environmentally positive with good insulation, solar panels, air source heat pump and underfloor heating, with no gas connection, which fits well with ecology's mission. We couldn't have achieved our dream home without their support. They made the process really easy to apply, with a lot of support throughout and stayed in contact throughout the build to ensure that we were always on the best rate that they could offer. Always helpful, kind and professional, with a mission that is positive to the world.",
      "rating": 5,
      "date": "8th April 2021",
      "category": "mortgages",
      "sentiment": "Positive"
    },
    {
      "title": "Best ethical mortgage provider/Customer Service Champion",
      "text": "We chose the Ecology Building Society because we wanted to build an Eco friendly PassivHaus. We knew nothing about them apart form the fact that this was the type of project to which they lent money. However, our journey with them has been very enjoyable. The staff at Ecology have been delightful and easy to deal with. They understood the building process and didn't delay decisions. They have treated us fairly and continue to do so, and their instructions are straightforward and understandable. We always feel like everything is transparent and there is no hidden red tape. We would wholeheartedly recommend them.",
      "rating": 5,
      "date": "10th April 2021",
      "category": "mortgages",
      "sentiment": "Positive"
    },
    {
      "title": "20 years a customer",
      "text": "I've been with the Ecology for over 20 years, and always glad to be a customer. One of the very few financial institutions that has a genuinely ethical and responsible approach. No gimmicks or special offers, just simple savings products with decent interest rates. In the past, the online banking was cumbersome, but it's now fine. So good to know your money is supporting other people who need loans to buy, build and renovate properties, rather than going to pay banker bonuses. Also a small company based here in Yorkshire, so what is not to like.",
      "rating": 5,
      "date": "2nd June 2025",
      "category": "savings",
      "sentiment": "Positive"
    },
    {
      "title": "Satisfied customer",
      "text": "We are delighted to have our mortgage with Ecology. We know that our money is doing good in the community and that social responsibility and ethics are taken very seriously. Without the Ecology, many socially responsible eco-housing projects across the UK would not have been possible. Their newsletter is very positive and inspiring. We have had no issues with the management of our mortgage over the past 15 years and we have made many energy-efficiency improvements to our home during that time. We wish them every success.",
      "rating": 5,
      "date": "8th April 2021",
      "category": "mortgages",
      "sentiment": "Positive"
    },
    {
      "title": "Savings for good - slow but steady!",
      "text": "The Ecology Building means savings are invested in positive change- although it’s definitely ‘slow banking’ over things like withdrawals, changing address, paper statements etc, this is a positive thing for me - my savings stay earning interest because I can’t quickly dip into them ! It takes 1-2 days. Customer service on the phone is good - they arranged an end of day Faster Payment when it was flagged for security, within 2hrs for house move. Good interest rates, only improvement is an app which is coming soon!",
      "rating": 4,
      "date": "29th November 2024",
      "category": "savings",
      "sentiment": "Positive"
    },
    {
      "title": "Supporting individuals and cooperatives",
      "text": "I am very happy to save with ecology. I have both personal savings and the housing cooperatives I am involved with have been understood and supported with mortgages by ecology building society. We appreciate them taking the time to understand cooperative ownership as so many other large lenders do not understand cooperatives and ndo not provide suitable suitable options. The customer service is very good and they are a genuinely competitive option for saving, which is a joy of mutuals.",
      "rating": 5,
      "date": "26th December 2024",
      "category": "savings",
      "sentiment": "Positive"
    },
    {
      "title": "Excellent Customer Service & Ethical Savings",
      "text": "I have been a saver with Ecology Building Society for a number of years. Their customer service is second to none: they are genuine and friendly and it is ALWAYS possible to speak to a human - no horrible call queues or phone bots. Any time I have had a query it has been quickly resolved. I like the fact that my savings are being put to genuinely green uses by the Society and that any interest my savings may generate is ethical. I thoroughly recommend them without hesitation.",
      "rating": 5,
      "date": "10th February 2025",
      "category": "savings",
      "sentiment": "Positive"
    },
    {
      "title": "Don't change",
      "text": "I wanted a more ethical business to save with and I have been with the Ecology since they were founded. I have had excellent service. The phones are answered promptly and money can be moved with minimum fuss. Staff are always helpful and friendly. I hope they stay ethical, personal and small. I particularly liked the salary ration structure (so CEO and senior staff are not way above those who do so much of the work) albeit this has been diluted more recently.",
      "rating": 5,
      "date": "24th December 2024",
      "category": "savings",
      "sentiment": "Positive"
    },
    {
      "title": "Making our dream come true!",
      "text": "When we went for a mortgage with the bank we use for all our banking, one that says it supports people like us -farmers wanting to build a home and going that extra mile for us and then they turned us down and so did all the other normal banks just because our barn conversion was a little unique and different it was Ecology who gave us a mortgage and made our dream come true. It was easy and simple and more importantly sensible. Just common sense!",
      "rating": 5,
      "date": "14th March 2022",
      "category": "mortgages",
      "sentiment": "Positive"
    },
    {
      "title": "Ethical, and so Supportive !",
      "text": "I love saving with a building society that does specific, practical things for the environment, and for housing (both so badly needed). Ethical - no investments in bombs or fossil fuels! The people who work for it are lovely! When I ring up to ask questions, I always get patient, friendly help and clear answers. Sure, the interest rate offered is modest - but this is outweighed by the peace of mind Ecology Building Society offers its customers.",
      "rating": 5,
      "date": "10th November 2024",
      "category": "savings",
      "sentiment": "Positive"
    },
    {
      "title": "Genuinely Ethical",
      "text": "I first opened an account with Ecology Building Society in the 1990s, and only closed the account because I needed the money, so when I again had some savings I opened a new account a few years ago. I prefer to deposit my savings with a company I am confident will use it wisely. I am convinced the EBS are committed to protecting our precious environment and they would never knowingly invest my money in anything unethical.",
      "rating": 5,
      "date": "4th November 2024",
      "category": "savings",
      "sentiment": "Positive"
    },
    {
      "title": "Underpinned a 50 year community for the last 10 years.",
      "text": "The Ecology Building Society provided a large loan for us to buy back half of a historic building that has been home to a changing community over 50 years. We have a social and environmental approach to sharing while we also all get on with our own lives. A grand house built for a rich family has been home to up to 19 people of all ages and backgrounds at a time. Without the Ecology we could not have done this.",
      "rating": 5,
      "date": "13th March 2022",
      "category": "mortgages",
      "sentiment": "Positive"
    },
    {
      "title": "Excellent communication, efficient service",
      "text": "We have had a superb experience with Ecology. They have by far been the most helpful and easiest financial institution we have dealt with. The communication with staff has been excellent and service has been really efficient - something that is often lacking with financial institutions. I have already recommended them to others a number of time sand will continue to do so.",
      "rating": 5,
      "date": "8th April 2021",
      "category": "mortgages",
      "sentiment": "Positive"
    },
    {
      "title": "I would recommend Ecology Building Society to anyone",
      "text": "I have been really impressed by Ecology Building Society. They are clear, transparent and straightforward. And when you communicate with them you speak to a real person who actually gets your situation. They were there for me this year when I needed them. I would definitely recommend them to anyone, especially those who want to have a positive social impact.",
      "rating": 5,
      "date": "24th December 2024",
      "category": "savings",
      "sentiment": "Positive"
    },
    {
      "title": "Eco focussed Loans",
      "text": "We obtained a mortgage for a piece of natural English woodland to enjoy the peace and tranquility of nature. Without Ecology and their products this would never been a reality. Thanks to Ecology and their forward thinking approach to sustainability we have been able to live the dream to own our own Woodland! I can't recommend them enough!",
      "rating": 5,
      "date": "8th April 2021",
      "category": "mortgages",
      "sentiment": "Positive"
    },
    {
      "title": "Keeping it simple",
      "text": "First time self building a home, so was very daunted by the prospect of this type of mortgage, however I needn't have worried. The flexibility offered by Ecology is second to none, allowing you to withdraw funds as and when you need, and the process to do so only involves a quick email. Can't recommend them highly enough",
      "rating": 5,
      "date": "8th April 2021",
      "category": "mortgages",
      "sentiment": "Positive"
    },
    {
      "title": "Very helpful",
      "text": "We needed a self-build mortgage for an unusual house built to high thermal eficiency standards. Elsewhere was often \"computer says no\". Ecology took the time to understand the concept and then couldn't have been more helpul. Great people, great philosophy. All lenders are not equal!",
      "rating": 5,
      "date": "12th March 2022",
      "category": "mortgages",
      "sentiment": "Positive"
    },
    {
      "title": "35 years of ethical saving.",
      "text": "I've been saving with Ecology for 35 years and not only are the savings rates competitive, the AGMs and Member Meet-ups are very enjoyable. I particularly enjoy visiting the unusual venues and meeting like minded people who care about where their savings are invested.",
      "rating": 5,
      "date": "9th February 2025",
      "category": "savings",
      "sentiment": "Positive"
    },
    {
      "title": "My experience",
      "text": "Staff answer calls promptly, are helpful and friendly - real people! The Society has a policy to ensure the ratio of salaries between staff and CEO/management are fairer than most societies although the ratios are not as good as they were, which is a shame.",
      "rating": 5,
      "date": "31st March 2025",
      "category": "savings",
      "sentiment": "Positive"
    },
    {
      "title": "True to their principles",
      "text": "The Ecology BS provided us with a mortgage when no one else would. It was a risky project but one true to Ecology's principles and a zero carbon future. The Ecology look at the big picture and support those of us working for a better, greener future.",
      "rating": 5,
      "date": "8th April 2021",
      "category": "mortgages",
      "sentiment": "Positive"
    },
    {
      "title": "Opportunity",
      "text": "The Ecology B.S through their mortgage products gave me the opportunity to fulfil my dream of a self build using non mainstream products ie car tyres and strawbale. I would like to thank both the founders of the society and the always helpful staff.",
      "rating": 5,
      "date": "13th April 2021",
      "category": "mortgages",
      "sentiment": "Positive"
    },
    {
      "title": "Ecology Online Banking",
      "text": "Only gave 4 stars because of the Online Banking, which is not the most up-to-date system. (There is not yet an app, but I believe this is in development). Savings: Good value for money, ISAs have good savings rate in line with other providers.",
      "rating": 4,
      "date": "11th April 2025",
      "category": "savings",
      "sentiment": "Positive"
    },
    {
      "title": "A personal bank that outs its money where its beliefs are",
      "text": "Our housing coop took a mortgage with Ecology Building Society almost 20 years ago. A man called Jon sorted it out for us. We're now building 29 new houses and need a new mortgage - guess what? Jon has sorted it for us.",
      "rating": 5,
      "date": "15th March 2022",
      "category": "mortgages",
      "sentiment": "Positive"
    }
  ]
}